[{"date":"2022-02-27","author":"customer","text":"Om not impressed","title":"Rip off","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"customer","text":"RR has gone downhill. Last summer you lost an item I sent in to sell; my inquiries were ignored. Over the winter I bought 2 items which were not available due to an inventory error. January I requested that the money in my account be sent to me, didn’t happen and, again, inquiries ignored. So basically I’ll buy until I have no money left that you’re holding and won’t be sending anything else to sell. I’ve been a nano second from contacting the BBB but now you have only $17 and I’ll spend it eventually. Otherwise, this recent transaction went smoothly.","title":"RR has gone downhill","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"Marcia Lopez","text":"I’m only giving 3 stars because the necklace was all tangled and knotted when I received it.  It took a lot of patience to untangle it.  It also needed to be polished as it was very tarnished.\n\nOnce I untangled and polished the necklace, I was happy with it!","title":"I’m only giving 3 stars because the…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"customer","text":"Your descriptions for most things are subpar.  I received a defective item that said minor fraying on belt with no pictures.  It was so bad, and the part that makes it a usable belt wasn’t even sewn anymore so that the belt just fell off with any sort of tension.  Then when chatting with your “customer service” I had to fight to get a full refund with the inclusion of the original shipping fee.  I have to wait minimum two weeks for a refund (not to count the transaction time from refund to credit card).  So I wasted so much of my precious time and have to wait so long for a refund.  You all should have the capital to take the time to take better pictures or at the very least write better description.  A customer service gesture that would actually show you value customers would be that in the meantime, you offered say a $25 site credit for my troubles and your mistake.","title":"Your descriptions are terrible!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"Jason A. Bivins","text":"Gucci purse was listed in ‘Very Good condition’ this was not accurate. The clasp was heavily damaged. This was not mentioned in the item listing. It was also not made to be obvious that this was a ‘final sale.’ I would not have purchased the item if the description was reflective of the actual condition of the purse. Now my only recourse seems to be to consign back to TRR. I wonder how many times this purse has been sold and re-sold. I will not be a user of this platform again.","title":"Product Description Was Wrong.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"Mary Rash","text":"Sweatshirt was NOT as described, said it had a light pull at the neck, but there were pulls and hanging threads at the neck, wrists and bottom all around.  That sweatshirt has been trough the ringer, even though it was listed as \"Very Good\" condition. Plus, it is very thin, I would call it more of a plain shirt. The other shirt I ordered was also listed as a sweatshirt, and is also pretty thin, but it's in good shape.","title":"Sweatshirt was NOT as described","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"customer","text":"The clothes has undisclosed stains and the sizing was off. I hope they let me return part of my order otherwise warning folks you're better off shopping somewhere else, where you aren't penalized of the clothes don't fit.","title":"The clothes has undisclosed stains and…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"Anusha Dhanraj","text":"never got my refund from them , I feel so helpless. The customer service doesn’t respond.","title":"never got my refund from them","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"LM","text":"I bought 4 pairs of shoes I was disappointed to see that you don’t clean the shoes, they were dirty. I had to clean them and sanitize them.","title":"I bought 4 pairs of shoes I was…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"Jordan DeRosa","text":"It would be great if y’all offered free shipping or returns. Because now my return has still cost me over $25 just in shipping costs alone. For a less than $200 item that is just a lot.","title":"It would be great if y’all offered free…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"Julia","text":"The whole text only situation is super inconvenient.\nWait time is quite long.\nLevel of customer service is non existent. Reps do not care about the customers. Feels like they have a certain amount of suggested phrases and that is all they are able to say. Very robotic. Seems that reps only have limited amount of options to offer to the customer and no one is able or willing to do anything extra.\nLevel of representatives' expertise\/knowledge should be improved. Also, are reps supposed to lie about certain things? Like not able to bring a supervisor into the conversation? Yet, when caught in that lie they don't even have the decency to apologize.\nTerrible experience.","title":"The whole text only situation is disastrous","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"customer","text":"I am not at all satisfied. One piece of clothes had two holes. It was described as excellent condition. As I complained, customer service declined to help me because I wrote from another mail address. \n\nOlivia Trepp","title":"I am not at all satisfied","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"K Russell","text":"The reason I gave only 3 stars is because of your sizing issues. Twice now I’ve bought a piece that you’ve inaccurately listed a piece of clothing by the wrong size as meant by the designer. For example: NSF lists their pants by numeric sizes. 25, 26, 27 etc. but you guys list them as S,M, L etc. that’s super inaccurate. Because the difference between a 26 and 27 (though both listed by you as a small) is a huge difference. I’ve requested that you guys list your sizes as the designer does already but as of yet there is no change. It’s a bit of a crap shoot.","title":"Sizing","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"customer","text":"Awful playing with returns and not responding in time  awful!!!!!!","title":"Awful playing with returns and not…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"customer","text":"While there is no return policy on the item i bought, the  pair of shoes advertised size is very wrong. The advertised size is bigger than the actual size of the shoes so  when the pair came, they did not fit me and i cannot get my money back. The  pair of shoes is a size 40 but advertised as 10.5 US. A size 40 is a 9.5 US and not 10.5.\nI want my money back.","title":"While there is no return policy on the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"customer","text":"Never received my order","title":"Never received my order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"customer","text":"The customer service to sell was great and my representative was amazing. My items I purchased were in terrible condition and the link to return them did not work.","title":"I would not buy","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"Melinda","text":"The ring I ordered was photographed from an angle that made it look much more substantial than it is. It actually is rather delicate, pretty and in good condition, but not the statement ring I thought I was getting and what I was after.","title":"The ring I ordered was photographed…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"Anzalone","text":"After TRR sent out an solicitation saying 90's puffers were trending I decided to part with my prized late 90's Jean Charles de Castelbajac 3\/4 length Grommet belted with a fur detachable collar, toggles and zip up a metallic matt gray on gray, name embroidered on the sleeve, lots of pockets, This was one serious piece of clothing in awesome good condition.If any coat had all the bells and whistles this one did. I didn't even think about the value of the coat knowing what i bought it for and full well that TRR would know what they had but unfortunately that was not the case. I realized about $100 in that sale because whoever listed it knew nothing about what they had. I'm no stranger to clothing it has been my business to know this so when I saw what had happened it was to late. The coat sold fast naturally but when i complained twice I was offered nothing in the way of compensation except they were sorry i was unhappy. I requested the other vintage item back a vintage Dolce and Gabbana 3\/4 length leather distressed black leather, double breasted motorcycle coat with gray flannel lining and spared the same fate or not I wouldn't take the chance. they had tons of other stuff in the batch and truthfully I dont care, I believe in recycling clothes and finding life in used garments but this wont happen again.","title":"After TRR sent out TRENDING 90's Puffers","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"Leilani","text":"My sunglasses were ordered & were supposed to be here Wednesday, I still haven’t received them. I was also supposed to have gotten a discount since it’s the 1st time I’ve ordered from you along with the sale; didn’t get it.","title":"My sunglasses were ordered & were…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=81&stars=1&stars=2&stars=3"}]