[{"date":"2022-03-14","author":"Donald D","text":"I recently ordered a pair of men’s Persol sunglasses. The sunglasses that I received are a pair of womens Oliver Peoples sunglasses. The sunglasses are marked Oliver Peoples, the RealReal tag has Oliver Peoples as well, so I don’t really understand the mix up. I am waiting for this issue to be resolved.","title":"I recently ordered a pair of men’s…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"Customer","text":"My card kept getting declined while trying to make a purchase. Nothing on my end was wrong, seemed to be a site issue. Was able to make the purchase the following day. A little frustrating. Other than that it was a good experience and I am pleased with my purchase.","title":"Overall good experience","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"Andrew","text":"Unsatisfied","title":"Unsatisfied","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"customer","text":"The products, descriptions were as expected.\nBut I pretty annoyed with the whole delivery process. \nThe informations provided by UPS were really bad. I contacted UPS multiple times search a package which was supposed to be delivered and the delivery itself was pretty much left outside unprotected in the rain, even I called and told I want to receive the packages in person.\nI am completely aware, that these complains are not really your issue, but in the end of the day when the delivery does not work, it is kind of pointless to order in first place.","title":"The products","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"Sad","text":"Sizing chart for French sandals woefully misleading stating shoe size 11 American = 41 Italian and 42 French. (Standard knowledge i11=euro 42) and when the sandals arrived they were a 41. Way too small. Also ordered a pair of slides that failed to list AAA width in description. Major problem for anyone with Fred Flintstone feet...like me.","title":"Sizing chart misleading and shoes' width not listed","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"Giselle Luppino","text":"I’ve unsubscribed 5 times from the emails and you send me 5-10\nA day.","title":"I’ve unsubscribed 5 times from the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"Elaine","text":"I sent you responses to customer service in regards to my recent purchase. The measurement for the Dior tote Is incorrect. I even submitted a picture showing the width Is 22 inches. The description on the website indicates 14.75 inches. It’s too big for me.\n\nThe representative responded to my email informing me it was a final sale. Although I understand this when purchasing the purse, I would not have purchased the purse knowing the width was incorrect. It’s a gorgeous bag I’m not complaining about the appearance, only the fact that I won’t use it because it’s just too big for someone my size.","title":"Gorgeous Purse, website details incorrect","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"customer","text":"My package was marked as delivered but I never received it.","title":"My package was marked as delivered but…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"D Foster","text":"I ordered a bag listed on the site in “excellent condition” and received it with holes in three of the four bottom corners as well as white residue in the internal pocket.\nAfter reaching out to customer service via chat, I was able to get return labels for this item, and am currently waiting for a refund.\nI will say the service rep I chatted with was very efficient.","title":"Received merch in terrible condition","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"customer","text":"Way to long to list","title":"Way to long to list","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"customer","text":"Love my Golden Goose tennies! They arrived quickly and just as promised. I just wish there was a way to ask questions about items before buying. I also wish it had been specified that the dust bag that came with my item was TRR versus Golden Goose.","title":"Great transaction. Need a few more options.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"customer","text":"Things put into the shopping cart disappeared and then were 'on hold' when I went to purchase them again but still not visible in my cart. Very frustrating.","title":"Shopping Cart Mysteriously Empties","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"Unhappy customer","text":"The purse isn’t big enough to hold my phone. I cannot return or exchange, I will never use this - as carrying my phone is the one reason I use a purse. It’s a shame it nonreturnable. I will never shop here again.","title":"Garbage.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"LY","text":"Make sure you triple check what currency you are shopping in. Even if you enter the site and choose your currency there, it will revert back to USD. They make it intentionally difficult to see what you're actually spending. \nThe range of items is impressive, but I won't be shopping with a deceptive vendor.","title":"Make sure you triple check what…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"Dan","text":"I really trusted the firm with their authentication process.  Received the glasses, they were damaged as well as looked cheap for being Gucci glasses. The emblems were plastic and the lens was not stamped. It gave me the hunch they were not real.  I drove 45min to have them authenticated based on a hunch.  Thank goodness I did!  The Gucci store found them to be bad copy counterfeits.  I immediately emailed them let them know I received fake counterfeits.  I packaged them to be sent back!  I received an email on a Saturday which Was great!  That’s about the only good thing that came out this transaction.  They waived the fees associated with a return.  They apologized but the damage is done.  I do not trust them now.  A quick search on the internet would have shown me to not trust them.  There are plenty of articles stating they are known for having counterfeit items. I usually shop on another online app but thought I’d try this one.  Lesson learned.  I’m so crushed as I loved the glasses but I refuse to pay over $150 for a pair of counterfeit eye ware.  I hope they figure out what is going on in their company whether it be more training or penalizing employees who authenticate fake items but something needs to be done.  Their reputation is definitely affected.  They lost a client in me.  Based on the waiving of the fees and Saturday customer service I give them a star otherwise they would one.","title":"Trusted them and was let down","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"JLB","text":"So very sad that the condition of the handbag I received is far worse than \"slight discoloration\" as described.  The bag has actual burn marks - in multiple locations that one may not conceal.  This is my first and most likely my last time to use this service.  I know better, you get what you pay for, and in this purchase, I received far less than I paid for.","title":"So very sad that the condition of the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"customer","text":"The clothes beautiful and in seemingly good condition, but I did not notice until after wearing that the silk blouse was ripped along the placket.  not sure how it can be fixed.  Feels like a waste of $50.  The Escada Blazer, however, was perfect - no complaints.","title":"One good, one not so good.  Meh.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"customer","text":"Payed for 2 day shipping took 5 days to receive. Items did not look like picture\/description. Couldn’t return one of the items. Have to try to resell.","title":"Payed for 2 day shipping took 5 days to…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"customer","text":"I don't recommend for customers outside of the USA. The costs are not transparent and the support is very limited, and thepackage didn't have the return documents. The item purchased was ok, but without a good description. It also had a cigarette smell.","title":"I don't recommend for customers outside…","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Maraya","text":"Yet again received a defective item. Between shipping and return shipping (both at customer expense with this company), their mistake will cost me $24, not to mention disappointment and inconvenience.\nThis Prada dress has lost all elasticity in the waist, yet they totally clamped it in to cover that up, and categorized it as in “excellent” shape. They will not take responsibility for their misrepresentation.\nEven worse, I know from experience that after I return it, they will stick it right back up on their site with the same description and photos, for the next unsuspecting customer to go through the same thing.\nUntil it becomes an unreturnable item and someone gets stuck with it.","title":"No responsibility for a defective item, SCAM","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=66&stars=1&stars=2&stars=3"}]