[{"date":"2022-03-08","author":"customer","text":"Very quick delivery which was fantastic, however, the shipping costs for international delivery was\/is extortionate. Particularly considering taxes, duties, etc aren’t included in that price. It will definitely deter me from purchasing anything in the future which is a shame because there’s some great finds!","title":"Quick Delivery, Wild Shipping Costs","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"The person emailing me had no idea how to do a simple task and left me hanging without solving anything at all.","title":"Idiotic","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"SMPNG","text":"Item is great. Box was terrible and the item said “with box” and the hat did not come in it’s box. \n\nAlso. You should put sizes for your hats. I see some have been added but not all. Very frustrating.","title":"Item is great but…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"I got sent the wrong item. I call customer service. The first representative told me I would have to pay for the return myself. After I almost threw a fit, he told me he would have UPS pick up my package. UPS never came after more than a week of waiting and speaking to many representatives. I finally gave up and took the package to UPS myself. I have the proof of delivery that the REALREAL received the package. STILL HAVEN'T GOT MY MONEY BACK!!!!!","title":"THEY SENT ME THE WRONG ITEM AND I DIDN'T GIVE MY MONEY BACK","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"Vee Ze","text":"I have received my order today but I am unhappy with the product.  While I was aware of the \"pin sized hole\" on the in label of the SAINT LAURENT motorcycle jacket, the obvious tear in the upper selve was not disclosed to me at the time of purchase. At this time I feel an exception should be made as this was not clearly stated at the time of purchase.","title":"I have received my order today but I am…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"The shipping and communication was fine. I had been issued a $50 credit that had a defective code when I tried to use it. I placed the order so that the cart did not expire and then texted with customer service for over an hour trying to get the credit applied. In the end all I was offered was a new code that would expire in 3 days. Very disappointed with that. The individual trying to help me was very apologetic and sympathetic to my frustrations","title":"The shipping and communication was…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"I have requested SO many times to only receive one email a week, but you refuse to stop emailing me.","title":"To Many Emails","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"Yadira","text":"The purse had more use than I expected. There were two brown stains on the front I did not see on the website photos. The faux snake scales were peeling off (also not seen in the photos). This was my first and last experience buying from the Real Real.","title":"Damage\/use not disclosed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"I am not happy with my purchase at all. I ordered a Gucci tote bag and then found out it was the wrong item. There was no option to cancel it. I called an texted with a rep because no live person would call me back and they said I can not return it. She said only consign it. This is very unfair to me for the fact I made an accident on the purchase and this was my first time on this website. I just really want the bag intended to order :((()() C Herrera","title":"I am not happy with my purchase at all","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"The whole ordering and shipping process was seamless—that was fine. My only issue was the product was listed as “excellent” condition which is defined by the site as—“Items are clearly unused, but tags are not attached and boxes or dust bags are not included.” This was not the case as my item had clearly been used with some small scuff marks, stains on the zipper, and two corners of the bag flap were worn\/torn. This item should have been listed as “very good” condition which is defined as “ Items show minor signs of wear. Shoes may show wear such as light scuffing at the soles, insoles and heels. Handbags and accessories may show wear such as lightly worn corners, light scratches and interior wear.” TRR needs to abide by their definitions otherwise they risk losing credibility in guaranteeing the authenticity and condition of the goods they resell.","title":"Item condition not as listed","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"The dress is exactly like in the pictures, it arrived after three day I ordered it. The only problem was that it is fits bigger than you'd expect from a size small.","title":"Nice dress","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"I bought 5 items new with tags in pristine condition allegedly. 4 were ok but had an old clothes warehouse smell, the 5th was a Veronica Beard blouse, this one had a hole on the seem in the side of the blouse and of course I didn't see it until I had removed the tags. Overall, I guess you get what you pay for. Pristine, well not so much...and I don't trust their \"review\" process anymore.","title":"I bought 5 items new with tags in…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"Advertised a pair of shoes as a size US10, to my surprised they arrived as an IT40 which is US9. Tried to return them for refund and I was told it would not be possible by a very rude and poor English speaking associate. Was not even remotely helpful. Why would I go by a European size chart when I live in Canada and shopping on a US site, with shoes advertised in a US size. NEVER again.","title":"Misleading advertising","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"They lost my goods, never listed them paid me a fraction of their list price, and sent me more spam than ever.","title":"They lost my goods","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"Danielle ","text":"I was placing an order and their website glitched and it took my money but did not complete my order so the item was never shipped I called a week ago and was told somebody would reach out to me in 24 to 48 hours no one did.  I called today and the accounting department hadn’t even looked at the issue. This is my second purchase from them and quite possibly my last","title":"Took my money and didn’t send my order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"Bad return service.\nBad order cancellation service.","title":"Bad return service.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"No true \"Customer Service\" department, not a phone number  to call, just a Chat option. Also it will cost you to return an item even if it's their issue, even if they ship incomplete order.","title":"False Advertisement","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"I am very disappointed in my purchase - the glasses are extremely scratched and were dirty when they arrived to my house. I will be returning them\nImmediately.","title":"I am very disappointed in my purchase","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"je-belle","text":"I purchased a Prada bag that was listed as \"excellent - no visible signs of wear\". The bag have VISIBLE signs of wear that I noticed right away when I took it out.  The FRONT of the bag have a very visible area where the leather is peeling off. The first thing that came to my mind was to question the authenticity of the bag. Each side of the strap attached to the bag have seams coming off that is very VISIBLE.  There was discoloration in between the bag's flap. I am very upset for the amount of $ I spent in what looks like a fake bag. Unfortunately, it was sold as not returnable.","title":"ITEM WAS NOT AS DESCRIBED","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"Constantinos","text":"If I could give you zero stars I would.  I order a LV bag, over $1100 and it was a fake.  Shame on your “professionals” on trying y to I pass this off as an authenticated bag.  To my untrained eye it was very obvious it was a fake and you tried to make this a final sale! I will never order anything from you again","title":"If I could give you zero stars I would","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=72&stars=1&stars=2&stars=3"}]