[{"date":"2022-02-02","author":"customer","text":"My new favorite shopping site! My only complaint is I wish I had more time to shop after I place an item in my cart.","title":"My new favorite shopping site","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"customer","text":"your billing team has been unresponsive for +2 months","title":"your billing team has been unresponsive…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"Cassie","text":"Sizes wrong, condition of shoes unwearable and they were marked as “good” condition. Forced to pay return shipping and no refund on original shipping. So $25+ and no ability to return their sale items which were grossly mismarked.","title":"Sizes wrong","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"customer","text":"I had my first purchase delivered last week and the product was damage. Unfortunately, I don’t know if I would be using the site again.","title":"First purchase.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"customer","text":"I received the incorrect size of an item. Took multiple conversations to get issue resolved. Actually still haven’t gotten a resolution. May not repurchase.","title":"Unhelpful.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"Anne Hokin","text":"While you did compensate me, though I believe it should have been more, the listing of my items were terrible. Clearly, the person doing the listing never looked at the items. For example a sheared mink with brooches from J. Mendel was listed as a graphic print jacket not even mentioning it was fur. Said it was slightly worn, it was only worn twice and pristine. There were other items like this. Also items I didn’t own were listed as mine. A very poor job that I believe cost me money. Also there was no negotiation on the compensation. I believe I should have had the privilege of discussing this.","title":"While you did compensate me","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"customer","text":"It did not seem like someone from the Real Real was actually answering my email and they didn't help me resolve my problem.  They put the work back on me.\nI erroneously sent a $600+ order to my former apartment building in NYC.  The shipment is en route.  When asked what i should do, I was told I should work directly with my old building to get the package sent to my new address.\nHow about a shipping label to provide to them so that they can turn it right around and give it back to the UPS driver?","title":"It did not seem like someone from the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"Eena","text":"Firstly, RealReal doesn't believe in phone numbers.  They use WhatsApp to 'deal' with customer issues.  You are passed to a new person each time who has no clue what happened before them.   My return\/refund process started Jan 23, and is still ongoing.  I have now dealt with 8 representatives, had it 'escalated' numerous times, and have had it 'discussed with the team' about 10 times.  And yet this group just can't seem to return\/refund my account despite the clearly high level people working 24\/7 on it.  I will not shop or recommend anyone ever shop here again.  And hey RealReal, I get that you don't really want to talk to people, but if it gets this far, and the person on WhatsApp is demanding a voice telephone call, the least you can is acknowledge it. Id also like to point out that WhatsApp has a call feature.","title":"Returns are a nightmare","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"customer","text":"The earrings were faded and the studs were crooked. Returned them today via UPS, hopefully my refund will be prompt.","title":"The earrings were faded and the studs…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"A V","text":"Was delivered by ups. I needed to pay 15 € more as an import fee. That was very unexpected. Specially when the shipment already costs 45€.","title":"Awful shipment","stars":2,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"The RealReal Scam","text":"My \"Pristine\" dress had giant hole. It was advertised as \"with tags\" and in \"pristine condition\". First time ordering from The RealReal. Had to fight to get a return label. The service rep swore I would be refunded for my entire purchase (including shipping to and from my house) but the RMA form shows that they did not refund the initial $12.95 shipping and are charging me $11.95 for return shipping. While speaking with the rep, I asked for proof in writing that I would be refunded for my entire purchase (including shipping) and would not be charged for return shipping, but he could not provide it. I do not trust this company at all and would NEVER purchase from the Real Real again. Time will tell if I will get a full refund for a \"pristine\" dress that was damaged beyond repair with a giant 5 inch hole I could get my hand through. So much for the \"most trusted resource for authenticated shopping\".  If you are reading this and are considering purchasing from The RealReal - run!!!","title":"My \"Pristine\" dress had giant hole","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"lilli becker","text":"The customer service was not helpful at all. And the tracking was also very unhelpful","title":"The customer service was not helpful at…","stars":2,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"customer","text":"The descriptions are not descriptive enough. Sizes on items were vague to nonexistent.\n\nThe items were nice but one non-returnable, a hat, was far too small to wear.","title":"More Info would be appreciated","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"Leila","text":"Your concierge is excellent Rory Monson, however, the time it takes to get received items appraised and listed is terrible I have waited 5 weeks for some of my items to be listed. This makes it hard for me to recommend your services to anyone,","title":"Your concierge is excellent Rory…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"customer","text":"The description of the bag was overly understated. It is not in ‘very good’ condition as described but more ‘as is’ clearly showing significant wear and leather separating in most of the corners and strap. I would not have purchased the bag, at least not at the price paid given its poor state","title":"Poor description of product","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"customer","text":"The jacket has an awful smell. Cute but the smell is overwhelming.","title":"The jacket has an awful smell","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"Cherille Davis","text":"Hello I wish you guys picture quality was better because when receiving the purse stains were horrible. The condition stated moderate discoloration at front flap but it was worse on the flap especially in the inside. If I wouldve have know I wouldnt have brought the bag & found another one on the site to buy. Very sad this was a final sale","title":"Unsatisfied","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"Jill","text":"My items were picked up my house aT the beginning of the December.  I was told that within 3 weeks my items would be listed \nSome items have been listed and sold... but a few others are still not for sale yet.  8 weeks later???\nI know covid is causing delays... but this is a little silly.","title":"My Items arenot on sale yet","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"customer","text":"The purse was so used looking it wasn't anything I would keep in my closet.","title":"Very Used Looking Purse","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"customer","text":"I paid $60 for a Kate Spade leather purse. Unfortunately it looks like it’s plastic. And I have no way to contact anybody to find out if this is authentic.","title":"I paid $60 for a Kate Spade leather…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=100&stars=1&stars=2&stars=3"}]