[{"date":"2022-04-12","author":"Lynne","text":"Pay extra for what sais 2 day international shipping and I get it a week later.","title":"Shipping","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Tom Mons","text":"Clothes in RealReal are nothing to be proud of. They looked disheveled, faded and worn just like what you get in garage sales. I bought three large-sized Polo t-shirts and what arrived were sized-large shirts that were actually 2XL in other stores. Without trying them on, I returned the items and was aghast with their refund. Out of the $72.95 that I paid for those shirts they only refunded $48.05 deducting return shipping and promo cost. This company is making profits thru the return of their thrashy products.\n\nTip for consumers:\nBeware, products looked worn and clothes' sizes are way larger than normal while deductions on refunds are exorbitant you feel robbed!","title":"Clothes in RealReal are nothing to be proud of to be…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"customer","text":"I'm disappointed that the Dior sunglasses I purchased were described as \"Excellent\" but they arrived with non-symmetrical temple arms. They were so uneven and crooked on my face it should have been obvious to whoever inspected them that these were not in excellent shape. They should have said, these will need adjustment in the item description. Customer service was helpful and I went through with a return on the item. I would love to have kept them and gotten them fixed somewhere but the way these are designed there is no guarantee they can even do it. Also, with the very short timeframe to make a return I felt I had no choice as I don't want to be stuck with potentially broken sunglasses if they can't fix them. I will also add, the item was packaged very well and not smashed or anything. These glasses were sent to me this way from The Real Real.","title":"I'm disappointed that the Dior…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Arsineh Aghakhani","text":"The glasses arrived with the side piece loose and it slides back and forth on the side of the glasses. Not sure how this could have been missed if truly inspected","title":"The glasses arrived with the side piece defective","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Brie","text":"My bag was delivered to the wrong place. Only 30 seconds after I had submitted my order did I contact customer care and was told that there was absolutely nothing that could be done. I couldn't even cancel the order either even though it had been through for not even a minute. So now I am stuck not only not having the bag that was a gift for my sister's birthday but I wasted over $400. The order wasn't even ready yet, it makes no sense to me.","title":"Stuck with no gift for my sister, no bag, and wasted $400","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"customer","text":"My very first time ordering from The Real Real I was sent a fake handbag. This was quite disappointing as I paid over $900 and was under the impression that such a rigorous authentication process (as advertised) would never have allowed this. The purse I purchased could have been bought on the streets for $50. I’m thankful that I was given a full refund, but needless to say, I do not consider The Real Real a trusted source to make future purchases. I also had a very frustrating time dealing with texts\/emails\/communication with customer service. All of the texts from The Real Real were coming to my son and my husband as well. I had difficulty getting in touch with a real person and the virtual service was of little help too. Overall, not a happy satisfied customer and I will not be returning.","title":"Lacking authenticity","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Doris","text":"The emilio pucci dress I ordered was described as having a pinhole, there were several pinholes, snags and seams coming apart. No matter what the price was I would not have purchased in that condition unless I was repurposing the fabric for something else.","title":"emilio pucci dress","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"customer","text":"Some of the prices are still retail prices, and shipping is expensive. I paid more to ship a belt than I paid for the belt itself.","title":"Some of the prices are still retail…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Diane","text":"The bag had darkened seam and the pictures could had been better","title":"Wasn't to my expectation :(","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"customer","text":"I made a purchase and was not happy when I received my order, didn’t realize how small the bag was…I attempted to return it, prepared to get site credit and I was informed by the system that my item was unreturnable, which I feel was totally unfair. I have never had this issue with Tradesy! I barely use TRR but I guess there was a reason for that!","title":"I made a purchase and was not happy…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"customer","text":"I am not pleased. I purchased shoes. They were too small. There was no pre-paid return shipping slip in my package. The chat feature for customer service is horrible. Huge waste of time and no help. I found a phone number (not easy to find) and they were able to help me over the phone however, I had to wait another day to receive an email with the return packing slip. I will never purchase from here again - way too much hassle.","title":"I am not pleased","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"customer","text":"Still have not received my order after 10 days. I tried to check on the order status on Saturday. It took 7 hours before I received a tracking number. There are many ways to indicate that customer service is not a priority and your company has accomplished most of them. I am still hoping my purse arrives safely and is as it was described. I am unlikely to use TRR again","title":"Still have not received my order after…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"customer","text":"Good and less good.\nPrompt service & delivery.  Easy-to-use website.  \nWould not say the product was 100% \"pristine\". There were minor, faint scrapes at back of each shoe and one side of the right shoe front looked slightly \"pulled\", as if the shoe had been stretched, where the top of the shoe meets the sole. The Gucci shoe box was damaged and one of the shoe bags had what seemed to be a lipstick stain on it - weird as these are men’s shoes.\nFor future consideration, Luisaviaroma website includes local tax & duties in their pricing which is why I often order from them. RR should try to do the same so that there is less of a guessing game for clients ordering from outside the US.  Personally, incurred an additional cost of $200+ in duty and taxes. I could almost have purchased a truly new and pristine pair directly from Gucci for close to the same total cost incurred for these loafers.","title":"Good and less good.","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"customer","text":"I spent almost $1500 the earrings for my wife’s birthday. Was hoping it arrived nicely polished like new but instead it looks dull and used. Very disappointed!","title":"I spent almost $1500 the earrings for…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"customer","text":"I bought katespade airpod case, came as a broken one! The price was $40, $5 extra above the highest price in USA","title":"Do not mix junk products from vintage","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Not happy with first purchase","text":"I didn’t receive the product as described. Customer service texted I should get an email from warehouse. Still waiting. I am dragging having to text customer service again. It takes too long. Would be so much faster on the phone. Waste of my time","title":"I didn’t receive the product as…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Dre","text":"The shoes I ordered arrived the next day!! I was a little disappointed with the condition. The website stated they were in very good condition but they're not.  There is obvious signs of wear not captured in the pictures.","title":"Condition not what I expected","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Iris","text":"I was supposed to receive my item on 3\/29. I reached out to UPS to let them know if my office hrs to find out they could not find my item.  After the 2nd day of waiting to see if UPS could locate the package, I reached out to The RealReal.  UPS allegedly found the package and it was shipped back to send and received on 4\/4.  Since being received by The RealReal I have contacted customer service every 2 days to find out when will I receive my package as I have NO tracking information.   As of 4\/11, without notice, I received my package.","title":"Customer Service\/Shipping","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Coco","text":"Your sizing description is severely lacking. All I look for is the designer sizing. It should not be that hard. If a Gucci belt is an 85 cm, put that in the description not “large” with incorrect measurements in inches. Thanks","title":"Your sizing description is severely…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Jintao He","text":"I brought blazers on RealReal App but the size description were wrong and the blazers I got were 10 size bigger than app size description. And realreal refused my return because it's final sale.","title":"I brought blazers on RealReal App but…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=34&stars=1&stars=2&stars=3"}]