[{"date":"2022-04-18","author":"customer","text":"None of the sizes listed are even close to reality. I understand when it says might size one smaller but many of the items were almost child size.","title":"Sizes listed unrealistic","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"Not what I thought it would be and no returns","title":"Not what I thought it would be and no…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"The billing got messed up, the item arrived after expected, and I never got my store credit ($500) toward future purchase after spending $3600 plus during a promotion.","title":"The billing got messed up disappointingly","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"I don't think the description of items were very good.  I purchased a skirt that was way too big, but according to TRR measurements it should have fit.  It was marked a medium, but in reality, the measurements were a large.  I also purchased a wallet, again the measurements were off by about an inch.  It is smaller than TRR measurements.  It's not worth it to bother returning, because of the almost $13 shipping fee and another $13 to return or exchange.  I'll just pay retail from now on.","title":"I don't think the description of items…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"Not happy with my shoes. Sole on my shoes disintegrated.","title":"On the first day wearing them,  the  heels disintegrated,  i felt embarrased.  Unfortunately, i can't return them i had to pay additional money for the shoe repair shop to fix them","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"the shoes i ordered were beautiful, however one was definitely not sized correctly as it was an 8.5 and didnt even fit my daughter's feet who normally wears a 7.  It is not clear that the store only allows consignment for returns of some shoes and it would be helpful to have better sizing information","title":"the shoes i ordered were beautiful","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"Did not include box as advertised. Item also arrived dirty with oil smudges all over.","title":"Not as described","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"TheRealReal was great delivery wise - however the shoes came a bit more worn then I was led on to think. For $158 and “excellent” condition, I have to get new bottoms for the heel which I did not want to do.","title":"More worn then I thought","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"My item was final sale. I cannot return it for your mistake. There were a few small holes in my dress and several bleach stains. I am very disappointed. I will be continuing to just buy at the real store in chicago. I will most likely never order online again after my first experience.","title":"My item was final sale","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"Purchased handbag that was in “great condition” but arrived completely torn down one side and is unusable. Customer service has yet to respond to me about a refund.","title":"Purchased handbag that was in “great…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"The quality of one of the items was poor and it was not returnable. The description did not adequately describe the condition of the item.","title":"Poor description\/non-returnable","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"Size recieved did not match what I ordered. I put a refund request in and nothing came back.","title":"Size recieved did not match what I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"Very bizarre interactions with customer service","title":"Very bizarre interactions with customer…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"LNW","text":"Here is what the facts are:\n\n1.  I was told once I sent in my bag, it would be authenticated.  The set sales price would then be emailed to me      & I could either accept it or have my bag returned to me.\n\n2.  I was given a UPS label from Nichole, which didn’t work & I was unable to reach her, so UPS created a new label with TRR’s info from their system.  I then contacted Nichole with a copy of the new tracking number from UPS, on 3\/21\/22.  She confirmed receipt 3\/21\/22.  Therefore, she had a tracking number to LINK TO MY PACKAGE BEFORE IT ARRIVED, which she states later is how TRR keeps track of them in house.\n\n3.   UPS delivers package to TRR on 3\/24\/22\n\n4.  She doesn’t respond to my calls or texts until 3\/29\/22, when she asks for a copy of the shipping label, provided to her on 3\/21\/22, then says that must be the problem.  She says she will need to open a support ticket, but the UPS tracking number that she had on 3\/21, was the issue for “the disconnect”.\n\n5.  Nichole didn’t turn in the support ticket, according to reps I spoke to later, nor did she return\/answer phone calls or texts again.\n\n6.  4\/01\/22 I spoke to rep #2 who looked for my information\/bag\/ticket & found nothing.  She found the ticket created by Nichole on Nichole’s desk, her words not mine & the ticket had not been entered into the system.  She said she would do it.\n\n7.  4\/06\/22 I call again & speak to rep #3.  She also does not find ANY action to find my bag.  She says she will take over my case & find out what is going on.\n\n8.   4\/12\/22 i speak to Steven who asks me to send him pictures of my bag so he can look into it.  I send them.  He says he will get something done & get back to me.\n\n9.   4\/14\/22 I get an email saying my bag is enroute to the authenticator & it would be a couple of weeks before I would hear back.  Their policy states & I was confirmed, that after it was authenticated, I would be contacted with a proposed sales price which I could accept or ask to have my bag sent back to me.\n\n10.  4\/15\/22. I get an email saying my bag was sold & I would be getting a payout.\n\n**It was not sold, it was deemed as LOST, which means you get whatever they deem the bag to be worth at 50-70%.  You have zero say in the matter!**\n\nThis entire process was deceptive.  TRR seems to do this on a regular basis to many of their consignors.  Please look into their practices.  Read their FB comments.  This happens over & over again, same scenario as mine.\n There are many other platforms to sell on who pay more & at much less risk.  Please, don’t take my word for it but do your research…THIS IS A RECURRING PROBLEM WITH THEM.  Read their own FB page comments.\n  (I’d be happy to share evidence of every single statement I made.)","title":"Consigning with The Real Real, DON’T","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"Communications need a huge improvement! Telephone hold time is forever. On two different days last week, my calls were never answered, attemps to leave a return call request never resulted in A returned call! On the 3rd day I finally reached an individual in India whose English was indecipherable. AND, the recorded music while on hold is louder than normal call volume, which only leads one to be more irritated! Many operations at Realreal are well done,  customer relations & communications are not.","title":"Communications need a huge improvement","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"When the sandals arrived they looked beautiful. I decided to wear them out for dinner. The leather was actually expired and flaky, and the metallic paint came out in several areas. They’re completely destroyed after just 2 hours of use. I can’t understand how a store that’s supposed to authenticate luxury goods decides to sell expired, unwearable leather and list it as “excellent condition”. I would not trust buying from them again. Money down the drain.","title":"They sold me expired leather sandals marked as “excellent condition”","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"Great products\n\nSome of the descriptions are not correct. For example - Tie widths were off that made me buy stuff I would not have. Nevertheless quality is great.","title":"Great products","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"Daniella","text":"One of the tops I purchased came with stains on the front and back that were not described in the description..","title":"Poor description of item","stars":2,"location":"IL","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"1) The selected items that I placed in the cart last only 15 minutes then disappeared while I continued on shopping.  They should be in the cart till Im done and ready to pay for.\n\n2) Only the items that I selected with the red hearts should show in my \"recently bag\", NOT all of the items that I looked at.\n\nThank you,\nTruc Nguyen","title":"1) The selected items that I placed in…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"I bought a Kate spade tote back from you. When I looked at it 4 very small but noticable brown stains on the back of the bag. I took pictures and emailed TRR about the issue 4 days ago and have yet to hear from you. These stains were not expressed in the pictures in the ad. I would like to request a full refund. Thank you.","title":"I bought a Kate spade tote back from…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=27&stars=1&stars=2&stars=3"}]