[{"date":"2022-04-10","author":"Ryan Becker","text":"I was overcharged and you made it extremely difficult to get my money back.","title":"I was overcharged and you made it…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Sophie","text":"The photos of the bag that I ordered were misleading-- it showed the wrong size and dimensions of the bag. Unfortunately, the item is non-returnable, so I am stuck with it. Disappointing.","title":"The photos of the bag that I ordered…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Real real","text":"False advertising the belt I ordered was way to small it was supposed to be a size 50 in the waist it was a 40 I reached out with an email no one has not responded back I need a refund on this belt I can fit","title":"False advertising the belt I ordered…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"customer","text":"I bought these shoes NWT. The first time I put them on and walked two step across the carpeted floor, the heel popped right off. I took both shoes to a cobbler to put zip soles on and repair the one heel and they showed me that the second shoe also lacked proper adhesive. So I spent another $80 to repair both shoes before adding zip soles that were NWT. I love the style, but would expect a very different product quality from NWT on the RealReal.","title":"NWT, but soles fell apart on first few steps on carpet","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Kimberly","text":"I bought shoes that were described as being in \"good\" condition.  They were in not in good condition at all.  I would rate as them as poor to fair.  Stained, heels and toes worn through and very stiff, felt like they were very old and starting to disintegrate.  Even though these shoes are overpriced when they sell new for $398, $115 for these is no deal.  I returned them but did not think I should have to pay for return shipping on something that was not accurately described and the damage was not disclosed or shown in the pictures.  There should also be a comments box attached to the reason for return.  This was my first and last experience with the Real Real.","title":"Should not be listed as \"good\" condition","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"customer","text":"Prices were good and delivery was good.  I ordered 6 items and all were final sale.  One dress mentioned minimal spot to front.  There were actually 6 spots, including 2 ink pen marks, 2 unidentified brown spots and two others.  Took to cleaners but they didn’t all come out.  Bought some “excellent” condition  shoes that were not wearable so I had to take to a shoe repair to get them fixed.  Other items were okay.  I will order again but wasn’t thrilled this time around. I wish I could give a better review because I had had some good buys.  I also wish search engine for produces was more specific.","title":"Prices were good and delivery was good","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"customer","text":"Received damaged items, this is the second time.","title":"Received damaged items","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"customer","text":"The box 📦  my item came in was destroyed and could have been easily opened.","title":"The box 📦  my item came in was…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"WEBCLIENT","text":"Usually very good. I bought something and it was shipped to an old address (my error for not changing it). 2 minutes after I ordered I immediately changed my address and reached out to customer service. The order was shipped to my old address and returned to the RR (tracking shows this). I now have no idea where it is - it’s been returned to RR - over a month later and RR customer service has ignored all my inquiries. They could at least give me a status or answer my inquiries.","title":"Very disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"customer","text":"My order was not delivered","title":"My order was not delivered","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Caroline","text":"you can find some gems, however you really have to dig through the site and do your research. Often the garments are photographed incorrectly (a skirt as a tube dress, for example) or described incorrectly. The pricing is also all over the place, sometimes a brand new pair of shoes will be $100, but then you will see the same pair of shoes, in worse condition, for 2x the price. Sometimes things on the Realreal are more expensive used than they are new from the brand.","title":"you can find some gems, but there are a lot of issues.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"customer","text":"The product I purchased does not look as good as the picture online.","title":"The product I purchased does not look…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Ronald","text":"Received my item broken. Very disappointed","title":"Received my item broken","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Melissa","text":"The coat I received was described as having 'minor pilling' and yet, it also had a gash on the front, a missing grommet, and the interior of the hood had three large holes in it.","title":"Not as described","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"CT Customer","text":"The bag I received was NOT the same bag as pictured in the images (despite the description noting as much). The bag came to me with water marks all over the leather (not patina), pen marks and some sort of white residue. It was not accurate to the description or imagery in the listing. Then TRR wouldn't allow me to return, they said I can consign the bag I received. I just want the bag that I purchased. Such nonsense and a total scam it feels. After reading other reviews, I'm questioning the authenticity of their offerings. BE CAREFUL!","title":"The bag I received was NOT the same bag…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Gayle Hoeffner","text":"This is where","title":"gndasndk","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"customer","text":"The item I purchased is not aligned with the condition it was rated. It is not in “good” shape and the item is not available for return.","title":"The item I purchased is not aligned…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Leah","text":"I made two orders. I was so excited for them but only received one of the three items I bought. It was a frustrating situation trying to figure out what happened with my order especially because the website makes it difficult to keep track of your orders since it gives broad details.","title":"Very disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"customer","text":"Could not get timely response from the Real Real throughout weekend and it was going in circles from \"call this number\" to the number telling me to Text for immediate help. Then the AI in the texting was slow and completely unhelpful. Took 3 days to speak to someone who did ultimately correct the shipping issue.\nDescription of items on 3 things did not match. Shirt was ripped, and material for hat & dress not as described.","title":"Bad service, Bad descriptions","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Barbara Alley","text":"Ordered a Michael Kors watch. The minute hand doesn't work. It should have been obvious to previous owner. Told they would give me an in-store credit for fifteen dollars. Either I go to the trouble and expense to return it or store credit.Not happy.","title":"Ordered a Michael Kors watch","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=36&stars=1&stars=2&stars=3"}]