[{"date":"2022-04-26","author":"customer","text":"The item said almost new.. there are terrible scratches all on them and they came in a filthy box I had to throw away not a great experience","title":"The item said almost new.","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"customer","text":"Order was shipped separately but only one arrived to destination. Never received my shirt only glasses at mailbox. Was delivered through ups","title":"Order was shipped separately but only…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"SD","text":"This was my first time trying TRR, but so disappointed with my experience. The order sent to me was the wrong item, brand, color. It was so unfortunate because it was due to arrive before an event I wanted to use it for. Customer service has not been helpful. I had to follow up twice to make sure I knew what was happening with my item but they were more concerned about getting the wrong item back. It’s been almost a month since I purchased the item and I still don’t have my refund or credit I used for the purchase. I’m hesitant to try again, especially since the item I purchased was not cheap.","title":"Disappointed with first purchase","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"customer","text":"Item designer line was not as advertised on both jackets that I purchased. They were advertised as Zegna Couture. Neither was the Couture brand.","title":"Item designer line was not as…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"customer","text":"When trying on the dress, I discovered 2 holes, each about 2 inches long where the lace and fabric had separated that were not disclosed in the listing, one on the sleeve and one on the back of the skirt. Both holes should have been found and noted had the item been looked over carefully. Also, the zipper has a sticky spot where the fibers had gotten caught and was almost not functioning at all.","title":"Not looked over carefully, 2 holes not disclosed","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"VM","text":"The Kate Spade purse I bought was in pretty rough condition...it looks really old and has a number of scuffs on it. This is not how it was described, and I am very disappointed. I can't return it, as it was on sale.","title":"Purse not as described","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Cristina de la Rosa","text":"The Box in wich the Trenchcoat was shipped was totally wrecked and looked miserable. The Trenchcoat had (and will have for a while) this typical cheap thriftstore smell. \nThere are small stains that were not mentioned in the product description but for me it is tolerable since I wanted that «used» and therefore carefree look. But that ugly smell and miserable packaging make me unlikely to order from TRR again","title":"The Box in wich the Trenchcoat was…","stars":3,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Christy","text":"TheRealReal appeared to be a reputable merchant for designer items- purchased a couple pairs of Gucci shoes and was very excited about it- upon delivery one of the pairs had a pricing sticker of $199 on the shoe box, clearly a part of TheRealReal’s packaging. Surprised and deflated as I had paid $700+ for the pair. Took a few tries to get ahold of their customer service via text and their response was to say that their pricing is structured through their marketing team. Regardless the entire experience was unorganized and made me wary of how they price their items. Terrible customer service system as I couldn’t speak to anyone who had a satisfactory explanation for why this shipment even got fulfilled with a price tag attached that doesn’t match the charge. If anything, the experience of purchasing something special and luxurious was robbed as I unpacked that box. Will be looking elsewhere in the future.","title":"TheRealReal appeared to be a reputable…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"customer","text":"My consignment items were lost. It took me reaching out to CS via email, phone, and showing up to a physical store to get some help. It took over a month to get some resolution. After I was assured my case was escalated and would be handled properly, the items that should have been returned to me were sent to a random CVS in Texas, not my address in CA. At this point Ive reached out to CS again and heard nothing back, now my items are missing a second time. I'm DONE with this company.","title":"My consignment items were lost","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"customer","text":"I needed to return a flawed item and was charged for shipping back.","title":"I needed to return a flawed item and…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"customer","text":"I ordered a designer purse, they are supposed to be verified for condition. It was filthy inside and had pet hair and crumbs and dirt on the bottom in multiple compartments.","title":"Dirty merchandise","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Luis Pena-Hernandez, MD","text":"I purchased and item, a pair of shoes. It was a $100 item. My size is usually 8.5. Well, this pair would have been returned by me. Except for the fact that it was a final sale. The website should warn the customer clearly when a sale is final. Now I have to consign it and hope that it sells. It’s not the customer experience I was expecting. $100 are not going to make me broke. But it’s the principle.","title":"Final sales need to be clearly marked","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"customer","text":"The bag description did not match to how the bag looked when I received it. If I would of known of the bumps and dents the bag has I don’t think I would of bought it. Plus, when contacting a customer rep they only gave me $75 store credit. I should of gotten a discount off the bag price.","title":"The bag description did not match to…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Morgan Muston","text":"The customer service is lacking, which led me to looking up the company on line and there seems to be questions about the authenticity of items. Due to the poor customer service I will most likely shop elsewhere.","title":"The customer service is lacking","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"A M","text":"High shipping and most of the time not as described!","title":"High shipping and most of the time not…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Carla Glez","text":"First because take long time to delivery and second because In the app show wrong size.  Show US 9.5 and really is UK 9.5","title":"First because take long time to…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Leah","text":"The Gucci Bag I purchased was a great deal and described as \"Good, Moderate discoloration at interior, light marks at back, light scratches at hardware\". I wasn't expecting a new bag, and was fine with all issues listed above, however, when I received the bag, the lining was a mess. The photos showed some minor issues however, this was completely frayed and falling apart. The real let down was when I put something inside the bag, I realized the interior is literally melting. My wallet was covered in a brownish goo. I love the look of this bag but unfortunately I'm afraid to put anything inside of it, rendering it sort of pointless.","title":"Definitely in worse shape than described.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Bag Buyer","text":"I have purchased from these type of shops before, but this was my first time buying from The RealReal.  I stupidly didn't look at the return policy and I'm shocked they aren't allowed.  The bag I received was supposed to be in good condition. It was absolutely not.  It was terrible.  I'd like to return it but that's not allowed apparently.  Shop at Fashionphile - they allow returns and I've not had a poor bag quality like this yeat.","title":"Bag in poor condition and no returns allowed!  Read the fine print! BEWARE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"customer","text":"I have yet to receive a reply to my inquiry!  A garment was purchased and terms noted a return was feasible.  When i went to process the return, the terms had changed.  Could someone please reply?!","title":"I have yet to receive a reply to my…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"customer","text":"I have a problem with an order. You sent me the wrong item. No one gets back to you and  it is impossible to speak to a representative.","title":"wrong item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=17&stars=1&stars=2&stars=3"}]