[{"date":"2022-05-09","author":"First time customer","text":"The three pairs of shoes I ordered didn't fit, which is not that big of a deal, but I didn't realize how stressful the return process works be. Because the shoes took a week to get to my house, I had two weeks for the return to arrive back at realreal. With having a normal life and shoe returns not being my #1 priority, it took me a few days to get the package ready, and now I'm freaking out wondering whether it'll get there on time. Regardless of whether the realreal end up honoring my return or not. This has been a horrible stressful experience, not the granola \"do nice by mother earth\" experience I for some strange reason expected. On top of that, the one pair of shoes that is non-refundable throws an error on realreal when I try to consign it with no explanation. Maybe it's not consignable, but the website sends me in circles through the consignment flow.","title":"The three pairs of shoes I ordered…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"customer","text":"Very poor quality control. I ordered a Dolce and Gabbana suit that was graded as Very Good condition and was super excited for it. When it arrived it had multiple holes in the pants and was completely unwearable. So disappointed with the quality.","title":"Very poor quality control","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"customer","text":"The item arrived as as advertised, packaged neatly.  Shipping was quick","title":"The item arrived as as advertised","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"Marie Mac","text":"Love the range and great value ( which is essential when copping the shipping costs to Australia 🇦🇺). Purchases arrived quickly and really well packaged. Especially happy with quality of clothes. Can’t believe they are pre owned !!!\nI purchased 2 cashmere  jumpers and so happy with their presentation, clean and odourless (sometimes a problem with pre owned).","title":"Great range, value and better than described condition.","stars":5,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"bill a","text":"we got a great deal on the basha shoe. my wife loves it","title":"we got a great deal on the bausha shoe","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"customer","text":"I order a vintage LV bag editor's pick that was stated in pristine condition.when I received the bag it was more like fair condition.This is the 4th handbag I have got from your company and the 1st flop. I also question the authentication as the leather on the handles was peeled off and it was white underneath.","title":"very dissatisfied customer","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"Patrick Jostrand","text":"Great selection and customer service, fair prices.","title":"Great selection and customer service","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"Carole Cox","text":"This is a very good company to deal with.  I purchased a sweater which was as advertised and of great value.  It arrived quickly and was packaged well.  I also like that each piece was authenticated.  This is a company I would use again.","title":"Good company","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"Yo","text":"Buying and selling is great!  I never thought my Louis Vuitton handbags were worth so much.  Kudos to the company for having a place for us to sell our used merchandise.","title":"Buying and selling is great","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"customer","text":"The item was in perfect condition and beautifully packed. :)","title":"The item was in perfect condition and…","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"customer","text":"Nice clothes, helpful customer service.","title":"Love TRR","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"customer","text":"So many things went wrong with my most recent purchase.\n1. The language about my sale being final was small and at the very bottom of the product page.\n2. Neither the checkout page nor my order confirmation said anything about Final Sale.  I only discovered it was not returnable when it didn't fit and I went to return it.\n3.  My email inquiry to customer service 1 week ago has still not been answered.\n4.  A friend suggested I use the 'text' feature which -- after a long and super-frustrating runaround with not one, but two \"bots\" -- delivered me to a person.  But the first person was impossible to understand. \"Send me a picture of the product page\"...which I did 4x and still had them saying \"send me a picture\".  This led to a connection with another real person, who basically said, \"Oh.  I can't help.  It's not returnable.\"  \nBuyer beware.  The stuff is authenticated but be sure to note if it's returnable or not.","title":"So many things went wrong with my most…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"Alexandra Bukojemsky","text":"Overall my experience with TRR has been good, always good customer service and consignment is easy. However the knowledge behind consignment is not always the best- I've seen things on the website that are vastly overpriced, while I've had things (like a Margiela long vest\/ coat) sell for far below their value. \n\nIf I could recommend 2 things:\nGive sellers the opportunity the see the prices before they are listed\/ made public. This would catch error (such as the 1k margiela vest being sold for $140). Also tell sellers what the earnings would be- I'm about to go up to 60% earnings (where I have been before) but have no ideas where this will actually take place. \nLastly, shipping should be free. Or at least come A LOT quicker.","title":"Good but could be better.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"customer","text":"Misrepresentation of items condition. No call back. High cost to low value ratio. High shipping, no free returns. Poor quality resale.","title":"Only once and it was enough","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"customer","text":"Fast delivery and items as expected in regards to quality","title":"Fast delivery and items as expected in…","stars":5,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"customer","text":"Thank you ! \nSo far , so good","title":"Thank you","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"customer","text":"Hello, Thank you for the beautiful boots. They seemed almost new looking and I would have given a five star but there is a bad rub on the inside heel  on the suede, that I did not know about. Otherwise, the price is  great and the product is so well made. Thank you so much!","title":"Hello","stars":4,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"LS","text":"Definitely 🌟🌟🌟🌟🌟 Fast shipment and excellent quality","title":"👍👍👍","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"customer","text":"Speedy delivery and bag in really good condition as advertised.","title":"Pretty bag","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-09","author":"customer","text":"Genuine products at a good price.","title":"Genuine products at a good price.","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=1&stars=1&stars=2&stars=3"}]