[{"date":"2022-04-09","author":"customer","text":"Disappointed. This is my first order with The Real Real. The first dress I bought looked like it was black on top and when I received it,it was an ugly olive green\/ brownish color and non refundable. The other dress I ordered, I was very excited about and then after over a week, was told that the inventory got messed up and it wasn't available. I will not be shopping with this company again. Would not recommend.","title":"Disappointed","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"Noemi","text":"They charge $ 12 for delivery, but then UPS sends the package to USPS, wasting time. Also, it's ok for shopping but terrible for sellers. If it weren't for the authentification, I would use only Mercari. Also, bear in mind that the experts are not always so great.","title":"Just OK.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"Ericka","text":"Three of the four shoes I ordered (all size 7.5 and reported TTS or fits bigger) did not fit, as in I couldn’t even get my foot in the shoes!!! I wouldn’t have bought these if they actually fit tighter, thus would have looked for an 8! I love the Real Real, I have had (until now) great experiences, but this was so disappointing, and they were on sale - thus non refundable…. However I feel the description of the sizing is off! Please help! I’ve already written to customer support, but have yet to receive a response.","title":"Misleading description of shoe fit\/size","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"Anon","text":"Price was very high, condition was ok, packaging was not good","title":"First experience was ok","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"sheilaveeh","text":"I’m not sure for which issue this customer service feedback is for but I have inquired back in December 2021 about the dustbags that should have been included in my purchase of Gucci sneakers and nobody has cared about getting back with me about it. I have sent a follow-up email multiple times but unfortunately I got no response and still don’t have the dustbags and it’s April 2022. I need the bags to store the shoes in when not in use and as well as for when I’m traveling. I understand if it’s lost and could not be located but I would appreciate someone getting back to me at least and tell me so rather than ignoring my emails. This may not be a big deal for TRR, but it is for me. If you can’t stand behind the description of your items at least let your buyers know their inquiries are heard. Being ignored is what makes me unhappy.","title":"You could do better","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"customer","text":"The item that I purchased is engraved. That was not in the description. It has the name \"Becca\" on it. This is something that should be boldly stated on the description.","title":"The item that I purchased is engraved","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"customer","text":"This is the 3rd time I was sent the wrong size for shoes. The last order was not even eligible for returns even though it isn't my fault the nobody knows the sizes of the products and just labels them whatever size.","title":"This is the 3rd time I was sent the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"customer","text":"The listing shows Size 11 shoes. The delivered shoes were at least size 12. Yet, I have to pay for the return postage.\n\nInteresting business.","title":"Penalized for being shipped wrong product.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"customer","text":"First time buying from the company. Two out of three items were the wrong sizes. Invoice only state tagged and not sizes. Customer service did not accept responsibility of wrong sizes. \n\nAs a Canadian, had to pay duties unnecessarily due to wrong fulfillment of order. Still waiting for refund to be processed.  Buyer beware!!!!","title":"First time buying from the company","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"customer","text":"inaccurate sizing. marketed a belt that only once I paid for, waited to receive, and then physically had it was able to see the true size (“80”), saw using a size guide that this belt side was for sizes “S\/M”. The belt was marketed as a size XS, which of course it was not. It was huge! Unfortunately I had to return it, and what was even more annoying was that it said “free returns” although that only applied to returns at a physical store location, which I am not near one or able to reach one. So I had to spend $12 to return an item that did not fit because it was falsely described online.","title":"inaccurate sizing","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"customer","text":"The product I got was very used. Not worth what I spent.","title":"The product I got was very used","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Z W","text":"From the start I contact someone and customer service because I would like to have seen pictures of the inside of the bag I purchased it anyway without the pictures I received the Box no proper installation or any stuffing to keep the bag proper form condition just was in a flimsy dust bag and had their logo on it bag was kind of folded luckily was not damaged because they didn't even send a box big enough for it","title":"From the start I contact someone and…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"customer","text":"My package has been lost and the customer service told me I have to wait few days to have my issue solved. The agent assigned to my case was apologetic but not really helpful or reassuring. Such a pity. Not a great experience","title":"My package has been lost and the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"customer","text":"Item has way more damage and wear on it than it was mentioned. Also when I received the package, it was tore on all ends with the dust bag hanging out.","title":"Had way more damage and wear","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Nayra","text":"The wrong purse was sent I was looking at all purses when I found the one which had excellent I pressed next thing one that I had look at earlier was the one the system add before the site went off. Will never buy again nor recommend it to anyone. The item is not even in good condition it’s fair condition but not good nor excellent.","title":"Don’t buy 2nd hand purse","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"customer","text":"Item I received did not match “excellent” condition description at all. Photos of item were not taken at close range so condition was also not revealed in this way. Was so disappointed and felt deceived when I received my bag and discovered this. It was final sale but fortunately PayPal protection helped me resolve this.","title":"Item I received did not match…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"customer","text":"Shipping and ordering was easy, however the item I received had different issues with it (spotting on various areas, unmentioned damage, etc). I would say to order with caution, as the authenticator\/quality inspector gives a subjective assessment rather than an objective one.","title":"Shipping and ordering was easy","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"customer","text":"Item was completely different than described and pictured. Glaring, poorly done alteration made to garment that destroyed the integrity and worth of the belt and caused it to be a completely different size than advertised.","title":"Item was completely different","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"customer","text":"The sunglasses are a little broken. They do not fit on my head well because one of the hinges is broken so they are wide.","title":"The sunglasses are a little broken","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"customer","text":"The size was completely wrong and customer service has not responded to my email","title":"The size was completely wrong and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=37&stars=1&stars=2&stars=3"}]