[{"date":"2022-04-07","author":"customer","text":"While I have made some good purchases and some good sales over the years, I don't like the sales process as it's just too slow.  I also made a couple of purchases recently online and the items were mis-labeled for womens and they were actually men's shoes and sizing so I had to return them.  So, I think this is just average.","title":"While I have made some good purchases…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"L Allen","text":"1 of 3 items in an order has been missing for almost two weeks. I’ve reached out for help a total of 4 times — twice through the chat\/text option TRR encourages, and twice through email. No response, no assistance. Today I’m going to have to call a physical location and beg for help. Overall a terrible retail experience that wasted a ton of my time and money, not a business I trust enough to spend with again at this point.","title":"1 of 3 items in an order had been…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Sammie's mom","text":"Great selection of clothes, but the website is riddled with inaccuracies and mistakes. Clothing is mis-labeled regarding size; or key measurements are mistaken. Since choosing the right size depends on measurements (sizing even for a single designer often varies significantly) measurements and sizing need to be correct and precise. \nAlso, policies regarding shipping are inconsistent and frustrating.\nFinally, texting the \"concierge\" is a joke. I'm not even sure if I have a real person because so often they do not understand what I am saying and I have to explain over and over.","title":"Great selection of clothes, BUT...","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"customer","text":"All of the pieces were in the expected condition except the Supreme NY Puffer. It had pen marks on the sleeve, and a pink stain on the front, so that was disappointing. Also the box it was shipped in either was tampered with by the mail service, or just really crappy. The tape was barely holding the box closed. I suggest being more honest about the quality of items regarding stains\/discolorations, and better packing tape.","title":"Supreme Puffer Coat had stains that were not described. :(","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"customer","text":"The item was not in good condition. The box was filthy stained and ripped. It said good condition but it was not.","title":"The item was not in good condition","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Kerri Robinson","text":"Omg !\nWorst purchases ever the purses stink so bad I am donate them.\n\nWill never purchase or recommend this company and will write as many bad reviews as I can.","title":"Omg ! Worst ever stinks","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"customer","text":"Specifically the last cs rep named H something was a+ but this site overall is awful. You guys straight up lost so many of my items and damaged others and the customer service is so bad that i actually kinda hate y'all. \"Vip\" is a joke","title":"Specifically the last cs rep named H…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Chris","text":"Smooth order process & fast to ship BUT...\n- UPS charged tax 36% far was much  higher actual VAT 20%. Miss detailed invoice \n\nMore generally: \n- RR Fur Export restrictions to France are uncomprehensible (don't see any legal import issue).\n- Boring to have to reconnect to RR each time even when  browsing only","title":"Smooth order process & fast to ship BUT...","stars":3,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Ces","text":"The real real website’s return process is not working. They will email you the link to print the return label but the link will automatically direct you to their website to shop. What they are saying thst the item is returnable, is actually not returnable. When you email their team, no one responds to you ever.","title":"The real real website’s return process…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"customer","text":"By the time they answered, my item was sold","title":"By the time they answered","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"customer","text":"Ordered two different pairs of Aces and both sizes came in the wrong size that was listed on the site……","title":"Ordered two different pairs of Aces and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"customer","text":"My item is missing and I have had no resolution","title":"My item is missing and I have had no…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Franco Polar","text":"The prices that you guys list my items with are ridiculous and the commission percentage is beyond unfair.","title":"The prices that you guys list my items…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"customer","text":"I order a Lanvin green sweater and you sent me another sweater. \nI have to pay taxes to receive. \nFinally I decided to take the wrong one and you gave me Electronic credit. But I have to pay taxes for sonething I didnt order.","title":"I order a Lanvin green sweater and you…","stars":2,"location":"MX","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Kate","text":"Beautiful dress and I am excited to wear it. However, the condition rating of “excellent” with no signs of wear was unfortunately inaccurate. The dress has a stain near the neck, but more importantly, a button loop on one of the sleeves is ripped and will need repair. This dress probably needed a condition tag of good as it has clear signs of wear and light damage. \n\nI look forward to fixing these problems and wearing the dress for a summer event. I hope my future purchases will have more accurate condition ratings.","title":"Beautiful dress, but inaccurate condition","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"customer","text":"To expensive to return an item. Won’t risk again.","title":"To expensive to return an item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"customer","text":"Bought sunglasses on final sale which indicated VERY GOOD condition. Stock photo used to hide the real condition which was bad. Lenses were so badly scratched that they can't be worn. I am not paying $11 to ship back as I don't want to lose any more $. This was my 1st and last purchase.","title":"Bought sunglasses on final sale which…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"customer","text":"The bag has a scratch on the front which was masked on the website image and not called out in the item condition.","title":"The bag has a scratch on the front…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"customer","text":"I was thinking it would have a wrist strap so I could take it without a big purse to carry it in.","title":"I was thinking it would have a wrist strap so I could take it without a big purse to carry it in.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"customer","text":"You would think that a company or site that prides itself on vetting and validating the authenticity of brand would also do the lowest expected service of checking and advertising size! I bought shoes that would have been a mad bargain but are now a right off, too expensive to return! Don’t buy from this store if you are overseas. I’m super disappointed. I won’t be using this site again.","title":"You would think that a company or site…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=39&stars=1&stars=2&stars=3"}]