[{"date":"2022-03-21","author":"customer","text":"While the scarf I bought was exactly what I wanted, it was disappointing that it had that \"old house\" odor.  Not sure what your cleaning policies are (if any), but I had to spend additional money to get it cleaned before I would ever wear it.  Very unfortunate, and will give me pause in purchasing future items.","title":"While the scarf I bought was exactly…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Forget out RealReal","text":"Forget about REALREAL. Until they hire people with common sense to package up breakables, forget it. They forget they have a fiduciary duty to get people”s items to them unbroken and packaged safely and carefully. They are turning great buys into trash by not teaching people how to pack crystal and breakables appropriately.","title":"Until you hire people with common sense…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Stacey Mitchell Kane","text":"Not only did you not list my items for over 60 days, first you told me that they were lost, then when we figured out where my 35 items were, turns out that they were listed on someone else's page. Also, you cannot seem to get the values right on anything.I have multiple pairs of shoes all in the same styles but different colors, all exactly the same condition and your prices are all over the place and not even close. I have been a client for a long time but I will never, ever list anything with you again. Your services are horrendous and you should be embarrassed. The people that you have working there are not competent and it's obvious. Seriously not happy, nor would I ever recommend your services to anyone. My sales rep however is the best. She is NOT to blame.","title":"THE WORST EXPERIENCE EVER. THEY LOST MY ITEMS AND THEN LISTED THEM ON ANOTHER PERSON'S PAGE. TOOK MONTHS TO SORT OUT.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"customer","text":"Ordered two items, one real - one fake. I assumed everything on this site was real as it says it is.. and is \"authenticated\" rigorously.","title":"2 items, 1 real, 1 fake","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Jazmin","text":"Overall very disappointing. The service is also very disappointing. It took over a week for my item to get delivered which is a little ridiculous. All they offered me was $12.95 store credit. Then when I finally received the item the box and the Louis Vuitton box were both in bad shape. The flap where you open the Louis Vuitton box was completely torn and the item was not accurate with the condition they had on the description. I will be returning the item. The person I talked to over chat said I wouldn’t have a problem returning it but now I can’t get a hold of them again. Not the service you expect when you spend $2,500 on something.","title":"Overall very disappointing","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Whitney","text":"Worst buying experience! STILL do not have my bag ! Buyers beware! The real real use ups who constantly change my address. I am still trying ti have my parcel delivered to me even though I out my correct address on the order received the correct address on my order confirmation. UPS have changed it and have still not redirected my parcel to me ! There is absolutely no end in sight. Don't buy from the real real buy from the real designer brands the real real is not worth it !","title":"Worst buying experience","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"customer","text":"I bought one item but had to buy a couple of others to check fit. I was not able to keep my $25 in introductory discount and apply it to the item I ended up keeping, technically my \"first purchase.\" No one would speak with me or do anything about this. I was told someone would call me back, and they did not.","title":"I bought one item but had to buy a…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"customer","text":"I ordered shoes and the size that was on the listing item was not the size of the shoe that I received. Purchasing $500 shoes you would think that would be the case and they would ensure that everything was correct. Customer service was pretty quick to redoing to emails and I was issued a $25 store credit, however something like this could have been avoided.","title":"I ordered shoes and the size that was…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"customer","text":"I bought a cute black evening jacket, size P.  I received it in the mail. I was extremely small. I am petite, 5 ft. 2\",  108 lbs.  I could not even put it on. I knew it was final sale, so I am giving it away.","title":"Evening jacket sized for a girl.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Pam Stone, customer","text":"I ordered 2 dresses. One I wasn't crazy about but it was one that couldn't be returned.  The other one I love, but it had several small stains on it.  I was able to get the stains out by washing, although one small stain remains.","title":"I ordered 2 dresses","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"customer","text":"The bag came as expected with some wear and tear that was noted in the posting, however it was visibly dirty. Like I was picking what seemed to be food off of parts of the bag. The inside was also dusty with powder or sand. I was fine with the overall condition of the bag but it feels insane they didn’t make any effort to clean it before selling.","title":"The bag came as expected with some wear…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"customer","text":"The calf to the boots are TINY and that should have been addressed in the description. The picture made them look normal sized.  These were final sale so I am just stuck with them now unfortunately and can not wear them.","title":"The calf to the boots are TINY and that…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"customer","text":"I ordered a jacket and it is missing the hood. I need to return it and I have to pay for shipping.","title":"I ordered a jacket and it is missing…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"customer","text":"Not great service. The order confirmation told me that I would be notified upon shipping and I was not.  Also, when the product arrived, I was not notified, so it sat outside for hours. Sorry to say that other online retailers have set the bar on these kinds of services and The RealReal is not up to par.\n\nSecond, the condition of the product was not as good as indicated. The product came crunched up (an Hermes scarf) and full of wrinkles. Not noted and not seen in the online pic.  Also, not noted in the product description was that the hand sewn edges were ironed flat, a big no-no in the Hermes scarf world.\nI'm not too likely to shop with you again.","title":"Not great service","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Stephanie barnhart","text":"You advertised a Versace suit on sale and it was only a jacket I was under the impression it was a suit it also showed pants as well I will be returning it","title":"You advertised a Versace suit on sale…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Dissatisfied Customer","text":"I was sent the wrong item and no suitable solution has been provided, after talking for hours to two different customer service representatives. The item I initially purchased is still available on the website yet the company is unwilling to ship it to me at the price I initially paid (as they've raised it since), even after I've already paid for shipping and duties for an item I didn't want.","title":"Received the wrong item and the company refuses to send me the right one","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Corey B","text":"I have not received my order!!!","title":"I have not received my order!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"customer","text":"Item was wrong gender. Very difficult to reach customer service and was charged for return shipping. She said I wouldn't be. We'll see when I'm issued the return credit.","title":"Item was wrong gender","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Britt","text":"The item purchased was saturated with cigarette smoke smell. The leather, the fabric interior, just ruined. I actually trashed it because it was so bad and nothing I did could remove the foul odor. My fault for not asking if was a smoke free environment upfront. However, I’m sure the RealReal would have never put their approval on this, regardless if it was a “name brand” bag.","title":"Cigarette saturated item","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"customer","text":"I’m somewhat upset, about the stains on the interior of the bag I purchased. Maybe, I didn’t look at all the images before I purchased it, which would be my fault, but it was kind of a shocking surprise. I thought it’d be in a little better condition. Although, I know consignment stores means that the products are used, so it was a great price, I just wish that they’re would’ve been a little more time put into the appearance like spot cleaning the stains if possible.","title":"I’m kind upset about the appearance of the bag I received","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=58&stars=1&stars=2&stars=3"}]