[{"date":"2022-02-06","author":"customer","text":"My shirt arrived with a 2 inch tear\/hole in the sleeve, yet on the website it was listed as being in almost perfect condition. Really wish I didn’t pay $12 shipping to just receive this lie.","title":"My shirt arrived with a 2 inch…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-06","author":"L Roca","text":"I know this is a pandemic creates issues, but it should not have taken 1 month to receive my purchase. And then to beg for it to be sent was worse especially when I paid for the item and contacted the company 4 x. \n\nBut I believe it's all in how the problem is revolved...this is what my review is based off of. Giving a credit for a future purchase and not the one that missed the event is in poor taste for me. It would mean more to make up for error in missing my 50th birthday than make it into some gimmicky credit to keep me coming back. It could have brought me back to 5 stars....","title":"I know this is a pandemic but…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-06","author":"Dan","text":"Spent $2000 on a pre-owned bag. The shipper for the bag is too small, the bag itself(leather) was folded and Jam into the small shipper when it’s arrived, bag was dirty and dusty, I had to wipe it down with a soft cloth myself but I’d expect this could be done by the retailer, not too much to ask for a clean item when you spent thousands of dollars even it’s pre-owned. Order a RealReal gift box with the item and never came with the shipment, got on the customer support and spent about 1 hour with the agent, answered hundreds of questions for a $5 gift box to determine it’s not my fault the box didn’t come, so I will receive a $5 credit but they will not send me the box. Will try alternative retailers for future purchase, very very disappointed and do not recommend.","title":"Very disappointed","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-06","author":"customer","text":"Have not received my items, yet I’m asked to rate my experience. How can I rate something that I have not seen?","title":"Very slow delivery","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"Customer","text":"I was more than just disappointed, the item I received was not up to my standards ,not for a Designer purse. It’s so worn, and so much smaller than I expected. I hope to sell it at a local consignment shop, I’m sure I will, at best get half of what I paid. I won’t be back.!","title":"I was more than just disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"Malou\/Douglas Wheelercustomer","text":"Everything is great. Maybe should not charge for shipping. Thank you.","title":"Everything is great","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"customer","text":"The item I received is clearly a fake. The authentication process is not trustworthy.","title":"The item I received is clearly a fake","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"customer","text":"The description of one of the dress I ordered did not include any reference to loose and torn beading on the sleeves.  The condition of this dress was not as described.","title":"The description of one of the dress I…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"customer","text":"terrible customer service. I did not even receive a call back, as I was promised.","title":"terrible customer service","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"Bushra Hussain","text":"The fact that duties are not included in the price, is always a sneaky surprise. I had forgotten why i stopped ordering from real real- its really not good to have someone knot on ur door and ask for 400 dollars out of the blue","title":"The fact that duties are not included…","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"Sad in Seattle","text":"The shoes were at least two sizes too small. Likely can’t be returned because they over 40% off. So $75 down the drain. Beautiful shoes though","title":"The shoes were at least two sizes too small","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"customer","text":"Worst customer service!!!  I purchased a pair of black shoes. Paid an additional $120 UPS to receive them in Canada. When the shoes arrived they were green (falsely advertised as black). This is 100% error of The RealReal. I called customer service for a refund only to be told that they cannot refund the UPS charge.  Asked to speak with a supervisor who told be that they can get me a store credit of $120. Now I’m forced to shop here again as I’m out $120 by no fault of my own. I do not want to shop here again!!!  \n\nIf you live in Canada - do not shop here - it’s not worth it!!!","title":"Worst customer service!!","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"B.M.","text":"i got my items fast and easy , however , there should be more transparency. when i tried to return the items i was told on @ of these that they are not returnable. when i purchased the merchandise i checked return eligibility and it said \"eligible for credit card refund\" but when i attempted a return i was told items discounted 40% cannot be returned. very frustrating and unfair","title":"dishonest site","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"customer","text":"Extremely strong odor saturating the bag I purchased ruined my experience. There was absolutely no mention of this odor on the site and they don't offer returns for the bag so I feel quite duped. The leather is saturated with musty old lady smell which is extremely overwhelming. I feel like it's dishonest to not mention that on the site. I guess now I know why it was so cheap.","title":"Extremely strong odor saturating the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"customer","text":"The pants sent were visibly dirty and had clumps of human hair in them.  I was very disappointed and disgusted.","title":"The pants sent were visibly dirty and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"customer","text":"It was very frustrating to me that I could not contact the seller directly to ask questions. This is my first purchase  so if there are options I am not aware of they should be made more obvious. The item description on the diamonds was sufficient however there were no details on the condition of the enameling. There were several areas were the enamel was missing (back,nose etc) that were not visible in the pictures.  It would have been nice to be able to contact the seller to ask about the condition of the enamel.  Has the enamel was damaged (and not fully disclosed in the description) I rated the purchase a 3.  With regards to my overall experience with Real my rating would be a 1.","title":"Nice pin - wish description was more detailed on condition","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"Nicole G.","text":"This was my first purchase with The Real Real. After browsing for months I finally made a purchase for a sale bag. The Artsy. I examined pictures and the bag rates as “very good”. Unfortunately soon after receiving and transferring my items to the bag I discovered several cracks at opening of bag. These cracks were not visible on any pictures, nor were they listed in the description. I’m so disappointed. My bag is non refundable. I’m guessing because it was sale? I definitely would not buy a non refundable bag again from Real Real. I feel the fact that I cannot return is unfair as it was not presented correctly or honestly. Other than cracks bag is as described.","title":"This was my first purchase with The…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"customer","text":"Returned item, still awaiting refund. Reached out to customer service as do not believe i should pay the return fee given the item was not as pictured (there was a hole near one of the buttons. Have not heard back.","title":"Returned item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"K.S","text":"Overall the product I received was great and just as pictured. My biggest gripe is almost everything is final sale so there is no exchange or return for most items even though they have a return policy. I read everything very well!!","title":"Overall the product I received was…","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"Jeffrey Rowe","text":"Good morning. How about upper mgt. give me a call and I'll tell them ALL about it, please and thank you!  317-600-3074","title":"Good morning","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=97&stars=1&stars=2&stars=3"}]