[{"date":"2022-04-02","author":"Colin Phillips","text":"Very bad customer service department very deceitful description of your merchandise","title":"Very bad customer service department…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Karen","text":"I ordered a size 8 women shoe and received a size 11 men shoes.","title":"I ordered a size 8 women shoe and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Peter bucik","text":"You sent me the wrong size Nike air max.   It was advertised as 11.5 you sent me a 10.5 air max.  It would cost too much money and time to order another pair for my son's birthday already came and went,how the heck did y'all get the size wrong","title":"You sent me the wrong size Nike air…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer","text":"I was sent the wrong item. I have yet to hear back from anyone as to where the actual item I ordered is … or if they even have it. I’ve been charged for my order, mind you. And they immediately sent a return label so they could get their item back. However, I have been charged for an item I have yet to receive … and I am getting no response from anyone. Unreal.","title":"I was sent the wrong item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer","text":"I purchased a bag that was not authentic. Once I received my order, it didn’t take long for me to realize it was not a real Gucci bag. I paid over $50 in customs in addition to the price paid for the bag as well as shipping. I won’t receive compensation for the money I wasted on customs which sucks because I wanted to love the product and keep it. Returning it was not a choice but a must. I will not be purchasing anything from this site again and have advised friends against it as well that were considering making a purchase.","title":"they sold me a fake Gucci bag","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer","text":"You do realize that your return label link never works right ???? It takes you to your website only, it doesn’t take you to where you can print out the label.","title":"You do realize that your return label…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer","text":"The shipping fee is not so friendly. Like I got the clothes are not fit, we need to exchange to the similar cloth, than I have to pay 3times of shipping fees.","title":"The shipping fee is not so friendly","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Fitz C","text":"Broken zipper. And I have to pay shipping back for a false description?!","title":"Broken zipper","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer","text":"although a good selection I never would have purchased shoes if I had known I could not return them. now I have to consign these shoes and I will lose my money. I dint think it's fair or right to to consumers like me.","title":"Return Policy Issues","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer","text":"My purchase wasn’t wrapped in a protection bag. It seems like the online purchases are less valuable than in store. Even tho, for me it was a big investment and finding what I wanted was difficult in store. I felt even more disappointed when I asked for assistance and got no answer.\nWithout mentioning that sold item have no authenticity document.\nThis is my feeling about this.","title":"Disappointing","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer from Germany","text":"I have purchased a dress and a bag.\nThe delivery was fast.\nThe items received were not exactly as seen in the photos. There are stains in the dress and the bag is heavily discolored.","title":"I have purchased a dress and a bag.","stars":3,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Albert Dambrosio","text":"Your customer service is horrible. I couldn't talk to anyone without texting. It took me many attempts to get an address for a return because your app wouldn't allow me to print a return label","title":"Your customer service is horrible","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Kimberly Dean","text":"Well it is real Chanel but the condition is just awful. The hand bag is dirty and worn. The “condition “ was supposed  to be “very good “ but it’s not….I can’t return it as it says no return. I will send it to Rago Brothers for repair & restoration. I hope it it will be useable afterwards","title":"Well it is real Chanel but the…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer","text":"Shipping charge way to high and the selections are just so so …","title":"Just so so","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer","text":"My garment was not exactly how it was described in the listing. It was more damaged than what it said (missing buttons and some strands loose and buttons broken or super loose), the dimensions were slightly off and the colour was not true to the advertising.","title":"My garment was not exactly how it was described","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer","text":"I am sorry to be writing this review, but the customer service is seemingly non-existent. I sent a text to the number posted on the site, for \"immediate assistance\" with my account. The assistance requested was for a follow up on a large consignment sent on January 19th -- none of the items have posted to my account, and I received no response to the text I sent, nor to the email I sent regarding the same issue. Despite the note packing slip that says “you can track the status 24\/7 on your My Sales page”…..there is no way to do this. The person who handled the consignment, Kennedy, my account rep has seemingly vaporized. We have had no response on any of this. This also is not the first time I have had an issue with consignments-- just prior to this consignment, there were several pieces that were posted mistakenly, to the account of the person who took the consignments in for me. That took weeks to resolve. Doesn't really want to make one send in expensive designer goods that seem to go into the ether.\n\nSome help would be appreciated.","title":"Consignor Relations? Really?","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"penny","text":"they never marked the item is not retunable after you purchased it.","title":"they never marked the item is not…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"customer","text":"Some of the sizing was off. Shipping was fast enough. Only liked 1 of 3 items. Will be reselling.","title":"Some of the sizing was off","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Sudhakar","text":"Item received looks used, I see M&Ms in the bag","title":"Item received looks used","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Customer","text":"The David Yurman dog tag I purchased was indeed a fake! Waste of time and effort! Would never purchase anything from TRR EVER! Don’t waste your time or money — I learned my lesson — I will buy it NEW from the actual David Yurman store!","title":"Fake David Yurman dog tag!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=46&stars=1&stars=2&stars=3"}]