[{"date":"2022-05-06","author":"customer","text":"Okay so …… I like the concept behind this store and I like the affordability of it. They shipped my item super fast which I appreciated. Now , when it comes to luxury items being delivered I expect a bit more care when it comes to packaging, especially because bags tend to lose their shape and many of the ones sold here are older so I expected some sort of care when packaging and for my bag to be filled with at least paper to ensure the shape remained intact during the delivery process which did not happen. Now my biggest complaint they do not check the bag to ensure it’s clean , my bag arrived smelling like it had been at a garage on the floor for months , I had to hand wash it for at least an hour to stop the water from coming out brown and full of dirt. On that end I’m happy I got my bag but it took unexpected work to make it look decent.","title":"Okay so …… I liked the concept","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"felipe villegas","text":"Por customer service, price items below price, takes a long time to received your payment","title":"Por customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"order naver arrived, delivery date changed after out for delivery","title":"order naver arrived","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"I really don’t like buying from the RealReal because of their fees and such that they subtract from my refund amount.","title":"Can I get my entire amount refunded???","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"customer","text":"The photos in the listing did not show the extent of the damage to the hardware. The description did note there were some scratches on the hardware, but it is in much worse shape than I would expect to pay over $1500 for.","title":"The photos in the listing did not show…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Jerry","text":"Come on Real Real … let’s get Real !  Purchased a Hermes Belt Buckle … had a size question .. no one to answer any questions. Wanted to see more photos … wouldn’t show more photos. The description said Excellent and would refund back to credit card. So I pulled the trigger !!  Guess what … buckle all scratched up around the edges .. not Excellent in my book. So …. I returned it and got stuck paying shipping both ways for an item I wouldn’t have bought had their been more photos.\nThis was a Real Real mess !!","title":"A REAL REAL MESS !!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"customer","text":"I received my item in completely disheveled condition. There was no packaging protecting it and it was broken open on arrival. The item was damaged and even after reaching out to customer service we were not able to come to a resolution","title":"Lack of packaging","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"customer","text":"The purse was graded as excellent with “no signs of wear and tear” but when I received it, it has lots of black marks all over and the seams are nearly pulling apart. Whoever graded it did not do a good job.","title":"Not in good condition as graded.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"customer","text":"So tired of this dumb sh!t. I’ve had a horrible experience, worse fake I’ve ever seen. Tijuana fake. I’ve tried to contact, shared, reviewed, blocked and yet I still get these god damn emails. I hate you.","title":"So tired of this dumb sh!t","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"ch","text":"Terrible communication and HORRIBLE CUSTOMER SERVICE EXPERIENCE \nI will NEVER use your site again…this may sound petty but  my dollars will go to,others…even after several of my clients bragged on the thing I found 110% different . When YOU made a mistake in the LISTING no fault of mine you were totally uncooperative in reinstating a credit id used …I could go on and on but it’s not worth my time or energy","title":"Terrible communication and HORRIBLE…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"customer","text":"Customer service was no help I got a fake gucci bag and they would not do anything about it and argued with me for over 3 hours","title":"Customer service was no help I got a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Courtney Smith","text":"The shipping and communication was great but the jewelry\/earrings and diamonds were much much smaller than expected for the price I paid. I have earrings with diamonds two times the size of the ones purchased from the real real, and they did not cost but of third of what you all charged me. I am disappointed and I do feel as though I was really mislead by the pictures of the jeweleries size, so, this will be my first and last time purchasing anything from the real real. I do not trust you","title":"The shipping and communication was…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Ivana Vucetic","text":"I went by the estimated shipping time when I ordered the bag, which should have arrived before I left for Europe. However, the delivery time changed, and now the bag is left with my neighbours until I come next year. Also, I tried to contact Realreal in the meantime to see can the shipment be faster, but communication was bad.","title":"I went by the estimated shipping time…","stars":2,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Sarah","text":"Man once I got past your A hole design forced sign-up pop up I actually loved your site and ordered from it. I liked it so much I recommended it to a friend but as I went to go and copy the link that forced popup sign in box came back again. It made me so angry I told her that I had made up an email address to get in. Most of the site spends a good deal of time explaining that everything is authenticated but then the pop up software makes it feel so scammy it’s difficult to believe. Whoever implemented that forced sign up should be summarily fired (by firing squad)","title":"Screw your pop up sign in box","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Brandy","text":"If you just want pennies on the dollar then go for it. I had a luxury designer cocktail gown NWT $1000 and got $18 for it. And that’s one of many high end items I got basically nothing for. I’m a VIP which supposedly get 70% but that a joke…it only applies to super high end items","title":"If you just want pennies on the dollar…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Julia Doxey","text":"did not fix my issue or even try to. they told me someone else would reach out but no one has and they are explicitly ignoring my request at this point to me wanting my personal property back.","title":"did not fix my issue or even try to","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"customer","text":"Purchased a size XS dress online but was sent a much larger size dress with the designer name tag still intact but the size tag cut off\/ removed. Can’t process a return due to it is a “final sale” item. Luckily, i have another dress of different color but same design. Took photos to send the customer service via email. Still waiting to hear back from them.","title":"Bought XS, sent a much larger sized dress with the size tag cutoff","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Customer","text":"I listed many items with the RR and recently sent in 4 new items that were very expensive and each item was sold for less than 20% of the retail value, which is very low. The worst part is I didn’t find out until it was too late causing me to not be able to change the price or request my items back because they were placed under a old account I was told had been deleted. On top of all this they have lost 3 of my items and keep sending them back to my old address I was also told they deleted.","title":"Insanely Bad Priced Items","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"customer","text":"Dress I ordered was not in the condition described. I returned it and still have not received my money back.","title":"Dress I ordered was not in the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Disappointed in Delaware","text":"I ordered two St. John’s pants. They arrived on time but one had a large rip in the fabric on the backside and a hole in the thigh. Also, each had a distinctive and different odor indicative of lack of dry cleaning.\n\nI immediately emailed customer service and have waited four days without a reply.\n\nThis was my first purchase. I will hesitate to buy anything else from the RealReal again.","title":"Clothes arrived damaged and smelly","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=3&stars=1&stars=2&stars=3"}]