[{"date":"2022-03-28","author":"customer","text":"I never received my product.","title":"I never received my product.","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"customer","text":"This was not delivered to my home. I've spent a substantial amount of time trying to reach someone there and then, finally, on the phone with someone (over an hour) who was not very knowledgeable. He promised to get the money returned to my account and it was now. VERY frustrating.","title":"This was not delivered to my home","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"customer","text":"I purchased a necklace on March 10, which was supposed to be a birthday gift (birthday has come and gone).  It has now been 18 days that they have had my payment, and yet the package tracking information informs me that a shipping label was printed but that the necklace has not yet left the warehouse.  Ironically, I did see the notification that my purchase is now outside of the window to qualify for returns.  Extremely disappointed.  The only feedback from the company was to reimburse me for shipping and tell me that they are going to request a \"rush\" on the order.","title":"I purchased a necklace on March 10","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"customer","text":"I ordered a jacket that was listed as size L, and when it arrived it was an XS. Its beautiful, and I'm very sad it doesn't even come close to fitting. This is my second experience with sloppy customer service at the Real Real, and its very disappointing. I'm told I'll get reimbursed fully (shipping even), but that remains to be seen. Based on my interactions in the past I am not confident.","title":"completely wrong sizing","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"customer","text":"I am giving this 3 stars because I'm quite disappointed. One of the deciding factors in making my purchase was that it said that the dress was in box. I can say that many people who order designer prefer when things are in box or original dust bag. When my package arrived, I found that my dress was not in box as stated on the website and on my packing slip. On top of that, the dress I ordered was white and wrapped in black tissue paper inside of a poly bag. It would be one thing if the dress was placed inside of dust bag from The Real Real, but it was left to chance that it wouldn't be damaged. For making a purchase that is considered final, I find this unacceptable and quite out of character. I did contact customer service and they were very kind. They refunded my shipping cost in the form of store credit. While this is nice and appreciated, I still wish I had the box. Please double check before sending future orders.","title":"I am giving this 3 stars because I'm…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"customer","text":"Placed my order with a signature required for delivery. It was “delivered” without a signature and I never received the package.","title":"Placed my order with a signature…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"BocaFelice","text":"They delivered to wrong address and package was stolen. They blamed it on me, as if I would fill in my own address incorrectly. Auto fill doesn’t make mistakes. Now I’ll never get my beautiful Louis Vuitton bag.","title":"Nope.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"customer","text":"Bad experience overall. Tedious.","title":"Bad experience overall","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"customer","text":"Tried to change shipping address 1 minute after I ordered.\nThey emailed back after three days and told me to figure it out myself by contacting the shippers directly.\nNever got items.\nThen they refused refund.","title":"Service SUCKS","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"Maria johnson","text":"I was disappointed with the Fendi Purse i bought. It is so overused and expensive.","title":"I was disappointed with the Fendi Purse…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"customer","text":"Sold me shoes that were much bigger than advertised (size) and was unable to return.","title":"Sold me shoes that were much bigger…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"customer","text":"This company has caused immense stress. Christina has been great but the company is just short of awful. 3 of my items have gone lost and unrecovered and when purchasing a Bottega bag in \"Excellent\" condition with the box and dust bag I instead received a very dirty and clearly used\/stained bag with no box or dust bag. I have consigned thousands of dollars worth of items with this company and will not be back or recommend.","title":"This company has caused immense stress","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"Lisa","text":"Neither dress was in great condition and I didn't realize I could not return one and had to pay shipping to return the second so I lost money.  Would never do that again or recommend to anyone.","title":"Neither dress was in great condition…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"G Z","text":"Love the available products, shipping, packaging and general site and app experience.\nReally don’t like that garments are shot on only one size mannequin regardless of the garment size. Clothes are awkwardly pinned or draped, which is both offensive and not helpful. I would rather see the garment flat.","title":"Great site, bad representation of garments","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"TrapperMD","text":"The only thing I don't like about it is, it doesn't show or mention what wear and tear or imperfection the item has.  I would rather see or know what I'm buying first, good or bad so there's no regret.  I would have bought the purse anyway knowing what it needed to get fixed.  I got lucky, it was a small repair.  Now, I don't want to buy anything else anymore because I don't know what I'm getting.","title":"You don't see what you really get!","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"customer","text":"Very expensive shipping, and the wool prada items arrived excessively crinkled, appeared to have been pushing into the bag rather than folder.","title":"Very expensive shipping","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"scarlett smith","text":"The bags are as pictured and described\/good condition however the $69 shipping fee is a bit ridiculous when there is also a conversion rate.\nThe delivery was very quick meaning it was delivered domestically and that shipping fee should only be there if it was an international shipping fee.","title":"The bags are as pictured and…","stars":3,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"Not so happy with first experi","text":"The wrong size was advertised. After receipt of the product was it realised. Then TRR wanted me to pay for the return\/restocking fee… for their mistake !?! Poor customer service at best!","title":"The wrong size was advertised","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"Bought an item from TheRealReal\nConsigned it 2 days after receiving it.\nThey RETURNED it to me saying it's not a brand they carry...after I purchased it from them\nI had several phone calls...sent it back for consignment and have not heard a single thing from them in several weeks.\nI would NEVER send something truly expensive to them.  Lack of customer service, follow up and attention to detail.\nTotal disaster","title":"Disaster","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"When I received this bag there was a smell (perfume or incense) that I still haven't been able to get to dissipate. It is very strong and whenever I use the bag I can smell it continuously.  The pictures of the inside lining didn't show this but that there is sticky residue that I am unable to get out. And anything I put into this bag including my wallet sticks to whatever this is.  I've tried cleaning the liner but nothing has seemed to work.  The exterior of the bag was in good shape.  But both the smell and the sticky residue aren't easily remedied and will make me second guess any future purchases I make with The Real Real in the future.  This was a final sale item otherwise I would return.","title":"Buyer beware of potential odors on used items.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=52&stars=1&stars=2&stars=3"}]