[{"date":"2022-04-01","author":"customer","text":"My package was lost","title":"My package was lost","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"customer","text":"No one has gotten back to me. Why am I getting this survey? Makes me think it didn't get taken care of.","title":"No one has gotten back to me","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"lln","text":"Listing said Medium and it was a 16. I still had to pay return shipping for their mistake.","title":"Listing said Medium and it was a 16","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"David","text":"The ordering process was smooth and the shipping was quick. The response time was excellent. That's where the positive ended for me. \n\nI ordered a beautiful Charvet white silk pocket square that was described as being in \"pristine condition\", their highest ranking. I received it and was quite surprised to notice there was an obvious glue stain in one corner from a sticker (which was only marginally improved by hand-washing and by using rubbing alcohol), a small 2mm hole in the fabric, 2 loose loops in the thread on the rolled edges, as well as 3 loose filaments of silk pulled from the fabric. None of these defects were mentioned in the description.\n\nWhen I reached out to the company to sort out this situation, I was offered to return the item, but they would not reimburse at all the original shipping fees (they charged me >40$ here in Canada), and the return fees would only be offered as store credits. I would end up loosing a lot of money from the shipping fees and only get the back returned article's value. It would be acceptable if I had decided I no longer wanted the item, but given that this was the seller mistake in the first place, this was an unacceptable resolution. \n\nIf I refused to return the item (and waste the shipping fees money), all they were willing to offer was 25$ of store credits. If they had offered 25$ money-back, that would have been slightly more acceptable, but offering store credits when it's their own mistake is crass at best. Not the kind of business-model you would expect from an average retailler, let alone a premium one.","title":"Bad return policy even when they are at fault.","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"customer","text":"The website asked me if I wanted my prices in Canadian dollars, which I accepted. Once I bought something it charged me in USD and didn’t do anything about it.\nNot impressed.","title":"False information","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Nick","text":"I bought some pants from them. I thought when they said in the website that items have minor wear, they meant some discoloration, fading, and other kinds. I didn't know it also meant that there are holes in the garments. I couldn't use 3 out of the 4 I purchased because the holes were in unsightly places and couldn't be remedied by just trimming the hem. I guess I'll be careful next time I buy from them.","title":"I bought some pants from them","stars":2,"location":"PH","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"customer","text":"My items description stated ... excellent. No visible signs of wear. However the hardware was all scratch up and the outer pocket had hair and crumb like particles. The outside also had a small scuff in the front. All things that went unmentioned. Disappointed.","title":"My items description stated ..","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Providence","text":"I made two purchases and received them promptly.  This third purchase still hasn't shipped.  It's been a week.  So I am concerned about that.","title":"I made two purchases and received them…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Karen Chamaj","text":"The pictures aren’t enough to see exactly what the item looks like. They’re aren’t enough and not able to zoom in.  There were some nasty looking stains throughout the edges\/corners of the purse that were not listed and not visible through the minimal pictures provided.  As a final sale purse I think more transparency should be provided.","title":"The pictures aren’t enough to see…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Barbara","text":"I recently purchased a dress from a brand that I regularly buy-- so I am familiar with the sizing.  When I received it, it seemed very small.  A check of the interior revealed that it had been altered.  I liked the garment and was able to deconstruct it and put it back together, but that was disappointing.  I don't know what kind of precautions could be taken to avoid that.","title":"Watch out for alterations","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"customer","text":"Send wrong item","title":"Send wrong item","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Denae Martilla","text":"I am still sorting out getting paid for items I consigned last September that were lost. The person chatting with me yesterday quit responding.","title":"Consigned items that were lost… still not sorted out","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer","text":"The shipping super fast and the product was almost new!!! Perfect conditions. I love it!!! I will use The RealReal again for sure!","title":"The shipping super fast and the product…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Laura Faatuiese","text":"It's a load of crap just like Balance of Nature....Their both rip of artists!!!!!","title":"It's a load of crap just like Balance…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer Ashlee","text":"I recently purchased a Rebecca Minkoff handbag, the condition was considered ‘good’. I received it and the condition was fair at best. The pictures did not show the correct wear on the handbag. This purchase has made me hesitant to purchase again from The Real Real. I will not be wearing this handbag. It’s in terrible condition, and wish the pictures were more accurate.","title":"I recently purchased a Rebecca Minkoff…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer","text":"I was pretty happy with my purchase of the Chanel sandals. That was until I was hit with an almost 500 dollar duty charge. The charge was about 40% my order. Thanks for the heads up real real. For real.","title":"Unreal duty charge","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer","text":"Buyer beware. Had variable success with TRR, just be willing to accept there is a good likelihood of something going wrong -condition inaccurately described, goods arrive with damage, customer service is poor. If shopping internationally take this into consideration as their mistakes will be at your cost and be prepared to receive absolutely no resolution or even a response.","title":"Buyer beware","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"MK ","text":"Item arrived damaged for an international shipment, returned but not reimbursed the shipping cost despite being a TRR error. You’re also on the hook for non refundable duty charges. Quality control totally lacking.","title":"Item received with damage","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer","text":"Unfortunately The item was not described Very well, But was a final sale and was in worse shape than expected..Scratches everywhere that did not show in Pictures.. Well..Learned my Lesson","title":"I got the Real Real","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer","text":"pricing can be hit or miss","title":"pricing can be hit or miss","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=47&stars=1&stars=2&stars=3"}]