[{"date":"2022-03-12","author":"M G","text":"This purse is filthy dirty, has flaws all over that were not disclosed in pics or description. It is worth about half what I paid and not returnable. I will consider using a different company for my purchases in the future. I reached out for customer support and no one returned my calls. Once I clean it who knows how many flaws it will have.","title":"This purse is filthy dirty","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"customer","text":"I was sent the wrong size than I ordered and have to pay $12 restocking fee for their mistake.  Not happy.","title":"I was sent the wrong size than I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"customer","text":"No one followed up at all. Terrible.","title":"No one followed up at all","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"customer","text":"Huge. It said xs and the jeans were a size 25.   I swim in them.    This was my first purchase from this app, and the last.","title":"Huge","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"Rosie","text":"I ordered a piece advertised as size XS. When it arrived, it’s actually a size large?! And I’m in being told I cannot return due to it being a sale item. What an absolute joke.","title":"Wrong size!!","stars":3,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"customer","text":"Customer service took forever  and the return policy is such a hassle. The Real Real sent me the wrong item. When I tried to return it, the customer service rep makes you jump through so many hoops and answer so many questions- it was super inconvenient and not easy at all. You have to prove that an item they sent you is wrong by taking pictures and uploading them to the site chat.  The website pictures of what you think you're buying don't actually match the item they send you (this happened twice). Also they will charge you a 12$ Return service charge for luxury item, even when the item description doesn't match the website description or the item they send is wrong. For a luxury service\/retail store, it has not been a good experience for the 3 items I bought and then subsequently returned all 3.","title":"Customer service took forever  and the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"customer","text":"I received the bag and it was covered with something that was orange and felt like sand. I had to shake the bag outside and could literally see a dirt\/sand-like substance falling out of it. I have tried so hard to clean it and get it all off, but each time I use the bag and take out my wallet or phone I still feel sand every single time. I expected the bag to be cleaner than that. The bag also did not smell good.","title":"A bit disappointed","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"Kai","text":"Their commission is too high","title":"Their commission is too high","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"customer","text":"The site double charged me and after several talks with support, where I have to always explain what happened from the beginning, Im still waiting, more than 2 weeks now for resolution of their \"accountant department\", even though it has been escalated twice, for my money back.","title":"The site double charged me and after…","stars":1,"location":"CZ","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"customer","text":"I did not like the service.","title":"I did not like the service.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"SMITH","text":"Items not described thoroughly enough.","title":"Items not described thoroughly enough.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"customer","text":"Lost my items for a solid month or so. Then magically found them and didn't tell me. Took maybe 3 months to sell 1 gucci t shirt, which they put on sale...","title":"Lost my items","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"Leah","text":"I wanted to cancel and order and tried to do so immediately after ordering but because of international time zones (I am in Australia and the RealReal associates are available during office hours Eastern time) was not able to do so in time. Disappointing.","title":"Not fair if you are outside US","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"Vanessa","text":"While my bag came on time, I feel like it was not accurately described (or described at all for that matter) on the website, and it’s hard to tell if you will like a bag just from the photos. I didn’t realize the bag I bought had a rubber base on the bottom. It was the same color as the leather so it was impossible to tell by looking at it online, and the base was not mentioned in a description on the website. It’s a bummer that I can’t return it. Will not be shopping from here again.","title":"Misleading photos and horrible return policy","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"Customer LS","text":"The shoes are beautiful but it would have been nice for them to indicate that this designer does not run true to size. They’re nearly an entire size too small. Since I got them on sale, by the time I pay for the return shipping, it wouldn’t be worth returning them.","title":"Not true to size","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"Levi Wagner","text":"I order sunglasses and the condition was excellent but the lens had scratches all over them the frames were all bent luckly i was able to bend the back into place but when you buy something the is \"in excellent condition\" it should show little sign of wear like advertised.","title":"I order sunglasses and the condition…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"Terry","text":"I am very frustrated right now with an order I have placed twice for the same Chanel Boy Wallet and both times the orders have been cancelled due to inventory issues. The first one was cancelled but then showed up as available so I bought it again. The second order (which was just cancelled today), I chatted with a CSR yesterday who assured me that it had been batched at the warehouse and that I would receive it tomorrow. I then got an email this a.m. that it was cancelled AGAIN. I called and spoke with a CSR who told me I just need to add it to my favorites and watch for it to appear again...Not only did I miss out on other wallets while waiting for this one to ship (twice) but I also missed the sale that was going on at the time of purchase.\n\nI will say that I did purchase two other items that shipped and were received fine. So I guess it's 50\/50 for me on The Real Real right now hence the 3 star rating","title":"I am very frustrated right now with an…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"Kris Hroncich","text":"I ordered a dress described as new with tags and the price was $175.  When I received the dress the tags were in fact on and the price was $91!  I thought that was very excessive especially when this site promotes value.  The dress did not even fit me well so I did return the dress.  I also sent a message to their customer support about the issue and no one has responded. : (","title":"Value???? No","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"customer","text":"truly the worst consignment experience of my life. they lost my items and only want to give me 55% of what they’re actually worth.","title":"truly the worst consignment experience…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"customer","text":"Item was broken","title":"Item was broken","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=67&stars=1&stars=2&stars=3"}]