[{"date":"2022-02-09","author":"customer","text":"I was very excited when I found the RealReal because I love the curated items they are offering. However, while I purchased several items more than 3 weeks ago, I am still waiting to receive any of them.","title":"Long wait","stars":2,"location":"BM","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"customer","text":"Your Indian customer service is horrible. They are incapable of doing anything and serial liars. They are doing nothing but lying to get people off of the phone. I have interacted with them twice and never had any resolution. Useless. Additionally you restricted buying on my account arbitrarily and refuse to resolve the problem. I would give zero stars if possible.","title":"Your Indian customer service is…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"customer Gracie Briggs","text":"I purchase some designer shade and they was scratched all up I was disappointed by them being real","title":"I purchase some designer shade and they…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"customer","text":"- Misleading description: wrong color\n- arm seam was coming apart\n- lint and glitter all over the inside\n\nDidn't even want to try the jacket. No thank you","title":"Just bad","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"customer","text":"I bought 2 dresses at a great price. They were packaged nicely. One was clean and smelled fine. The other was musty smelling and since it was silk probably not easy to get out. Neither dress fit, even though they were two waist sizes larger than my normal size. Also, I was only able to return 1 dress. The other one I would’ve had to consign again with Real Real. Not sure I will purchase dresses here again.","title":"Return policy is short and not customer friendly","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"customer","text":"Customer service rep was unable to authenticate or explain a serious authenticity issue in my order after several attempts","title":"Customer service rep was unable to…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"customer","text":"Not too pleased with my purchase ! It was somewhat misleading —- thought the purse I purchased was red but it was orange. Thought it was much newer but was pretty worn . Think it was way overpriced .","title":"Not too pleased with my purchase","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"customer","text":"I ordered a size 9 shoe but got a size 6 shoe.  I'm guessing the person who entered the text about the shoe had a dyslexic moment.  However I was really disappointed.  Since I am an artist who paints paintings of beautiful high heels, I kept the shoes , but I can't wear them.  Real Real is giving me 20.00 off my next pair of shoes, but I am still left with a sour feeling about my first experience with buying from the Real Real.","title":"I ordered a size 9 shoe but got a size…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"customer","text":"I ordered some shoes and were not cleaned or the quality I ordered","title":"pictures show different","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"customer","text":"I contacted customer service about 5 times regarding a missing package. Times 1-4 I was told not to worry, that my package was on track. It was not until the 5th time that I contacted customer service that someone actually addressed my concern. I am still awaiting my shipment.","title":"I contacted customer service about 5…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"ABIGAL D","text":"My experience was unfortunately awful customer care. My experience is ongoing with an investigation for non-receipt of my order which should have been avoided.","title":"My experience was unfortunately awful…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"customer","text":"Great service love what I bought however it was not disclosed that the inside of the pouch was sticky. As Louis Vuitton purses are known to get sticky over time I was rather disappointed that this got a high rating And yes it was clean and kept well but there was no disclosure that the inside was sticky and pretty much unusable","title":"Disappointed","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"ALW","text":"Their customer service platform is really crappy. It is not customer-focused. When you reach out, if the automated answers can't help you it sends you a message to \"go about your day\" and they'll message you when an agent is available. If you aren't available when they message you, it times you out and you have to start over. I purchased 2 pairs of shoes and both were listed as the wrong size. After 4 tries with customer service chat, I gave up. It seems like this inconvenient setup is by design.","title":"Customer service needs improvement","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"customer","text":"I ordered a jacket and when the item that arrived wasn't what I ordered.\nTotally different brand.","title":"I ordered a jacket and when the item…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"customerTina G","text":"This was my 1st and probably last time ordering. Item was described as a size it was not. Guess I should've paid more attention to the measurements but I just went by the size stated on the ad for the item. Lesson learned.","title":"This was my 1st and probably last time…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"customer","text":"Unfortunately 1 of my items was listed as new and 'pristine' but it came with two obvious stains. The other items I ordered were okay. *EDIT* Positive note is they were quick to provide store credit for the stained shirt (wish it was an actual refund, but oh well!)","title":"Wrong description","stars":3,"location":"NZ","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"customer","text":"Item I received was not the one in the photos.\n\nI don’t even know how that happen. \n\nAnd your support team was very insulting. \n\n“It’s only missing one letter of the alphabet” \n\nReally?\n\nDo you also sell Versac and Guci products?\n\nCheck the photo out in my profile, then search the same hat to see the images they used to sell it. \n\nDefinitely not the same item. Definitely not inspected. Scam","title":"Item I received was not the one in the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"Melissa Choi","text":"This is regarding my experience of SELLING with The Real Real, not of buying. As a seller, the service is sub par. My rep told me 5 minutes before our meeting that she wasn't going to be coming. Her boss ended up having to cover for her, which worked out ok. \n\nHowever, I was also told that once the items were processed, I'd have a chance to review and nothing would go live without me approving it first. Not true. There is no stop point to allow you to review the items. They expect you to just constantly be looking at your account to catch the items they've processed. If you want it back, you have to reach out to your rep (who is unresponsive and hard to get a hold of) to ask them to manually remove the items for you and ship them back. That's IF you happen to catch the items before they go live and get sold. Which happens without any notification. Again you're just supposed to somehow be constantly monitoring your account. \n\nFinally, their commission structure is a bit deceiving. My sales page says in large font that I have 55% commission. What it doesn't make clear is that that is ONLY if the item is priced over $196. Below that, your commission is less - between 30-50%. So then what ends up happening is most of your items get priced with a cap of $195. \n\nI gave 2 stars because I do think they do a lot of work in processing items, and because of their wide audience, things that get listed seem to get sold pretty quickly (which actually may be a negative if you had any doubts or decided you want some items back - they'll probably be sold before you get the chance to check on your account). I just wish their process and service were better and clearer so that the sellers are made to actually feel valued.","title":"Selling with The Real Real","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"customer","text":"All has been great except for my first order.  It was lost on January 24th and I still do not have an update or status as to the whereabouts of my order.  Too difficult to communicate when an issue arrises.","title":"All has been great except for my first…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"customer","text":"My belt is gorgeous and in good condition. It took quite a while to reach me, I’m not sure if RR  charged for shipping but they shouldn’t as a courtesy. For the $13 shipping charge, it should have reached me within 3-4 days. It took 10 days. \nThis was my first purchase. \n\nI appreciate the range of designers and merchandise RR carry’s and will continue shopping with them.","title":"My belt is gorgeous and in good…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=94&stars=1&stars=2&stars=3"}]