[{"date":"2022-03-10","author":"customer","text":"The RealReal has good merchandise, however, shipping is quite expensive. The shoes I ordered ran smaller than true. To ship them back would have been $11.95 in addition to the $12.95 to have them shipped. Shoes were as described other than the smaller than normal size for that brand. I’ll look elsewhere because of the very high shipping costs. It probably would make sense if you are ordering a large amount.","title":"High Cost Return & Shipping Good Shoes","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"Carol","text":"The purse I received was cream colored when in the description it said it was white. I’m very disappointed. I don’t know that I’ll order anything else.","title":"Description Deceiving","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"John","text":"I got the item, but it took about a month. It took multiple inquiries for them to sort out a) where it was coming from b) how long it would take and when it did come, it came in a box that could've probably fit 50 golf clubs (I bought one). Shipping was half the cost of the total (about $40). It wasn't even securely wrapped - one piece of tape was keeping it together by a thread. If the box, while poorly sized, wasn't so sturdy, this item would've never survived.\n\nThey have a good idea, they have a pretty smooth platform as far as their customer service, but it seems like they haven't really thought out each step of the way. It just seems unpolished in execution.","title":"I got the item...","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"McKenzie Gage","text":"I am a but disappointed by The Real Real with a recent order. I purchased a wallet that stated it was in excellent condition with no signs of wear. However, when I received the wallet there was visible discoloration (faint yellow stain on white wallet). \n\nI contacted customer service and sent in a photo. They were only willing to either have me send the wallet back for a full refund, or if I kept the wallet they could only provide a small credit towards the website or refund me for shipping.. \n\nI really wanted to keep the wallet because it's unique but disappointed with my options. I felt like I should've been refunded at least $25 back towards my card. \n\nThe description was mis-leading.","title":"Wrong Item Description","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"customer","text":"I will definitely be using the real real again. However, I only gave this transaction 3 stars because the condition of the bag was substantially worse than described. I am unsure if RR rates the condition or the seller does, but I will be paying closer attention to the photos instead of allowing the stated condition to influence my decision.","title":"I will definitely be using the real…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"customer","text":"The shipping is horrible! I'm a first time customer.  Ordered a scarf on 3\/3\/22 it's now 3\/9\/22 and it has yet to ship!!","title":"The shipping is horrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"customer","text":"Always great stuff, however last Marc Jacob shoes i ordered were listed as \"leather\" are are actually a canvas material. A Rachel Zoe dress I bought was actually a jumpsuit. Cute stuff but buyer beware. Now have to sell these both online to get em out of the closet","title":"Always great stuff","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"Customer","text":"The heel on one of the shoes has a slight defect that was not mentioned on the listing. I don’t think it can be repaired.","title":"Heel defect","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"customer","text":"you sent me a nasty purse that i paid $400 for. i am not happy and will never buy from you again. the online chat that i spoke to basically told me to deal with it. poor customer service and absolutely ridiculous to mis represent the condition of an item. i will be telling everyone to not buy from here.","title":"you sent me a nasty purse that i paid…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"Victoria ","text":"Said excellent. There are dark spots on the handles. I’m taking this the legal route.","title":"Said excellent, it’s NOT","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"JAH","text":"I was really excited to order a necklace from theRealreal based on the advice from a friend in the US who has had good experience with them. Unfortunately, I am really disappointed in their service, communication and international logistics capability. My necklace is stuck in customs due to incorrect documentation. Any one in customer service I speak to asks me to wait 24 hours and check back. They will not directly respond to if they have even contacted UPS. The customer service team responds only with a script and little else.  \nThe company has a great selection and nice prices, but unfortunately is not set up or have the experience to be an international shop.","title":"Terrible service and poor logistics","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"customer","text":"Sent the wrong item and I had to send it back. Still don't know when or if I'll get the item I originally ordered","title":"Sent the wrong item and I had to send…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"Lauren G","text":"I ordered a pair of Golden Goose sneakers for my daughters birthday and was sent two different size shoes! Upon notifying the real real I was given the option of either keeping the shoes with a $40 credit towards another purchase or returning them with a prepaid return label. I responded that I felt this was not an adequate fix considering the hassle and disappointment they’d caused my daughter and me and asked that both the credit and prepaid label be provided and was never responded to after that. So now I’m sitting here with two totally different sized shoes and no way to communicate with customer service. Very disappointing.","title":"Disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"Lolita Leva","text":"Unfortunately the item that I received was not as pictured. There was a missing zipper on one of the boots making it impossible to wear as I needed to bring it to a shoe maker to get fixed.  Dissatisfied in my purchase.","title":"Shoe missing zipper.. not as pictured","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"customer","text":"The RealReal used on their listing additional photos that weren’t even included in the listing. While the items that are sold by themselves on their website, they used misleading advertisements making me think I’d be getting the entirety of what was listed. When I reached out to the client services specialist, they obviously had to approve my request of getting a full refund. BUT, they actually have the audacity of making me pay for the shipping and adding an 11$ fee for the refund. As I was obviously very disappointed by their service, I sent a message to the same « specialist » and she left me on read for now almost 5 days. This is not a way to do business and now I know, I will NEVER ever shop at the RealReal.","title":"Misleading in their listing","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"Marina","text":"Item was not as expected \nDull in color, should be yellow gold but looked greenish","title":"Item was not as expected","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"customer","text":"No resolution","title":"No resolution","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"customer","text":"It takes so long for the items to show on website. Maybe hire more people. The commission you say people can get is to get people to sign up and there is no way I would have sent some of the items for a 40% commission. You should be able to hire more workers with that commission. The first item of mine listed went on sale the second day at 15%. That's ridiculous. The Second Day is was on sale. You need to give it a week. I was so offended. I have sent 4 shipments and have one item listed. You have items new with tags but these items are worn with tags not new. When I but something New with tags it should only be Pristine or list Defects. The shoes that are new with tags that have been worn are called USED. They told me I would get credits and it takes two months? The rep has been nice and I know she is trying but I think this is a ripoff so far. For the sellers.","title":"Sellers get shafted. Just like eBay.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"customer nyc","text":"So bad. Customer service is very bad, they dont care about your order. I have placed an order and after 3 weeks of waiting for them to ship, they cancelled it with NO explanation. Then, gave me half of money back and half as “store credit” lol. They choose how much money they will give me back which is ridiculous. Will never EVER purchase from this web cite again.","title":"So bad, scam and low customer service.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"customer","text":"There were some inside scratches on the lenses that were not mentioned.  Though you can see through them and don't notice it should have been mentioned in ad.","title":"There were some inside scratches on the…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=69&stars=1&stars=2&stars=3"}]