[{"date":"2022-04-17","author":"Denise","text":"The description noted the authenticated LV bag as in very good shape. The few photos showed very few wear spots. The bag itself has a lot of wear & tear on all the straps. It is NOT in ver good shape at all. This was a first buy on The Real Real & will probably be the last.","title":"Buyer beware!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"Deidre Plotnick","text":"I bought a pair of shoes listed on website and on the order form as womenswear size. Though beautiful, They clearly were not women’s, which I discovered when they arrived. They were huge.  Somebody is not cataloguing the merchandise properly. And now I am out $43 to send them back and the restocking fee- which I am really hoping I am not charged. What a waste of time, money and energy.","title":"The Real Real needs to be way more careful about cataloguing their merchandise","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"customer","text":"I think actual pictures of the item and of damage should be included. I've wanted this bag for a while and finally splurged after a rough few months. It had more damage than I was anticipating because there were no pictures or details given of the condition. It's really pretty horribly misleading. I also would have never characterized a bag with fraying and a pocket starting to detach in the condition that this one was listed in.","title":"I think actual pictures of the item and…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"Angel Thomas","text":"I received my purchase very fast, but the Gucci slides do not fit. I feel that I wasted my money.","title":"I received my purchase very fast","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"customer","text":"The handbag had more scratches and scuffs than i expected. It would be really helpful to actually see the damage in the photos when you make a decision. I have looked at higher end designer bags but seeing the outcome of my first purchase makes me want to steer away from purchasing here.","title":"The handbag had more scratches and…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"Yifei","text":"Didn’t receive my order. real real Customer service simply ignored my query of the order not being received. Fortunately I paid by PayPal and their customer service is responsive. \n\nThis is the first time I bought on RealReal. The experience is thousand times worth than the Poshmark. My purchase history cannot even be found in my account. Status tracking is bad. When you don’t receive the order, you don’t know who you can talk to. PoshMark gets all these taken of.","title":"Didn’t receive my order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"Regina romero","text":"My package didn’t arrive and you don’t even answer my mails","title":"LOST PACKAGE","stars":1,"location":"MX","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"customer","text":"I never received my package. No reply from customer service.","title":"I never received my package","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"Cassie","text":"Iv only had my bag for a couple weeks and already it has torn.","title":"Iv only had my bad for a couple weeks…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"Vickie","text":"I love most of the products I received, but it’s awful how much I have to pay for returning items that doesn’t fit and when sending different items back, I was told by Zion on a chat, it was best to send items separately from different orders to make the process easier and more accurate.  To me it was to subtract two separate fees.\n\nAlso, trying to reach a live person on chat is a nightmare.  On two recent occasions I had to wait over ten minutes and that was after the robotic interaction.  One was actually  been longer, I was frustrated and just disconnected.\n\nFinally, on an order received yesterday the invoice for a belt I ordered was in the box but the belt wasn’t there.  I have to now try and reach someone to rectify this issue.  And a beautiful bracelet I bought didn’t come with its appraisal.\n\nI’m a regular customer, you could do better in communicating.\n\n-VDH","title":"Could be better for a luxury resale","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"customer","text":"Ordered 2 ties and paid extra for expedited shipping. Items were supposed to be received last Tuesday (4\/12). It is now 4\/17 and I still haven’t received my order nor have I been updated regarding the status of my order. First time giving this vendor a try and it looks like it will be the last time as well.","title":"Ordered 2 ties and paid extra for…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"Lisa ","text":"I am very upset that the last two orders I placed did not come to my street address! They went instead to the post office through UPS!!! Then they get returned back to the real real and eventually I get credited! I really want what I ordered! All of my previous orders have always been delivered UPS to my street address! I don’t understand why this is happening?\nBest,\nLisa Friscia","title":"I am very upset that the last two…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"customer","text":"On my first order on the real real I received the wrong dress. I sent pictures three times and each time received an email back saying they needed pictures. It has been very frustrating not to reach a resolution after two weeks. WIll not order from them again.","title":"I received the wrong dress. Customer service won't help me get the right one.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"Wesley Hamm","text":"Hit or miss.   When something works it is a good experience.  When things go wrong it is a mess.  First you have to pay for everything to ship to you.  If everything works all is good - but if it doesn't fit, you find damage that wasn't described (which happens more often than I was hoping for) or you just don't like it person - YOU have to pay to ship it back.  Also, I recently received an item that was \"final sale.\"  It arrived with a hole in the sleeve that wasn't mentioned in the description.  I worked with Customer Service to return the item and they said they would, but when I received the return label it was for the wrong item and now I have to go back and sort it out again.  Plus, again, I will have to pay for the return shipping - even though the issue is not my fault.","title":"Hit or miss","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"CP","text":"I don’t think the ratings are very accurate. Theres a huge difference between excellent, very good, and good. I feel most items I’ve received have been incorrectly classified. This is the reason I very rarely shop here.","title":"Poor classifications","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"customer","text":"There was a bit more wear than expected","title":"There was a bit more wear than expected","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"Julie","text":"Bag is in good shape but it smells like smoke. Kind of a bummer and sort of gross. You should probably disclose that info. Had I known I would have spent money on something else.","title":"Smells like Smoke!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"customerMs B.","text":"The picture was deceiving. Earrings were tiny and flimsy. I understand pictures need to be enhanced. Nicely boxed and delivered but will see a Jeweler to even determine that they are Gold. Very disappointed.","title":"The picture was deceiving","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"c h r i s t i","text":"misleading representation of item’s condition. has staining and is unfinished but was not described. i emailed customer support and have not heard back in 3 days.","title":"misleading representation of item’s…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"MadeleineB","text":"Inaccurate description re: sizing. Bought two pairs of shoes, which are AAAA narrow.  Not indicated in description.","title":"Inaccurate sizing","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=28&stars=1&stars=2&stars=3"}]