[{"date":"2022-03-29","author":"customer","text":"Pricing of items seems rather random.  Typos in listings, misrepresentations by staff, terrible delays.","title":"Pricing of items seems rather random","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"I did not receive the item that  I ordered that said was delivered to me  and instead received a box of items that were clearly someone’s consignment items that were sent back to them. \nIf I want the shoes I will have to check back on site regularly to find them.  \nVery disappointing and took a lot of of my time settling the situation with customer service","title":"Received wrong box","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"You really need to know exactly what you’re getting in terms of size, brand, etc because there are no returns, at least with what I got. Didn’t realize that until it was too late. I’m just used to Amazon where you can return everything. Also, clothing came perfumed.","title":"No returns","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"Return shipping cost was a surprise. Thanks think we all spoiled now by all the services and brands that offer free shipping and free return shipping.","title":"Return shipping cost was a surprise","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"customer","text":"Paying $13 in shipping is high in itself. To pay it and wait 8 days for your item is absurd.","title":"Paying $13 in shipping is high in…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Amy k","text":"The handbag is in great shape\n..the only problem is...THE SMELL!! Holy God!! Ive had it for a week and cant carry it because of the smell....Its a horrid smell","title":"Great bag with horrid smell","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"customer","text":"very small to see big enough for daughter not adult","title":"very small","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Hatchy Morein","text":"Bought a SONOS Connect which was advertised in the product title and description as S2 compatible and received an S1-only compatible unit.\n\nCustomer service was not very helpful in remedying the issue.\n\nM","title":"Mis-Advertised Product","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"customer","text":"I was sent the wrong item and was never contacted again by customer service nor did I receive any further responses to my messages after I was told they'd look into it.","title":"I was sent the wrong item and was never…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"customer","text":"One star for the app, one star on the selection. \n\nNo Stars for international delivery and transparancy on the costs. Furthermore one star not given as two items have flaws which were labeled in the app as „excellent“. Furthermore one star not given on the international retour- it is not clear for me how to work with toll and refund here as well as the delivery.","title":"2 out of 5","stars":2,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Melissa","text":"Advertised under retail price to reel you in ; paid 2x as much as would have been new even with the $25 off and the item wasn’t even new. Disappointing.","title":"Advertised under retail price to reel…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"customer","text":"Purchased pants that were labeled a size 10 on the website, but received them and the tag said size 8 quite clearly. Had to return.","title":"Purchased pants that were labeled a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"customer","text":"I was waiting around for your call and you never did call","title":"I was waiting around for your call and…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"customer","text":"The Item was broken and the boxes were basically open when they got to me.","title":"The Item was broken and the boxes were…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Avid shopper","text":"Your customer service has really suffered badly. I have had numerous occasions to reflect this….too numerous to list everything. Your warehouse for receiving, evaluating and shipping is terrible! Their descriptions are inaccurate….have had many items to send back. They have even listed my item to sell incorrectly. Your stores are a separate entity on to themselves….rude and lack knowledge. Your team of people to gather, appraise and evaluate merchandise is a whole new separate division. None of these divisions speak to one another. Follow up with them is not good at all. Your customer service is outsourced and another separate department. I have been hung up on at least 3-4 times. \nI have spent thousands of dollars with The Real Real. At times I am tempted to just delete the app off my phone. The lure of scoring an actual tremendously good deal keeps me coming back along with being a compulsive shopper. Soon though The Real Real will not profit from this much longer.","title":"Lack of customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"customer","text":"The product I purchased was a different color than the description online","title":"The product I purchased was a different…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"KMCM","text":"Two items in one order. Neither fit. One was returnable minus $12 for shipping and the other was not returnable so I had to reconsign. Not an ideal experience. Will not buy from again. Two stars because the items were as described and the price was great. I knew about the $12 return shipping but was unaware that I would not be able to return both items.","title":"Not a great experience.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Enrique Espinoza","text":"You send me damage and used items  purses never buying form here","title":"You send me damage and used items …","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Nicole Y","text":"I thought these items were returnable and they didn't fit. The The gown was listed as a different size like a 10 and I got sent an 8.","title":"I thought these items were returnable…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"customer","text":"I bought a bag in “excellent” condition, but it arrived with surface scatches and smelled moldy. That’s “very good” and should have been reflected in the price. Since it’s final sale, I am stuck with it. Love the bag, but not the value. It was also stuffed in an undersized dust bag that ripped when I unpacked the item. I just expected better. I can get this type of experience from Poshmark.","title":"Not Real Real Great","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=50&stars=1&stars=2&stars=3"}]