[{"date":"2022-02-07","author":"Valencia ","text":"The bag is smaller than I thought and the hardware looks old","title":"The bag is smaller than I thought and…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"customer","text":"The page for dress I bought said, “This item can be returned for credit card refund”. However it’s in fine print on separate return page that returns cost $12. I found this pretty misleading. If that’s the policy, put on the item’s page where you list the other return information.","title":"The page for dress I bought said","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"Barbara","text":"The RealReal staff members steal reserved items from online customers' shopping cards. On February 7th, around 6:07pm, I added item # LOR104329 to my card; about 1-2 minutes later, the item was removed from my card without my authorization by a RealReal staff member and sold to someone else.","title":"The RealReal staff members steal…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"Bill","text":"It is literally impossible to contact the site. While the item I ordered did not allow for returns it was misrepresented as an XL when in fact it was a size 8 no way is that XL  - of course it does not fit. Oh the solution appears I can relist it with you...no thank you.  I am stuck with it UGHHH.","title":"Poor customer service and no communication","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"customer","text":"I returned two pair of shoes. However, you only credited me for only one pair. The sad part is, the pair that you credited was actually the pair returned after the other pair. You all sent me an email to return both pair, but you didn't give me a refund back on but one pair of the shoes.","title":"I returned two pair of shoes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"customer","text":"I ordered a couple of times and the sizes were never accurate and I don’t get back the full refund.","title":"I ordered a couple of times and the…","stars":1,"location":"MX","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"Anne","text":"“The Real Real”?  More like “The Wrong Wrong”.   I purchased Stuart Weitzman brown suede boots that were listed for final sale as a size 8. But the shoes I received were most definitely not size 8 - they’re at least two sizes smaller.  \n\nI emailed customer service for guidance on my options for return\/refund, since I did not get the item I believed I was paying for.  \n\nI got an email back, probably from a bot, that said I would not be getting any kind of refund because the shoes were listed as “final sale”. \nI wrote back and said this reply is unacceptable since the purchase I made was for a Size 8 shoe - it was posted for sale as such and the expectation is that I would receive the Size 8 shoe.   I did not receive the Size 8 - the shoes are unusable.  \n\nThe only fair and reasonable action would be to allow me to return the shoes, at TRR’s expense, and either refund my payment money, or give me store credit.  \n\nI have not heard back from TRR, which tells me they don’t care, and essentially did a bait and switch.  Buyers beware. And TRR beware: there are probably many other clients who’ve experienced the same situation and cold customer service.   It’s how class action lawsuits are born…","title":"Beware of the Bait and Switch","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"customer","text":"The coat I received was not the coat I ordered. After searching around for months for the perfect black wool overcoat, I was very excited to find a lovely Max Mara coat in my size on the RealReal. I ordered the coat and the package arrived in good time. However,  when I open the box, it was a completely different designer and coat style. Didn’t even fit me. I sent the coat back but never did get the coat that I had ordered.","title":"Received wrong item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"customer","text":"The scarf has stains on it. Looks like food. That was pretty gross. I need to take it to the dry cleaners before I can wear it. The socks have the original price tag on them… for less than what I paid!! I understand that you guys have to make some money  but it was really tacky to send it to me with the original price tag. I’m definitely bummed with this purchase. This is the second time I’ve had a problem so I’m not sure I’m going to use this site anymore.","title":"The scarf has stains on it","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"Daniel","text":"I purchased a designer handbag for my wife and was sent a completely different bag. I have battled for 5 days and cannot get a direct answer on where my bag is. I sent back the incorrect one, per their request. I would expect something that cost that much to be handled with a bit more care. I will definitely not order from here again and will never refer to anyone I know. I’m extremely disappointed and expected so much more based on the reviews I read.","title":"I purchased a designer handbag for my…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"customer","text":"Item condition description was not accurate. Item was described as being in “Very good” condition, but upon receipt of the item, I noticed a tear in the fabric. Returning item.","title":"Item condition description was not…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"Rosemary A.","text":"I made my purchase based upon how the item was showcased\/advertised and was pleased with what I saw.  I was also pleased with the timing of receiving my purchase--from purchase to receipt of goods was all done with in a week's time. However, when I received the much wanted item, the shoes were so worn out that I would have had to have the soles replaced and the tip of the shoes were worn out.  I feel that The RealReal should give a full description of the conditions of the items that are sold so that the customer can decide if the item is worth their purchase.  That would save time and the deduction of the customers funds that are refunded.","title":"I made my purchase based upon how the…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"customer","text":"First time purchasing from Real Real and was very disappointed when I received my bag. It was filthy. Bag was advertised as good new condition and it was far from good. Red stains all over the inside two compartments and bag still had trash from previous owner. Highly disappointed and will never purchase from the realreal again.","title":"Highly disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"customer","text":"I find that retailers of second hand items often use some sort of perfume spray to mask the smell of dust. I would prefer the dust, as the spray smells awful and I can't get rid of it. Unfortunately, the Real Real seems to use the spray as well. The bag is beautiful but I don't know if I'll ever be able to use it due to the scent.","title":"No Perfume Spray please.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"customer","text":"The RR rep never  showed up","title":"The RR rep never  showed up","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"Nikki","text":"I was sent the wrong item!! I purchased a size 38 Valentino boot and was shipped a size 36!! After calling customer service I had to explain the whole situation and remain on hold for quite a while when I was hung up on. So I had to call back and explain the whole situation again! The solution was I had to ship the wrong size back and hope you located the size 38 to resend me upon receiving the size sent in error?!? So to recap I’m out $800, don’t even have the item I purchased in the first place, and had to drop off the package to UPS with two small kids in the middle of a pandemic! \nMy first purchase through The RealReal so far has been a disappointing, inconvenient, waste of my time!","title":"I was sent the wrong item!","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"Ellen Shedlarz","text":"Nothing has been resolved yet so I can’t really grade anyone. There are two issues outstanding. The first is a Todd’s bag went to you December 9 that’s still hasn’t been put up or priced. I was told it was inferior quality and then I sent the sheets for when I bought it for I think $300 from you guys.\nI am still waiting to hear affter2 months. \n\nI’m waiting for a return label for free return but I haven’t gotten the package yet .","title":"Nothing has been resolved yet so I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"JUSTWANTEDNEWBOOTS","text":"I RECEIVED THE WRONG SIZE BOOTS.  I WAS DISAPPOINTED BUT, HEY, ACCIDENTS HAPPEN.  I LOOK ON THE WEBSITE FOR RETURNS AND FIND OUT I HAVE 15 DAYS, THE PACKAGE ARRIVED LATE DUE TO SNOW STORMS AND BY THE TIME I RECEIVED THE PACKAGE ONLY 7 DAYS REMAINED.  THEN I NOTICE THEY WILL CHARGE $12 FOR RETURNS.  I DIDN'T THINK I SHOULD HAVE TO PAY BECAUSE IT WAS THERE FAULT, NOT MINE.  SO I CALLED CUSTOMER SERVICE.  40 MINUTES LATER AND BEING DISCONNECTED TWICE I HADNT GOTTEN ANYWHERE.  EVERYTIME I CALLED BACK OR WAS TRANSFERRED I HAD TO GIVE THEM MY ORDER NUMBER, PRODUCT NUMBER, NAME, ADDRESS, BILLING ADDRESS.  SO AFTER THE SECOND DISCONNECT, I GO TO MY OFFICE AND THINK IT WILL BE EASIER TO \"CHAT\"  SAME THING!!  ORDER NUMBER, PRODUCT NUMBER, NAME, ADDRESS, BILLING ADDRESS.  COMPUTER, THEN PERSON, THEN NEW PERSON.  THEY FINALLY AGREED TO WAIVE THE $12 RETURN FEE.  I HAVE NO FAITH IN TRR.  IF THEY CAN BE TRUSTED TO VERIFY A SIZE, HOW CAN I TRUST THEM TO AUTHENTICATE A PRODUCT.  VERY UNPROFESSIONAL.  I NEVER LEAVE BAD REVIEWS BUT THIS REALLY PISSED ME OFF.  I HAD TO GET TO THE AIRPORT TONIGHT BUT FIRST I HAD TO GET A RETURN LABEL, GO WAY OUT OF MY WAY TO THE UPS STORE TONIGHT BECAUSE IF I WAITED UNTIL I GOT BACK THE 15 DAYS WOULD HAVE PASSED.  WELL, NOW IM AT THE AIRPORT AND HAVE TIME TO TELL EVERYONE WHAT A $*++SHOW THIS WAS","title":"HOW CAN THEY VERIFY AUTHENTICITY WHEN THEY CANT VERIFY SIZE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"Dominic","text":"THEY DO NOT COVER CUSTOM COST - customs to get it shipped to Sweden was also very expensive.\n\nAnd when I received the order, the item ended up being FAKE after close inspection.\n\nNow returning is a hassle - Customer service has given me a pre paid manual return label and a refund on the shipping charge - but this does not cover the cost of the Custom I had to pay for the item to arrive to me and the eventual Custom charge I will have to pay for the this item to get back to US.\n\nMy first purchase from The RealReal and will be my last.","title":"Item was Fake","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"customer","text":"I have an issu with the item I purchased, I wrote to CS and never got an answer back.","title":"I have an issu with the item I…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=96&stars=1&stars=2&stars=3"}]