[{"date":"2022-04-04","author":"Dicarlo","text":"When I ordered shirts said men's but received women's can't be returned so gavrvthem to my wife . Also had to pay an additional ups charge eill not use this site again","title":"When I ordered shirts said men's but…","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"The small, medium, large sizing wasn't that helpful when selecting a jacket. There's a difference between a 4, 6, and 8, and some jackets were too small while others were too large. I bought 3 leather jackets hoping one would fit and I had to return them all.","title":"sizing challenges","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"EH","text":"If I could give zero stars, I would. I have shopped with TRR for quite a while and have had so many issues, it’s unreal. The most recent experience being i was sent a $25 off coupon code. I attempted to use the coupon code and while it applied the discount, noted that the sales tax was being calculated on the prices of the items pre-discount, which is incorrect. I reached out to customer service and didn’t not receive an answer until about 6 hours later. It was about 9:00 pm by then and I was putting my child to bed, wasn’t able to answer the phone. By the time I was able to check my messages, the agent had logged on and ended our chat within 5 mins, didn’t even give me a moment to reply. The issues I have had with the website are countless, and the customer support is borderline useless. Every time I have tried to shop here lately, it’s been so frustrating to the point where I just don’t bother. Great prices and great product, terrible customer service and they make no sense whatsoever. I believe the sales tax issue is borderline illegal but who knows. This company seems pretty shady to me.","title":"If I could give zero stars","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Kristin","text":"I loved the YSL Clutch I ordered but was so disappointed that it had stains on it. It was not disclosed in the description and the item in non-returnable. I would like to know what my options are.","title":"I loved the YSL Clutch I ordered but…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"Quite literally the worst customer service in retail. I can only liken my experience to Verizon Wireless and Comcast. No wonder my friends refuse to sell or buy from The RealReal! Shameful.","title":"Quite literally the worst customer…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"Product has stain on the collar and was still in packaging","title":"Product has stain on the collar","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"If I could give 0 stars, I would. Deceptive, fraudulent practices. I spoke with three associates in the chat feature. All three dropped their connections without resolving the issue. Took over three hours! And on at least one item with damages that were not disclosed! I finally spoke over the phone to a fourth associate who was able to help, but it should not be this difficult.","title":"If I could give 0 stars","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"I ordered an item which was said to be a pair of suede boots in the description. They are most definitely not suede boots, they are velvet. The representative said I needed to send him a photo of the item--as I was at work, I was not able to take a photo of the item.  I would think that they have more than several photos of the said item as they are the ones selling it on their site. Very unprofessional.","title":"Not Accurate Item!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Hannah Lin","text":"Let me give a review for what the real real is really about. I had been selling on them for a while. Super slow on process. You can have your items shipped out for weeks and it still listed as processing. I requested my Chanel bag return since it has been ever sold, their associates texted me told me that the bag was sent out on the way back to me, never got a confirmation email or tracking.  It has been 2 months since they told me that bag was sent out. Then they keep me on the call for forever, keeping sending me to different department. Each time they ask my email address what I call for just so I can give up my request.  Christina, one of their associates, told me she was going to send help, never once I got an email back. Then she cannot pick up calls ....  I question if they are using those sale items doing other business. Pulling an item off a warehouse should not be this difficult unless they rented out. Highly suggest checking on the company illegitimacy.","title":"Let me give a review for what the real…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"The listing said it came with minor scuffs but it arrived with tons of scratches and dirt and dust all over, and it didn't come with a case and cleansing cloth as stated in the listing.","title":"Misleading photos of quality","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"The bag you sold to me was fake! And I have emailed you guys and no one has responded! I’m so upset that you you guys would screw your customers and claim you authenticate every item!","title":"The bag you sold to me was fake","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Laura F.","text":"There is nothing more frustrating than having to pay for returns. Not only don’t you get the item, but it ends up costing you money. Of course that was better than the experience with my other dress, which I was unaware could not be returned. So now I have a dress that doesn’t fit, plus I paid a fee for a dress I don’t own. I’ll stick to going to the stores.","title":"Poor return policy","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"A LYD","text":"The purse I received was really more of a poor quality rather than good.  Plus the photos that generally accompany the add  really don’t give an accurate size.  Not sure what I would carry in it other than a few little trinkets. Not very happy this time","title":"The purse I received was really more of…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Kelly M","text":"The process is easy, but the commission structure is very bad for the sellers- if they don’t price your item at at least $195, you only get 30% of the same price.  And they set the sell price.  That seems extremely excessive.","title":"You basically give your items away . . .","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"ED","text":"I bought a coat that was too small and when inquiring about returning it, it was eligible for consignment but, the local store stated that they are not currently accepting such designer garments. I am done with you Unreal Real.","title":"Lost trust","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"The RealReal is not a reliable authenticator. The have claims of a “thorough authentication process by highly trained individuals” yet I purchased fake ALD 550’s with a text on the outsole that read “NON-MAKING”. Anyone without proper training could identify these as fake. I do NOT recommend shopping at TRR as they are an untrustworthy consignment company.","title":"The RealReal is not a reliable…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"customer","text":"Bag is fair condition, a little dirty","title":"Bag is fair condition","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Lisa","text":"I received the wrong handbag for the second time. .. will def be the last time. Awful customer service.","title":"I received the wrong handbag for the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"customer","text":"Really upset with the 70% discount on all my items that you sold, specially on my Hermes Bangle , not gonna recommend you to anyone.","title":"Upset with the discount on my items","stars":1,"location":"IR","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Mikayla Johnson","text":"This is ridiculous, I ordered a coat 3 weeks ago and my order still has not even shipped. When I reached out to customer care, they refused to cancel the order stating that it’s in process and then “escalated it.” This was several days ago and I’ve not heard back yet. What is the hold up? Why can’t I cancel if it’s still in their possession?-","title":"This is ridiculous","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=43&stars=1&stars=2&stars=3"}]