[{"date":"2022-03-31","author":"customer","text":"I bought a watch two weeks ago and it has yet to arrive and TRR has yet to say what they plan to do about it. I only spent $570 or so for the watch.","title":"I bought a watch two weeks ago and it…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"PM","text":"I question the authenticity of the bag I received. Sadly it’s a final sale, so there isn’t much I can do about it. Costly lesson learned but learned none the less. I’ll never purchase from or recommend this company to anyone.","title":"I question the authenticity of the bag…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Nancy C.customer","text":"I paid for 1-2 day delivery and did not receive the article.I was told that I ordered after 1 PM my time and therefore it did not take.  I ordered on 3\/23 and thought that I would receive it by 3\/26 at the latest thinking it would go out 3\/24 way before the 1 PM deadline. I finallt arrived on 3\/28 arouond 5 PM.  I am disappointed that nothing came out  that stated in no way will this be processed  for the 1-2 days and you went ahead and took the extra money.  I did call yesterday and spoke with a customer service representatative.  At first she said that there was nothing they could do. I then I asked if someone else could help.  She stated she would try.  She came back and said I was fortunate and that they would credit it back not on my credit card but now have a credit with the REAL REAL You need to be more up front with your delivery fees.  I felt like this was a bait and switch.  I thank you for the credit but who knows if I will ever use you again!","title":"I paid for 1-2 day delivery and did not receive it!","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"customer","text":"I sent items in for sale. They lost a pair of jeans and then underpriced many items. They sold a pair of Prada sunglasses for $40, so I made $12, they told me. they would pay me the difference of what they should have been sold for and never gave me those funds. They still have not priced or put for sale a ring I sent them a couple of months ago. I don't think it is worth selling expensive designer goods when I get $12 for them. I have more luck buying things from them.","title":"I sent items in for sale","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"customer","text":"I ordered a pair of sunglasses and they didn’t come with the box as stated. I reached out to ask for a box as they are a gift and I have not received a reply yet and it’s been a week. I bought these as a gift and I don’t want to give them without a proper box.","title":"I ordered a pair of sunglasses and they…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"customer","text":"The RealReal is not always honest with descriptions of their inventory so you have to be very careful. All of my recent purchases labeled “with tags” in the description did not arrive with any original tags (other than The RealReal’s). A handbag that was labeled as being in “pristine” condition arrived with scuff marks all over the patent leather. Sad to say that the quality of this business has gone way down in recent years and I will be taking my business elsewhere.","title":"Dishonest descriptions","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Sarah","text":"I am so disappointed to have to write this.  I bought a pair of louboutin shoes, within 3 wears the heel completely disconnected from the shoe.  I was offered $50 as a credit to my account, which I declined.  This was my first purchase with RR.  I have never had this happen to a pair of shoes, so much as I am wondering if the \"red bottom\" was plastered on somehow really making these shoes a FAKE.  Hopefully RR will actually do something about this!!","title":"I am so disappointed to have to write…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"customer","text":"Why is it so expensive to return something","title":"Why is it so expensive to return…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Tyshaun Smith","text":"My Gucci ultraspace shoes was way to big it said a size 6 but It was fitting like a size 9 literally fitted 3 sizes bigger then my actual shoes size..","title":"My Gucci ultraspace shoes was way to…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"LV bag","text":"Product was as described!  But their shipping and handling of a product worth $1000 was very disappointing. I received a very poorly packed bag and because of this damage occurred to part of my order.  Customer service did nothing to correct the error.","title":"Product was as described. Costumer service was disappointing!","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"customer","text":"Raincoat Coat came nicely packaged and body of coat is in great condition. However I was disappointed to find undisclosed damages including dirty pockets with a ton of shredded paper in them. Also one of the buttons to the removable hood was not on the hood. I will have to fix myself or take to a seamstress.","title":"undisclosed damages, final sale","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Brenda Ford","text":"The shoes I ordered had the whole front sole of the tennis shoe loose. They were in general in bad condition. I am returning these shoes 4\/2\/2022 and expect a full refund.","title":"The shoes I ordered had the whole front…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"online customer","text":"Products were fine...but disappointed in the lack of supportive packaging in the oversized box that my Prada bag was sent in. There wasn't any packing around the purse that prevented it from sliding around in the large box. Either use the appropriate sized box or add extra packing around the item so it doesn't slide around and get MORE damaged in shipping.","title":"Poor packaging","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"customer CCS","text":"So far, my first time using the real real hasn’t been Positive.  I received my sweater & it was damaged.  Someone had clipped off the care instructions tags & in doing so, they cut a hood in the sweater.  I reached out to TTR saying other than the hole I liked the sweater & I cld have it hemmed but asked for a partial refund.  They just responded to me & said the sweater I ordered in Final Sale, no returns & would I like a $10 credit for a next purchase.  Firstly I didn’t ask for a refund, or a credit, I asked for a partial refund for this particular transaction.  And just today I found another hole (also like the first not disclosed in the description).  If TRR doesn’t settle this transaction properly, I don’t want to be a return customer.  I never even used my $25 off $50 purchase welcome offer before it expired.  I’m going to share all this with them & see how they handle it.  But buyers beware…personally I know these are used clothes, but if damage is not disclosed there should be better consumer protection.  It should be up to the buyer to make the educated\/informed to buy a damaged good.  Not get a damaged good & then be asked to come back to spend more money on another item as a solution to remedy the first wrong.","title":"So far, no so good…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Susan Bringardner","text":"The John Hardy bracelet was described as having blue sapphires which is why I purchased it.The sapphires are completely black so they don't go with my other sapphire jewelry. It's not returnable but it was misrepresented. Very disappointing.","title":"John Hardy bracelet a disappointment","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"customer","text":"They sent me the wrong item and then wanted me to pay for the shipping","title":"They sent me the wrong item and then…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Iris","text":"While I enjoy perusing the website ,I found the jewelry piece I was shopping for. However , I was sent the wrong size bangle bracelet .\n\nI called customer service the next day. The advisor said I would hear back in 24-48 hrs from someone.\nStill no word. I would like to return item but don't have an MRA.","title":"While I enjoy perusing the website ,I…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"customer","text":"SIZING ISSUE but great condition. Leather is in great shape and the shoes are well taken care of. Dropped star count because they are comically undersized. I typically wear an 8 but ordered an 8.5 to be sure of comfort however I can hardly fit them on my feet. Feel like a size 7. Would have appreciated better guidance around fit. Will have to re-sell.","title":"SIZING ISSUE but great condition","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"customer","text":"My order was never delivered. It has been Missing for nearly a month now and The RealReal refuses to give me a refund. I have repeatedly reached out and keep getting the runaround. This is between TheRealReal and UPS. Why are you still holding my money!?","title":"My order was never delivered","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"customer","text":"Take too long to received an items.  Quotation too low","title":"Customer services","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=48&stars=1&stars=2&stars=3"}]