[{"date":"2022-05-03","author":"customer","text":"The last couple of items were dirty or damaged. The QC is an issue.","title":"The last couple of items were dirty or…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"BMS","text":"Canceled order. Second order, shoe size was not as advertised.","title":"Canceled order + wrong size","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Grace","text":"I am so disappointed with the RealReal to say the least. I thought I was buying a black Hermès leather bangle bracelet (according to the listing). But, it wasn’t the case. Instead, I got a dark blue leather bracelet. I can’t even return or exchange it for something else ‘cause it’s a final sale. The RealReal, did y’all do this intentionally? Selling items that are falsely advertised, knowing very well that the customer won’t be able to return it? You just lost a customer right there.","title":"Misleading Listing Description 👎","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"customer","text":"My account was charged for a Chanel purse I wanted and the purse wasn't completed as sold. I had to call TRR 5 different times to finally be reimbursed for the $3,800 and the purse was left for sale in the open market.  I asked multiple times for a coupon code since I was charged and still lost the bag. I would have still been charged the $3,800 if I didn't call multiple times.","title":"Charged for purse that I didn't receive","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Deborah Obendorf","text":"I love the designers and choices Real Real offers.  I have repeatedly ordered a specific size with an expectation based on the advertised description.  The item delivered is not the advertised size ordered. In 2 of these cases the items were non refundable and the information was not revealed in the cart when I checked out.  Please fix this, I would like to purchase and order from you without disappointment or undue expense that won’t be reimbursed. Thank you.","title":"I love the designers and choices Real…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Clare Barry","text":"I am disappointed. I have not yet received my package and UPS is difficult to deal with. Their website is not accepting payments for customs owing and there is no way to communicate with a real person there.  All I get are mechanized responses. I need help to receive my package.","title":"I am disappointed","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"customer","text":"I will never order from here again the purse I ordered was extremely dirty and sanitary, and absolute trash  , do not buy from here it’s a scam","title":"I will never order from here again","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"customer","text":"The item I got was in great condition for the price I paid and ended up fitting extremely well, but it was more out of luck that it did. The sizing listed wasn't in standard sizing, but just so happened to still be a good fit for me (anyone who was an 11 in Viberg normally, would have found them MUCH too small) and the photos really didn't convey the true condition of the boots. The description was also incredibly lacking in any details about the boots that would help identify them to most serious collectors of this type of footwear.\n\nI'm very happy with the results, but it was in spite of the listing, not because of it.","title":"Pure luck","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"customer","text":"I ordered a $75 tie, it was some sort of child’s tie for people who don’t know how to tie a tie and it was mentioned nowhere on the description. Product was not even close to description","title":"I ordered a tie","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Cate","text":"I cannot return the items that don’t fit and arrived in an absolute wrinkled mess. It did not say when checking out you cannot return discounted items. Very disappointing.","title":"I cannot return the items that don’t…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Gail","text":"I'm quite surprised that there was no attempt to dust off the bag or to shake that sand and crumbs out.  I wasn't expecting a deep clean, but this was surprising to me. The bag was otherwise as described.","title":"Black Mulberry Bayswater","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"customer","text":"Awful customer service. Super unhelpful, which is unexpected for a business that deals with high priced and valuable items. One tiny mistake on my end resulted in over 2 weeks of wasting time trying to contact and resolve the issue with them. Never shopping here again for the headache it caused me.","title":"Awful customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Jane Balcerek","text":"I ordered a Burberry scarf. I thought it was black plaid, but it’s blue. No color was stated in the description. I wouldn’t have bought blue. I paid for a gift box that did not come with it. I sent an email to customer service, and received an automated response that i might get an answer back in 2 weeks. This is a gift, and for that amount of money i shouldn’t have to wait 2 weeks for response. I don’t think I’ll do business with them again.","title":"I ordered a Burberry scarf","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"customer","text":"The site experience was good, but the product was in worse shape than what was shown. I was disappointed to see the fraying and stains on the purse; I would not have purchased if the flaws were more visible.","title":"The site experience was good","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"customer","text":"The size of the shirts were a joke I'm trying to figure out how to get my money back","title":"The size of the shirts were a joke I'm…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"customer","text":"I received an incorrect order and I am having a lot of trouble contacting them. I like buying from them because there is good selection but their return policy is not great, and I have received a few items that aren't as described but also aren't returnable (there should be an exception if it's not as described).","title":"Occasional Quality Issues","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"customer","text":"Took them 6 weeks to answer and quite frankly the tone and manner were very flippant and not helpful.","title":"Customers last","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Marvin Gross","text":"Item very wrinkled. Additionally it has a very odd seam that may require it to be returned. Everything considered not real thrilled to be giving it as a gift.","title":"Item very wrinkled","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"customermelissa","text":"Worst place to buy they don't give u what u buy them they don't sen ur percel  I way robbery","title":"Worst place to buy they don't give u…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Customer","text":"The bag I purchased smells like mildew\/mold and I paid $1075 for it. Waiting for response from Real Real so I’m hoping this rating improves.","title":"The bag I purchased smells like…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=8&stars=1&stars=2&stars=3"}]