[{"date":"2022-02-03","author":"Sarah","text":"Don't misunderstand, their shipping is great. I got my items in record time and they were fantastic. But selling to them is a nightmare. No one responds. I have tried to contact a few different people who have reached out to me to sell but when I have questions they don't respond. If you try to contact their direct customer service, they don't respond.","title":"Definitely buy from them, selling is questionable.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"customer","text":"The bag I received is not in “pristine” condition, such a let down","title":"The bag I received is not in “pristine”…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"customer","text":"The fact that RR makes it very difficult to return an item (because we loose a lot of money by returning something), is a bad thing, because we have to be 100% sure about placing an order completely without expecting a need to return it","title":"Returns are too difficult","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"NO NAME","text":"Absolutely under no circumstances trust or buy from this company I’m warning anyone thinking about purchasing from Australia. They use UPS which are absolutely hopeless. I have a disability so when I know a package is coming I sit down stairs in the lounge which is next to the front door. \n7pm at night I finally have in and assumed it wasn’t being delivered that day refreshes the delivery website and it said delivered. I went outside and looked everywhere and nothing. No one had knocked and I hadn’t signed for anything. I rang UPS (don’t use them terrible customer service) they couldn’t have cared less they said it was showing as delivered and I asked how it has to be signed for they said the driver signs now because of covid. So the package has either been delivered to the wrong address or the drivers can see where these packages are coming from sign for them and keep them. \nSo o contacted the real real they weren’t Interested and kept sending me emails saying it says delivered and signed for I said I hadn’t signed for anything and they didn’t care in the slightest. So my money for the handbag I purchased is just gone.  \nBE WARNED DO NOT BUY FROM THEM IF SOMETHING GOES WRONG THEY ABSOLUTELY DO NOT CARE.","title":"BE WARNED DO NOT BUY FROM THEM.","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"customer","text":"This was a gift for my daughter. The picture on the model is apparently photoshopped and didn’t show the actual size of the handle. In reality the handle was too short to comfortably wear the bag on one’s shoulder. I wish I had known that since it is not returnable.","title":"This was a gift for my daughter","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"Richard Quinones","text":"Hello, I purchase these shoe and they are to big on me because of so much wear, now I find out that there not returnable NOT HAPPY !","title":"SHOE ARE NOT RETURNABLE NOT HAPPY.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"Kirstyn","text":"Description said minor wear leaving out the scratches on the purse in 2 places and purse was not cleaned out at all found gum wrappers and change in the purse amongst crumbs and such, otherwise after cleaning its in fair condition. Expected better from the many great reviews however not dissatisfied!","title":"Description said minor wear leaving out…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"Gail Stanger","text":"I ordered the Gucci sweater that stated “one size fits all.”  It arrived marked as a medium \nand I ware a large.  Rather disappointed.","title":"I ordered the Gucci sweater that stated…","stars":3,"location":"MX","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"A.L.","text":"HORRENDOUS SELLING EXPERIENCE - They lie and bait and switch you on commission payments. DO NOT SELL THROUGH THEM.\n\nThey promised me 70% commissions, confirmed in writing. My items started selling (without my approval, mind you) and then they refused to respond to me over email, call, or text. Good luck getting a hold of anyone.\n\nThey also are holding over $5,000 of items hostage - it has been over a month and they haven't sent these items back, replied about them, or provided any update or expected timeline.","title":"HORRENDOUS SELLING EXPERIENCE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"customer","text":"Terrible customer service","title":"Terrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"Liz","text":"Was sold as a medium when it is a small want my money back","title":"Was sold as a medium when it is a small…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"customer","text":"Tie came just rumpled in a bag. Needs much better packaging.","title":"Tie came just rumpled in a bag","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"Allison","text":"The shoe sizes were completely off. The blue heels were closer to a size 7. The dress size was very much a small. And the return policy is AWFUL. We pay $12 to have them shipped and to return items, also $12. And you guys can't even include a shipping label, the customer has to print it which I'm sure most people don't own a printer and on top of that it must go through UPS. So trying out this company has cost me $25 and about an hour of my time to head to UPS to ship back products which were completey mis marketed.","title":"Mismarketed and Costly Shipping Policy","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"Stacy","text":"The handbag I purchased said ‘extremely good’ condition. When I received it, there were small holes in the leather and something brown and sticky spilled on the inside and all over the zipper tracks. I’d be embarrassed to carry this bag in public.  Be very careful of the quality they claim. I can’t imagine what ‘good’ or ‘fair’ condition would entail.","title":"Visibly second hand quality","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"Sean","text":"Told me my item will be listed within 4 weeks. They received it almost 7 weeks ago and it still hasn’t been listed!","title":"Poor Communication","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"customer","text":"Pictures of the handbags didn’t show how dirty it was from the inside. Also bag was way bigger than shown in pictures. Unfortunately, it is non refundable.","title":"Very disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"customer","text":"Item was overpriced for condition. Had I seen either in person I would not have purchased. Extremely faded and worn.","title":"Item was overpriced for condition","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"customer","text":"DESCRIPTION OF BAG INCONSISTANT WITH ACTUAL.  CONDITION POOR.","title":"DESCRIPTION OF BAG INCONSISTANT WITH…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"Abby","text":"Where is the follow-up???--I sent an email  yesterday , now awaiting the customer care agent's response--no response--I want to start the return since it is NOT an adult item as per description  but I want to be assured I'm not collecting extra charges and I want a conversation with a human--NOW","title":"Where is the follow-up ?Where is the care???","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"customer","text":"With no way to try on clothes, you are forced to blindly purchase clothes. I was okay with this since there is a refund policy, however upon trying to make a return, I found that I would only be receiving about 70% back. I bought a suit for ~$74 and with taxes and shipping came out to $110. When I tried to make a return I only receive $65. They made $45 off of me and get to keep the product. I will never be purchasing from the RealReal ever again","title":"Scam","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=99&stars=1&stars=2&stars=3"}]