[{"date":"2022-03-29","author":" Biddle-newberry","text":"I purchased an item that was final sale.  I don’t have a problem knowing that if an item doesn’t fit it is your loss but this item was in such poor condition it should not have even been sold period, I was surprised to see that it was. It will be a donation for me as the quality is so poor I cant even sell it at a local consignment shop. \nMy other 2 items were great.","title":"I purchased an item that was final…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Jay","text":"Shipping was timely and the website operates well. The merchandise I received was filthy and had rips and stains.","title":"Filthy, worn product","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"Completely misleading photos, DO NOT forget to check the measurements. Bought a bag that I now have to pay for it until it sells on consignment.","title":"Completely misleading photos","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"For the second time that a shipment or a partial shipment never arrived and I was was charged. I had to go thru the trouble to call customer service a few times to track the package and finally get a refund as the package can not be located......","title":"For the second time that a shipment or…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Customer","text":"They sent the wrong item, and still charged me for shipping. When I contacted them to resolve the issue, they quickly ended my chat session before the issue was resolved. The process to get the correct refund is time-consuming, and in the end, I will not receive the correct item, and the mistake that was made by The Real Real will cost me money in the end.","title":"They sent the wrong item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"Website doesn’t work.\n For ordering or pulling up order history. Doesn’t apply discount REAL, and your agents don’t reply about my concern for an entire week!","title":"Website doesn’t work.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"The shipping was expensive, but I wouldn’t have minded that if the item shipped faster. Also, I had to return the pair of sneakers I bought because they were listed as a size 12, but when they arrived, they were actually a size 10. I returned them immediately.","title":"Inaccurate item description","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"Pictures misleading, order no longer exists on website when I try to view.","title":"Pictures misleading","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"JT","text":"The bag is great! Wife loves it.\nThe packaging NOT so great. Need a better box that can endure being tossed here and there. Box was damaged. I received many packages, boxes that’s, thought of to protect the contents, arriving at our home as if came from next door, when really came hundreds of miles away.\nI have pic","title":"The bag is great\/ packaging, NOT SO","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"The experience with ordering and delivery was great but the purse I ordered had a spot on the front that wasn’t mentioned in the description or visible in the photo, but the red dot stands out incredibly in person. Very disappointed as it was a gift for my best friend and I have to resell it. Was excited but probably won’t buy from TheRealReal again.","title":"I feel deceived.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"terrible customer service","title":"terrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Steven Morales","text":"Size of item was advertised wrong beware had to send back and still waiting fir refund and hopefully I will not be charged postage as the item was listed XXL and was definitely not , bate and switch , fake advertising","title":"Size of item was advertised wrong beware","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"The shoe size was not accurate - need to show both European sizes and American. Delivery took too long. When sizes are not accurate it should be possible to get a full refund with no processing fee.","title":"The shoe size was not accurate","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"there is no buyer support number","title":"there is no buyer support number","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Lindsey","text":"The condition of the purse I bought said it was excellent with no signs on wear. There is definitely signs of wear on the handle and the bottom corners of the purse.","title":"Condition not what I expected","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"I purchased some ties and was a little disappointed at the listing quality and what was delivered. I ordered several ties in excellent condition and that was not the condition they arrived in. I sent back two of them. The piece on the back of the tie where you tuck in the tail was either ripped or completely missing, making the tie not wearable.","title":"I purchased some ties and was a little…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"Stopped responding after a couple emails and didn’t resolve the issue at all. I want my money back.","title":"Stopped responding after a couple…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Jackson","text":"I dropped off a consignment at your Palo Alto store on March 14th and wasn't provided a receipt OR an email after my visit with proof of acceptance until AFTER I called to specifically request one. Thank God I took a picture of the man who accepted my consignment because I don't trust this process at all. Still to this day (now March 29th) I have no idea what process my consignment is in or where it is located. I feel like I've made a huge mistake selling with the Real Reall. Should have stayed with selling on Poshmark or Offerup.","title":"I dropped off a consignment at your…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"customer","text":"I sent it in your service has gone downhill","title":"I sent it in your service has gone…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Jen","text":"Didn't charge me in the correct currency, item did not match the item description. They refused to refund or return only offered a tiny credit.","title":"Terrible customer service","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=51&stars=1&stars=2&stars=3"}]