[{"date":"2022-02-27","author":"JNF","text":"I placed an order two weeks ago and still haven't received it or received any answers to why from customer service. The tell me they will get back to me within 48 hours but never do. I've placed 7 orders on the real real and out of that 7, 3 have been canceled and 1 not getting shipped out.","title":"Customer service is lacking","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"customer","text":"The strap is really worn but there was no mention of it in the description. P","title":"The strap is really worn but there was…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"Darcell Carter","text":"I was sadly disappointed.","title":"I was sadly disappointed.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"customer","text":"I don't think it's correct that when a return is made they only return half the cost of what originates payment","title":"I don't think it's correct that when a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"customer","text":"I haven’t revived my package","title":"I haven’t revived my package","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"Marija","text":"Pictures need to be more detailed of the defects in the items. I have purchased something in a “very good condition” but it was in less then ok condition. \nAlso, sizing on the model is there for a reason, but it is not accurate at all.","title":"Needs more details in the pictures","stars":2,"location":"RS","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"yoko","text":"Delivery was so quick and products purchased were just beautiful. I am happy about it!  However, it is not convincing that I have to pay same amount of tax for each iteam purchased as the price very varies.","title":"Delivery was so quick and products…","stars":3,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"customer","text":"I received the wrong order, and when I inquired, I never received a response","title":"Poor Customer Service","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"Teresa","text":"The RealReal SOHO “lost” 12 of the 13 consignment items I gave them. I brought them to the store on October 19. It took until mid December for them to own up that my items were gone. It’s now the beginning of March & I’m still not totally repaid. The work I put into getting restitution was heroic. The amount I received was abysmal. NEVER EVER again with TRR. I’ll shout it from the rooftops & post it on Yelp.","title":"SELLER BEWARE of TRR","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"customer","text":"I was sent the wrong item. I was offered a return but would be out $48 shipping to Canada as well as $20 in duties. They also want to take off $11 and change off the purchase price for the return despite it being their mistake. I have tried writing and calling to deal with this issue and have them rectify it, but I have been unable to get a response","title":"I was sent the wrong item","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"Joey Emanuel","text":"the glasses were crooked and are they are not authentic Dior they lied and also had the Gull the Real REal to lie to me and tell me no refunds or returns so if you get something from here be weary and look at the videos where they were on the news selling fakes and didnt really authenticate anything no guarantees but they sure take your money fast.","title":"the glasses were crooked and are they…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"B. Chau","text":"A blouse was missing from the order and the packing slip said it was in the box with the rest of the order. It wasn’t. Customer service is looking into it. Pray for me 😄","title":"A blouse was missing from the order and…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"customer","text":"The necklace is broken now. It gives me a doubt whether I will buy again","title":"The necklace is broken now","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"K from Virginia","text":"Good item, poor packaging. My item came mostly as described. The box was in rough shape but the item was untouched. The tape on the bottom of the box was 95% on the right side and barely touching the left. The item had no holes or stains but had such a horrible odor. I washed it twice and had to leave it out for a week to air out.","title":"Good item, poor packing","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"customer annoyed with shipping","text":"Shipping charges are outrageous!!\nNot only is not free, but it’s more expensive than most other sites that’ charge shipping IF you spend under a certain amount. \nWhy don’t you give the option to ship from your warehouse to a store to pick up.  For free like almost every other retailer.  The limited amount of in store pickup only if the store happens to have isn’t enough.  You should offer to ship all merch to the store for free.  Better carbon footprint too which TRR is so quick to point out in other facets of the business.","title":"Shipping charges are outrageous!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"Ms. SHEILA DONNELLY THEROUX","text":"Nothing has arrived. TRR has products listed that they do not have in inventory","title":"Nothing has arrived","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"customer","text":"I got some shoes and a jacket. The shoes were great, but the jacket I purchased was labeled as a 3XL but was somewhere near a mens medium, so nothing like what I was expecting. This wouldn’t be a problem if there wasn’t a $10 return fee, but now I’m down 10 bucks with no jacket.","title":"Mislabeled product","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"customer","text":"I ordered two items and both were sent to me in the wrong size. Unfortunately customer service did not help me, nor acknowledge their mistake. I was really looking forward to both items! Shipped very fast though.","title":"I ordered two items and both were sent…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"customer","text":"The purse I received was not in the connection it was marked as. And it had a funny odor. I feel like transparency is key to securing customer loyalty.","title":"The purse I received was not in the…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-03-01","author":"customer","text":"From the beginning my experience has been a complete disappointment. I was told that you sold certain items and was encouraged to send them to only have them denied because you do not sell them. It took weeks to finally get them returned to me. I sent in a $3k in retail value RL Purple Label Tuxedo with the tags on it for you to separate it, Mia label the items as a blazer and dress pants, and sell it off for a fraction of the value. I was told by someone on the phone and in email that you would supplement the amount owed to me to compensate for the error but I never have received these funds after the blazer sold. When it was returned you had an opportunity to pair the tuxedo as it should be but instead you sold the jacket again while the pants remain marked as “accepted” looking like there is no intention to try and sell them. The entire experience has me never wanting to consign or purchase from your platform.","title":"Extremely disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=80&stars=1&stars=2&stars=3"}]