[{"date":"2022-05-02","author":"Tylie Jones","text":"As a consigner I would appreciate the app being easier to use. When asked for price approval, at the “my sales” button on the app, it should list those items needing verification. And make it easy to sign off.\nOf course I’d like to see pricing higher, particularly at the very beginning of a listing. Quite a few of my items with tags got bought in first couple of days. Maybe list this kind of item for a few days before lowering the price?","title":"As a consigner, app not easy, prices low","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"The items came exactly as described, but I'm really disappointed in how they shipped these items. \n\nI had close to $300 in designer items being shipped, yet they did not require a signature to receive the package, which I would have preferred. I was not able to be home when they delivered and it was pouring rain. Luckily, I was able to find a friend to bring the package inside for me. When I opened the package, the items were wrapped in a thin fabric cover. I had a $200 leather handbag that would have been DESTROYED had it been left outside any longer. They should not only require signatures for their packages since they're dealing with high end, expensive items, but they should also be packaged better to withstand any elements they might encounter. \n\nAdditionally, they need to have more photos of their handbags online. I was surprised that there was a thick mesh shoulder strap on the bag I ordered. This was not in the description or in any of the photos.","title":"Terrible Shipping Practices","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"I got the wrong brand. I paid for and ordered Hatch, and received “Hutch”.","title":"I got the wrong brand.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"My order shipped very quickly however it is clear that the inspection process is not very thorough because this dress had actually food debris on it in multiple places. I understand age and wear is a given with used items, but food dirt is unsanitary and pretty disappointing.","title":"My order shipped very quickly however…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"Sent wrong item.","title":"Sent wrong item.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Robin Brinn","text":"I have been consigning with the RR for a number of years. I have found them to be increasingly disappointing. Item photography and description is often poor and inaccurate, prices and payoffs have gotten much lower and percentages for consignors have decreased. Hold times to reach customer service are often extremely long.","title":"Disappointing Consignor Experience","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Liv Leopold","text":"I dropped off 2 designer shoes by a well known Italian shoe designer.  They had protective soles added to bottoms. They were in really good used condition, no flaws . The counter person at store accepts them and sent them to authentication center. A couple days later I get a UPS shipment notification with the return tracking #. No explanation note, no feedback at all.  Really not happy with the experience. I will continue to sell my items myself on eBay, for better results !","title":"You could do better selling items yourself …","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Cheryl","text":"I was thrilled to see the shiny dark green Maria la Rosa socks I'd wanted for a long time available on The Real Real website.\n\nUnfortunately, when the socks arrived they were definitely NOT the dark color that was pictured on the website.\nThey are a light, pale green.\nStill pretty, but not what I paid for.\n\nTo add to my disappointment, there was a note inside the package that said the never-worn socks were not eligible for return, although there was a return slip in the box.\nTHAT BIT OF INFORMATION WAS NEVER MENTIONED ON THE WEBSITE..\n\nI have to keep the socks even though they are most clearly the wrong color.\nI cannot recommend The Real Real to anyone I care about.\nSorry.","title":"BOO!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Keri Kearns","text":"Just ok, you earn more on Poshmark but the real real is more convenient.  The real real says they excel at customer service but it's really just an excuse for them to harass you with texts, emails and even the occasional phone call.","title":"Just ok","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"AD","text":"I ordered a few items and the way shoes were shipped is careless. Wedge shoes in a bag? In addition the condition of the shoe is not as described. One of the dresses I ordered ha stitches popped in the underarm area and the Chanel sweater had been laundered so the bottom is twisted. It’s a dry clean only. The description you post are not necessarily accurate or in accordance with the condition of the received. I would like to be contacted. I wrote you you on Friday May 29, 2022 and have not received any response.","title":"Not as described","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"customer","text":"The product sold was not as described","title":"The product sold was not as described","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Jen","text":"My$800 package never arrived.","title":"My$800 package never arrived.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Chealzea Pasion","text":"Received my item with a security tag still on the garment. Had to cut a whole in my $118 dollar shirt to remove the security tag.","title":"Received my item with a security tag…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Marta Reis Joaquim","text":"Sincerely, you are perfect for selling, and your customer service used to be excellent, but now I'm feeling ignored since I tried to cancel a purchase because I knew it wouldn't fit me well. I was told that it would be impossible to cancel my order on   the same day as my purchase, this is not my first time buying from you; it was possible to cancel before. I respected the new rules, and I paid the import fee to receive the merchandise to start returning it. It did not come with the return label inside the box n the receipt. I began the process on The Real Real app, and I received an email telling me that I could print the return label, but the link was broken, and it did not open, only redirected me to the Canada unit. When I complained about asking for help, I I felt ignored, and the sensation was that you were forcing me to stay with an item that didn't fit me and asking me. To wait for a week or so to have someone to assist me. I'm a customer of yours, and I would like to have the attention that I'm sure I deserve. I might have bought little things but I have been loyal and I always recommend your store to my friends. The dress doesn't fit me but the pants is amazing. I was thinking about Dior pants similar to that that I bought but I'm so insecure about trading with you now.","title":"Customer service","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"customer","text":"I’ve never had an issue with TRR so far and I love there format and ease of buying as well as selection, but I order a denim jacket that said it was a Large on the site. But when I received it, it was an Extra Large (XL) which was quite a bit disappointing. I wish a picture of the tag\/size was posted on the site so these hiccups did not happen. Especially with shoes. Can’t tell you how many dress shoes I’ve looked at but rather than a D width they’re EEE width. But still listed only with size (length) and not width.","title":"Website miss labeled actual size","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Henderson","text":"The price is usually always good but the shipping is ridiculous and you are limited to express shipping. When you add on that and then the extra costs it can be, and often is, half the cost of the items themselves. It turns out to be expensive.","title":"The price is usually always good but…","stars":3,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Gigi Ajavon","text":"I will never buy from them again. Returning stuff is such a headache. I thought their “store” in DC would have items for me to try on to determine my size but it’s just an office.","title":"I will never buy from them again","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Paul toussaint","text":"There is absolutely no customer service or care. \nYou lost my items,  you under priced my items, you also had the wrong address to ship my items back. You can’t talk to a live person on the phone,  you sales team\nDon’t call you back.  Should I say more?","title":"There is absolutely no customer service…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Verified customer","text":"Not only have I NOT received the correct dress, for which I paid overnight shipping to have arrive over A WEEK ago, but it is a NIGHTMARE trying to actually get any customer service. The only options were to either waiting on the app (a joke—they always managed to message me “back” at 4am, 12 hours after I requested assistance), or via text (waited 10 hrs multiple times only to be told there’s nothing they could do but wait for the warehouse to find the dress). I will NEVER be using your site again. Not only that, but I’m filing fraudulent charges with my credit card. What an absolute joke.","title":"Do not use this site—nonexistent customer service, possible fraud","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"customer","text":"The item description only talked about missing strap and interior discoloration. There was no mention of loose threads coming off. This thread holds the zipper with the bag and is falling apart. Given that bags are non returnable, and high delivery charges, need better detailed item descriptions, especially of all the flaws that would make the bag non usable!","title":"Loose threads holding the zipper, damaged bag","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=9&stars=1&stars=2&stars=3"}]