[{"date":"2022-04-20","author":"Edward pierce","text":"I was satisfied with my purchases.  Just took a while to get them. I did have a little stain on one shirt","title":"I was satisfied with my purchases","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"Joe G","text":"One of the purses I got for my wife is damage, we can even exchange it because has the tag that said is final sales and all that. You guys were supposed to check that all items are functional and great shape, but apparently you guys just check pictures and ship the tags and the customer has to deal with damage items at the end","title":"One of the purses I got for my wife is…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"Andrew","text":"I was told by text customer service I’d get free return of product that I had serious buyers remorse on. The same product could be purchased new for less money than the almost new one I got from you guys…. So then when it arrived it said it was a final sale and not returnable. So I texted customer service again and they had to make a custom UPS label. Now that you guys have had the product returned and it’s in your possession… it’s gonna take 7-10 biz days for a return?? Unacceptable.","title":"Disappointed in seller\/item over priced. Customer service set wrong expectations.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"customer","text":"I got the wrong dress and have emailed customer service twice. The dress is a non-return item and I’m pretty frustrated. The dress is completely wrong and I don’t like it\/don’t want to keep it. I’d like to be refunded. Nobody has gotten back to me in weeks.","title":"I got the wrong dress and have emailed…wr","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"customer","text":"This is the worst online shopping experience I’ve ever had. It was my fault for putting my old address, but I recognized my mistake within 5 minutes of placing the order. When I went to view my order, it said to email real real support for help- which I immediately did. I then got an email the next day saying my order has shipped- but I had not gotten a response customer service. I immediately called the shipping company and they said they had no actually received the shipment yet, and the the real real has full access to change the shipping address. I then contacted the real real via chat- and the person told there was nothing he could do- even though the shipping company said your company has the ability to change it. When I explained this to the rep- he said he couldn’t do anything but cancel my order and have it shipped back to the warehouse house- then I would have to rebuy the items once they are re listed on the real real. I contacted an event a second time and she said she would have the items reshipped to me. But no tracking has been updated and it’s been a week. This is the worst system I’ve ever experienced and I am very I likely to use the real real again or recommend it to anyone.","title":"worst online shopping","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"customerJulia","text":"I ordered a box of never used Cartier stationery, labeled pristine. It all smells like mildew.","title":"I ordered a box of never used Cartier…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"customer","text":"Very difficult to return a product.","title":"Very difficult to return a product.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"customer","text":"This product was not as described. The zipper was completely tarnished and very difficult to open. The leather on the tag is so worn no words are legible. I contacted customer service for help and did not receive a response. I will think twice before ordering from this website again.","title":"This product was not as described","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"customer","text":"Definitely more wear to the interior of the bag than was described.","title":"Condition not as described","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Grizzgirl","text":"U charge too much for shipping","title":"U charge too much for shipping","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"customer","text":"The refund for a return is a financial bloodbath .","title":"The refund for a return is a financial…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Woman","text":"I was content with my first purchase. For my second purchase it was over 1thousand dollars the item was listed with signs of wear but it arrived with staining that was not listed. Damage that was not disclosed.:\/ it was disappointing. Packaging needs more effort in securing the product inside. Not sure if I will give it another try… pictures are edited as to not depict the true condition of the product.","title":"Disappointed, unsatisfied","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Good service anyone?","text":"I was sent a sweater which was marked in \"very good\" condition with a large hole.  The other sweater I ordered was lovely.  I was sent the wrong pants.  I had to take the time out of my day to sent the sweater with the hole and wrong pants back to the RealReal and I have yet to hear about the original pants that I ordered.  They keep telling me it has been \"escalated\".  What does that mean?  After a significant amount of my time devoted to this awful service and total lack of follow up I am completely unsatisfied by this order\/company.","title":"Will be very reluctant to use this company again","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Gail","text":"I ordered shoes and a small purse. I measured my cellphone to make sure that the bag’s measurements provided by TRR were sufficient to put me my cellular in the bag. I did not see that it was final sale. The shoes I knew were final sale. \nSo, when the items arrived, the shoes were a tad too small and my left foot wouldn’t go in due to my very high arch. Fine, I could consign them.\nThe purse was a different matter. The measurements were not accurate and my cell phone didn’t fit in any way shape or form. And then I found out that it was final sale. \nWhen I called to consign the items, Chloe accepted the shoes but wouldn’t take the purse due to TRR not accepting that brand this month. \nWhat???? I had just bought it 2 days before. \nVery unsatisfactory and Chloe was not helpful at all. I will definitely think twice before using TRR again to buy anything","title":"Bad bad bad experience","stars":1,"location":"CO","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"customer","text":"Item arrived with store security tag attached. Was also noted as being in excellent condition with no visible signs of wear, however was delivered with a massive stain on the hem. \n\nHonestly disappointed to say the least.","title":"Item arrived with store security tag…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Christina","text":"I text and emailed for help last week, but no one is getting back with me?  Used chat, the agent can't help me either.","title":"I text and emailed for help last week","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Not a happy shopper","text":"None of the clothes I received were accurate in their description. Especially the sizes. The larges were smaller than explained.One dress has studs missing off it. And of course it was all promo sales. So I spent $108.00 on clothes that don't fit and can't be returned for a refund. Will never shop here again.","title":"Terrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"customer","text":"Sells fakes lol","title":"Sells fakes lol","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Robert Simek","text":"No communication and order sent back it appears\n\nThank you \nRob \n905-929-1000","title":"No communication and order sent back it…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Confused and Disappointed.","text":"Dear the RealReal:\n\n1.  I consigned a lot of clothes and the ones you were supposed to return to me were stolen in your shipping room (replaced with a hideous pillow.) This took way too long (more than a month) to unravel and no explanation was ever given. Thankfully after repeated requests you paid me for my lost clothes.\n\n2. I returned a pair of shoes which you received and have relisted.  However, you have still not returned my money.\n\n3.  It is literally IMPOSSIBLE to communicate with you via chat, text, or phone.\n\n4.  Your virtual assistant does not even recognize my order number?\n\n5.  After starting a virtual chat, you find out you are not talking to a person and one will get back with you when they are (good and) ready...not when the customer is already waiting (just go about your day is the message you receive ????)\n\n6.  I love the RealReal...consigning and purchasing, but this is getting to be too much.  What is going on?","title":"What is going on?","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=23&stars=1&stars=2&stars=3"}]