[{"date":"2022-04-13","author":"customer","text":"I was sent the wrong size item and have not gotten a response after reaching out to customer service twice.","title":"I was sent the wrong size item and have…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Lili","text":"Metal damage ☹️","title":"Metal damage ☹️","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"customer","text":"I was disappointed with my first experience at TheRealReal. I bought a pair of shoes with elastic backs. The elastic was completely stretched out and starting to fray. Perhaps the brand was authenticated but the condition was not properly stated.","title":"Disappointing first purchase","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Customer in Cambridge, MA","text":"One dress I got was labeled as large but it was a 6. Which is a small. Another was unbelievably ratty and the quality listed on the site did not match the quality of the dress. I’m unable to return both dresses so I’m trying to sell them elsewhere. There should be a way to report the condition or give a review on each item received as opposed to this single box. That way the item can be associated with the feedback and a review can be done on how it was posted.","title":"One dress I got was labeled as large…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Vanessa Clarke","text":"Fake bag delivered, no response from customer service. Do NOT recommend","title":"Fake bag delivered","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Nikki Galvez","text":"The wallet doesn’t close the magnet has no hold when I put all my cards in. :(","title":"The wallet doesn’t close the magnet has…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"customer","text":"The listing for the item I bought stated that the handbag would come with its box and dust bag. However, I did not receive the original box. Instead, the bag was thrown inside a shipping box without any cushion or padding (the handbag was placed inside a The RealReal dust bag). Also, having to pay for shipping was disappointing, given the item took 2+ weeks to arrive. Based on my initial experience, I unsubscribed from the email list and will not be making another purchase through their site.","title":"The listing for the item I bought…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"customer","text":"Listing said that sunglasses were in Very Good condition. It did note that there were some scratches but did not noted that the scratches were deep and hit directly in the line of sight making one eye useless.","title":"Scratched!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"customer","text":"The products were good but I paid extra for the gift wrapping and the box came destroyed. Not impressed I paid extra money for a box that looked used and broken","title":"The products were good but I paid extra…","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"customer","text":"Terrible. Mislabeled and stained. God awful customer service.","title":"Terrible customer service and products","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"customer","text":"The jacket arrived filthy. There were dried food and stains and oil on many parts. Luckily they came off in the wash, and the jacket is in decent condition, I just assumed that The RealReal wouldn’t sell something that hadn’t been cleaned.","title":"Nice jacket, but very dirty","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"Daniel Jaramillo","text":"I ordered some Tod's size 7 and they sent me about 11 size","title":"I ordered some Tod's size 7 and they…","stars":1,"location":"MX","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"customer","text":"The item that was sent did not match description and customer service representatives did not follow up with the issue","title":"The item that was sent did not match…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"Antje","text":"Sizing chart for non-US clothing is off. Having to pay $12 to return an item that was incorrectly listed in the first place seems poor customer experience.","title":"Sizing chart for non-US clothing is…","stars":2,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"customer","text":"Bag is in good condition but the interior liner is flaking","title":"Bag is in good condition but the…","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"customer","text":"Name plate on purse scratched. Black marker line through designer name inside. RealReal disappointed","title":"RealReal disappointed","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"Pam","text":"I ordered a watch and it did not arrive.","title":"What happened to the watch I ordered?","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"customer","text":"Many bag said it was in excellent condition but it was more like in good condition.  Several scratches on the leather that were no noted on the posting.","title":"Many bag said it was in excellent…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"Bunne Grantham","text":"Unfortunately my order was dropped off at and other door by the UPS driver, so I didn't receive it & can't say how it was, Bunne","title":"Unfortunately my order was dropped off…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"MissMew","text":"I love The Realreal. But the problem is that there are too many mistakes in the item descriptions. Often it is the measurements that are wrong, sometimes by a large amount. This time the dress I bought was listing as having a 100% silk lining. Unfortunately the dress was completely unlined. I was able to return the dress, and The Realreal paid for the shipping label, which I appreciate. But the whole thing could have been avoided in the first place. \nThe other problem is that once I have returned an item I see it listed with exactly the same description and measurements. Nothing has been fixed. This is very troubling and causes a lack of trust with future purchases. I really wish the company would take more care with accurate descriptions and measurements. Plus I have doubts about the authentication process.\nOne more thing - fixing the problem in the chat function takes a really long time. I feel like the worker is juggling a lot of chats at the same time.","title":"Too Many Mistakes","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=32&stars=1&stars=2&stars=3"}]