[{"date":"2022-03-20","author":"Cynthia Storer","text":"Eh. Bought a Tory Burch black dress and a sweater. The dress has two bobby-pins in it to secure the bust line. I would have returned if I noticed before removing the tag. The sweater is very cute.","title":"Eh not great","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Paige Charette","text":"I have purchased from this website and if the items did not fit, easy returns.  HOWEVER, if you purchase a \"Final\" sale and reconsign the item as I did.  The shoe was sold and then returned as mine was Final Sale and as the shoe remains on the website it continues to go down in price.  So in essence, my $95 purchase was posted at $87 the first time it was posted on their website providing me with $24 in monies if sold!  Now it is $70 some which will be $15 or so.  I will never do this again especially since my higher purchase cost of this shoe at $95 was Final Sale.  So in wrapping this up, I was taken almost $100 and have learned to never work with this online consignment again.","title":"I have purchased from this website and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Alexandra","text":"Shipping is too expensive","title":"Shipping is too expensive","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"customer","text":"I twice made appointments and no one ever connected with me or contacted me.","title":"I twice made appointments and no one…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"customer","text":"The shirt was stain and the material bleeded with dye","title":"The shirt was stain and the material…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Andrea","text":"Unfortunately, my purchase didn’t work out. The item I received was not what it was supposed to be. The RealReal helped to solve the problem. Thank you","title":"Unfortunately….","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Customer L","text":"Sent me a dress that was a fake and not even the dress pictured in the listing.it looked nothing like the dress in the listing. Customer service didn’t acknowledge that it was fake and didn’t seem to care when I told them. \n\nAt least they allowed me to print my return label and send it back. Hoping to get a refund in the next few weeks. \n\nThis company can’t be trusted unfortunately. Their “authentication” process is faulty at best. This dress was so clearly fake, I don’t know how it passed their authentication process. Probably because there is no authentication process. Stick to buying from trustworthy department stores or from the brand itself.","title":"Sent me a dress that was a fake and not…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Irene","text":"The bag is not in very good condition. The logo got rusty and the bag is filled with scratches. However, in the description, it writes “Very Good Condition.” Can’t believe I spend thousand dollars to get such bad quality bag. The worst experience ever.","title":"The bag is not in very good condition","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"customer","text":"The item I purchased was in my local post office but you opened up a return request that I did not request at all and now I have to wait for the item to return to you for a refund even though I never requested a refund.","title":"Avoid this company","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Lucy Der-Tawitian","text":"I’ve written five times ! No one is responding to me— I’m just being ignored now. Really frustrating as the fault wasn’t with me. Would really appreciate it if someone gave me value as a loyal customer and right their wrong \nThank you","title":"I’ve written five times","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Mark M.","text":"I bought a pair of Gucci Men's Loafers from RealReal last week. While I have decided to keep them, they are clearly BROWN, and not as described...which was supposed to be BLACK, as pictured in the photo. \n\nAs these were very costly, at more than $240 plus used, I will not be shopping further at The RealReal in the future.","title":"I bought a pair of Gucci Men's Loafers…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"customer","text":"Why is it if I list something with the REALREAL and it sells, but gets returned, I have to pay a 15 dollar fee for them renting my clothes for free?\n\nWhat a stupid policy. If the RealReal is going to allow it, then the REALREAL should take the 15 dollar hit every time.\n\nEspecially when the amount we get in commission from the sale of our items is so small in comparison to what the REALREAL takes!\n\nRidiculous and makes me less likely to list items with you again till you resolve this issue.","title":"Bad policies discourage consigning or leaving items with your company","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Eric","text":"I really liked the items I ordered and decided to keep all of them. Thank goodness I did- they all had giant tags affixed noting that they were final sale. BE CAREFUL when you order- I don’t recall seeing a “final sale” disclosure, though it was probably there, just not displayed very prominently.","title":"Nice items, great prices- light on disclosure","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"vicki","text":"I bought a piece of jewellery from theRealReal for my mother’s 85th birthday.  She likes sapphires so I got a piece with sapphires which looked very impressive in the photos. When it arrived, it was so small as to be almost unrecognizable.  The chain arrived all knotted too, so we could not actually even try it on.  And all this after $65.00 in unexpected tariffs, which were C.O.D. on delivery.  I immediately repackaged and returned the piece which cost an extra $30 for postage with tracking and insurance.  All in all, it cost me $95.00 to simply look at and return a tiny piece of jewellery that did not turn out to look at all like the image in the advertisement","title":"I bought a piece of jewellery from…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"customer","text":"Shipping is extremely expensive and very slow.","title":"Shipping is extremely expensive and…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Mindy L. Aisen","text":"I just received my item: UNSIG26120, a chinchilla jacket with a condition description of \"very good\". There is a split in the fur! I paid $1750 on sale, and it is not returnable! Very upsetting. I have been a realreal customer and consigner for a very long time and I am sooo disappointed. Are you glad you aske?","title":"Chinchilla jacket.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"customer","text":"I sent an email to my rep and also one to customer service with a question about a pair of earring offered for sale and never received a response from either.   I am not interested in buying when you are not interested in answering my questions \nAlso, I have some jewelry that has been listed as \"coming soon\" for some time and has not been priced.  Your process seems to be slow.","title":"I sent an email to my rep and also one…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"daisy seferoglou","text":"If I could put no stars I would.  Horrible is an understatement.  The woman seriously said she’d get back to me by Saturday and here it is Sunday and nothing.  They underprice your goods and price it at 20% off so it will sell fast so you will get literally no commission.  They say it will be up on the site in 2-3 weeks- yeah- try 3 months.  The site is saturated with sh!t so nothing sells and they don’t have a proper marketing or pr team.  No one ever gets back to you.  Like EVER.  It takes them weeks to get a solution.  Never trust them or co-sign with them .  They are incredibly untrustworthy.","title":"Worst customer service I ever encountered!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Ruth Tucker","text":"I have bought 8 items from RealReal. 5 were as advertised. They were in the pristine category with tags. 3 items were very misrepresented. An item marked excellent was in fair condition. An item marked very good, the soles were separated from the shoe. One item, with a top brand name, was of such poor quality it could only be a fake. I give the people that  do the evaluation a 1 star. The company has grown to big to monitor its evaluators.","title":"Beware of authenticators.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Regretful First Timer","text":"The bags had an awful smell. My first purchase and now I have to figure out how to resell since I can’t return. Never will shop here again. Waste of $800.","title":"The bags had an awful smell","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=60&stars=1&stars=2&stars=3"}]