[{"date":"2022-04-15","author":"forget me not","text":"don't like to pay for shipping.  Others sites have free shipping.  One item I received recently has a snag (jacket),  it didn't list the problem.  Disappointed","title":"don't like to pay for shipping","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Jessica Lazewski","text":"The Bag was in good condition, but it was collapsed and had no shape to it. Very disappointing… no matter how much stuff I put in it it had no shape. I only used it once then put it away in the duster bag and put it in my closet. I’d like to sell it back to you.","title":"The Bag was in good condition","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"customer","text":"100% not Tiffany!! I bought a Tiffany & Co Champagne flute and it’s clearly stamped Riedel on the base and had a Tiffany sticker on it unlike any Tiffany stemware I have ever bought or seen. I even showed it to my Tiffany sales rep and she agreed. I submitted a ticket to them and was only Told to context them from an email address that I had under my account, so I did. It’s been another week and I’ve heard nothing back. This was the first and last purchase I have or will make from the Real Real.","title":"100% not Tiffany!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"customer","text":"Extremely disappointed in my purchase. Size was not as stated and garment had a stain.","title":"Extremely disappointed in my purchase","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"customer","text":"I’m having a very difficult time getting a pick up and communicating with the drivers etc. the number on the emails is not a working number.","title":"I’m having a very difficult time…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"customer","text":"The item came very quickly, but I purchased a gift box that didn’t arrive and it took a few days for customer service to get back to me just to acknowledge my message and my issue still hasn’t been resolved almost a week later","title":"no gift box","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Jeni","text":"The description of my Tom Ford sunnies said they were excellent. Huge long scratch on the lens and the arm was practically falling off. Crap.","title":"The description of my Tom Ford sunnies…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Joann","text":"I bought this purse and it looked yellow in the picture. When it arrived it was greenish. No refunds? Product should match the description. Pictures can be altered. Sad, I really wanted a yellow purse. Now I have a purse I don't even like. I am a teacher and money is tight. Really sad about the whole experience.","title":"Disappointed first purchase","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"customer","text":"I have purchased a number of items from the Realreal and this is the first one that was packaged poorly.  The item is a glass bird that is valuable and the box arrived torn and open.  Fortunately the glass bird is in one piece as there was good bubble wrap around it.  In the past the glass items were shipped in larger boxes with significantly more wrapping and tape.  Had the box been just a bit more torn I'm sure the glass bird would have fallen out in the usps systerm.  The usps handles millions of packages a day I imagine and if you are going to ship via the usps then please pack the items more securely.  It is in your best interest as well as the customer's.  Thank you very much for an otherwise fine transaction.","title":"Poor packaging","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Jennifer Todd","text":"Be careful what you purchase just make sure you read throughly on the description some of the items have been used quite well but they must state it on the description I purchased a small purse and it was used a little bit more than I would like...and nonrefundable:(","title":"Be careful what you purchase just make…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Sandra Hankerson","text":"The sizes are incorrect every time I order","title":"The sizes are incorrect every time I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Jacqueline Wernick","text":"The LV belt I purchased did not have a keeper and it was not mentioned in the website. Same belts that had keepers were betting sold for the same price. My belt should have been priced a bit less.","title":"LV belt","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Michelle","text":"I specifically searched for \"womens size 10 Gucci shoes\" I placed the order believing that is what I would receive.  I received a Men's size 10 and now I have to return them.  I'm very disappointed.","title":"Misleading placement of product","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Chantal","text":"There are white Color dots on the bag which where not shown on the pictures","title":"There are white Color dots on the bag…","stars":2,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"customer","text":"bottom of luggage has the 2 feet stand & was freshly screwed off. holy christ","title":"bottom of luggage has the 2 feet stand…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"customer","text":"Item description was incorrect and listed the size as a men's shoe size 11.  Upon receipt, it was a size 7.  This wasn't the first time this has happened.","title":"Item description was incorrect and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Deborah Grogan","text":"This is the second order for me and I am very dissapointed. The dress does not look like the picture.It states it is silk but the fabric is not silk. Dress size is not correct, not did the measurements match what was on the dress description. The dress was too small. I will be contacting customer service to return the dress.","title":"This is the second order for me and I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Jennifer","text":"Not as described.","title":"Not as described.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"kt","text":"Hello, First I like TheRealReal and have some beautiful items I have purchased from the site. I also like that in-store returns are an option.\n\nWith this order and a couple of others the item comes poorly packaged. The earrings from my latest order did no hav the tag attached. I need to return them because, although beautiful and a great price, they don't look good on me. You require tags be attached for a return. I called the CS phone number and was on hold for awhile and then offered a call back when it became my turn. That was was about 8 hours ago. No call back. So because the condition of the items on arrival and the lack of customer service, I have to give a poor rating for this order. I still need confirmation that I can return the earrings (no tag attached as received) to the PA store on 4\/22.","title":"Hello","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Elizabeth","text":"I Love The RealReal but the customer service replies are extremely slow to non-existent.","title":"I Love The RealReal but the customer…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=30&stars=1&stars=2&stars=3"}]