[{"date":"2022-03-05","author":"customer","text":"Bought two pairs of shoes advertised on your site as US size 9.5. That was incorrect they are more like 8 or 8 1\/2 .European size 39 1\/2 does not equal US 9 1\/2 ,even one of the boxes said 8 1\/2. returning both and not happy I had to pay shipping for your mistake.","title":"Wrong size advertised","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"Stcora","text":"Everything was fine except I did not receive the original dust bag with one of the bags purchased. It was stated in the listing that dust bag was included on both items and only one original dust bag came. I was upset due to the fact that I prefer to purchase item w original boxes\/dust bags included. I emailed TRR and they are trying to locate the dust bag. Waiting on an update. Besides that, everything was fine!","title":"Missing dust bag","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"customer","text":"For the first time in 9 years I received a FAKE! A KNOCK-OFF! A FRAUD!","title":"WTH a FAKE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"Dulcinea","text":"The Louis Vuitton I purchased was listed as Very Good condition. When I received it the handles had major damage! Very disappointed. Their expert’s and team of listing associates should offer virtual shopping on their handbags. If I had seen this damage I would have passed on this handbag.","title":"Beware very good condition is not what you receive!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"Cathie Dominick","text":"The wallet had ink marks and whatever else all over it. This was not seen in the pictures nor was it conveyed to me.","title":"The wallet had ink marks and whatever…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"customer","text":"Received a dirty jacket and no response yet from customer service on returning the item.","title":"Received a dirty jacket and no response…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"customer","text":"Description incomplete\n\nI ordered a Dior wallet that comes with the DIOR charms, but the R charm is missing. The description said nothing about this flaw.","title":"Description incomplete","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"Unhappy customer","text":"The louis vuitton bag that I purchased it seemed nice from the outside but when I opened it was a disaster super duty, the pictures didn't show the bottom or the sides of the microfiber.\nAlso it was shipped with UPS with no signature required and it was left outside for someone to grab a $1,000. Louis Vuitton purse \nI'm not impressed at all with real real as a company.","title":"The louis vuitton bag that I purchased…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"Wendy","text":"I but a lot from your site. The shipping is expensive, when most big companies have free shipping and my package is delayed again. I’m tired of it.","title":"I but a lot from your sites hopping time and cost","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"customer","text":"When I speak to customer service they are very nice and seem to be helpful but they don’t solve the issues at the end.\nMade an order recently and it arrived very quickly but about the customer service calls, nothing has been solved about the issues I had called about, I wish they would follow up instead of my having to call again and get frustrated because they don’t resolve them.","title":"Customer service ability to resolve issues","stars":1,"location":"PR","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"customer","text":"The purse i bought is faulty - it does not close!","title":"The purse i bought is faulty","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"ELIZABETH","text":"The watch was a fake. I was surprised that the appraiser apparently didn't look at the Cartier lettering on the face or otherwise they would have seen that the letters for the maker Cartier were sloppy\/not clean Never happens with Cartier. The watch face and weight also were not of Cartier caliber. \n\nSpeedy in getting item to me and the return procedure was very smooth, but still they should have caught that the watch is a fake. $9K for a fake!","title":"The watch was a fake","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"Customer","text":"I was sold a fake Gucci bag that’s non-refundable.  When I contacted customer service they suggested that I consign it. Why would I consign a bag that I know to be fake? I have returned it to have its authenticity evaluated and am waiting for a response.  I will never buy from this store again.  Horrible experience.  I paid over $1,000 for a knock-off bag.  This company should be embarrassed.","title":"I was sold a fake Gucci bag.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-06","author":"customer","text":"The pants arrived missing 2 buttons on the fly","title":"The pants arrived missing 2 buttons on…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-06","author":"customer","text":"The shoe didn't fit the way it should have, their is nothing supporting the top of the shoe.  When I am walking the comes of my feet.","title":"The shoe didn't fit the way it should…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-06","author":"Maria","text":"Too slow in their responses. Still waiting to be refunded my money even the item I returned has been received a week ago. They haven’t processed the refund and still waiting for their email","title":"Too slow in their responses","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-06","author":"spikey games TV","text":"you sold me a $400 dingy stained louis vuitton purse, and i was refused and given the run around on a return. i am reporting you to the BBB! judging by other reviews, i see you do this to people often. I will NEVER purchase from you again.","title":"you sold me a $400 dingy stained louis…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-06","author":"PMM","text":"I was sent the wrong dress.  Customer service was terrible - it was impossible at first to find a phone number and I spent an hour dealing with a robot at the other end of text messages. When I finally got a real person by text I didn’t have a sure sense that the problem was understood.  I finally found a phone number after digging through old e-mails.  The woman I spoke with said there shouldn’t be a problem when I returned a less expensive dress by a different designer than was on the return slip I’d been sent. but didn’t seem to really understand.  And no one indicated whether the right dress will be sent.  When I first opened the package and saw the wrong dress, I was willing to cut TRR some slack, given the volume they deal with, but the subsequent waste of my time through completely inadequate customer service means I won’t be buying from them again.","title":"Wrong dress - and then it got worse","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-06","author":"customer","text":"I got my first item , was very excited and of course I thought the items were “thoroughly” inspected by a professional, when I open my purse I find a used dirty breast concealer, yup that was my first impression. I would give you 1 star but the purse was ok. Now I have trust issues. I’m waiting on my next purchases.\nAlso you should offer free shipping for purchases at least for $100.","title":"I got my first item","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-06","author":"Peta Brookstone","text":"The sizing was completely off - based on the measurements I thought the item would be a bit tight but took a chance……turns out it was at least 2 sizes too big. I can’t even return it because it’s a final sale. Very disappointed and nervous to purchase anything else from the site.","title":"The sizing was completely off","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=75&stars=1&stars=2&stars=3"}]