[{"date":"2022-02-08","author":"customer","text":"I'm so disappointed to be writing this review. I had trouble from the beginning to end with my purchase. When I originally went to check out, the website kept backfiring on me and did not accept my credit card, paypal or debit card. It also did not accept any coupon code I used, even though all were eligible. Once I received my item after fast shipping, I realized I accidentally purchased the wrong bag. It was my fault for not reading the description closely enough, but there was also a glitch in the website that customer service did not take responsibility for. I kindly asked for at least store credit back and none of my requests were met. I don't think I'll be returning, unfortunately.","title":"I'm so disappointed to be writing this…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"customer","text":"I love my bag but it was not cleaned. Filed with hair and dust so I gave it a nice little cleaning!","title":"I love my bag but..","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"customer","text":"The top I ordered was in such bad shape I wanted to return but it was on sale and said I couldn’t. I am going to send back because I want to see if anyone working there would wear it. This was my first purchase and not pleased. Dorine Ravizza","title":"The top I ordered was in such bad shape…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"Not very happy consignor","text":"I’m very disappointed in the RealReal’s consignment process. Someone came to my house to go through my items. They took almost 60 items, left a few behind. Now they’ve returned most to me in SIX different shipments - so far. I don’t mind them not accepting the items, but they should train their employees better so they don’t ship back so much. They don’t take most Tory Burch, Trina Turk, Elie Tahiti, etc. and their employees should know that. It’s ridiculous and a waste of time and money - incredibly inefficient. I’m going to make so little from what they kept, I might as well have donated the clothes to Goodwill in the first place","title":"What a waste of time!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"Nikole Graham","text":"bag was sold as excellent no visible sign of wear. but the leather has bubbled! I paid more than a brand new Chanel for this one! Not happy. Item not as described. Will contact customer service to return.","title":"bag was sold as no signs of wear, \"not\"","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"Customer","text":"Two of the items in my order were great, two were just ok, one was not good and two were completely wrong out of my first order alone. \n\nThe two items that were wrong \/ wildly different from how posted\/portrayed could have been easily avoided with more diligent intake and accurate posting. \n\nI received one ladies item that was very clearly four sizes different than listing in an unmistakable way and one item that was men’s instead of women’s. Both were shoes had been mis-listed in terms of size\/categories type details and shoes are not like a garment in terms of ability to do alterations.\n\nWith improvement I think this could be a good site. \n\nThey should revise their return policy so customers are not charged return shipping in cases where we received a wrong\/completely mis-represented item different from listing. \n\nI understand return shipping in a case where customer simply decided they didn’t like fit of item etc, but not when the problem was from the company side and a wrong\/different item\/mis-represented item is sent. \n\nCompany needs to get better at reading tags and listing more accurately.","title":"Has a lot of potential but needs quality control and intake improvements","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"NMW","text":"I was disappointed I went to have the diamonds reset only to find out that the diamonds are lab grown which when I was purchasing I was sure not to purchase unless they were natural diamonds. Although, it read on the report I was certain I chose something altogether different as later described when I received it It was embarrassing when I went to the jeweler, he said they were inscribed on the side girdle of the stone. It should be stamped across the listing on the website, so this doesn’t happen to someone else. I like the brilliance but I am still disappointed nevertheless.","title":"I was disappointed I went to have the…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"customer","text":"The items I purchased were definitely gently used & not excellent condition.","title":"The items I purchased were definitely…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"Cheri","text":"The pictures of the item I ordered are a little deceiving.  The LV white purse is not as bright as pictured.","title":"Pictures are a little deceiving","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"customer","text":"I was a bit bummed out when I received my bag :(\nIn the description it was never mentioned about the hardware being discolored. \nThat’s usually when I donate my bags or anything else.","title":"I was a bit bummed out when I received…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"Joseph Pasquino","text":"The amount of money for shipping is overpriced.\nThe problem with photos of items is not accurate on length.\nOrder Dianne Von Furstenberg wrap dress and it is floor lenght.\nCost more to shorten than worth.","title":"The amount of money for shipping is…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"customer","text":"My item was stolen from the packaging before I received it. Emailed The Real Real to no resolution.","title":"My item was stolen from the packaging…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"Rosemarie","text":"The top was advertised as a size M. While I realize sizing varies by brand and designer items run small, this is truly tiny, more like an XXS\/XS, and I think such a size variance should be cited in the description. I’m now stuck with a shirt.","title":"The top was advertised as a size M","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"customerJ","text":"I called, (no call back as requested) and 'chatted' , who said I would be called back by a representative.  I want to return the item.  Because I received no answer, I have mailed back the item (Frye harness booties) and have requested a return and full refund.","title":"No call back as requested","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"customer","text":"Dident respond to email","title":"Dident respond to email","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"Morg","text":"Love the shoes I ordered, but the strap was almost broken off :(. Thankfully a local shoe repair store in town is fixing them, but I wish I would of known how bad it was before I bought them.","title":"Broken strap","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"Emma","text":"The dress was not the same dress that was pictured, and unfortunately it took a couple weeks to get ahold of customer service and have them refund the shipping fee. Though in the end that agent I spoke with on the phone was incredibly kind, apologetic, and helpful. I would be more inclined to give them the benefit of the doubt if this weren’t the second time this has happened to me.","title":"Didn’t match description, poor customer service","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"customer","text":"The item that was sent to me was significantly different from that was pictured on the website. I ordered what was presented and described as an item that was in excellent condition with no signs of visible wear. The item that was sent was in much worse condition than I was led to believe. Marketing is deceptive.","title":"Deceptive marketing","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"customer","text":"The sparse description of items leaves something to be desired. I ordered a shirt which was described as black - when it arrived, it was colorblocks of black and navy, which had not showed up in the photo on my phone screen. I'm also concerned about their inspection process, as the pair of boots I ordered had a broken zipper which was not mentioned in the listing. Now I have to pay to return both things, neither of which I would have ordered if the listings had been more complete.","title":"Need improved descriptions and close-up photos","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"Mariana C","text":"Terrible as usually. Bought a pair of shoes size 9 only to receive the shoes in size 6. Non returnable! Like what i suppose to do with them?!!? I ll never get back on their website.","title":"Terrible as usually","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=95&stars=1&stars=2&stars=3"}]