[{"date":"2022-02-20","author":"Robin","text":"The item I received was not the photo of the item I ordered.","title":"The item I received was not the photo…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"customer","text":"The real real charged my credit card for a lot more then what I paid for my bag. I’ve been trying to contact customer support for weeks and haven’t gotten any answers or money back.  Very disappointed","title":"The real real charged my credit card…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"customer","text":"Overall the selection is good, and I love having the trust of \"quality control\"--I know I'm getting the real thing. However, the measurements are very confusing--and sometimes clearly inaccurate. (I know my way around sewing and making clothes!) When you're ordering clothes without being able to try them on, it's so imperative to have clear and accurate measurements, and I've not bought things or had to return them because of that.","title":"Good selection and \"trust\" but confusing sizing and measurements","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"customer","text":"The experience of using the website\/app is great. But then using an delivery service that leaves valuable items on your doorstep for passers by to steal deflates the whole system. This is not Amazon, these are individual pieces that if lost cannot just be purchased again, I don’t want refunds, I want the pieces I got excited about. Please do something about this TRR, I’m sure I’m not the only one disappointed in this way. :-(","title":"Fix the delivery service!","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"Javier Calderon","text":"I bought two medium sized shirts, neck size 16, but they both fit like small shirts. Although the labels said M, I think it would be worth to categorize the shirts sizes based on other shirts and not on the label. In any case, I had to return both shirts and lose some money in the transaction.","title":"Medium sized shirts more lile S","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"Mary Herbert","text":"Questionable on its authenticity. The branded number, LV gives its handbags was partially hidden because it was on both sides of the seam. I highly doubt LV would have allowed such sloppiness. Even though the description mentions some interior dirt, who would think a company wouldn't remove the long strains of hair that was inside. Hello RealReal, this isn't a garage sale. And the exterior dirt they mentioned was a tiny little spot that I wiped away with a tissue, YES, tissue. I'm sure it took more time to type the exterior condition then it took me to whoosh the tiny little dried on substance. And really, the person authenticating the bag couldn't have removed those hair strains?","title":"Questionable on its authenticity","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"customer","text":"Even though I explained that the item I purchased was incorrectly sized on the website, I was still charged a return shipping fee. That is unacceptable customer service from a company purporting to be a high end boutique.  Certainly, charge me if I just didn't like an item, but if you label an item as one size and send me another, I shouldn't have to pay to return it.  And the online customer support chat mechanism is poor at best.","title":"Returns for incorrectly sized items","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"customer","text":"Size doesn’t fit","title":"Size doesn’t fit","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"customer","text":"I was shown black glasses. And that's what I thought I was buying. However, when I got them they were a bagel color. Not good.","title":"I was shown black glasses","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"customer","text":"The shoes I purchased although heavily discounted were not in re-wearable condition. They were also not returnable so I do not recommend purchasing anything that is a final sale.","title":"The shoes I purchased although heavily…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"customer","text":"The dress measurements were inaccurate and the sweater was tiny not medium but extra small \nVery disappointed","title":"The dress measurements were inaccurate…disappointing","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"Karin Kauffman","text":"Their customer service was really unprofessional via the online chat. They kept literally hanging up on me. It took me almost 1.5 hours to resolve my issue after having to explain the situation multiple times. It was a literal nightmare, I reached out to their customer service & they basically said… sorry. \n\nThen I receive the $450 bag & the condition was absolutely horrible. The bag very literally looks nothing like the listing. I was shocked & could not believe someone would adjust the camera & edit so much to make this look like an entirely different bag.","title":"Their customer service was really poor.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"customer","text":"Item was correct but photos online store seemed to be off. Picture was bright an clear. Product I received was dirty and very dull in color. When description says good condition it actually looks nothing like the photo as pictured. Sunglasses I received was dull an discoloration on frames. Disappointed","title":"Item was correct but photos online…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"ALPHA STEEL WORKS","text":"Used site before it was wonderful .  HOWEVER yesterday I purchased a Gucci shawl - site did not mark item sold as it had for the last purchase I made in December 2021… I did the chat and they admitted item error on THEIR website … Realreal will NOT help me with the item they are charging me for .. AT THIS POINT I WILL NOT RECOMMEND THE SITE …. I feel scammed and they showed an item on my account but admitted today they are sending a different item !!! I FEEL IT WAS A BAIT AND SWITCH !!!!","title":"REALREAL _ Disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"customer","text":"I really do love the RealReal, but it's a bummer I was sent a completely different item than I ordered... and sadly the item I ordered wasn't available at all. But I have gotten a few other items on The RealReal and had good experiences with those. Still waiting on my return to be completed.","title":"Good but mix up","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"customer","text":"My original order included two items, with the intention to reduce costs for shipping and importation costs \nOne item that was available for purchase was later cancelled, resulting in me having to order two items separately and thus paying double for shipping","title":"My original order included two items","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"Christian Broughton","text":"Bad - authenticated to be wrong sizing and not match descriptions","title":"Bad - not sized correctly","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"Mike S.","text":"I made a purchase, after being misled about a site wide coupon because I really liked the watch.  About 30 minutes afterward, I re-read the description and noticed that the watch would only fit a wrist much smaller than mine.  \n\nI immediately tried to reach out their customer (lack of) service via text message, phone and email.  They failed to respond to me until the next day.  They said that they “had to ship the item” because of their policy but would instruct UPS to return it to sender.  I was assured that it would not be a problem.  \n\nIt took UPS 3 days to “almost” ship it to me and then return it to them.  A week and a half after receiving the order I just wanted to cancel, they only gave me a partial refund ($50 less than what I originally paid).  \n\nBuyer beware, read the fine print, don’t talk to their customer service, and be prepared to pay for an order that you just decided to cancel right away.  Also, their coupon “REAL20” doesn’t work on anything.  Not even the items that do not carry the disclosure about coupons not being eligible.  Their coupons are truly sitewide - they don’t work anywhere.","title":"I made a purchase","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"Jennifer Brown","text":"I purchased a pair of Stuart Weitzman Suede Pumps in a size 8. I received 2 Stuart Weitzman shoes but they were two different shoes and two different sizes. I went through customer service to try and get the correct shoes and they wouldn't provide me the correct shoes. They return policies are terrible and they expect you to pay for shipping either on your own or they will discount the cost through the label they provide you with for the return. I really wanted to use this store and I love the concept but I had an overall terrible first purchase experience and I cannot use this service again. Please be careful before you buy you may get 2 different shoes.","title":"2 different shoes - Had to pay shipping cost to return","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"customer","text":"Ordered shoes and the wrong size was sent. This is 2nd time this happened in less than 2 months. Each time, I’ve had to convince customer service team to waive the return shipping fee. Very disappointing experience, considering it was their error and Not charging me for RETURN shipping is the absolute least they should do.","title":"Wrong size shipped - BARELY reconciled","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=86&stars=1&stars=2&stars=3"}]