[{"date":"2022-04-20","author":"customer","text":"Non-existent Consignor Relations\n\nI have been given the run-around and hung up on by so-called consignor relations experts for more than two weeks. \n\nI asked for an item I consigned to be returned and was assured that would happen.  After two weeks of calling, emailing and texting, my item was re-listed and sold.  \n\nI understand TheRealReal is no longer interested in my business, so I would like to be paid for the item I asked for back that you sold and have my remaining items listed with you returned.","title":"Non-existent Consignor Relations","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"Chellycha","text":"I had set up an appointment to sell a Louis Vitton item and chose the option of text, and the person I had set up with never messaged me and I waited all evening.","title":"I had set up an appointment to sell a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"customer","text":"Not what I expected. I paid for the name (designer ) ONLY because the purse is cramp and not only that if I had not checked with my PayPal account you would have been getting reoccurring payments without my knowledge. I’m so glad I called customer service and they stated that it was a reoccurring payment set up on your end. I cancelled it and I will no longer be ordering from this site again. I really feel if I had not called PayPal customer service I would have been scammed by you. Please do not connect with my email again","title":"Not what i expected and scammers","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"antonia t","text":"Wrong item sent","title":"Wrong item sent","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"customer","text":"The pair of LV shoes arrived with its original box being crushed when I opened the outer packaging box. Not sure if this happened during transportation and it seemed odd that someone tried to put tapes around the original LV box to keep it in place. I was expecting the item purchased with its original box at least the box should be in its shape and not squashed or flatten when arrived. I was dismay when item received in such condition.","title":"First time purchaser with The Real Real","stars":3,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"customer","text":"Bag was more used than description specified.","title":"Bag was more used than description…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"kimthu huynh","text":"I have nothing to complain of your shipping and service. But the Chanel shoes I bought were very dirty and smelled. I understand that they are secondhand but at least you guys should lean them a little before delivery to show your respect to the customers.\nKimbowers","title":"I have nothing to complain of your…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"irrate customer","text":"Couldn't get help to get into the website.  Awful and it took forever.  Then 2-3 days for IT to help.  Ridiculous.","title":"Couldn't get help to get into the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"customer","text":"The package arrived damaged same as the product itself, the costumer support didn’t reply to my email.","title":"The package arrived damaged same as the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"customer","text":"The item that I spent hundreds of dollars on cake just thrown in a box. No padding, no secondary box just thrown in there. When I got the package there was a huge hole in the top and my item got dirty. Customer service doesn’t really help much.","title":"The item that I spent hundreds of…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"Marni M.","text":"When it works out, it’s great. When it doesn’t you’re mostly out of luck (and money).","title":"Hit or miss","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"UNHAPPY Customer","text":"Was not told that these bags are FAKE!!!! I am not happy at all!!!!! I have many of LV pieces and I would have rather paid more for a real piece versus paying over $700.00 for a fake LV!!!!!!! I will let everyone I know to NEVER use your site or company!!!!!!!!!!!!!                          Thanks","title":"THESE ARE FAKE!!!!!!!!!!!!!!!!!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"Liya Langbort","text":"The website is not clear and you just want to order a coat and after you made the order you have to pay a lot more... If that was clear to me at the beginning, maybe I wouldn't order from The RealReal. \nVery disappointed.","title":"The website is not clear and you just…","stars":1,"location":"IL","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"customer","text":"The belt is missing on the jumpsuit I ordered.","title":"The belt is missing on the jumpsuit I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"customer","text":"After purchase, my order was described as \"undeliverable\" by UPS and was then designated \"return to sender\".  Contacted customer service and the only response was \"as soon as we receive the order back we will issue a credit\".  There was no contact, either by email or telephone to verify my address and I didn't have a chance to correct the issue prior to the package being returned.","title":"After purchase","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"Unhappy customer","text":"The handbag had a bad odors that was not mentioned in the description. After paying $1,500 for a handbag that I was so excited about getting and once I received it unable to use because of the smell has been very disappointing. With this not so good experience I will no longer use your site for any future purchase \nThank you","title":"The handbag had a bad odors that was…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"Connie Villanueva","text":"The bag did not have any ID internally that would say “LV made in France”, very unusual. The cloth bag smells and looks dirty.","title":"No interior ID on the bag","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"Lawanda Simmons","text":"I purchased a pair of Versace earrings over $400. Now I thought the The RealReal suppose to authentic the product before shipping. However the earrings was just fake and very noticeable. Very lite weight they was bent and out of shape. The craftsmanship was horrible. I am now aware they are not checking that the product they are shipping out.","title":"Fake Versace earring","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"Isaac","text":"i ordered a paul smith tie and although not a word of it was mentioned in the description, there was a picture of a completely naked woman on the inside of the tie, i was just suggesting that something like that must be mentioned in the description of the item.","title":"critique of description","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"Lauren","text":"The security tag is still attached to my dress","title":"The security tag is still attached to…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=24&stars=1&stars=2&stars=3"}]