[{"date":"2022-03-06","author":"customer","text":"A dress I recently received and paid an astronomical price for was severely damaged and there is no return option. I felt absolutely duped and frustrated.","title":"A dress I recently received and paid an…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-06","author":"Holly","text":"Filters are inaccurate, placed filter for womens sz 9 for Valentino sneakers. Bought a pair, got them and they were way too big… so quickly ordered other shoes in sz 8 instead and started the process of retuning the others- as I’m leaving out of town on a trip I wanted to bring those to. \n\nI’m being charged for the return and when I printed out the label— the description is menswear! This was not on any of the other order forms prior to buying. \n\nI had someone check my new order, I have a mix of both mens and womens Valentino sneakers sz 8- going down a size as I was trying to get a pair of womens shoes to fit me. Well basically I’m being charged again for all the shipping, returns, etc for shoes which are going to be BOTH too big (mens) and too small (womens). \n\nI’m fine with weary man’s shoe if they accurately filtered; for example if you want a womens 9, you could get BOTH mens 7 AND womens 9.","title":"Filters are inaccurate","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-06","author":"carrie","text":"well the title written description never said the cotton citizen sweatshirt had no back in the listing.yes a pic of back which i thought was a white patch on top of the black sweatshirt.very misleading...no refunds either.will not be so inclined to shop real real again.just very unhappy with this purchase.","title":"well the title written description…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-06","author":"Jennifer A.","text":"Still not sure how I feel about luxury resale and here it why. Obviously, it was my choice to look for a used\/worn but good version of the LongChamp Le Pliage tote. I was on the market for a budget-friendly purchase from a trusted source. I've seen mixed reviews about The Real Real and wanted to give it a try myself. I should have known better.\n\nI found a tote within my budget and appeared to be well taken care of for a used tote bag. It was everything I had wanted for the price tag. I felt a bit disappointed after completing my order because I realized the total cost would bring me close to a brand new tote. But again, I decided to follow through.\n\nWhen my tote arrived, it was well packaged and in a dust bag. The bag appeared as the photos except for trash inside the bag. There was a tattered gum packet inside the bag and let's just face it, I was disgusted. Where is quality assurance? It made me check other reviews of mishaps and also made me question whether or not it's an authentic bag.\n\nNeedless to say, I don't think I would purchase again. I don't want a hit and miss product. I feel that there still needs to be improvements in order for me to ever decide to make another purchase.","title":"Still not sure how I feel about luxury…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-06","author":"customer","text":"The shoes that I purchased where two sizes too small than what the site said.","title":"wrong size shoe","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-06","author":"JenK","text":"I wish the description of shoes indicated if the sizes are for Men, Women or both, or international size especially Adidas and what would be the exact size in inch. To be specific it would be better if you include the size in INCH. I bought last 2 adidas shoes and they wont fit me at all! Because they're in Men size, waste of money! If i could return them i be worry about shipping return! So i may not going to buy shoes here anymore.","title":"I wish the description of shoes…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"Anna B","text":"The staff isn’t warm or welcoming. They all seemed in a bad mood. If I asked a question the answer would be ‘not sure that’s in a separate system etc’. Working in fashion, I have found the RealReal to be disorganized as much as a love the concept and the items sold.","title":"The staff isn’t warm or welcoming","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"Samantha","text":"Absolutely ridiculous. My package came vandalized and damaged and all customer service is saying is that they will give me a 25 dollar refund, that there is nothing else they can do. All shipments are insured, there is plenty they can do, they just don’t want to. How on earth can a company operate this way. It’s almost fraudulent. This was my first time buying from them and I will not be shipping with them ever again. I will never recommend them to anyone I know either. What a completely unreliable company. Their claim that they provide a safe and reliable platform for buyers and sellers of luxury items is absolute hogwash.","title":"Absolutely ridiculous","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"Aaron","text":"It is the very first time I shop at the RealReal. First of all, I was unable to use the $25 coupon I had received via email. I kept getting a message that made no sense.\nSo I decided to shop without it as I had already chosen some items. \nThe box with the items arrived within a reasonable period of time, however it was packed somewhat carelessly. Out of 4 items I wanted to return one that did not fit. I signed into the website and under \"my orders\" I was not given a choice to mark the item I wanted to return. Again, it is my first time shopping here so maybe I am the one who is missing information.  The skirt that I want to return is too small on me, plus one of the belt loops is loose, needs to be sawn in place. That's how I received it. I tried looking and looking for a phone number to call customer service and I found none.... FRUSTRATING...\nNot the best first experience :(","title":"It is the very first time I shop at the RealReal","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"Paige","text":"I purchased a hat that was too small.  Customer service at the Real Real would not allow me to return it or receive a store credit.","title":"I purchased a hat that was too small","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"customer","text":"I filtered clothes for my size, XS, and the brand I was looking for, Patagonia. The pants I purchased were listed in my XS search but they are not true XS Patagonia pants. Patagonia uses the number system for sizing on some items and the letter system for sizing on others. I should have read the description more closely because it did say XS\/2, but you should list items based on what is actually on the tag to be consistent with how manufacturers label their clothing. I would have never purchased size 2 Patagonia pants because I know they don’t fit me. But I trusted what was listed in my search for XS bottoms. The pants were also listed as “very good” condition. The butt has a number of pulls and missing thread around the pockets. Disappointed with my experience, as I now have pants that are to big and not returnable. Will still with my local consignment shop, thread up and Patagonia’s used online site.","title":"I filtered clothes for my size","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"customer","text":"You cancelled my order with no explanation at all and then the item sold…. Even though I had already purchased it.","title":"Terrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"customer","text":"1\/3 of my order never came, customer service ghosted me about it, and I'm still waiting. The stuff is top-notch but the hassle is a major deterrent.","title":"1\/3 of my order never came","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"Mean Aunt Kate","text":"Love the deals and ability to give items a second chance.  All of my purchases have been great.  I would have given them a 5 star if it was easy to return returnable items.  I don't mind the fee for returns, and I would willingly pay it, but who has a printer anymore?  So, I will donate a dress that does not look right on my frame, which is a shame.  Not all donations make it into the hands of someone else, and I am out $130.  I will stick to shoes from here on out.","title":"Sticking to shoe purchases...","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"customer","text":"I am comfortable that the bag I purchased is real; however, I feel that the condition was worse than described with numerous pen marks and the bag still had cookie\/cracker crumbs inside. Just not what I’m used to when I spend over $2k on an item…","title":"I am comfortable that the bag I…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"customer","text":"Quality of items wasn’t fully described or depicted due to their limited photo\/website template.  Authenticity is also questionable to me but item was somewhat rare so still went for it.","title":"Quality of items wasn’t fully described…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"customer","text":"Everything was great until… your shipping cost. \nI’m a professional\/personal shopper. \nPoint being I shop a lot. \nYour shpg cost is ridiculous","title":"Everything was great until… your…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"customer","text":"The ring I received was significantly larger than what was represented in the photo.  I immediately returned, but could have saved the time and hassle had the ring been represented as its true size.","title":"The ring I received was significantly…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"Nicole Burton","text":"I ordered an adult womens belt, this was my 1st time ordering with you guys.  I actually got a child's belt that didnt fit.  I need to send it back but evidently the return email is not the same address.... theRealReal?  I called for another email and still haven't recieved it 3 days later.  Can someone call me?  \n\n804-836-0174","title":"I ordered an adult womens belt","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"DM","text":"Purchased a Burberry wallet. Saw that it was on sale for 20% off. Code did not deduct 20% (though I see the code on my invoice without the actual discount) . I contacted customer service once I realized error. Was told 20% did not apply to item until 5 days after my purchase. Why did the site then allow me to apply the code? Did not make any sense. Rep just repeated code applied after I made purchase. I am satisfied with product but not so happy about this discount policy.","title":"Need Clearer Explanations About Discounts","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=74&stars=1&stars=2&stars=3"}]