[{"date":"2022-03-11","author":"customer","text":"Wasn't as expected","title":"Wasn't as expected","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"customer","text":"Sizing was way off…With having to pay almost $12 to send the shoes back, I have no plans to purchase anything from this website again.","title":"Sizing was way off","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"customer","text":"condition and quality are fantastic, however I have now ordered two pairs of dress pants that have been far larger than the real reals listed measurements, requiring professional tailoring.","title":"great condition, inaccurate size","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"customer","text":"They sent me two (2) right shoes.... WHERES THE LEFT SHOE... RIDICULOUS! and , trying to have customer service assist is nearly impossible!!","title":"They sent me two (2) right shoes...","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"customer","text":"Shoes were listed as excellent condition with no visible signs of wear but the insoles were clearly used with major fading and previous owner foot impressions.","title":"Shoes were listed as excellent…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"TG","text":"I bought a bag and realised it had no official authentication card, emailed them within the hour from purchase and took them days to answer so they sent me the bag all the way to UK despite all my emails asking them to please hold until I could talk to them :(","title":"I bought a bag and realised it had no…","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"customer","text":"Harder to get help on phone and process returns lately","title":"Harder to get help on phone and process…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"MRR","text":"Purchased 2 handbags. The first one-Marc Jacobs Stam-came with the incorrect strap. The bag has grained leather accents while the strap has patent leather accents. Funnily enough they didn’t photograph the strap with the bag which should have been my first clue they weren’t being truthful. The second bag-Tod’s-was listed as being in excellent “unused” condition. This poor bag was a total mess-scratched leather, worn piping, tarnished hardware, misshapen, stained stitching etc. I asked and received a refund but they will only give me a merchandise credit for the shipping. Which is unfortunate because I will never shop with them again! When I questioned the rep about the rating process, she told me items sometimes get damaged during shipping!!","title":"Unhappy with handbags received","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"Chenetra Hall","text":"I never got package","title":"I never got package","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"customer","text":"Making customers pay for the return shipping. All other brands pay for return but charging $12 is just ridiculous.","title":"Making customers pay for the return…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"Karen T","text":"I bought some Gucci sunglasses. The description said slightly used or normal wear. Let's just say they are a little more \"used\" than I expected.","title":"I bought some Gucci sunglasses","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"event planner","text":"BEWARE! This is a truly problematic company. I have consigned items with them and from the start the service has been nothing short of atrocious. On top of the inept and rude service, I have not yet received payment for the majority of the items I consigned. Many were sold in December - a full three months ago. Customer service is literally non-existent. DO NOT CONSIGN WITH THIS COMPANY!","title":"BEWARE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"Cecilia Gonzalez","text":"Item selection is pretty good. You can find excellent condition to new items at reasonable prices. Customer service is good once you get a hold of someone.\n\nHowever here are some cons:\n1. Clothing size is a hit or miss. Even when the item states \"new with tags\" or \"pristine\" that doesn't mean the item has no flaw. I've experienced it where the brand size is different from TRR's size and material description. Or the \n2. Returning an item is such a pain and costly.\nTRR charges shipping cost of $12.95 and $11.95 for return of each item in the same order! So if you have multiple items in one order, with different shipping\/arrival date, and you choose to return one of the items before you receive the rest, you will get charged $11.95 for that return. Then say the rest of the items come another day and choose to return another item, you will get charged another $11.95 to return it. How ridiculous does that sound? \n3. Return window is only 14-21 days depending on shipment and return date. \n3. Order cancellation - you have to contact TRR within 15 minutes to guarantee cancellation otherwise, even if your order is still under \"Confirmed\" status, if you wait til the next day, they cannot guarantee cancellation. This sucks when you place an order after customer service closes at 8 pm ET. You would have to try and chat with someone - if they are available then you might get lucky.\n4. Customer service via phone is Mon-Fri from 8-8 pm ET. How about folks in PT time zone? It should be extended until 8 pm as well PT. During weekends, you can only contact a live agent via chat. \n5. Refund can take weeks to receive!","title":"Inaccurate clothing size description, diffcult return process","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"customer","text":"It’s been two months and I still don’t have one of my items listed or sent back. People keep returning items. What has sold was reduced within  days of it being listed","title":"It’s been two months and I still don’t…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"customer","text":"I’m pretty upset with my purchase\/return. I have worn a size 11 (not wide) for years in every brand and never had an issue, so I wasn’t worried about ordering size 11 for the Gucci loafers. I couldn’t even fit my toes through the opening and the RealReal product description even said that Gucci loafers typically ran large. Im fine with returning them, I get that some products don’t work out, but not exactly happy that I had to pay shipping to order it AND return them. I would appreciate free shipping on my next order, as i’m still in the market for similar loafers.","title":"Incorrect sizing description","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"Grant","text":"Half my order was excellent. Exactly what I ordered and expected.\n\nThe other half was simply dishonest. The sizes ordered did not match the sizes sent. A specific waist and inseam was clearly listed on the item's page. The tags of the items sent did not match the listings. Moreover, the actual size of the items sent did not match the listings.\n\nOne pair of pants falls straight off me because it is far too large. The other pair of pants are so long I stand on the cuffs.\n\nI can understand a mistake. That's no issue. However, to require processing fee is crazy. The policy allows the store to simply send you whatever and crank fees. Now I understand much of that goes to third-party shipping costs, so there's little financial incentive to do that for most items. \n\nHowever, it renders inexpensive items unreturnable. The policy can even work to charge the customer for the store's mistake. Any item close to or under $12 simply cannot be purchased from the site with this policy in effect. \n\nNo returns is fine. But no free returns when you receive the wrong item? That's just nuts.","title":"Half Excellent, Half Theft","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"customer","text":"disappointing so far.\n\nI've both consigned and bought from TRR, and the purchase situation is fine. As a seller, I guess I expected a little bit more. The consignment home-pickup thing is GREAT and I even had a long, very enjoyable convo with the local rep, who is awesome. And I understood TRR would handle the pricing, but i was told my commission tier was 55% and I am getting 30%. The pricing is baffling -- I just got $12 dollars for a NWT $600 dress. The amount of marketing email pressuring people to make purchases is over the top, it's like 4 emails a day. I was hoping this would be a little bit more of a win-win, and maybe over time it will be, but I'm really underwhelmed and had i known in advance how little money i'd see for my items, I would probably not have done it.","title":"disappointing so far.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"customer","text":"I purchased expedited shipping for $30 on a Friday afternoon. I did this to insure my clothes would arrive before my departure to Spain on Wednesday morning. Counting days, that gave me Friday, Monday Tuesday even Wednesday morning would have been okay. \n\n I understand my package arrived on Wednesday afternoon. \n\nFor the next three months I’ll be overseas on the trip the clothes were purchased for. \n\nI watched with my tracking number time passing while my parcels sat in your facility not to be picked up by UPS until either late Monday or Tuesday.\n\n I don’t think you should offer expedited shipping if you can’t hold up your end of the obligation. \n\nFYI it’s been cold and rainy all day in Barcelona. Perfect for the North Face utility coat sitting at my home in New Orleans.","title":"I purchased expedited shipping for $30…","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"customer","text":"I bought a sapphire pendent and it did not give dimensions. And the picture was so magnified it was deceiving at best! When I received it was so tiny it hardly fits a necklace and the clip can’t make it suit a bracelet.  I’m only keeping it because I don’t like the hassle of the return.\n\nBuyers beware.","title":"I bought a sapphire pendent and it did…","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"customer","text":"The shoes that I purchased were in horrible condition, even though rated well in the listing.  Customer service was helpful with getting a return processed, but I was not happy that I had to pay for shipping back when it was their lack of oversight.","title":"The shoes that I purchased were in…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=68&stars=1&stars=2&stars=3"}]