[{"date":"2022-03-16","author":"Steph","text":"Asked for an extension for the free $25 promo for new users and was given an incorrect coupon code. Asked customer service again and they said I couldn't use this code on any sale items, which just isn't true. Would delete my account and move on.","title":"Asked for an extension for the free $25…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"customer","text":"I’ve ordered twice and had 2 items refunded back to me saying it was an inventory issue and then the same item is listed at a higher price.","title":"I’ve ordered twice and had 2 items…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"Dissatisfied","text":"I would like to speak to a manager about this experience as soon as you are able please call me at my goal is to believe that someone at the real real is looking out for me. I think before my commission was reduced from 70% to 60% - a rep should have reached out - informing me to consider consigning more , in order to maintain 70% status - to offer me the opportunity.  After all I have had such a turnover of reps in miami - I can’t even tell you all of their names .thank you best","title":"I would like to speak to a manager…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"customer","text":"I got hood jacket..not washed.. small for me..can not return..","title":"Can't return...","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"Jonathan","text":"My package said delivered to the front door but I live in an apartment building and when I went to check to get it my package was nowhere to be found. I live on the 2nd floor and would have come down had my bell been rang but to no avail.It was truly disappointing","title":"Disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"Michele M","text":"This was my first purchase from here. The outside of the bag was in great condition but the inside was horrible. There was still a bobby pin and scrunchi in one of the inside pockets. The pockets looked like they may have had water damage as the black coloring was flaking off. Not happy and will not be ordering from here again.","title":"Not pleased!","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"customer","text":"Shipping has been incredibly slow. Still haven’t received my items.","title":"Shipping has been incredibly slow","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"Y. O.","text":"My order was not the size as listed. It did not fit at all. I have worn\/ordered the same brand before so I know my exact size and the size listed on TRR was not correct. Really frustrating.","title":"My order was not the size as listed","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"M.J. Stallworth","text":"The RealReal was not completely clear on the condition of the item.  They said the item was in Very Good condition.  However, the stitching was loose in several places and will be need to be repaired and there was personalized stitching on the interior which was not mentioned.  Had I known the item would need repairs, I would have chosen another item.\n\nOn the other hand, shipping was quick.\n\nIn the end, I am less likely to trust The RealReal's assessment of an item's condition as it seems their standards are vastly different from mine.","title":"The RealReal's assessment of condition doesn't match mine","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"customer","text":"I bought a sale item that was supposed to be cashmere and in excellent condition.  It is not cashmere and has a small stain in front.  Since it was on sale, it is not returnable.  I will not order from the “RealReal” again.","title":"Very Unhappy:  Item not what it said it was","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"Morgan","text":"The RealReal shipped me 7.5 sized shoes that were listed as size 10\n\nWhen I initiated a return, I was notified that the item I bought was not eligible to return and was denied an opportunity to speak to a representative to explain the situation.","title":"Received wrong size. No option to return 👎🏼","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"customer","text":"Horrible! You sold my products then never paid me!! Then I called for three months to get my money","title":"Horrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"Ruth","text":"I never called and processed a return. Someone may have either committed fraud or the associated processed a return for the wrong account. I'm waiting for a call back now, but this is so strange.","title":"I never called and processed a return","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"BP","text":"my 1st purchase was a PAIR of shoes, which I thought meant 1 left shoe, 1 right shoe. I received my order, however instead of the proper pair I ordered, I got 2 (two) RIGHT SHOES, no left. after days of dealing with customer service, the final resolution - NOTHING! Now, I'm stuck with 2 right shoes which does NOT equal a pair. What a waste of my time, money & energy!! BUYERS & SELLERS BEWARE!!","title":"HORRIBLE 1ST TIME","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"customer","text":"Ordered two items and only received one. Still have no update and it’s been two week, all they’ve done is refund the shipping costs. Not likely to shop here again.","title":"First purchase","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"customer","text":"The bag I purchased was beautiful and just as described except that the main inner zipper does not work (it is very stiff and will only open to approximately one inch).  The bag is not returnable....not sure why....it was not clear in the description that the zipper was broken.  Very disappointed.","title":"Disappointed","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"Ashley Johnson","text":"Dress is much more faded and pilly than described. Not happy with my purchase and I cannot return due to it being discounted. This is the second item I have purchased here and was not happy with the first purchase either as a snap came off of a designer purse after just a few uses. I don’t believe that was actually a designer bag either.","title":"Dress is much more faded and pilly than…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"customer","text":"It wasn’t clear to me that I would have pay shipping on returns.  Paying shipping to receive and return a purchase becomes an expensive endeavor for a purchase that doesn’t work out.","title":"Shipping costs","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"Daphne Harris","text":"Purse had undisclosed damage but they don't take returns","title":"Purse had undisclosed damage but they…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"customer","text":"The item I purchased was a non returnable handbag\nI would not qualify the bag as in good condition \nThat was en exaggeration","title":"Return policy","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=64&stars=1&stars=2&stars=3"}]