[{"date":"2022-04-24","author":"Guest","text":"Items were mislabeled or the pictures were of a different item for a number of items. When I contacted TRR to correct, they did nothing for over a week. Then they reduced price because the item had no sold, simply due to their errors.  Suits were separated and sold piecemeal, devaluing them and leaving odd pieces  as separate items that made no sense","title":"Mislabeled or Separated","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"customer","text":"I was sent a product that broke apart after 1 use. Terrible. Never using the website again.","title":"Terrible quality","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Becky VDP","text":"The purse that was sent to\nMe is a fake! It is not real\nLeather.  The straps are so stiff. And the purse smells horribly! Like chemicals! Will never buy from this site again!","title":"Fake!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Dara","text":"My rockstud slides are missing a stud unfortunately.","title":"My rockstud slides are missing a stud…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"customer","text":"Not what I expected","title":"Not what I expected","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"customer","text":"Item was in great condition, however all tags were cut and it was listed as a Large. I wear a large in Patagonia, this was definitely a medium.","title":"Good condition, listed wrong size","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"customer","text":"Because some of the items your split for commissions is way too much. On top of that you undervalue many items.","title":"Because some of the items your split…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"customer","text":"I purchased a bag, it was supposed to be very good condition, the pictures did not include the bottom of the bag. I received the bag and the bottom did not look very good condition to me at all. I think the bag was overpriced for the condition of the bag.","title":"I purchased a bag","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Sonnia Wagner","text":"I just wasted my money on two Chanel items a hobo handbag and a pair of sunglasses. The handbag said \"Excellent\" no signs of wear but the metal piping have tarnish marks and makes the handbag looks old, the sunglasses have scratch marks on both lenses and the right \"temple\" is so bent that I can't wear my because the sunglasses don't fit right one side is higher than the other. \nI can't return these items because they are \"final sale\" so my $1,500 is going to be a donation to a charity. I rather buy at eBay at least they warranty your customer satisfaction and you don't throw away your money. \nThis is not my first purchase, I had great experiences in the past but this will be my LAST purchase. They should take back merchandise that is not in the condition they advertise.","title":"I just wasted my money on two Chanel…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"customer","text":"The clothes I got were not clean. They smelled and were wrinkled. I sent them to the dry cleaner immediately. I would never buy anything from the RealReal again!","title":"The clothes I got were not clean","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"A Howard","text":"The product was great, but the fees to ship to Canada defeated the purpose of the deals on the site. For that reason, I don’t think I’ll be ordering from TheRealReal again.","title":"Shipping fees way too high","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"gretchen rivers","text":"unfortunately you sent me double of things i didn't order and left out what I wanted! i really needed the reishi and want to order but I am scared that you will not package correctly again...i have had a very badly broken right arm...please do it right...i truly believe in mushrooms! xxxooo gretchen...plus I was sent a card with a coupon and number on it but I cannot find it","title":"unfortunately you sent me double of…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Trang","text":"I don’t like it because the old bag has a bad smell and it not returnable. I will never shop here again.","title":"I don’t like it because the old bag has…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Catherine","text":"The quality of the products, the discription of the products and the entire TRR experience continues to go down hill. Use to love TRR and purchase multiple times a month but after the last three experiences I will start to look for alternative consignment options online and locally.","title":"Continue to go down hill.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"DV","text":"While the shoes themselves are lovely it appears the previous owner recently walked on fresh asphalt as the soles were encrusted with black grit and tar.  This was not mentioned in the description and I was surprised to find they had been shipped in this condition.  I had to use solvent and a scraper to remove this material so they would not scratch or leave tar on my floors.  I expected better from the RealReal, especially for the price I paid.","title":"Shipped dirty","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"customer","text":"Shipping fees make TRR more costly especially if you have to make a return","title":"Shipping fees make TRR more costly…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"customer","text":"Twice disappointmented:-\/\n\nFirst one was a crossbody that was dirty and complete with used nail file and crumbs in the pocket. I wrote to TRR about that and they issued me a credit for $11 on an item that was over $100 but that never showed up in my account as a credit. \nSecond disappointment is a  purchase received of a blouse that was listed as FRAME but was, in fact, a Vince blouse and the label was plain to see in the neckline. I will now be charged the $11.95 shipping label fee to return that blouse for an error that was clearly not mine. In that shipment was also another blouse which I will have to re-consign and even though I am shipping them back to TRR together, I am charged for two shipping labels at $11:95 each. My advice would be to never buy anything on final sale, which stupidly I did, because I have another blouse now that I cannot use. \n\nOther than those purchases, I’m happy with TRR.","title":"Twice disappointmented:-\/","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"customer","text":"really upset with the packaging of my order. I received the box half open and torn everywhere, luckily the heels were not damaged. they were left in the shipping box unprotected.","title":"really upset with the packaging of my…","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Roberto McNew","text":"Item not as described. Much more wear\/staining than listing disclosed.","title":"Item not as described","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Yoshi","text":"I ordered Adidas Snowboard Boots and unfortunately I received their counterfeit.  There was no apology about it from The RealReal.  Addition to that, to get refund, I still had to pay for the return shipping.","title":"I ordered Adidas Snowboard Boots and…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=19&stars=1&stars=2&stars=3"}]