[{"date":"2022-04-25","author":"Nikki Manwarren","text":"I was surprised and very disappointed by the conditions of my Gucci passenger bag.  It indicates  online “Very Good” but it looks very very poor condition.  The strap was so dirty.  So unhappy with my purchase.😩😩😩","title":"I was surprised and very disappointed…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"customer","text":"Size were not even close to 50 I think It was 46","title":"Size were not even close to 50 I think…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Mrs phyllis podesto","text":"I have been selling with you for several years, and service has become the worst.  The items are not processed for 4 weeks and longer, one now going on six weeks.  Not something I think clients like, when making a decision to consign with you.  Feel COVID  might have been issue last year but not currently.","title":"I have been selling with you for…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"KERRY RANABARGAR","text":"Can not get any response on sandals I never received in February and this last order I received a damaged shirt and I am having to pay shipping to get it sent back.  Ridiculous","title":"Can not get any response on sandals I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Lynda Latner","text":"The item had holes in the pocket lining and the exterior pattern was faded and cracking.","title":"The item had holes in the pocket lining…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"customer","text":"It’s been two weeks and my writing utensil has not shipped yet. There was never an update on the shipping status emailed to me. I called the customer service number and was told that it was not in stock and had to be ordered from the manufacturer. This is all perfectly acceptable, but the lines of communication are not. When logging in to search my recent transactions in order to see if I had maybe made a mistake in checking out, I received an error instead of information about the status of my order. I’m not one to complain, but this issue should be resolved, especially on a site that sells such high end merchandise.","title":"Lack of Communication","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"YC","text":"overall good, however as a member in Canada, I found the consignment is very difficult. I paid shipping myself, Im okay with that. The problem is I cannot get my consignment item returned if it is not eligible for listing(even if I tried to pay for the return shipping cost) another thing is some of item description is slapdash, for example they often put an automatic watch in quartz watch category which make buyer confused. My item usually sold within a month here, that's pretty good, however the overall experience still need to be improved.","title":"consign experience in Canada","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"customer","text":"I bought 3 purses, 2 were great, one was horrible.","title":"I bought 3 purses","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"customer","text":"I ordered a Tod’s bag that said was in very good condition.  When I received it, there were black marks and scuff marks all over the bag and the color of the bag was not the same as in the picture. I’m not happy with it. When I looked through the pictures online, there weren’t any black marks or scuff marks.  I won’t be ordering from the Real Real again. I’ll go back to Tradesy. I’ve never had that issue with them. I got exactly what the pictures showed.  Very unhappy!!!!","title":"I ordered a Tod’s bag that said was in…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Lauren Keenan","text":"The return policy needs to be 1) more generous and 2) more clearly defined for customers before they purchase - like large print “this is not returnable”. I felt swindled.","title":"The return policy needs to be 1) more…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"customer","text":"They sent the wrong size, the wrong shoes and promised to refund my shipping which they did not.  This was my first time buying from them and it will be the last.","title":"They sent the wrong size","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Jackson","text":"I tried logging into my account (including 5minutes ago) when I got a message saying suspicious activity was detected on the ONLY phone I use that is never out of my sight.","title":"I tried logging into my account…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"customer","text":"Ordered Glitter Golden Goose sneakers that were represented as Very Good condition but arrived with multiple bald spots where the glitter was worn completely off. The soles did show some ‘dirt’ but it actually smelled like poop and I had to wash off before trying on, just to confirm that the size at least fit.. before spending 5 hours to try and get a full refund including shipping. Fingers crossed that they honor the full refund, as they were returned the next business day.","title":"Ordered Glitter Golden Goose sneakers…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Fernanda Chamlian","text":"I bought a black Gucci bag but wham I received the package the bag is brown","title":"Complaint","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"customer","text":"I haven’t received my package!","title":"I haven’t received my package!","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"customer","text":"I was offered a $25.00 Discount with a purchase via e-mail.\nI tried to use the code associated with the discount but was not successful.\nI wrote to customer service, only to be told that once a purchase had been made, the code could not be used.\nThis is no way to treat a client who spends thousands of dollars per year on your site.","title":"I was offered a $25.00 Discount with a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Nina","text":"clothes aren’t as pretty in person as online. Paying for return shipping is discouraging.","title":"clothes aren’t as pretty in person as…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Brian Russell","text":"I wouldn't have never ordered a men's shoe in size four and a half that's a kids shoe I wear 12 not happy at all trying to cancel it very hard","title":"I wouldn't have never ordered a men's…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Jacob","text":"The bag I purchased arrived in way worse condition than was described. Unfortunately it is a final sale item. This is the 3rd poor experience I’ve had with TRR. Selling, buying, and the in store experience in SoHo have all been poor, average at best.","title":"Bag arrived in poor condition","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Linda LaRue","text":"It would be very helpful to have more pictures and a better description. Too often vital information, like date of production, especially on Hermes items. This lack of detail, as well as no return policy, stops me from purchasing items of higher value.","title":"Better descriptions needed.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=18&stars=1&stars=2&stars=3"}]