[{"date":"2022-04-08","author":"Ashley Glanc","text":"The products were great, and as described. However, the shipping and duties in to Canada were astronomical. 3 of the items I purchased were made in California (so should be sent out duty free using the proper HS code) they weren't properly labelled for customs, so the duties were enormous. Since the responsibility of the HS code is on the shipper, I am stuck with a huge import fee. \nVery disappointed, and sadly, won't be shopping here again because of that.","title":"Great products, sadly shipping duties were outrageous.","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"customer","text":"I’ve unsubscribed from emails so many times but they won’t stop","title":"I’ve unsubscribed from emails so many…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Suzanne Margolin","text":"I bought a Kate Space shoulder strap for my purse.  No where does it say Kate Spade on it.  It was also supposed to come in a box but instead came in t wo oversized bags.  Not happy.","title":"I bought a Kate Space shoulder strap…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"FiIna","text":"I bought a chanel bag here described as in very good condition. It arrived with chunks of sticky tape stuck to it which had lifted the leather. I got in touch with customer service who agreed to a return at my cost despite the fact it was not in the condition advertised. Be very wary of this company.","title":"Mis advertised Chanel bag in poor condition","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Hannah Luna","text":"The item was pretty okay but I felt the description wasn’t accurate it said discoloration at arm but much of the lace was discolored","title":"The item was pretty okay but I felt the…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"customer","text":"Garbage quality on this site. Don’t waste your money.","title":"Garbage quality on this site","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Customer in SF","text":"Sweater ‘ad’ was completely misleading. Shipping way too overpriced. And when you return something - they charge you again for shipping. Very disappointed. Also - when you toggle that you’ll pick up something locally, at least in SF, zero … that is NO items are eligible for pickup in SF so you always have to pay expensive shipping. Another inauthenticity as it were - don’t list in the site that if you pick up items from local TRR stores it’s free when that isn’t true.","title":"For ‘realreal’ there is some inauthenticity!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"BESSER","text":"I’m so disappointed with the fact that my beautiful Tory Burch leather jacket arrived notoriously  stained in the back. These flaws were not disclosed in the website and for me, it makes it unusable.  I wonder if the items are inspected before shipping…","title":"I’m so disappointed with the fact that…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Lucy","text":"I was dissatisfied with the actual look & quality of the item.  It looked different on the website.  The return cost is outrageous so returning the item is not an option.  First & last time using this site.","title":"I was dissatisfied with the actual look…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Tifany","text":"Bad. Shipping was great but i bought a gucci handbag horrible quality it doesnt even look like a gucci bag anymore. So sad because it was like $400","title":"Gucci handbag","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"customer","text":"Shipping dates at time of order were not clear. Ended up being later than I needed for my event. And box was pretty basic in terms of packaging. Kind of dented, seemed like a non lux purchase. But bag was great deal!","title":"Shipping dates at time of order were…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"customer","text":"I was disappointed by the significant shipping costs and added duties. The RealReal communicated it very effectively but considering most other companies offer free shipping with no duties, this will lead me to not shop here again.","title":"Duties + Shipping too expensive","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Jane","text":"Customer service was satisfactory. Garment arrived torn - this was not described in the condition report. I would not have purchased if I had known of the tear. Condition reports need to be more accurate to save customers from headaches and annoyance","title":"Garment Arrived Torn","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"customer","text":"The no return policy for anything on sale (most of inventory) and high shipping costs is irritating. I have found some real gems here that I love. And I have 4 pairs of pants on my closet where the fit is not right\/don’t wear ever. Would have been less expensive and less wasteful to just get something new after trying on in-person.","title":"The no return policy for anything on…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"customer","text":"My first purchase was a bad experience-  the item was supposed to be in Excellent condition- “no sign of any wear” but it came with a large pull in the knit on the sleeve-  to return it cost me an additional $11.95-  even after I left my comment about that-  won’t buy from them again","title":"My first purchase was a bad experience-…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"customer","text":"Never received email confirmation for my order which was stolen at UPS warehouse.","title":"Never received email confirmation for…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"customer","text":"Package hasn’t arrived and there’s been no updates from the company.","title":"Package hasn’t arrived and there’s been…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Laila Louie","text":"Horrible experience.  I packed 3 boxes of items for TheRealReal.  They gorilla market you via text to consign with them, so once I took the bait, they text me 3 or 4 times to ask how my packing was going.  I made a list of all my luxury items and packed them neatly. A driver came to take the three boxes and I received a receipt with the number of boxes.  They were a little bit nonchalant so I was worried but I figured it would be fine. Well was I wrong. I saw my items after 7 days in the app but only 1\/3 of them.  I asked where the rest of my items were and they said to wait. I did and I checked with customer service via chat and email almost every other day. The chat customer service is awful. It takes almost a full day for them to get back to you. It became clear after 2-3 weeks that they lost my items. Or stole them. Alexander McQueen items, Hermes, Halston, Thomas Wylde, Gucci, Tory Burch…they launched an investigation and now they want pictures of everything.  I have some but not all and let me tell you how hard I am kicking myself for ever sending my items there.","title":"Horrible experience - DO NOT USE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"customer","text":"The box were all bend up & had tape on it were it were open need to put merchandise in a better package","title":"The box were all bend up & had tape on…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"Marilyn Bledsoe","text":"I love TRR however, I don’t \/won’t do business with UPS. Nor will I EVER! How can I find out in ADVANCE of a purchase which carrier will be delivering my purchases in The FUTURE? And why on EARTH would you have a customer service Rep named “ Lucifer “? Who assured me that my package will come sooner or later via The Post office WHEN UPS refuses it? Really. I expect much more from myself in the future. The horrid thing is I bought an item that couldn’t be returned for any reason. As soon as I realized the package carrier was UPS. I called customer service.. and basically got the run around from some guy in Namaste Where Ever. TRR I want my purchases in my mail box.","title":"I love TRR however","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=38&stars=1&stars=2&stars=3"}]