[{"date":"2022-03-04","author":"customer","text":"Bracelet has opened up lifting leather from string","title":"Bracelet has opened up lifting leather…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"customer","text":"I was so excited about my LV purchase. I went with the more expensive version of the bag that I wanted because the description said it was in ‘excellent’, ‘superb’ condition. No visible problems. After receiving the bag, I was only able to carry it for less than one week when the strap broke off from the buckle attached to the purse. There is no way to carry the bag now. Upon further inspection, I see that the strap on the other side is also about to rip. It is an obvious problem that should have been noted and reported on their site to potential buyers. Now I am out a LOT of money and having to wait weeks or months for LV to fix the problem at who knows what the cost will be to make this a usable bag again. So disappointed.","title":"I was so excited about my LV purchase","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"Kathleen Hiraga","text":"The Paul Smith jacket reeked of perfume and had spots that looked like food? I have used the RR before and never had a bad experience, but this one was gross.","title":"The Paul Smith jacket reeked of perfume…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"Kiran Akkineni","text":"Hermes box arrived battered and broken. Multi-thousand $ purchase","title":"Hermes box arrived battered and broken","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"customer","text":"I ordered a pair of Tory Burch sunglasses whose condition was stated as \"very good.\" The description only mentioned a slight scratch on the lens. I got the glasses and was so disappointed. The scratch isn't even that noticeable, it is the fact that they were so grimy, dirty, and the company didn't even attempt to clean them up. In addition to that, one arm of the glasses is completely bent, and the Tory Burch logo is supposed to line up perfectly, but since it is bent, it looks distorted. This was my first purchase from the The RealReal and now I know to stay away. If I had this kind of a problem with a pair of sunglasses, who knows what I would run into if I was buying a luxury designer purse.","title":"I ordered a pair of Tory Burch…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"Sevcoop","text":"My issue is with the shipping costs.  My item, a small phone case\/wallet, weighed 7.8 ounces, yet it cost me $12.95 for shipping.  The item itself cost $17.50.  As the item did not fit my phone - my mistake totally -  I returned it.  The RealReal wanted me to pay $11.95 for prepaid shipping, which would then result in the shipping costs being higher than the actual item itself.  Instead, I mailed it myself for $5.40.  While I knew the initial cost to ship it TO me, I was unaware of the cost associated with its return.  All in all, a very unsatisfactory transaction.","title":"Shipping Costs","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"Ellen Williams","text":"Not only were the items not in a quality I would have sold them in but I never received my selling shipping label and for days I was being contacted about a pickup before I even got a label (still don’t have) and then the rep ghosted me","title":"Terrible experience from start to finish","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"customer","text":"I purchased a classic medium balenciaga motorcross bag and with having a few of my own purchased in store  I instantly noticed a huge difference when I received the bag I went to get it authenticated i received a call that the bag was in fact a fake I am extremely upset as this was my fear purchasing from this type of company now I’ve spent $800 and this bag is final sale Im super upset.","title":"Was sold a Fake !","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"Lina Kravitz","text":"terrible my glasses came in some weird case dirty as hell and with a lends cleaner that was also dirty so gross never again very disappointed","title":"terrible my glasses came in some weird…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"Mickey Baker","text":"I was sent a free return label to return an item which you listed stating the wrong color. The boots said brown but we’re in fact black. I returned them and the credit applied was minus $12.95 for shipping. I will never purchase another item from your site. Your customer service is horrible as well.","title":"I was sent a free return label to…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"customer","text":"there should be less expensive shipping to Canada, especially since we pay for duties.","title":"there should be less expensive shipping…","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"customer","text":"I ordered two items. One of them was perfect, the second one was listed under the wrong size, therefore the item I received needed to be returned and I have to pay for the returning label. Since this is due to a company error, I find it unfair that I have to pay for the return.","title":"Listed under wrong size","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"Ha hoang","text":"I like it the quality is good but only couple time I order two pair of shoes A size was not correct One pair I ordered Size 5\/5 but the shoes come in 6\/5 and one more time I ordered size 5\/5 it come size 6 I am not really happy for that that’s why I gave you 3 stars","title":"I like it the quality is good but only…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"Ian Ungstad","text":"Product was defective. The sleeves on my shirt were messed up. You could hardly get your arms in and when you did you were unable to lift your arms up. Garbage. RealReal sells dfectives and\/or counterfeit items.","title":"Product was defective","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"customer","text":"I love everything I got except one pair of the jeans the butt had a patch on one side where they split and been mended back back together and the other side had a hole still. These are completely \nUnwearable..  such a bummer.","title":"I love everything I got except one pair…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"Park","text":"i think therealreal don't inspect the qulity of items at all. i have bought a rlx ralph lauran jacket that they describe very good, Minor discoloration at neckline; minor residue at neckline. but when i unbox, I found big tear. i don't understand how could miss this big tear, and describe very good.\n\nand customer service is terrible.\n\n do not trust this website's describe, and do not buy at this website.\n\nevery item behind expert? a downright lie. this website never inspect items at all.","title":"no inspect item","stars":1,"location":"KR","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"A dissatisfied customer","text":"This company is a scam.  They lie about and misrepresent the items they sell and refuse to refund your money.","title":"This company is a scam","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"customer","text":"I haven't received my order yet and it's been 3 weeks since I ordered. The postal service told me it was sent the slowest possible way. I am still tracking it and hope to receive soon.","title":"I haven't received my order yet and…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"customerpat","text":"Beautiful items but none fit right so had to return them","title":"Beautiful items but none fit right so…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"customer","text":"I am disappointed with this purchase, the shoes \nSalvatore Ferragamo does not work for me because it is size 9 AA, and they do not say that in the description, they only say size 9 for that reason I bought it, in other shoes you clarify when it is A, AA or AAA, I feel cheated .","title":"I am disappointed with this purchase","stars":1,"location":"DO","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=76&stars=1&stars=2&stars=3"}]