[{"date":"2022-03-09","author":"Barb","text":"Very much disappointed - I heard the rave about this site so I joined - yet how I’m let down by many things \nThe cost of shipping is outrageous- other sites comparable is $12-$18 shipping( CAD) as yours being $48 - \nShipping is charged on every transaction throughout a day - new items are uploaded twice a day so in order to get first access to the item you purchase immediately- then layer to do the same which costs a minimum of $100 fir shipping that day - very much feels like a scam \nWhen purchasing, adding item to bag, only have 20 minutes to complete sale before it’s available again- not enough time to continue shopping for other items to add to the order - so your again paying more in shipping to make another purchase or loose items\nThere is no place to see the policies of the site - it’s a trial by error - and hope your not scammed or continually contacting support with which I’d you wait for a response then you’ve again lost your item to someone else \nNotifications are received telling if item on sale yet when put item in bag it’s charging at current price not the sale price - again feels like a scam\nThe first look option is nothing different than not subscribing- there’s no early access to items before everyone else - there’s no updates on items other than the standard 10am\/7pm - again another scam \nEverything about this site continues to cost you $$$$ or not work - it Seems as though it makes the rules as it goes that suits best for the site to get more cash and send the client in circles \nNot impressed at all with this site - the competitors are much more client focused and very easy to shop - this site is overall has much to restructure to be in the running for a “upscale”  business","title":"Very much disappointed","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"I am SO disappointed with my last purchase. I bought this Emilio Pucci dress and right when I opened the package I could tell it was fake! \nI worked for the brand years ago and I love buying vintage pieces.\nAfter inspecting the entire dress I decided to check the CARE TAG which is usually a big indication of authenticity. And I was correct. The care tag CLEARLY states the item was made in CHINA!\nThis is a big disappointment! Specially when your state your items are inspected","title":"I am SO disappointed with my last…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"Ended up paying over $300 more than expected, and their customer service is not helpful at all.","title":"Don’t shop here","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"Lori","text":"Size Medium skirt posted; size Zero sent.  Not a simple mixup as there was only one item available.  Took 1\/2 a day of texting customer service to get a refund, then another to pay for return shipping; and yet another phone call to be reimbursed original shipping.  This was clearly a sloppy mistake by The Real Real, wasted a lot of my time, and I will not use them again.","title":"Incorrect advertising","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"Eexpensive shipping and returns, discount wasn't applicable and later found out no return was available on item, which is frustrating because of the high price items are being consigned at. I would love to be able to buy quality vintage and consigned pieces, but not being able to return items and the prohibitive costs of shipping is difficult to contend with. I doubt I will buy anything again, without first trying on the same items and designers in person which is disappointing and negates the ease and purpose of shopping online.","title":"expensive shipping and returns","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"Customer","text":"Although The Real Real does an excellent job in getting the item sold once it is finally listed, it takes far too long to get to that step. As a \"VIP\" I thought there would be less time to wait but clearly that makes no difference. \n\nCustomer service is quick to reply but nothing changes or speeds anything up afterward. \n\nI have sold many items. I only was (unpleasantly) surprised once when my Versace dress, bought for over a $1,000 was going to be listed at a selling price just over $100. Commission would have been less than $100. I requested my dress to be returned and they did so.","title":"Patience is required","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"I had the worst first time experience buying an item from TRR. I was charged twice, took a while to refund me, the item was returned back to them, refunded on BOTH charges, and was charged for the cost even though it was their error and waited to be refunded for that. I was asked to re-purchase the item again!  The worst part is having to communicate the issue with several customer support on different days whereby having to explain the situation and issues over and over.  Frustrating!!","title":"I had the worst first time experience…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"Sell for too low. Return things all wrinkled saying dirt but there is none.","title":"Sell for too low low","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"Not receive the item","title":"Not receive the item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"Items are continuously described wrong. The pictures aren't clear enough so you have to rely a lot on the measurements and description of item. On top of that, customer service is no good and asking me to pay for shipping the item back when the item was described wrong is terrible. Its a waste of time and a waste of money and frustrating to shop from this site. You get happy at a find just to be disappointed and have to then waste time to set things right.","title":"Items are continuously described wrong","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"customer","text":"It was not made clear that I could not return my item. It did not fit, and my only option is to consign it back through the website. The return policy should be stated with every item. In order to get any money back, I have to participate in the time consuming endeavour of selling it back, which I did not wish to do.","title":"Return Policy Visibility","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"customer","text":"I'm not sure if the listing was incorrect or if I was just sent the wrong item, but I got a jacket that was not the size on the listing I bought, rather a size smaller.","title":"Incorrect Size\/Item","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"customer","text":"The new form of customer service and being unable to get customer service on the phone is causing unacceptable delays and VERY poor service. I’ve discussed with two friends and we all feel the same way.","title":"The new form of customer service and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"customer","text":"Terrible CustomerService","title":"Terrible CustomerService","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"Juliet Blakeslee-Carter","text":"I have been buying from the Real Real for years and never had a bad experience. Unfortunately, I decided to consign 6 items (worth over $1000 USD) and these items have been missing\/in processing for over 4 months. I have emailed, texted, and called customer service multiple times and have never received a satisfactory response regarding the location of my items. I suspect that they have lost these items (based on many similar complaints online).  They have never once offered compensation or explanation. Will never use again.","title":"Poor Consigner Service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"customer","text":"I received a call from my son for the shoes I ordered for him, he received on Sunday 3\/6, the product was damaged and extremely dirty my son was upset it wasn’t the product in the picture, but he kept the product and took them to be fixed, very unsatisfactory and not happy customer will try another product and give one more chance","title":"I received a call from my son for the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"customer","text":"The clothes were faded, and beyond re-selling. I’m surprised they took clothes in that condition for someone else to purchase.","title":"The clothes were faded","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"customer","text":"Received sweater with odor and stain on it which was not mentioned in description. Requested a reasonable discount in form of refund so it could be used toward professional cleaning. Associate offered site credit instead (so one could purchase more low quality\/faulty items and pay for shipping each time? No thanks). Will plan to return item instead but now at a loss for the shipping fee to have it sent to me)","title":"Received sweater with odor and stain on…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"customer","text":"The RealReal guarantees that each item is the authentic brand. When the Kate Spade shoulder bag I ordered arrived I realized that it might not be a real Kate Spade. One of the snaps doesn’t line up when trying to close the purse, which is a poor level of quality you would not find in an authentic designer bag. So I did research on genuine Kate Spade bags, and found a number of examples that the bag I paid for is fake, such as the brand label being a separate metal label that is glued onto the bag instead of the embossed label that is the only way Kate Spade labels their leather bags. I did not know any of this before ordering as I believed the site’s authenticity guarantee. The item is “final sale” which is even worse. I cannot use the bag, since anyone who knows what an actual Kate Spade bag looks like (I didn’t, I trusted the site) will know that I am carrying a fake bag. Very very upsetting that a site that in its very name guarantees that designer items are the genuine brand is selling fake merchandise. I have ordered a number of things before and have really enjoyed them; I don’t know if this was a fluke but if it can happen I once it is really hard to be confident in the guarantee.","title":"Bag was not authentic","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"customer","text":"The appraised prices are low. Also, when addressed I was promised that it would be looked into and fixed but nothing ever happened. Also some items commission percentages are not what is promised.","title":"The appraised prices are low","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=70&stars=1&stars=2&stars=3"}]