[{"date":"2022-03-20","author":"Nancy","text":"The item looked very old","title":"Old item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Jan","text":"I received the wrong item. Now I have to go through the difficult process of returning it. First time ordering from this site and definitely the last.\n\nThe one good thing is that customer service was very helpful but so disappointing and annoying to have received the wrong item.","title":"I received the wrong item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"customer","text":"I ordered a two piece suit and only received the pants. I contacted customer service and no one has responded. I’m going to have to just process a return, will probably end up paying shipping costs both ways, and for nothing. What a rip off!","title":"What a rip off!","stars":1,"location":"OM","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Randi Millman-Brown","text":"Ordering was easy but the size of the item was not accurate- the shoulder bag was smaller than I thought. Also, the bag had items left in it by the previous owner.","title":"Ok but not great","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"customer","text":"I ordered a purse that I was very excited about, but when it arrived I was very disappointed. The purse was very cheaply made and a obvious knock off. The site states that they have experts that review authenticity but in this case this $900 purse was made of patent leather had plastic straps and burlap on the inside. The original purse was leather with gold metal straps and leather on the inside. The shade was not even available by that designer that they sent me. Even though the sites says all sales are final they did refund me my money for the fake purse. I actually took it back to the store to get the refund and they did have real purses in the store, they just didn’t send me one.","title":"Fake purse","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Miriam","text":"Some flaws details weren’t mentioned… disappointed","title":"Some flaws details weren’t mentioned……","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"customer","text":"I paid a lot of money for a damaged item and the damage was not listed in the description of the item. All I was offered for compensation was a temporary 15.00 credit.","title":"I paid a lot of money for a damaged…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"customer","text":"The item was described as being in \"excellent\" condition, but I would describe it as in being \"good\" condition. The shirt has obviously been worn and washed several times and the shirt is pilling. Very disappointing.","title":"Inaccurate condition description","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Renee","text":"I was sent the wrong item. I sent an email with pictures and also called customer service then finally reached someone via text. It turns out that the top I ordered was no longer available. Why would TRR decide to send me a similar top instead of notifying me that the one I ordered was not available? It was the same brand, color and fabric but a different style. I’m not sure if the email and text responses are automated, but it stated that they were sorry that my order didn't meet my expectations…well…I did expect I would receive the top I ordered, not one that resembled it.\nConclusion: after taking photos, emailing, calling, texting, printing a return label, packing, driving to UPS, I get a notification for my credit MINUS shipping\/handling. I’m back on the phone to customer service to explain the whole thing again and why I should not be charged for a return due to an error by TRR. I finally got it resolved but what a waste of time and effort to end up with nothing. Finally, I would like to believe that receiving the wrong shirt was an honest mistake, but what bothers me is that the one I ordered was NOT available, so it’s not the case of someone accidentally packing a similar shirt. Maybe they thought it was close enough and I wouldn't notice?","title":"Similar but Different","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"customer","text":"I paid for gift packaging for this gift and it didn't arrived gift wrapped. Please honor services when you have rec'd the funds during check-out to do so.","title":"I paid for gift packaging for this gift…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Campbell","text":"The selection and prices are good, but the size of the item I bought had been incorrectly entered on the website. The shoes were a 'Narrow' fitting and hence too tight. Took me ages to get customer service to waive the return postage. Additionally, I was unable to recoup the $25 introductory discount, which I had used to purchase them.","title":"Not an encouraging first experience","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Frugal Jane","text":"There is no doubt the selection is one if the best and pricing most of the time is in line with used products. I have noticed a lack of full disclosure on damage which is disappointing especially if it is not returnable.","title":"Great Inventory and\/but…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"customer","text":"Consignment takes a very long time. My items have been there now 2 months and are just being posted. I don’t know that consigning with them was the best idea.","title":"Consignment takes a very long time","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"customer","text":"Product purchased was an elaborately embellished dress with large sequins, whoever shipped the item did so incorrectly. The highly fragile dress was placed in a garment bag ( great ) and then incorrectly put in a large box with no packing cushioning.  The results were the dress was smacking all over inside the box on its way across the country to me and no surprise arrived badly damaged- large amount of sequins ripped off the dress and lay in the bottom of the garment bag along with a large amount of the sequins that are still on a dress are barley hanging on. Such an insult to Prabal Gurung and his teams beautiful work. It’s final sale so I can’t return it.","title":"Terrible packaging","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Laurie MacDonald","text":"My purchase had mold on the tassel and smells of musty mold.","title":"My purchase had mold on the tassel and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"T. Roy","text":"Advertised as new without tags in excellent condition, but the scarf has food stains in the silk. Great first (and last) experience with this site.","title":"Not a new scarf","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"customer","text":"Package never arrived","title":"Package never arrived","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"customer","text":"Two of the products that I bought were not good for wearing. Even that it was saying very good in the condition.","title":"Two of the products that I bought were…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Marcela ","text":"I was very disappointed that my scarf was rated as “excellent” and yet when I received it it had multiple stains on it. There was no mention of this in the description. It was my first purchase from the site but now I feel as though I can’t really trust it.","title":"I was very disappointed that my scarf…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"customer","text":"I was really disappointed that the shoes I purchased were labeled as the wrong size. I feel like this is the simplest thing to oversee. Unfortunately, I was planning on wearing them for my wedding and will not be able to do so. I do appreciate being able to return them, however do not see why I should loose money on shipping when the item was clearly mislabeled.","title":"Mislabeling","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=59&stars=1&stars=2&stars=3"}]