[{"date":"2022-02-19","author":"Coreen","text":"I recently purchased a Chanel bag, it came with no serial number and no authentication card. When I reached out to the company they told me it had been authenticated. I have been trying to reach them for proof that this bag is authentic, but nobody has gotten back to me.","title":"I recently purchased a Chanel bag","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-19","author":"customer","text":"Customer Service has not replied to me","title":"Customer Service has not replied to me","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-19","author":"Joshua Gallo","text":"there was an issue with my pants not being delivered as advertised and the need for a return. the conversation with the representative lasted around 30 minutes with a lot of pushback.","title":"there was an issue with my pants not…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-19","author":"A.Cullinan","text":"The article I ordered was not real leather but a fake. It is in returns process.","title":"Fake leather","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-19","author":"customer","text":"Terrible no refund after returning $200 item!","title":"Bad no refund after 1 yr","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-19","author":"customer","text":"The item I received is far more damaged than lead to believe. The straps are nearly torn off on both sides. I am not sure I would want to purchase again.","title":"The item I received is far more damaged…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-19","author":"brytteldredge","text":"The two items I ordered did not work out. One was far too big abs the other missing a piece which was not mentioned in the description. The return process was very simple, abs I would definitely order from TRR again in the future;however, I do plan to only order things that can be returned. It's the nature of consignment shopping that things may not be as expected. I'm pleased with TRR.","title":"Easy returns","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"A dissatisfied customer","text":"This company is a scam. They misrepresented the Chanel handbag they sold me and refuse to give back my money. Run, don’t walk, away from them.","title":"This company is a scam","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"customer","text":"Products—when you get what you actually purchased—are at a decent price. It ends there. Customer service and administration and review\/oversight of products is horrendous. Corrections are NEVER made to erroneous postings (completely incorrect sizes reposted for sale with no correction after returns and in two cases for me completely incorrect item posted) causing other customers to keep purchasing the same incorrect item over and over again, forcing the person who initially consigned the item to get a price on a heavily discounted item because no one will buy it and it can’t sell. This hasn’t happened just once. It happens in no less than 30-40% of my transactions. And there is Never an apology for the repeated inconvenience let alone an offer for a discount or discounted shipping for the aggrieved customer by customer service. I have complained countless time about this problem and it never changes, so why do you keep bothering with these surveys?? You don’t really care about customer satisfaction so why the pretense?","title":"Poor oversight and review of posted and returned items","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"customer","text":"What you sent as Hermes ... is not REAL Hermes.  Hermes does not make their shoes in Italy,  with unworn soles.  It is new product with a tilde over the Hermes name... REAL Hermes uses a bar the second e. FAKE... new with a minor scuff and not real.","title":"Not REAL","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"A very disappointed customer","text":"The Michael Kors handbag I purchased was NOT in excellent condition. Besides wear condition mentioned, leather was peeling on the front-side of the bag and the gold plated hardware was worn-down to silver on the rings. I will NEVER purchase from The RealReal again. Suggest that The RealReal show defect photos of the item to illustrate the actual condition; but they do not.","title":"The Michael Kors handbag I purchased…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"CD","text":"I sent TheRealReal a LV handbag valued at $2,900 for consignment on 12\/27\/21. They received it on 1\/2\/22. After waiting almost 2 months, the bag was never marketed on their site. It was authenticated & given a price but never went live on the site. I finally requested a return on 2\/5\/22, and it's been 3 weeks and they still haven't returned my valuable handbag. I'm considered legal action.","title":"I sent TheRealReal a LV handbag valued…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"customer","text":"What looked like the world's best black suede boots on your web site were described as being a size 37, which would have been perfect.  When they arrived, they were clearly marked a size 6 and were just too tight.  I was so incredibly disappointed!  And now I am consigning them back on the RealReal site and highly recommend the boots to anyone who is truly a size 6.  It was such a disappointment to find out that they had been wrongly depicted and someone had clearly intended to mislead customers.","title":"What looked like the world's best black…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"Kiki Atfb","text":"Wrong description on items. We can’t try on or touch can only buying by look at the description it’s very important.  How can you put size 6 to size 9 and not returnable.","title":"Wrong description on items","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"Nicole Whom","text":"Take too much percentage of commission","title":"Take too much percentage of commission","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"customer","text":"Dress I ordered was supposed to come with a full\nSlip. This is how it was designed by Oscar de la Renta. It is a gold crocheted gown and without the slip it’s nothing more than a beach cover-up. Completely see-through. In addition the dress was not looked over carefully enough because in one area, the crochet was broken and created a hole.\nI saw this immediately and it should’ve been caught by whoever except these clothes and rates their condition. The dress was made many years ago, and considering it was not complete and slightly damaged the price never should’ve been $1900. Needless to say it will be returned. In the future I feel I can only Purchase tag on garments from you","title":"Condition not as reported. Missing and undergarment that was supposed to come with it","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"customer","text":"There was a red hair clip in the bag. Completely gross.","title":"There was a red hair clip in the bag","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"customer","text":"Wrong brand name on one item. Since the purpose of the site is to buy brand name items, this is a pretty big issue. The description of the condition was incorrect on multiple items and there were two very worn items that I would have never purchased in that condition. Two great items but the rest were very disappointing and are worthless but I'm stuck because they were on sale. Over $1000 of wasted money out of the $1700+ spent.","title":"Wrong brand name and other issues","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"Angelique Pinault","text":"I have mostly had good experiences with this company, but recently they sent an item that was covered in stains. I requested a $20 refund just so I could get the item dry cleaned. They only offered a $15 site credit which I declined. The representative offered to let me return the item,  but said that I would not be refunded the original shipping. At that point I had to call a representative since they only offer a chat online. I have returned the item and I am waiting to see if they will in fact refund the original shipping cost.","title":"I have mostly had good experiences with…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"customer","text":"photos of your products are misleading, also whether or not an item is returnable should be WAY more visible because that is also misleading and now I'm stuck with a purchase I hate","title":"photos of your products are misleading","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=87&stars=1&stars=2&stars=3"}]