[{"date":"2022-04-14","author":"customer","text":"Honestly I’m so shocked I had to absorb how bad that was… was a whole saga to get this bag and I wish I could return it my now.\nWas trying to get more info on it so I contacted therealreal and they were real vague. Couldn’t tell me country of origin…\nBought the bag anyway hoping for the best as it looked in pretty good condition. Again what a mess. Never got a shipping email and then I go to check my account about 4 or 5 days later because I was curious and it had already shipped and was due to arrive in a day or 2.\nUSPS leaves it in a puddle never rings the bell and when I see it has arrived I go get it box is SMASHED… and even better the bag only has a dust bag no wrapping or protection of any kind. Heck it wasn’t even stuffed so it got banged around and was flat as a pancake. What a horrible experience. I open it to make sure it’s not wet and it’s way dirtier than the picture and the inside smells like a grandma spilled her whole bottle of cheap perfume in it. I was so upset I cried put it in a corner and can’t even look at it I’m so mad and upset. Feels like a bag I was so excited for is tainted by such a garbage experience. I would never shop here again.\n\n***edit I called therealreal and they have let me return it free shipping because of my bad experience which I am very grateful for","title":"Returning…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"Customer","text":"The fact that there is a high shipping cost AND a ridiculous and high return cost is unnecessary. Other thrift websites like ThredUp don't have expenses this high and even offer free shipping when you spend a certain amount and offer ways to waive the very low return fee. Given how much more money your items sell for, it's definitely unnecessary.\n\nI want to do better for the planet and thrift, but when you're selling used products you need to make it more worthwhile compared to going to buy them new.","title":"More Money Than It's Worth.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"customer","text":"Good service, wish shipping was free and there needs to be more images of the product","title":"Good service","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Juanita Patton","text":"I purchased a pair of Chanel red patent leather shoes that were listed as 8-1\/2. When they arrived (4\/6\/2022), they were size 6-1\/2. I returned them the same day via a label provided by trr. They were received by trr (4\/8\/2022) that Friday and confirmed via email that day and another of the same on 4\/11\/2022. I was told by your outsourced team, that because it’s an Chanel purchase, it would have to be authenticated which would be up to 14 days before I would receive credit back to my method of payment. I asked if I could speak with a supervisor (not her fault) in the USA, I was told they could not transfer, but that they would send a text for someone to call. That never happened. It’s only after I went to social media did I get my refund. I sent back another Chanel purchase due to this frustrating debacle and vowed to never do business with trr again.","title":"I purchased a pair of Chanel red patent…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"LOU","text":"The Burberry bag did not disclosed that one of the snaps was broken. There was no refund or exchange so I couldn’t reach out to customer service. I think the inspection process should have been more thorough and performed before the bag is shipped","title":"The Burberry bag did not disclosed that…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Reyna  Castillo ","text":"My package was open when i got it and my purse was very dusty","title":"My package was open when i got it and…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Christine DIGGELMANN","text":"Unfortunately the scarf has more stains than described","title":"Unfortunately the scarf has more stains…","stars":3,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Renate Tucker","text":"Person from RR promised to apply $25 credit--did not.  Alsp 30 percent was advertised on TV and she said that was no longer good--bait and switch.\nI wrote the head of the company and said that RR was not as responisve as they were years ago.  Did not even bother to reply.\nThat says it all.","title":"Real Real not the company it was years ago!","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"customer","text":"I bought a case on April 8, I asked for it on April 11, April 12 by mail and chat and you tell that you will ship as soon as possible and apologize for the delate. But on April 13, you tell me that my order was canceled. When I ask again you tell me that you have an “inventory problem” and no hay inventory. When I ask to solve the problem you tell me that I can call If I what, I ask for the manager and you never answer. \nThe problem is not only that I lose the item, I also lose $200 because I have already sold. I really upset, because I thought you were a serious enterprise.","title":"“Inventory problem “","stars":1,"location":"GT","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"customer","text":"The listing described the item as new with tags. The item did not contain a tag and the stitching around the zipper is open and needs to be repaired.","title":"The listing described the item as new…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"A. Andrew","text":"size filter is unreliable. Colors on clear on screen. But fine.","title":"Colors and size filter unreliable","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Rebecca Alfaro","text":"I purchased what was described as a Michael Kors crossbody bag from the real real last month. When I received it it turned out to be a belt bag which you wear around your waist. I went online to attempt to return it and the only way they will take it back is if I reconsign it, they receive additional commissions and i recieve a partial refund. I find this dishonest and highly unethical and would be very happy to discuss this with someone from the company if there was a way to contact them. I highly suggest you steer clear of this company!","title":"Incorrect description","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"customer","text":"The glass carafe was broken when package opened","title":"The glass carafe was broken when…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"customer","text":"The product I purchased was as advertised (minus a few spots that I was able to remove) and shipped quickly.  When the item arrived, I found an obviously used KN95 mask and screws\/bolts in the pocket.  I was surprised that this wasn't found by RealReal.  When I reached out to customer service, the response down-played the potential health risk.  The lack of concern on this issue gives me pause about doing business again.","title":"The product I purchased was as…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Zara","text":"The item arrived damaged . Please contact me as soon as possible. \n781-929-6630","title":"The item arrived damaged","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Alexus Lacy","text":"I don't feel that the bracelet I ordered was worth the $60 I paid...it's  too small and cheap looking.","title":"Not the bracelet I thought I was getting!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"customer","text":"It will be returned.  From the description I thought that I was ordered a youth size\n12.  This shirt is size 12 months.","title":"Disappointed","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Chiara","text":"Bought a $3000 + LV luggage piece. I received it locked with no keys!!!! Contacted customer service and was told to expect the keys couriered immediately.  Still waiting.......and shortly boarding a plane within minutes, with no newly purchased LV luggage!!!!!!!","title":"Disheartened, diisappointed and departing....","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Diane Pierno","text":"I really like the reuse concept but paying high Delivery fees AND long delivery timelines makes me want to shop elsewhere.\nAnd deliveries BTW 10:20 pm? High risk of theft … \nLast year I sent a LV bag in NOV  finally got it back in April! It never listed","title":"I really like the reuse concept but…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"customer","text":"my clothes are not selling","title":"my clothes are not selling","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=31&stars=1&stars=2&stars=3"}]