[{"date":"2022-02-15","author":"customer","text":"Slow response time from customer service","title":"Slow response time from customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"Sara Robinson","text":"It was used looking, dirty, had a gash in the leather on the closure… I mean it wasn’t the worst but I’ll never buy from the real real again. When they say something looks new, it should look new this looked used and worn.","title":"It was used looking","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"customer","text":"The dress I purchased looked just as good as the description that was posted! The only thing I would say that I was unhappy about was I was charged a shipping fee that was over $10 and the package took 7 days to get delivered","title":"The shipping fee","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"Haley Champion","text":"I received my dress is a very timely manner and in perfect condition. \n\nHowever, the photo online made it look more of a midcalf length dress and when I put it on it grazes the top of my ankles. I'm 5'5\" and traditionally a size 4, so for this to be the case was a little surprising to me. Due to the layers on the dress it doesn't make sense financially to have it altered. It's also final sale so now I have a dress that doesn't work :(","title":"Dress wasn't modeled accurately","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"customer","text":"I purchased a Chanel purse for my wife...the purse was not cleaned and had stains on it also was balled up in the packaging. Not what I expected.  But you get what you pay for I guess.","title":"I purchased a Chanel purse for my…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"customer","text":"Please specify if a shoe width is extra wide or extra narrow. Standard sizes as listed should be normal or medium width. I was sent a ridiculously narrow pair of shoes that cannot be worn because it was final sale and cannot be returned. This was deliberately omitted in the size information, photographs and product description. This is not good practice.","title":"Please specify if a shoe width is extra…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"customer","text":"I really wish the shipping\/return costs were lower. It’s very high","title":"I really wish the shipping\/return costs…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"customer","text":"I wasn’t aware that I had to pay customs. In the checkout I did not see anywhere that customs was my responsibility, only in the confirmation email AFTER I had made the purchase. I paid 3.3kAUD and then had to pay another 400AUD for customs. Will not be ordering again","title":"I wasn’t aware that I had to pay customs","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"customer","text":"TRR has lost numerous parcels I’ve mailed in as well as failed to return rejected items. How can I trust a company that does not take care of my personal items?","title":"TRR has lost numerous parcels","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"customer","text":"Decent price but they had an item that they listed as grade-0, ie like-new, and it had significant and obvious cosmetic and structural damage.  Terribly disappointed.","title":"Ignoring item defects!","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"John Penta","text":"Chatted and I never got an answer you guys or sell high-end shoes like Louis Vuitton and you put the size 11 but you don’t put LV 11 US 11 so I have no idea what size shoe is and I couldn’t get a straight answer from any of staff so sad","title":"Chatted and I never got an answer you…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"customer","text":"When I received my jacket it was dirty (hairs, crumbs in the pockets, etc.) also the butterfly zipper was broken.","title":"Broken and Dirty.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"customer","text":"This was the worst purchase I have ever made. I understand the merchandise is used but my packaging was beyond awful. If I’m spending over a thousand dollars with your company I expect it not to look like someone threw the LV bag in a 99 cent Real Real microfiber bag. I felt like I bought something off of eBay and was shocked. I will never purchase a used item from this company again became the whole experience felt discarded and like I was getting someone’s hand me downs thrown into a bag for thousands of dollars.","title":"This was the worst purchase I have ever…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-16","author":"Susan CALNE","text":"I bought a ‘ final sale’ Bottega’ woven purse. The photographs and the description were acceptable and flaws mostly able to be  cleaned up, polished etc.\nWhen it arrived one of the woven strips of leather was cut right through close to a side seam. When I enlarged the photo part of it was visible.\nWhere is the phone number? Chat line Agent  didn’t understand my problem ‘ final sale’ final sale’ . I asked to be transferred to someone senior. That took even longer with someone who appeared to be reading from a script and needed to be reminded of Customer Service.  Make sure there are enough detailed photos.Enlarge them all; don’t rely on the ‘expert’The ‘expert’ who ‘curated’ this piece provided a less than accurate description’. I have returned it with tracking. It remains to be seen whether this postage is refunded. It should be for an item not as described.","title":"Not as described Final sale Returned with hard work!","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-16","author":"Amanda","text":"I ordered a handbag which was final sale only (which so many of their items are). I felt like the color was wildly misrepresented. Both on my phone and computer screen, it looked like a beautiful soft pink, the purse I received was neon pink. The description of the purse was \"pink\" I guess they left a lot of room for interpretation. I don't understand why they couldn't just disclose \"hot pink\". This definitely made me lose trust so I don't know if I would buy from them again.","title":"Color Inaccuracy","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-16","author":"Richie Sater","text":"This company quoted us for a fur coat at over 1000 dollar sell price then proceeded to change the price and sell it for only 300 without telling us.  They took a 50% commission on top of that.  When asked about how they could do this they mentioned some hidden term in the contract.  Do not trust and do not consign.","title":"Do Not Consign, VERY DISHONEST COMPANY!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-16","author":"customer","text":"Ordered a size Large as indicated on the item as well as invoice, however the jacket that came was an Xtra Small.  \nFirst time customer too and unfortunately will not be returning.","title":"Ordered a size Large as indicated on…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-16","author":"Christa","text":"The shoes I ordered were at least one to two sizes smaller than what it says on the shoes, which means they run way small (no mention on site) and I had to pay for shipping twice. They also were more worn than they look online. I received a return label and amount of store credit and sent the package off in time. The website now states order not returnable... so I'm left wondering if I get at least some of my money back?","title":"No mention this brand runs way small and more worn than advertised","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-16","author":"Jacques","text":"Seamless delivery and perfect fit. For non-US deliveries however, why aren’t the duties not being billed immediately at the purchase? This makes returns virtually impossible and may refrain me from buying anything else on TRR despite the overall excellent experience otherwise.","title":"Purchase & delivery top - import duty billing is a problem though","stars":3,"location":"LU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"},{"date":"2022-02-16","author":"customer","text":"We were very positive about the experience at first, but after using the bag twice as a student with only carrying a apple laptop in it - I have to admit this is really disappointing.  I would like to understand your refund policy?  I would also like to post photo's so that you can see that we are telling the truth - not seeing the functionality to do so.\n\nThanks\nMalena","title":"Bad quality","stars":1,"location":"ZA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=90&stars=1&stars=2&stars=3"}]