[{"date":"2022-05-06","author":"MB","text":"Ordered Celine sunglasses. Within 12 hours they were significantly less expensive. It was pulling teeth to get the discount. They were shipped and stolen before being delivered. I had to file a claim through UPS. The entire experience was awful and I never got any sunglasses.","title":"Ordered Celine sunglasses","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"The service is good but the jacket I received smelled which turned me off. Now I have to decide whether to return it or wash it or dry clean\nIt is my first time and I didn’t know what to expect \n\nThank you","title":"The service is good but the jacket I…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"Size guide wrong which made me buy a pair of shoes that were not my size. But since i a abroad I can’t even make a return because I would pay taxes for it","title":"Size guide wrong which made me buy a…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"item did not ship.","title":"item did not ship.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"My order took over three weeks to arrive after 3 phone calls. I was refunded the shipping charges, but the experience was very frustrating. The articles I bought were very nice, but I’m not sure it was worth the aggravation.","title":"My order took over three weeks to…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"Dissapointed","text":"I had consigned a number of expensive designer items just to learn that half were priced wrong and mislabeled. They were sold like that getting me less than 15% of actual value. Dealing with consignor relations afterward has been a nightmare. And I have mot received any money to date","title":"I had consigned a number of expensive…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"Nancy","text":"My experience has been hit or miss. The last two orders were exceptionally poor. I ordered a pair of earrings which arrived with bent posts and in less than described condition. Yesterday I received a Louis Vuitton bag that only mentioned faint scratches on the hardware. They priced it nearly $500 above retail but being a discontinued bag I was willing to pay the premium. It has much more wear than described including a large stain on the leather strap. It was cleverly hidden in the photos. The icing on the cake was that they sent it with no signature required. I am fortunate enough to live in a building with a concierge who accepts all packages. As I paid nearly $2k it gives me pause. It’s likely this will be my last purchase.","title":"My experience has been hit or miss","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"Mistakes happen, so I  wasn’t angry about the error in the listing. My grievances are with the process of returning the item. I was told that I was responsible for shipping and I had to send proof of the error in the listing (photos of the shoe size)\nI was only offered a full refund, after I insisted on full reimbursement.","title":"Return Process","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"All my consignments are sold for few dollars","title":"All my consignments are sold for few…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"The bag I got is in real real bad condition. Also, way way way too many emails.","title":"The bag I got is in real real bad…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"Sold me a pair of shoes that had 2 different sizes in the box and I had to pay to return them. Returns should be free always. Doubtful I’ll shop here anymore.","title":"Sold me a pair of shoes that had 2…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"Order dispatched in parts with only one tracking code received. No news of my order in weeks.","title":"Very disappointing","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"Your customer service is not good.","title":"Your customer service is not good.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"My first order of sunglasses was canceled- so I purchased another pair and they were not in wearable condition. 2 orders 3-week wait time and $11.95 to send back an item that was not close to the condition described. Huge disappointment.","title":"My first order of sunglasses was…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"I was sent the wrong product and when I contacted customer service she answered no question and told me someone would contact me about it and I haven’t heard anything back.","title":"I was sent the wrong product","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"Natalya Babiy","text":"I bought a expensive Chanel classic flap and they described it as excellent. No signs of wear. When I got it , there was scratches inside and outside . And the hardware was sooooooooooo scratched up in the FRONT! Also, there was a no return policy on that…. When I emailed them, they ghosted me….","title":"Lied about condition of item, & no returns allowed","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"RH","text":"Your description are lacking and your pictures lack contrast and detail especially on black clothing. It is hard to see important things like what king of waist band and details of clothing. Have purchased items with details I don't like multiple times, even after attempting to zoom into pictures. You need to adjust contrast on black clothing","title":"Your description are lacking and your…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"Products should be cleaned before they are sold. Every time I've purchased an item I had to take it to have it cleaned - bags + sunglasses, everything. I love the items but they should be cleaned before selling!","title":"Products should be cleaned before they…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"DocOlie Magno","text":"Quite disappointed with the Chanel bag I purchased. It was described as in very good condition with minor marks and discoloration. Discoloration is not minor . If it was shown in the picture I wouldn’t have bought it. Also the dust bag is too small , it was not for that particular bag.","title":"Quite disappointed with the Chanel bag…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"Vivian ","text":"Shoes arrived not in a box but instead wrapped in tissue paper and in a plastic bag so they were slightly damaged.. Disappointing..","title":"Disappointed","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=4&stars=1&stars=2&stars=3"}]