[{"date":"2022-04-28","author":"New Customer","text":"I did not get a response from customer service. \nI will not mention why I needed customer service.","title":"No customer service response","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Ann","text":"Worst costumer service I have ever experienced. Trying to return my package IN TIME FOR FULL REFUND, but no one is helping me. It’s not the first time it happens","title":"Worst costumer service I have ever…","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Bfb Fit","text":"Final sale item. Photo did not represent item well. Also why am I paying shipping fees when none of the other preloved resellers charge this. Won’t be using TRR again - that’s for sure!","title":"Final sale item - photos did not represent item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"customer","text":"I have asked repeatedly about items i am selling. No response. \n\nI was asked to okay pricing on one item...you've had all items since 3\/30\/22. \n\nI asked for a picture since i have several rings and no response. \n\ni am not going to okay any price without a picture accompanying it. \n\nThe process has changed in a bad way since last year.","title":"I have asked repeatedly about items i…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Ginger","text":"I like the ease of the app, the selection of products, and the prices seem fair. This was my first time ordering from The RealReal and I was a little surprised to find that the bag I purchased did not come cleaned. There was a skittle stuck to the bottom of the liner of the purse and in the side pocket there was an old lip liner pen and an anal plug! I was a little shocked to find a sex toy in my new bag. It made me question whether the bag was really inspected and authenticated properly.","title":"Surprise Contents in my new Bag","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Maria Myron","text":"Ordered Chanel sandals with box. Shoes arrived without box or receipt. Customer support says they will contact warehouse and send box. That was 5 days. No response","title":"Ordered Chanel sandals with box","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"LorLor","text":"The  Jean Paul Gaultier top and pants I received are in great condition.  However, I ordered a pant size XS US2 but I received a size 4.","title":"The  Jean Paul Gaultier top and pants I…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"customer","text":"Disappointed in my purse. It is a vintage JL clutch that was categorized as excellent. It was missing several crystals in the decorative trim. TRR was excellent and took it back with photos showing the flaws even though it was not a returnable item. I was very disappointed as I wanted it for a special event and no time to buy\/ship something else, now no matching clutch for me, but if that is my only complaint I’m a lucky lady.","title":"Disappointed in my purse","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"customer","text":"Item described as black but gray figurine as shipped. Seeking return and refund.","title":"Item described as black but gray…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"customer","text":"Both items were in worse condition than indicated in the condition description and the way they were depicted in the pictures. Disappointed.","title":"Worse condition than indicated","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"customer","text":"I didn't realize that one of the items wasn't returnable. It's not in \"very good\" condition and so that is upsetting. And my only option is to consign it again and maybe make 30-50%? I'll never buy anything on here again.","title":"Not in \"very good\" condition!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Janetta K","text":"Chats are open for long time \nHard to get hold of someone. Items are Discounted within the first two weeks. \nEx J Mendel New Bolero Weather for Treme retail 1500 was sold at $56 -20% and I get 30% was not worth it","title":"Chats are open for long time","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"customer","text":"Not sure why it took so long to ship","title":"shipping","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"customer","text":"My bag arrived in a very timely matter but definitely was not in the “very good” condition that was promised. The bag was supposed to show only minor areas of wear. There are several large stains including on the leather which were left out of pictures. Also the bag is covered both inside and all over the dust cover with what I can only assume is animal hair and the bag smells so terrible I cannot keep it in my room. Every time I walk in to the room that it is kept in I am overcome with the awful smell. I am so disappointed. In dealing with your company in the past I expected higher standards than this.","title":"My bag arrived in a very timely matter…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Nalardin","text":"I ordered 2 items, one was mailed the other one still says processing and it's been 2 weeks. The worst part is i have emailed asking whats going on and haven't heard anything back. Poor customer service!!!","title":"I ordered 2 items","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Name","text":"I did not order anything from TheRealReal, but my email address was used to do so. I asked for the order to be cancelled and this to be investigated, I got an automated response saying they'd be in touch in office hours and never heard anything again, other than a password reset which did not help that my email was attached to an account incorrectly.","title":"I did not order anything from…","stars":1,"location":"IN","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"customer","text":"It looks good, but the problem is the smell. its smell like a clothes some my grandmas closet.","title":"It looks good","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"Steve","text":"Package was totally damaged with giant holes in the box.","title":"Package was totally damaged with giant…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"Dominique","text":"Difficult to shop unless you know exactly what piece you want, otherwise you could be stuck searching through thousands of items endlessly. Would be great to be able to search more curated collections or filter by style in some way. \n\n$11.95 delivery charge is antequated, not to mention paying for return shipping if the item is not a good fit. I often hold off on ordering simpy to avoid buying from trr simply because i could be out $20 just on shipping if an item doesnt fit. Last I checked, return window was also extremely short. I'm a single mom with a full time job, we need extra time to get things done.","title":"Difficult to shop.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"S K","text":"As a consignor of Cartier and Van Cleef and Arpels I am really appalled at how sloppy TRR is getting. I sent in my brand new Cartier love bracelet in January. They mislabeled it as generic.  It took 4 months for them to confirm that it was Cartier, not generic. Then they took a picture of my bracelet where the shadow made my bracelet look damaged, so no one is buying it. They want to re-photograph the bracelet now, which will delay listing my bracelet for another month...bringing it to 6 months that I've waited. The RealReal is becoming sloppy and careless.  I could have been paid in one week from Fashionphile,  but I got greedy thinking I could make $100 more at TRR and it has been a fkg nightmare dealing with them. Never again.","title":"As a consignor of Cartier and Van Cleef…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=14&stars=1&stars=2&stars=3"}]