[{"date":"2022-03-26","author":"Recent purchaser","text":"The garment was advertised as Max Mara but was actually Weekend Max Mara which is their less expensive line.  False advertising really.  Not sure how to solve this in the future since you can’t ask questions.  Aside from that, the product shipped quickly.","title":"The garment was advertised as Max Mara…","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"customer","text":"Representative would promise you anything just to get you off the phone. \nThey sent back a pair of jeans that I consigned because they said it was damaged. It wasn’t damaged when I sent it in! I even sent them pictures to show the tearing was not there before. They promised on the phone to give me $100 site credit for the issue. They lied and when I contacted them again, there are no notes in that regard! I won’t trust this company again.","title":"The Real Real is not trustworthy","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"customer","text":"Do not buy there. They sent the wrong item in a final sale (I got a wedding dress instead of a casual slip dress?) and a pair of supposedly high quality  Tod's mules literally disintegrated after a couple of steps of wearing them outside. We'll have to see if they will refund me for the shoes, but I am disappointed with my experience.","title":"Do not buy there","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"customer","text":"My packages have been going back and never get delivered anymore. No matter how I order. It’s so strange","title":"My packages have been going back and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"Karen Louie","text":"The pin part of the brooch was bent making it difficult to fully open the piece to put on clothing. That damage was not listed in the description.","title":"The pin part of the brooch was bent…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"customer","text":"I got the item quickly, but it was marked as “like new” and was actually missing a snap…","title":"I got the item quickly, but…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-27","author":"customer","text":"I asked a question on my order via the site. It appeared the email didn’t get sent so I pressed the send button multiple times. The email is hanging there so I had to restart my phone.","title":"I asked a question on my order via the…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-27","author":"Saundra Shively","text":"The quality of merchandise is suspect. I don't think it's real leather, as it was advertised, and there was no mention of no return policy before I purchased the purse. I will warn anyone who may be thinking about buying from this company to go somewhere else.","title":"The quality of merchandise is suspect","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-27","author":"wrong sizing","text":"this is the 4 time I have had shoes marked with wrong size and then have to pay to\nreturn for mistakes on your end.","title":"this is the 4 time I have had shoes…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-27","author":"customer","text":"Bought a $2000.00+ handbag and received in a beat up box with no packing material . Also no signature was required. Was left out on front porch. I buy lots of expensive handbags and have never had them delivered like this. Especially when I pay for shipping. Don’t know if I would buy from you again . Thanks","title":"Bought a $2000.00+ handbag and received…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-27","author":"Disappointed","text":"I was very disappointed with the item I received. This bracelet was clearly dead stock, I should have known because TRR had several available for sale, this was a defective non functional piece of expensive jewelry. The bracelet could not fasten properly. The return process online Was relatively easy, now to see if I am actually refunded will impact my overall experience.","title":"Dead stock","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-27","author":"customerTony","text":"I receive texts with some regularity offering $45 off on my next purchase, however when going to pay there was no way to use the $45 coupon.","title":"I receive texts with some regularity…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-27","author":"C M Gooden","text":"Received order on time, but order was incomplete. Ordered and charged for a gift box that was not received with the scarf. When I called to inquire about the missing gift box, I was given the runaround and on the phone for over 25 minutes mostly on hold. I was finally told that I would be contacted by email in 24 to 48 hours. It has been over 48 hours and I received no email. The scarf was a gift and the right box for presentation is important. As I was charged for it, I don’t know why they would not simply send it. For an upscale product, one expects competent service.","title":"Order not complete","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-27","author":"Marie Eisenmann","text":"I ordered a Judith Lieber bag described to be in very good condition.  Minor exterier wear.  When I received the purse, it was shipped and packed well.  However it has a largish hole in the leather.  This was not shown in the pictures or disclosed although if I look at the pics now I can see the hole (the angle of the pic makes it hard)  \n\nThe purse is currently at a leather shop being repaired (the best they can do is patch the hole)\n\nMy issue is the hole should have been disclosed, supposedly this is not returnable but how is a non-disclosed hole not returnable?","title":"I ordered a Judith Lieber bag described…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-27","author":"customer","text":"My dress arrived without a belt and customer service didnt reply to me. Only after i called 3x it came to a resolve.","title":"My dress arrived without a belt and…","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-27","author":"customer","text":"The product I received had undisclosed damage and contained a filthy duster bag with a multitude of stains and what looks like bug wings","title":"Clearly a return that no one inspected","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-27","author":"customer","text":"Don’t like it and can not return !","title":"Don’t like it and can not return !","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"R Willis","text":"The priceI paid for the Mark Cross bag was not significantly less than full price, so I expected to receive a bag in very good condition. Only the leather material, which covers 20% of the bag,is in great condition. The coated canvas is peeling, cracked and the bag looks very used and worn. I am not a satisfied RealReal first-time buyer.","title":"Not the expected quality for the purchase price","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"customer","text":"Bag is not what I expected and I can’t even return for store credit","title":"Bag is not what I expected and I can’t…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"customer","text":"I ordered a scarf with a gift box - it came without the box - I reached out to customer service three times and received no help. super frustrating as this is a gift and I paid for the box.","title":"I ordered a scarf with a gift box","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=53&stars=1&stars=2&stars=3"}]