[{"date":"2022-03-18","author":"Kellie Cataldi","text":"Do not agree that purse was in \"very good\" condition. Leather rolling up on side suede material peeling..Will not recommend and\/or purchase from The RealReal again. Delivery and updates on shipment were great and on time.","title":"Do not agree that purse was in \"very…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"Michael hall","text":"There was no response   Is there a zero rating","title":"There was no response   Is there a zero…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"customer","text":"I'm concern with the aithencity of their products. Then the last products I went to return and the items disappeared from my history nor could I gwt the labels. I put a request for a call back, no one ever got back to me so I was stuck with items I could not wear.","title":"I'm concern with the aithencity of…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"customer","text":"Extremely unhelpful and I’ll never order from here again","title":"Extremely unhelpful and I’ll never…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"customer","text":"I am disappointed in the item that arrived versus the photo I saw on-line. I wish I could return it as I didn't see the \"Non returnable\" when I ordered.","title":"I am disappointed in the item that…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"customer","text":"I've dropped  off my diamond  ring about  3 months  ago and it's  still not live on their website. Really  disappointed with  the service.","title":"Disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"customer","text":"I think the bag that I.had ordered is counterfeited.It s a shame ,ripping off people like that.And it can not be returned nor get credited for,All I know is KARMA does exist.","title":"I think the bag that I.had ordered is…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"customer","text":"The item I purchased is not the size that was identified on the website so I have no use for it and it is not refundable. I am wholly unsatisfied with this transaction.","title":"The item I purchased is not the size…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"customer","text":"Shipping is Untrustworthy they tell you one thing when you purchase and they take your money and then they ship it whenever they feel like it …. They use Ups worst shipping company","title":"Shipping is Untrustworthy they tell you…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"Malak Charifi","text":"Why we can’t do pick up the orders from store first to save the shipping fee plus for the staff safety, just  got a part of my order the delivery man just throw it in the front door I know the building is safe but not for a precious things as gold. Also sale tax little higher","title":"Why we can’t do pick up the orders from…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"Pup Mom","text":"This was my 1st and likely only experience with TheRealReal. I ordered a cashmere scarf that was supposedly in perfect unused condition and it arrived with 2 holes in it. One large and 1 small. I have no idea how those holes could have passed the inspection.  I immediately called customer service and sought out return information even though it was over 40% off in a final sale. The customer service agent was outstanding and immediately sent me a return label and said that the return postage would be refunded even though not stated on the email with the return label. I do hope this can be resolved easily and with a full refund.","title":"This was my 1st and likely only…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"customer","text":"The shoes sizing online is not correctly listed. Shoes that are US size 10 are not equivalent to EU\/IT size 40. Instead it’s more like 42. I ordered a pair of shoes and made a mistake of going off the size US 10. The shoes came in. They don’t fit. I can’t return them so money lost for both the shoes and the associated charges (shipping costs and taxes). Disappointed.","title":"The shoes sizing listed is incorrect","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"Ashley","text":"It should be clear when an item is final sale, not hidden in the return policy. When purchasing, there should be bold text by the price so customers are totally aware before purchasing — particularly as many (if not most) items are heavily discounted & therefore final sale.\n\nCurrently, you need to click into a different page to read the return policy. Not super user friendly.\n\nI’ve also received what a counterfeit item from TRR before, despite advertising as being 100% authentic. Too late to return (didn’t notice at first), but what a waste of $.","title":"Read the return policy & scrutinize authenticity","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"customer","text":"They charge shipping and return label \nSome items not returnable","title":"They charge shipping and return label","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"Anonymous","text":"Bait and switch artists. CAVEAT EMPTOR! (BUYER BEWARE!)","title":"Bait and switch artists","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"customer","text":"Item was not as described- like - at all! What the heck is their authentication process. Terrible customer service never heard back despite multiple emails","title":"Item was not as described- like","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"customer","text":"Bad experience. First time, and sadly last time I will use TRR. I order a pair of YSL heels; my purchase arrived and I received two totally different shoes (not only were they two different styles, they were both right foot shoes!). I contacted customer service via email, and was sent a return shipping label to which they expected me to cover the cost. Had they shipped me the right item, I would have not returned in the first place so I did not feel responsible for any costs due to their mistake. I finally got a representative on the line who was able to credit my shipping cost, and let me know once the item was received back my full refund would then be issued. There was no attempt on their part to make it right, at all. They could have offered to correct the mistake and resend the correct item. I was really looking forward to my purchase.","title":"Bad experience","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"Emm","text":"A friend who is a huge fan of TheRealReal recommended I consign with them. She told me upfront that she would also be getting a referral fee which I had no issue with. I had an in-home appointment to review my items in order to assess what was most saleable and in total consigned 13 pairs of designer shoes (Manolo Blahnik, Jimmy Choo, Prada etc) and 20+ clothing items. Getting through to TheRealReal was a total nightmare. You cannot call direct and when you do, you are placed on an indefinite hold with a recording that your wait time is less than 10 minutes. I left my number for a callback that never came. When my items were finally published on the site, I was shocked to see how little they sold my clothing for! An Equipment silk blouse with sales tags attached sold for $40 for which I receive $12! I would've rather donated the item than sell it for $12. An Armani blazer that cost me almost $1000 and was worn once is listed for sale for $80 with a condition description stating there is piling throughout. Not only is that false, I will recoup a big $24! I am so upset, I have asked that some of my items be returned as I'd rather keep them or sell them on Poshmark. I was told there is a $15 per item fee to return them. I specifically questioned the rep who came to my house about any issue I may have with TheRealReal's pricing of my possessions and directly asked if I can have them returned if I do not agree with their suggested price. I was told it would not be a problem and I could request my items back. She never mentioned a charge to get my own clothes and shoes returned and when I called to question her, she told me well yes there is a $15 fee but I've never seen it charged to anyone. I am beyond distraught. I will likely look to have my remaining items sent back and will NEVER NEVER use them again. Thankfully I didn't give them my collection of designer handbags which if I choose to sell, will fetch far more on other resale sites.","title":"Extremely disappointing experience consigning my goods","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"E. L. Halsey","text":"Shipping and receiving took to long, horribly oversized box for item and the item was returned because a clear and proper description was misleading so I received a woman’s driver instead of a man’s. I was charged $35 for shipping which is way to high. You only charged me $12 for a return label for the same item!","title":"Not a Satisfied Customer.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"VS","text":"The description of my purchase was not what I received.","title":"Handbag Purchase","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=62&stars=1&stars=2&stars=3"}]