[{"date":"2022-04-27","author":"Jo","text":"I placed an order and unfortunately it didn’t fit - I contacted them via email and was told the items were non returnable meanwhile no of that was mentioned when I placed the order - the person on the other end told me I can consign which I had no clue what that was - apparently they’ll sell it for you and you get a commission- what a scam ! They sell you something but you can’t return it ! Then they want to steal more of your money by giving you a commission! What a bunch of crooks ! Stay away from this sight ! I’ll never shop there again and I’ll tell anyone i know how shadows this site is ! Too bad I had to leave 1 star because they don’t even deserve that ! \nTerrible! Shopping experience!!! \nTheRealScam !","title":"I placed an order and unfortunately it…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"customer","text":"The order came but one item was missing, I am super disappointed. I am waiting for consumer services to give me an explanation. \nThe shoes are great thought  !","title":"The order came but one item was…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"customer","text":"The LV bag that I chose to purchase was described as in “very good” condition and for the price, I thought it would be.  Upon receiving said item, I was totally dissatisfied and disappointed.  I could’ve chosen a bag that was in good condition for less and been more satisfied. Truly not looking to purchase any more items from “The Real Real!”","title":"The LV bag that I chose to purchase was…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"customer","text":"never received my package","title":"never received my package","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"customer","text":"I orderd a size 11 shoe and when I received it , it came in and size 11 in childs size\nWhen i wanted size 11 for mens size\nNow i have to return this and hopefully get my money back","title":"Ehhh","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"customer","text":"Shipping takes a little too long, but the bigger issue is sizing. The dress I ordered was listed as XL on the site, but when it arrived it was very clearly labeled a size 12 by the designer. If it had been listed as a 12 on the site, I never would have ordered it because I know a 12 is most likely too small for me in a dress of that style. But since it was posted as XL, I took a chance that it would fit. I’m not sure why the real real considers a size 12 to be extra large, but in this case time, effort, transportation, labor etc. were wasted simply because someone could have — and should have — but didn’t list the dress as it was marked: size 12.\n\nIt was easy enough to return the dress since there is a store near me where I was able to drop it off, but if I had shipped the dress back to them, I would have been charged $11.95 for shipping\/handling. My advice is to read the fine print, make sure clothing that doesn't fit can be returned, and think carefully about how a style will fit your shape. Almost everything I've seen online and in store seems smaller than what you'd typically expect for the size listed (not uncommon with high-end designer merchandise, but something to be aware of). \n\nI've sold\/consigned numerous pieces with them and done much better on that front -- though I do think they sometimes are too quick to markdown an item, which leads to less commission for the seller.","title":"Sizing is misleading","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Sarah","text":"Beautiful scarf but only give 3 stars as it was listed as “very good” condition with no flaws mentioned or photographed.  There are two small, but distinct, stains right next to the Hermes corner of the scarf.","title":"Beautiful but small flaws","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Buyer","text":"Even though I received the items promptly, some of the clothing items claimed to be in excellent condition but were extremely used and worn.","title":"Not so excellent condition","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"customer","text":"Very dissatisfied disappointed","title":"Very dissatisfied disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"customer","text":"My order was shipped fast and it arrived fast. Unfortunately, one of the items in my order had some pretty significant damage that wasn't mentioned or pictured in the item description. It has happened before with other items I have purchased, in that there may be a little hole, but nothing that can't be fixed, so it hasn't been a big deal. However, this time, describing the item as having \"moderate wear\" and not include a significant defect is deceitful. I, unfortunately, won't be able to wear this item because the damage is pretty noticeable and unfixable, unless a MAJOR alteration is made to the item. I have already reached out to the Customer Service team with some pictures and hoping to find a solution. A situation like this won't deter me from continue buying items from The RealReal, but it will make me more weary of trusting the description. And while on this note, I had sent in a pair of Prada Wedges to sell, they were in what I thought pretty good condition, no defects, no major issues, other than light wear, and it was sent back to me. The fact that I couldn't consign those shoes and I've seen shoes in far worse shape listed and I received an item with actual damage, it's very disappointing. I think it's time to add more transparency to the product descriptions.","title":"Damaged Item","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Kim in FL","text":"Received 2 of 3 items ordered. One was clearly a fake-the most basic glance at the hardware and straps shows it’s not an authentic Prada bag. It looks like a poorly done knock-off. I reached out twice to find out the process to return the fake and have yet to get a response. \n\nIn the meantime I received bag #2 of 3 ordered (ordered before I received the fake bag).  While it looks better and the emblem is consistent with authentic bags, the quality of the leather is suspect. It is practically flaking off in places. I have yet to receive bag#3. Unfortunately I don’t have high hopes considering my experience with this company thus far.  All three bags were expensive and based on the reputation of TheRealReal I expected high quality used authentic bags.  It’s been a thoroughly disappointing experience and I\nI am sure I’ll never consider buying “authentic used” bags online again. This is my first and last experience. It’s quite disappointing, when I found this site and perused the bags I thought I’d found heaven. Beautiful, hard to find gently used authentic luxury bags at a reasonable price point? Jackpot! That excitement lasted until the moment I received the first order. \n\nAt this point I’m looking for a refund or at a minimum a re-assessment of the (fake) Prada backpack. The remaining bag on the order is due to arrive today. I hope it doesn’t prove to be a fake.\n\n  I’d recommend saving your money until you can afford to purchase the bag you want new directly from an authorized retailer, preferably the actual brand’s store.","title":"Buyer be ware. Maybe shop in store only so you can see, touch and smell the item before you spend hundreds of dollars on a possible fake","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"A V","text":"All the commercials about the site suggest their prices are 95% off, and that’s not true at all.\nAfter browsing through the site and looking at all the prices, I realized the prices are like new.\nSo, I personally will be making my purchase straight from the brand store.\nA message to all.\nWhy bother?","title":"All fake advertisements","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Cassidy","text":"Items are poorly described in terms of wear and photos did not provide accurate description","title":"Items are poorly described in terms of…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"customer","text":"Much smaller in size than expected. Disappointed ☹️","title":"Much smaller in size than expected","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"customer","text":"I ordered a bag and the damage was not fully documented\/shown. There was water stains and hardware missing that were not shown in the photos. I messaged customer service and they responded quickly, but they were only able to offer me $30 (15% of purchase price) store credit and would not refund my card. I would not have bought this if I had seen the full extent of wear. Overall, be aware that damage may not be fully shown and your refund options are very limited.","title":"I ordered a bag and the damage was not…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Marva  N","text":"Great customer service but  prices are too high for used items and sizing is always wrong .","title":"Great customer service but  pricing is…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"customer","text":"My order said it was a size 11, i received size 7.5.   BAD","title":"My order said it was a size 11","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Unhappy","text":"The bag looks like a dead.leaf..Faded and dirty inside out. Not happy!","title":"The bag looks like a dead.leaf..Faded…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"customer","text":"I’m still haven’t received my order and I’m afraid they’re so short staff it’s going to take a few days to even get a response.","title":"I’m still haven’t received my order and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"customer","text":"Product was not accurately described. As such, I purchased a damaged, smoke-ridden Louis Vuitton bag, which I had really been looking forward to owning for years. Sadly disappointed in The RealReal- I had heard good things.","title":"So disheartening","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=15&stars=1&stars=2&stars=3"}]