[{"date":"2022-03-30","author":"Franny","text":"The phone representative was very helpful, the rest, not so much. When I started to place my order the dress was offered at one price and during the procedure it changed…very confusing, for me as well as the representative. When I did receive the dress it was impossible to try on because the TRR tag was attached to the side and through the sleeve so I couldn’t get my arm through the sleeve without taking the tag off and thus risking not being able to return the dress. I chose to return. My first and only time, too much hassle and stress for me. Not worth it.\nAgain, the representatives are nice and helpful, the process is difficult","title":"The phone representative was very…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Eli","text":"Overall fast shipping and simple shopping process. However, the book I ordered was not in pristine condition. When it arrived, I opened the book and the seam not glued to the pages and I had to re-gule the seam myself in order to actually flip through the book, if not the pages would just tear off. I could've returned it but decided not too and fixed the issue myself because everything else was in perfect condition. Not sure if the glue melted during shipping or the description was inaccurate, that's why I give 3 stars.","title":"First time buyer, experience was ok..","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"customer","text":"The condition of the handbag was way overstated. The fact that they are final sale makes me very hesitant to trust the information provided, especially for items that are worth thousands of dollars. In addition to a lot of visible scratches on the leather, the bag has an incredibly strong odor that was obviously not easily known unless it was disclosed. It also seemed like the photos were intentionally taken in a way to hide the visible wear. \nI would not be upset with the purchase if the condition of the handbag was more transparently shared or if there was a way to process returns based on the fact that the description of the condition vs. the reality did not match.","title":"Condition vs. Reality did not match","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Louis nwokeocha","text":"You guys are using text to answer customer problem and you guys are so so so bad with it.texting and snswering with wrong answers.all that do is to frustrate customers like me.scrap it its nonsense.","title":"You guys are using text to answer…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Rosemary B","text":"I’m sorry to report that in my first experience with RealReal that I did not receive the pretty earrings I purchased. RealReal advertises they use UPS as their delivery service.  But for my order, their carrier UPS subbed out the local delivery to the US postal service.  UPS and RealReal reported to me that my jewelry was delivered into my mailbox!  (Not to my doorstep!!). And it was not there!  UPS directed me to USPS.  USPS will take two weeks to research.  Real real refunded me but all I wanted was my jewelry.  Three hours of my life wasted on calls hassles claims.  Real real service efficient but did not deliver the product. \n\nI encourage real real to RETHINK your delivery carrier choices!  I thought this product wouid be delivered to my door bars on prior experience with UPS.  It’s jewelry!!! would have paid extra for a more secure delivery. UPS should NOT be allowed to handoff last mile delivery to the post office.  I would never have placed a jewelry order that would be placed in my mailbox.","title":"Delivery of Jewelry into my Mailbox???","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Carla","text":"The Real Real representatives that inspect the merchandise before it is accepted to be sold should really do a better job of describing the flaws.  For example, I ordered an evening gown that stated that it had a minor pull in the back but when I received the dress it had SEVERAL pieces of fabric missing throughout the dress as well as LOTS of pulls.  I looked awful.  Glad I ordered and received it well before my event.","title":"Need better descriptions of garments","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"customer","text":"Frustrating that you keep sending my consignor returns to an old address.","title":"Frustrating that you keep sending my…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"customer","text":"First time purchasing here and the items are good. I did not like the fact that they didn’t leave the items in my house, it was a little bit of hassle getting the items but otherwise was good.","title":"First time purchasing here and the…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"customer","text":"Not Happy with the products it came really damaged and the sizing was a little bigger than I expected from a nine also was very confused because it said my order was canceled but then I got it still","title":"Not Happy with the products it came…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Yvonne","text":"The shoes are beautiful but a half Suze to small difficult to return","title":"The shoes are beautiful but a half Suze…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Sean Stephens","text":"The item was nice but unfortunately It was very small. It said item was xxxl but it was only X-Large and didn’t fit me and I can’t return so basically it’s a loss for me. It was my first purchase and I’m pretty Leary about making another.","title":"The item was nice but unfortunately It…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"unhappy customer","text":"Initially the process was easy, the associates were friendly and helpful. Then it was downhill. Text messages regarding questions\/concerns were never answered. Items were sold then returned weeks later with a note that they would be relisted for sale...with no date for relisting. The fine print should be read for commission rates.\nI will think long and hard before using this service again.","title":"Get the facts first","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Monica","text":"The item took long to arrive. I ordered shoes and they were falling apart. This quality of service is horrible why would they sell items in this condition.","title":"Complete disaster","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"customer","text":"I really don't like the return shipping costs. Prevents me to try a lot of things. Returns should be free. Everything else is great.","title":"Return shipping costs","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Marie nuguid","text":"I did not receive my order yet ups send back to the dealer","title":"I did not receive my order yet ups send…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Zaida Jacoby","text":"I received wrong item. The packing slip had the correct item. \nCustomer service sent me the return slip with the packing slip not describing the bag ( wrong bag) I received.\nI asked the customer representative, Ashley if the correct bag I want is still available. Her response was she will let the team know. Have not heard from the team.\nHow long does it take to see if the bag I want is available?\nVery dissatisfied!!!","title":"I received wrong item","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"customer","text":"As a new customer who’s always looking for a great sale, I was very disappointed receiving one of ur designer bags that I purchased with a unwrapped tampon in the bag😨 that has changed my opinion of this company as a new customer😌","title":"As a new customer who’s always looking…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"customer","text":"I ordered two bridesmaids dresses. One arrived without the TRR merchandise tag. As I wanted to return it and the return requirements state clearly that the tag must still be attached, I reached out to Customer Service. I attempted to solicit help via the chat, phone and email and was never able to receive clarification on  my issue.","title":"I ordered two bridesmaids dresses","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"customer","text":"Bought some shoes and boots well packaged.  Bought an expensive FLOS light and it was not wrapped properly - legs were poking out of the box upon arrival and yes - surface was damaged.  Customer service was not very helpful.\n\nAs a consignor - amazing communication while they are trying to get your items but once they have them so difficult to communicate.  My items were listed for far less than I would have accepted and were sold before I was even informed they were listed.  \n\nHave asked for my items back and will be very careful when purchasing items from them if I do.","title":"Started out well but wouldn't consign again and wouldn't buy fragile items","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Francois","text":"great selection.... bad photos..... bad presentation of the merch...inaccurate representation of garments","title":"thoughts..","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=49&stars=1&stars=2&stars=3"}]