[{"date":"2022-03-24","author":"Kathleen","text":"I was sent an item that was advertised as a shoe size 6.5, the actual shoe size is 8.5. I notified customer service that I was leaving for a trip & did not have time to return the item until I came home (greater than 2 weeks). I was told the policy is the item be return within 2 weeks. \nThis is the first time I’ve ordered from this company. They misrepresented the item they advertised and then refused to work with me on their mistake.\nNo thanks.","title":"Misrepresentation","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"customer","text":"Horrible staff and just everything about the whole process.","title":"Horrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"customer","text":"The condition of my purchase was horrible, there was a lot of wear and tear. And it was not a reasonable price . It was literally 200$ Cheaper then what it would of cost new at the store. Very disappointed won’t be shipping with the real real anymore first and last time!","title":"The condition of my purchase was horrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"customer","text":"Very disappointed. Item arrived in totally disaster condition. Customer service not answering at all to any email!","title":"Very disappointed","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"customer","text":"The wallet I purchased was not a wallet but actually a case for glasses. The photos were misleading. It is a very high quality glasses case, though.","title":"The wallet I purchased was not a wallet…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"AA","text":"My parcel was never received \/ someone else signed for it and pinched it. I would recommend rethinking packaging as it’s obviously clear when it’s a Real Real delivery so it doesn’t happen to other customers. Yet to hear back on it - it’s been nearly a week. \nOtherwise love the site and concept!","title":"My parcel was never received \/ someone…","stars":3,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"buyerbeware","text":"Item not as described, incorrect measurements and not eligible for return. will re-sell on eBay.","title":"Item not as described","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"customer","text":"I would have liked for them to come in the actual Gucci box and bag . They came in a broken regular black shoe box","title":"I would have liked for them to come in…","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"customer","text":"I loved the website and ease of navigation with good product description; unfortunately my experience \/ purchase was not great.  I purchased a LV wallet and the front snap does not stay closed; front flap of the wallet is not flat, and the wallet came with a slight moldy smell - having to use product to remove the smell.  Wallet was delivered with a no-return card; otherwise I would have exchanged the item for another wallet.  Non of the product issues were outlined in the product description .. hence, a little disappointed.","title":"LV wallet issues not disclosed","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"customer","text":"One of the candles became unavailable after I purchased it. The lavender spiral candle was broken in multiple places on arrival. Overall, very disappointing purchase.","title":"Broken\/Needs bubble wrap!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"customer","text":"I shop fairly regularly from the site, as I do trust the authenticity of their items. It has become my go-to shop for high quality basics, and their selection is amazing. One recurring issue I've noticed though is inconsistency with listing the condition of the item. Sometimes big stains will not be listed, and may be tough to see in the photos. Colours of garments can also be listed incorrectly, such as an 'orange' garment listed as 'red'. Other times damage will not be listed at all (such as broken buttons or burns from an iron). Most stains come out with a gentle wash and stain remover, but other damage can't be repaired. I would just advise other shoppers to have an eagle eye when looking at an item, and be prepared to invest a little time or money into it.","title":"Great Selection but Inconsistent Listings","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"customer","text":"I bought a shirt that was advertised as a mens shirt and when it arrived it was a womans shirt.  When I tried to return it I was going to be charged $11.50 to return something that was advertised incorrectly.  Someone will just get a nice gift.","title":"I bought a shirt that was advertised as…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"customer","text":"Account got blocked for no justifiable reasons a few times within two weeks of account opening. It’s ridiculous.","title":"Account got blocked for no justifiable…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"customer","text":"Bought my bag more than 2 weeks ago, paid for expedited shipping and still haven’t received the item. I’m still not sure if I’ve been scammed or if I’ll get my item some day. On the day it was supposed to arrive I tracked my item and it said that it was being returned to the sender, as the sender had requested so. I talked to over 5 customer representatives and each said something different, no one could tell me what had happened with my package and why the sender requested that my bag was sent back. No one tried to do anything to make my experience a bit better. On top of that, had an agent who lied and said I was getting my bag until one specific day for sure just have another agent tell me that wasn’t happening one day later. So, very bad experience, no one is remotely worried about the customer experience or solving problems that come up during the order.","title":"Bought my bag more than 2 weeks ago","stars":1,"location":"PE","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"customer","text":"There was no indication at checkout or my confirmation email that the clothing I purchased was final sell. And one of the items is such a horrible fit. Now I’m out $$$ for something I can’t wear or return. Not sure I’ll be purchasing again.","title":"Sales are Final","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"customer","text":"So dissatisfied the bag was trash wasted my 500 dollars would never buy from the real again","title":"So dissatisfied the bag was trash…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"customer","text":"Everything regarding ordering & quality of items etc etc is good.  The issue is the shipping is slow.  Have ordered three times & each time it was UPS ground.  For amount of money the items on the site cost & the ones we purchased I would think they could ship with a more expedited service.","title":"Everything regarding ordering & quality…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"G Simone","text":"I have purchased hand bags from you guys in the past. This time I ordered Tom Ford glasses...not impressed.  When they arrived I opened the box looked at them and purchased them back in the box. I couldn't even tell where the box is?","title":"I have purchased hand bags from you…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Rachel","text":"I've had one item photographed backwards for over 90 days and we are now going on a month since I've alerted cust. service and no change.  In addition,\ntwo skirts were attributed to the wrong designer.  One has been fixed, while the other remains incorrect.","title":"BACKWARDS!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"customer","text":"Sizes were incorrect (the shoes I purchased listed as size 11 but the label on the box itself says 10 and the shoes are too small) and the shirt I received was of dubious autheticity (low quality craftsmanship, construction, and fabric.) Additionally, it was listed as having a busy measurement several inches larger than my own but barely fits. Based on my experience, TRR’s product listings and authentication process are unreliable and incredibly disappointing. Proceed with caution, or maybe not at all.","title":"buyer beware.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=55&stars=1&stars=2&stars=3"}]