[{"date":"2022-05-05","author":"customer","text":"You have a pair of all black cracked leather maison margiela replica sneakers that are marked a size 45 on your website and when received they are marked size 42 on the tongue of the shoe. Please fix this listing for others. Im returning the shoe, it dosnt fit","title":"Wrong size shoes","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"customer","text":"I was told I’d be issued a refund for my stolen order and was not. Your agents keep telling me different things and I’m very upset","title":"I was told I’d be issued a refund for…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"customer","text":"Paid for express $29.99 for 1-2 day express shipping and didn't receive item until day 5. When called to ask about it they said the weekend was a non working day. I guess everyone else delivery on the weekends except them.","title":"Paid for express $29.99 for 1-2 day…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"customer","text":"The worst customer service there ever was.","title":"The worst customer service there ever…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"customer","text":"They never responded my questions","title":"They never responded my questions","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"customer","text":"Inaccurate website description, boots were listed as size 11, but they are actually a size 6.5 upon arrival. Not even close to my size. How did The Real Real not notice this?!\n\nI ordered a size 11 boot, the website listed the boots as women's size 11, however when the boots arrived they were half the size l needed. Clearly the Real Real does not double check sizes before listing items. Anyone who knows shoe sizes could have seen by just looking at the boots that they were not a size 11.\n\nThis item was non returnable, even though they are the ones who misrepresented the item. I will NEVER order from here again! Who care's if the item is authentic if I can't wear it because the wrong size was listed?!","title":"Inaccurate website description, listed as size 11, actually size 6.5","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Betty Atlas","text":"The dress was nothing like it was described. Incredibly tight and poorly fitting. No size was noted on the dress and so I cannot understand how it was sized online. To make matters worse, a return ended up costing me close to $20.","title":"The dress was nothing like it was…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Lisa","text":"I appreciate the selection that the RealReal offers. The shipping\/tracking could have been clearer - it said my package would be delivered by a certain date, but only one of my two items arrived and I had no idea when the second item would arrive. I had to chat with customer service to figure that out. One of the items I received had a hole in it and when I told customer service, they offered a $20 credit to the site that would be valid for only the next three days. This was a $195 piece of clothing that I had decided to keep and get mended, so I was a bit annoyed by that. Lastly, it wasn't made clear to me that the second item I ordered wasn't returnable - I only discovered that when I went to make my return and the only option was to consign the item. Nothing life-altering -- this just ultimately turned into an annoying shopping experience.","title":"Selection is good, the rest of it was... annoying?","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"customer","text":"Horrible return policy","title":"Will never shop here again","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"customer","text":"I was extremely pleased with the item I purchased and they arrived as described on the website. I also benefitted from the accurate size guide suggestions. So I appreciated that. However, after buying this expensive item, I assumed that it would come packaged carefully. Unfortunately, that was not the case. My item (a pair of shoes) was thrown into one dust bag with a single piece of tissue paper dividing them. Further there was no tissue outside the dust bag in the box to make sure that the shoes were not tossed around and damaged in transit. This was a very real possibility since the box was large and had two tears at the sides. Since my item was not damaged, I am not dissatisfied, but I think you should be more thoughtful with how you package your items. I would have greatly appreciated the shoes coming in separate dust bags with tissue paper supporting not only both shoes but the inside of the box. Thank you!","title":"I was extremely pleased with the item I…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"amber","text":"I received a counterfeit product and I’m so bummed and embarrassed. This feels like a scam. The stitching, the tassel, the snap closures features are all wrong. I received it yesterday and It’s worried me all day today. I thought TRR was legitimate.","title":"I received a counterfeit product and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Kiki","text":"I would give it more stars if international shipping wasn’t so outrageously expensive. Otherwise no complaints.","title":"I would give it more stars if…","stars":3,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Melissa","text":"I ordered Columbia jeans and received corduroy pants.  Impossible to contact the site.  Will not be buying here again.","title":"Received wrong item, can't contact the site","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"TStriet23","text":"Super misleading. I received my item and it was far smaller than it appeared online. Something they should probably make pretty clear considering you pictures look a lot bigger than in person.","title":"Super misleading","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"LA Girl","text":"I tried purchasing a bag twice.\nBoth times I received a purchase completed email \nThen a few hours later I received a return completed \nFor the same bag.\nWhat’s going on?!","title":"I tried purchasing a bag twice.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"I ordered three pair of pants from Piazza Sempione on your sight.  Specifically product with tags still on.  The pants although two were the same size, fit totally different.  Also, I was looking for all three pair to be the side zip.  The description did not explain which would be a side zip and which was a front zip.  These pants from this brand are plentiful on your site.  It would be really helpful if description could note side zip or front zip.  So bottom line i had to send back two pair to return.  I am frustrated that i am being charged the fee for a return when i really did not have good info to order items with tags still on that were so out of spec.  Please advise.  Thanks.","title":"I ordered three pair of pants from…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"I have found a lot of good items at the RealReal but also received many items that were not in the condition described. For example I recently received a sweater that was listed as being in excellent condition but when I tried it on I noticed there was a three inch hole along the seam.","title":"I have found a lot of good items at the…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"Karen","text":"I purchased my first Louis Vuitton bag and I have to say I am highly disappointed. It was rated as “very good condition” Which is absolutely not true. The description said it had some light tarnishing but there was a rip on the bottom of the bag and the inside was completely stained and the bag smelled awful on the inside. The handles also looked more worn and darker than the pictures Definitely paid way too much for this mediocre bag. Unfortunately there are no returns so, my loss!","title":"I purchased my first Louis Vuitton bag…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"Brenda M.","text":"I purchased 5 items and only kept 2. The 2nd package had an awful smell. The wide-leg jeans I purchased look old & cheap. They charged me a $35 promotion fee after I returned the items. I don't know what that is. I won't be shopping with TRR, anymore.","title":"Overrated","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"customer","text":"Bought a shirt that in my size. The shirt that arrived had no size label on it and wasn’t even close to the size advertised. It can’t be returned and I have learned my lesson.","title":"Buyer beware","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=5&stars=1&stars=2&stars=3"}]