[{"date":"2022-03-25","author":"customer","text":"The wallet had some really obvious marks on the front and back.  If I didn’t have a $25 credit to use on this purchase I would have sent it back.","title":"The wallet had some really obvious…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Mary ","text":"Never got a response via email from Customer Service - if Real Real wants to sell items - take better pictures of items (more than 3 pictures come on), invest in high quality resolution pictures that can be zoomed in without bur or pixilation, and give honest, accurate description of items flaws and damage. I called CS for better information on 2 items I was prepared to buy but here 1 week later my issue has yet to addressed, acknowledged or responded to. Horrible service follow-up. This is the 3rd time calling CS and never hearing back from CS despite being told I would.","title":"Never got a response via email from…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Debra Wells-Hopey","text":"I'm sad. This sweater cost me over $240  and it had a significant hole in it. The condition stated on the website was \"Very Good\". I'm crushed!","title":"I'm sad","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"customer","text":"The 2 pair of shoes arrived very late. I ordered 2 pair of shoes from two different designers. One fits perfectly the other one feels like a size 8. It doesn’t fit. As I was reviewing your return policy, I realized I will lose $11.95 just to return the shoes, while I have already paid $12.99 for shipping. What a ripoff. I will not purchase from your website anymore. I’ll stick with Rue la la.","title":"The 2 pairs of shoes arrived very late","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Wednesday","text":"There are some good finds. Most of the sizes (for closing) are wrong. I have received children’s closing, sizes clearly visible on labels but miss identified on web site. If the returns where free it would be less problematic. I mostly judge the sizes based on how they look on these sad looking models.","title":"There are some good finds","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"customer","text":"horrendous customer service.","title":"horrendous customer service.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"customer","text":"I ordered a designer T-shirt. The Logo and all stickers are cracked and very faded. Came with tons of cat or dog hair on the item also.","title":"Won’t be using again","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"customer","text":"Great for the buyer not so great for the seller, concierge always changing, no communication, false promises.","title":"Great for the buyer not so great for…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Liliana M Gomez","text":"Lack of transparency when describing their items accurately and measuring any flaws; then they will give you a hard time at rectifying the situation. \n\nSecond time I deal with this ok high ticket items","title":"Lack of transparency when describing…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"M. Williams","text":"The Real Real... I understand that you guys need to promote your business but, Y'all send TOO MANY EMAILS PER DAY! It's honestly ridiculous and I'm actually a bit turned off of your company because of it. I wish you guys the best but Y'all gotta do better.","title":"Too many emails.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"customer","text":"Before i purchase the bag I chatted with their customer service because title of the bag said it's a small but their description for the width was size of medium and height was size of small. So I wanted to know and check the size of the bag. Customer service said what they have on the description is correct and every bag has different dimensions. So I believed what she said and purchased the bag; however, when I received the back and it felt much bigger than I thought. So I did measure the dimensions and the height of the bag was 8.25\" instead of 6.25\". I started a conversation to make a return and the customer service representative was able to help me to start the return. They said they will have to re-authenticate the bag so it will take 7-10 business days to get my money back. It's kinda annoying that I have to wait that long to get my money back. If they had a correct information, I wouldn't have bought it.","title":"incorrect item description","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Heba rida","text":"Bad condition the leather is so bad 200 in the garbage","title":"Bad condition the leather is so bad 200…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Gary Mann","text":"Sent back last Friday.  No refund yet.  Took my credit card quickly.  Return still waiting.  Work at Neiman Marcus.  Not good customer setvice","title":"Sent back last Friday","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Kevin Elliott","text":"After purchasing two pieces of luggage at over $1500 each both described as very good condition but showed up in unusable condition. One with the main zipper torn away on bottom side (bag can't close) the other the carry strap was chewed on (presumably by a pet) to the point it won't have held a load. The more disturbing part was both time attempts were made to hide the damage in the photos and even strategically setting up the bags to hide it on initial inspection. Which leads me to question are they actually inspecting the items or are they the ones being very dishonest.","title":"Deceptive condition on bags","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"customer TJ","text":"I purchased Tory Burch purse and wrist wallet. The wallet was in good condition, but the black purse was in poor condition. I am contacting customer service today to arrange returning the purse. I am disappointed in quality and the price I paid for the purse.","title":"I purchased Tory Burch purse and wrist…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"Brad k. meier","text":"You sent an item that did not match the description. Then attempted to charge a $22.00 return processing fee after I sent photos and returned the item. I’m disputing the charge. Horrible experience. Terrible firm.","title":"You sent an item that did not match the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"customer","text":"There were a couple spots that weren’t pictured on the bag as well as marks from the handles laying on the bag, I feel like they graded the bag higher quality than it actually was.","title":"Quality level not right","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"Kate ","text":"Had great experiences in the past but this most recent purchase had me super bummed. Labeled as my size and women's, I bought a pair of Gucci mules. I was stoked until they arrived and were actually mens. Paid shipping to get them delivered, and despite driving to a Real Real location to return them, paid return shipping and restocking fee. Seems a little unfair for me to have to pay seeing as the shoes were mislabeled as women’s and it wasn’t my error.","title":"Had great experiences in the past but…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"customer","text":"The condition of the item stated \"Excellent, no signs of wear\", but the sleeves are so dirty and the suede has faded on the shoulders.","title":"Condition not as stated","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"customer","text":"The Bottega Veneta bat I bought smells really bad & is already quite shabby.\nAlso I paid so much Tax for Shipping to Germany","title":"The Bottega Veneta bat I bought smells…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=54&stars=1&stars=2&stars=3"}]