[{"date":"2022-05-07","author":"customer","text":"Can’t get an answer from customer service. Paid $90 for a skirt and it came ripped.","title":"Can’t get an answer from customer…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"customer","text":"I got the fake Jimmy Choo shoes then have to pay return shipping fee. Stop , no more shopping here.","title":"I got the fake Jimmy Choo shoes then…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"Amy","text":"Hit or Miss. \n\nI was a bit nervous to place my first order with the Real Real. I decided to splurge on a few pieces that I could use for my new job. I ordered three items-- a full grey suit, a black skirt, and a green blouse.\n\nGrey Suit: The suit jacket was perfect BUT the matching skirt had holes in it (along the back seam of the skirt). No where in the listing were holes mentioned, in fact, the description made it sound like the suit was practically brand new. Obviously it would have been helpful to know that the item had holes in it. (Had I known, I would have gone with something else.) \n\nBlack Skirt: The black skirt was also a bit of a let down. The skirt turned out to have two layers (this was not mentioned in the listing)--an outer layer and a inner layer. The outer layer is a tweed wool material, and the inner layer is a silky material. The measurements provided on the listing were for the OUTER layer-- not the INNER layer. (The inner layer is about two inches smaller than the outer layer.) Long story short, the skirt does not fit. I am disappointed. Again, had I known, I would have gone with something else. \n\nGreen Blouse was perfect. I was 100% satisfied with the blouse. \n\nOverall, don't expect to get something that you will be able to wear right out of the box. The items may be measured incorrectly (or maybe it would be more accurate to say incompletely), and contain surprise damage like holes.","title":"Hit or Miss","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"Jemma","text":"There was a major defect in the bag I purchased that wasn’t disclosed in the photos or in the description.  When I received the bag, it had large writing on the lining of the bag in permanent marker that cannot be removed.  This was a final sale item so I cannot return or get a refund.  It ruined the whole experience for me.","title":"Disappointing experience","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"customer","text":"They sold me fake shoes that broke within the first hour of wearing them. NOT AUTHENTIC","title":"They sold me fake shoes that broke…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"Mrs McGowan","text":"The RealReal is a U.S based online consignment site for designer clothing, accessories and other luxury items.  \nI've made only one purchase of a specific designer eyeglass case which I received promptly, in excellent condition and as listed on the site. Upon browsing the site and with the variety of items listed, I have no doubt to expect anything different on other purchases as to condition and quality.\n\nHowever, I was disappointed in the customer service aspect of my purchase. The timeframe given to change, modify or cancel a purchase is very limited and unreasonably so with a weekend purchase. Connecting to a live agent, was very difficult and when I finally did, the timeframe had expired.  Efficiency in processing orders, shouldn't supersede good customer service, in my opinion","title":"The RealReal: Designer Consignment Online","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"Jennifer","text":"I searched high and low for the perfect leather jacket and finally found it on The Real Real. Sadly, I was sent the wrong item (somebody else's perfect jacket, I imagine). I found the customer service chat people to be polite, but ultimately unhelpful in fixing the issue. The most frustrating part was that I had to eat the $45 I paid in duties and never received the item I originally ordered.","title":"I didn't get what I ordered.","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"customer","text":"I’ll stay with new purchases item was put in a box 5 times larger than item was torn stained and did not appear any where near”pristine condition” first purchase and disappointed.","title":"Stick with new returnable items","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"Kareem  Daniel","text":"My purse is not in excellent condition as stated. Strap is worn and dirty, so is the purse!","title":"My purse is not in excellent condition…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"Katrina Alevizos","text":"The new with tags purse was decent but the north face fleece sweatshirt was garbage. It was obviously damaged from being put in the dryer, but that wasn’t apparent in the picture online. It was in no condition to be sold. Maybe I’ll use it to make a cat bed, but it is unacceptable to wear on my body.","title":"The new with tags purse was decent but…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"customer","text":"I ordered a pair of diamond stud earrings, which arrived beautifully. However, they were just placed in a small zip lock plastic bag. Pretty disappointing to purchase an item with a retail value of over $2000 and receive it in a plastic bag???","title":"Packaging Needs Improvement","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"Micketh","text":"Company sent out the wrong item internationally- incurring unnecessary import fees for me. Upon returning the item, I now seem unable to use PayPal in order to purchase further items. I was willing to give the company another chance as I have had things from them with no problem in the past. However, despite customer service responding through their chat function, they have not being able to rectify this. I seem to have been blacklisted for returning an item when they sent out completely the wrong product in the first place. This is on top of unnecessary import fees - please be aware international buyers.","title":"Prevented from ordering using PayPal- confused","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"customer","text":"Wrong size, false advertised regardless of whatever sale. Shoe Box was mashed up inside of the box it came in. 700$ brothers… 700$ to get scammed basically. 99% sure it was advertised for size in US then I receive the size in UK and women’s sneakers not men’s. Like what??","title":"Wrong sizes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"customer","text":"One item was as pictured. The other item was not as pictured as the heel tip was missing from one shoe. I am extremely disappointed that I have to pay nearly $30 in shipping charges for an item that I would not have ordered if the description accurately described what was actually delivered. I am reluctant to order anything else from your company.","title":"One item was as pictured, the other was not","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"customerC Potts.","text":"On the fence.\nThe item arrived in a timely fashion. The box doesn't really fit the pochette. The booklet matches the pochette. The card that came with it looks as though it was cut out in a hurry--the corners are not square. The pochette seems to never have been used. It is almost too perfect. Especially since it is from Summer 2013. There are inconsistencies.","title":"On the fence.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"pr","text":"I purchased this as a gift and was shocked to find the previous owner’s initials engraved on the back of the charm. The post contained no photos of the engraving. I can’t believe you thought this piece retained value when it was personalized in this way, and that you were too lazy or deceptive to disclose it. Very disappointed and makes me distrustful of TRR.","title":"Previous owner’s monogram","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"customer","text":"In the description it said it was a small.  When I got the dress it was a size zero.","title":"In the description it said it was a…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"customer","text":"I received the wrong item. I ordered an ivory sweater, and received a mustard yellow tank top instead. Not even remotely similar? I also ordered a red tank top in “excellent condition”. When I got the item and pulled it out of the box, it was completely covered in dust\/dirt. It looked like it had been sitting on some warehouse floor and people had been walking all over it for years. Aside from rumored authenticity issues for high-price items, TheRealReal clearly lacks proper responsibility and ability to store, organize, and ship items so that they are correct and in the best possible conditions. I assume some items will have snags\/not be in pristine condition as this is a consignment store, but to deliver an item that is coated in dirt clearly from their own facilities, or ship a completely different item than ordered is unacceptable.","title":"Terrible Experience","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"Sarah Bee","text":"Clarity of consignment revenue is hidden, you should allow sellers to easily claim back their items.\nYou sent back an item I had sent to consign with no context. Over communicate text\/email\/your portal that nobody would check.\nYou send me a Fendi bag with my order that I didn't even order. How laughable. I had to reach out to you 3x (once via concierge, once via email, and once via chat to reach someone) the poor soul that also bought the bag must have lost all trust in you. I sure did. I'll buy from you buy from you but I just hope you actually require a signature for delivery (you don't) and I get the right items.","title":"Meh; would buy, don't sell, but also cross your fingers?","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-08","author":"VOLHA","text":"The order was delivered for a very long time. Item was not in the condition described. The site says that you can return and in the box there was paper that the return is not possible.","title":"Very bad service","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=2&stars=1&stars=2&stars=3"}]