[{"date":"2022-04-30","author":"LVarela","text":"Bought sunglasses and received a damaged box, soaking wet dust bag, stained and damage case and no sunglasses. \nVery sad experience.\nSo disappointed. \nWon’t buy again.","title":"Bought sunglasses and received a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"\"vip \"  client","text":"The consignments never put attention they don't cannot pay you up front and also they give such a crazy price for your items and add these calls without your permission discount discount to your items your own  Propety","title":"The consignments never put attention…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"AC","text":"FI was disappointed with the experience to buy a piece of jewelry (and returning it). \n\nI think the shipping was SLOW, and it was expensive (it should be free and the cost included with the item price).\n\nIn the future, I will think hard if I want to buy again.","title":"Disappointed","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"seller","text":"Commissions for lower and mid priced items are too low. Should at least increase the percentage based on merit\/rewards tier","title":"Commissions for lower and mid priced…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"customer","text":"They make online ordering worthless with no returns.  Now I'm stuck with pants that don't fit...","title":"They make online ordering worthless…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"customer","text":"There needs to be more photos. I spent a lot of money and when I received the product there were some stains and blemishes that were not able to be seen","title":"There needs to be more photos","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"JANIA BRACHE","text":"Second time I receive dirty items.","title":"Second time I receive dirty items.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"customer","text":"The garment was as advertised, pristine with the tags attached.  However, it would have been helpful that they said size 4 rather than size small.","title":"The garment was as advertised","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"StormyOne","text":"The bag is beautiful but the interior smells absolutely horrible! Nowhere was it mentioned that there was a horrible odor. I know smells are subjective but this is way too bad to overlook. I am trying everything possible to mitigate the smell but if it doesn’t work, it is definitely going back! There should have been at least a mention that there was a “storage odor”. Very disappointed and will not buy here again. Have purchased many vintage bags on other sites and never had this problem.","title":"Horrible odor","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"customer","text":"I LOVE The Real Real but I ordered a skirt that said “Excellent. No visible sign of wear.” But upon arrival the skirt had discoloration on the back and a small tear. I think the shipping rates and return policy\/charges are way too high and honestly the return policy prevents me from ordering much much more frequently.","title":"I LOVE The Real Real but I ordered a…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"customer","text":"The description of my jacket was incorrect. There were quite a few holes in it, that weren’t on description.","title":"The description of my jacket was…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"customer","text":"The stains on the item should have been pictured. There were dark black ink stains on the sleeve and an undisclosed stain on the front of the item. I likely won’t buy from this site again— definitely not an item described “very good”. I would have expected a designer consignment store to err on the side of caution with its description not downplay the use. Very disappointed.","title":"Disappointed","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"Kim O'Neil","text":"I was sent a totally different size shoe.  VERY DISAPPOINTING 😞","title":"I was sent a totally different size…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"customer","text":"I bought a pair of shoes because they were size 37 and I receive ones from a different size.","title":"Wrong size","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"Mrs. Fox","text":"Ive made purchases prior to my previous. My purchases include, a bucket, louis Vuitton, excellent condition. Three pair's of shoe's. All outside soles , excellent condition.. However this last 2 pair's of shoe's are visibly worn. At the toe the outside material is pulled back, and the sandals look dirty, worn a lot. Not pristine. I really expect customer service to be more selective on items to be sold.","title":"Ive made purchases prior to my…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"Teekay","text":"Inconsistent Size Guide for clothing and return process for international shipping cost too much as the customer loses whatever he\/she paid for custom duty and bears the return shipping cost.","title":"Inconsistent Size Guide for clothing…","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"theowls","text":"Returned the item I purchased because it was not in condition as described. It was described as “excellent - no flaws” but smelled like the dress had been laundered and reeked of detergent. When returning the item there is a $11.95 “processing fee” which is unnecessarily high. I am\nstill awaiting a refund which has yet to be processed…","title":"Would not buy again","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"customer","text":"Overall, product description was correct. My one complaint is that the front pocket was clearly not checked or cleaned. There was significant dirt and gunk in the front pocket. Twenty minutes of cleaning got most of the gunk out, but my expectation is that the company clean and check the product before selling.","title":"Product Cleanliness","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"customer","text":"The Chanel purse that I purchased said it was in excellent condition. There were marks on it and it smells bad. Like someone was smoking inside the purse. I am having to try different solutions to get the smell out. It wasn't cheap and I feel for the amount of money it shouldn't smell like that. \n\nWallet was in great condition","title":"The Chanel purse that I purchased said…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"customer","text":"Photo of bag was deceptive.   The item color stated grey.   The photos showed a bag so dark it almost looked black.  When it arrived the color was a medium light grey, nothing like the photo.  Also it claimed the bag was in excellent condition.  It arrived with  several stains.","title":"Photo of bag was deceptive","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=12&stars=1&stars=2&stars=3"}]