[{"date":"2022-03-02","author":"Rhonda Moats","text":"THE ITEM I PURCHASED WASN'T WHAT I EXPECTED EVEN THOUGH THE QUALITY IS GOOD. MY PACKAGE CAME 3 DAYS LATE","title":"THE ITEM I PURCHASED WASN'T WHAT I…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"customer","text":"My package never arrived","title":"My package never arrived","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"customer","text":"There are some great deals to be found, but the shipping is so high and I don't like that some items can be returned while others cannot - really makes me question things before I purchase them.","title":"There are some great deals to be found","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"Hrsgal","text":"I ordered a pair of sunglasses that were listed as in very good shape.  The only issue listed was bent arm on them, which I was fine with.  When I received it in the mail the first warning sign that this was a bad buy was the case they came in.  It was absolutely disgusting and dirty.  I really didn't even want to touch it.  When I got to the glasses.....ummmm...wow.  There was a scratch so big and deep in one lens you can't even see out of it.  The arm was bent but I expected that but was also scratched up and 75% of the jewels on it were missing.  These glasses should never have made it on the site.  The only place they belong is the trash.  They should have at least given an honest description and listed them as poor.  Not impressed and out the shipping $$.","title":"Description Not Accurate","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"customer","text":"Sizes were way off and unreturnable. Complete waste of money","title":"Sizes were way off and unreturnable","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"Ann Chloé","text":"Another business hiding behind Covid to make excuses for their greed and poor treatment of their customers. Reporting them to FTC","title":"Disgrace","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"Erica Cross","text":"The sweater I purchased was noted to be in \"Good\" condition because of pilling and some discoloration at the cuffs. I felt the sweater was actually in \"Fair\" condition - the discoloration (i.e., dirt) was much more significant than pictured, and was present on the neckline as well as the cuffs. I also felt that for the $12 shipping fee, the shipping speed was very slow.","title":"TheRealReal Review","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"Linda","text":"The experience was ok, but when I got my handbag I found the security lock was still on so I had to find someone that could remove it.  Also, they said they would email or text tracking and that never happened.","title":"The experience was ok","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"customer","text":"My item is broken and unwearable","title":"My item is broken and unwearable","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"customer","text":"I will never shop with this company again i got a fake Louis Vuitton handbags from the realreal  which is very sad","title":"Fake Louis Vuitton","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"Emily","text":"I received the wrong item. Promptly returns it abs requested support in getting the item I had ordered. Because it had already been processed as sold,  I was not able to reorder it.A refund was processed but I still can’t order the item I originally attempted to purchase.  It has taken several messages to Helpdesk and it is still unresolved.","title":"I received the wrong item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"customer","text":"The jacket said xl online but it’s more like an xs. And of course no returns. Already had more gear in my cart for a future purchase too.","title":"The jacket said xl online but it’s more…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"Ms Estrada","text":"My issue was not resolved. I asked to speak to a manager and was told a manager wasn’t available at the moment but they would call me back. I never received a call back from the manager or anyone else from TheRealReal.","title":"Bad Customer Service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"Victoria","text":"Having an AWFUL experience with Customer service. I purchased a pair of sneakers during their special credit promotional period. When I received them and after further inspection and third-party authentication I was Made aware that they are a replica and not authentic. I contacted the real real Customer service and I spoke to someone named Hazel who is a Service specialist by title. There were other items part of my order and this made me eligible for the promotional credit if I return these I’m no longer eligible but I purchased them just so I could be eligible for this promotional. Nevertheless he told me to return them and that I will not be getting any kind of credit which is fine if I was purchasing what they were advertising however their authentication system failed and now the customer is suffering and being punished. For this headache and their failed authentication system they should be able to still honor the value of my original purchase even if I return to them these take an authentic and replica shoes. I have been a customer with them for the last seven years and over the last couple months they have had inventory issues authentication issues and therefore not only do I not want to purchase from them I will also no longer sell with them absolutely horrendous service.","title":"Having an AWFUL experience with…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"customer","text":"bad service from customer service","title":"bad service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"customer","text":"The item I purchased was supposed to have one minor snag in fabric. Instead, it had missing beads that were falling off as I opened my package. It was final sale, so I did not have the option to return itm I also requested a label to sell and did not receive it.","title":"The item I purchased was supposed to…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"customer","text":"Never received my order, called customer service they said they would raise a ticket with UPS and never heard back","title":"Never received my order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"customer","text":"Louis Vuitton Trevi GM\n\nThe bag I received was as described. I have an issue with the quality of the dust cover (didn't fully cover my bag) and the fact that it wasn't stuffed. The canvas could have been damaged from it not being stuffed. I paid too much money for this bag for them not to provide a quality dust bag and stuffing. Need to do better RealReal.","title":"Louis Vuitton Trevi GM","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"spikey games TV","text":"I bought a #$1,400 Louis Vuitton purse off the real real. Now, i understand it was used, but you would expect it to be in GOOD condition. It was stained badly, and not only was the inside filthy with what appeared to be the inside of a cigarette that had broke apart, but there was also a gross looking piece of trash in the pocket. To say i am disappointed and feel like i was ripped off is an understatement!","title":"I bought a #$1,400 Louis Vuitton purse…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"Kate","text":"Very disappointing experience for a first-time user. The return policy was not clear and now I am stuck with $250 worth of absolute garbage. The sizes were not as described and the items were very low-end versions of brands I usually wear. Unclear if these items were just very old or factory-type products. Will not shop with The RealReal again.","title":"Very disappointing experience","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=78&stars=1&stars=2&stars=3"}]