[{"date":"2022-03-16","author":"Bettye","text":"I am truly disappointed with my merchandise. I ordered a pair of shoes not only were they not new they were completely worn.  Then to further add insult to injury there's an eleven dollar charge to return them through a process that's anything but convenient. Thanks Real Real but no thanks","title":"I am truly disappointed with my…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"customer","text":"Nothing was delivered","title":"Nothing was delivered","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"customer","text":"My issue is not resolved I was not happy with the service I received I have consigned and purchased with you all for years and I’m shocked at the resolutions I was offered!","title":"My issue is not resolved I was not…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"Timothy Harris","text":"I've  ordered my merchandise over a week an a half ago and all I'm getting is these BS emails. Nun stating that my package has arrived!","title":"I've  ordered my merchandise over a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"customer","text":"I was so excited to see a pristine bag that claimed still have tags. To my surprise, the “tags” were a wadded ball of care tags… It was poorly packaged and the top of the box was stains with the red of the crystallized accessory on the bag that was scraped. Either they poorly evaluated it or done in transit.  You can also see the scratching on the accessory as well which is such a bummer. So much for pristine -__- This product was also very closely priced to the original ticket price. Might as well have just bought a brand new one instead of being disappointed.","title":"So much for pristine -__-","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"customer","text":"Shipping was kind of slow. I received the shoes in an oversized dust bag where the shoes were thrown in it, with what looked like random black scrunched up tissue paper.Not neatly done with care AT ALL.\n\nThe fur on the shoes were not treated, or brushed. I would assume that if you are spending a few hundred dollars on an item that the company would put some care in their presentation. The shoes came scratched at the toes and were not even buffed or polished. Definitely did not have a wow experience when receiving my purchase.\n\nI like what i purchased but will have to put forth additional work to get them treated.","title":"Unsatisfactory presentation","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"Benjamin H.","text":"I was thrilled when my aunt introduced me to this website! It’s got a killer selection of goods. The most thrilling of all was a gold band that I knew immediately was made to live another life as my wedding ring. I tested my ring size before ordering so I knew I was getting the right size. The order shipped as desired and I LOVED the look of my new ring! So far, 5 stars. However, it was too big and slipped off my finger. I’m not an expert, so I thought I’d made a mistake. I took it to two jewelers, and yep, the actual ring size was 9.5 - not a size 9 as listed on the website. For a company that prides itself on authentication, selling a size 9 ring that isn’t actually a size 9 is a bit of an embarrassing hiccup. I still love the ring, so I coughed up almost $30 to get it locally resized. For a $300+ ring, that’s another 10%. I wish they’d sent me the right size in the first place.","title":"Right ring; wrong size! (Sold as 9, half a size off)","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"Bean","text":"I bought a pair of jeans that were advertised as the correct size, in my case 27.  They were so darn small that there was no way they were a 27.  Now I'm stuck with a misadvertised pair of jeans and no way to wear them.  I'm not interested in buying from the high priced site if you can't monitor the merchandise.","title":"I bought a pair of jeans that were…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"Sarah","text":"I used to love this site, but the mistakes keep happening and the last interaction with their complaint department was akin to a 5th circle in admin hell.","title":"I used to love this site","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"Jamie","text":"My relationship with TRR is a mixed bag. I've made about 15 orders with them totalling around $5-6000 so not a high spender by any means. I've had good luck finding some amazing pieces I would not have found anywhere else and they give me access to brands we just don't have in Canada. What I have learned however is that whenever you buy it really is a gamble on what your going to get. I've had quite a few orders where items have come to me with significant damage, stains and holes,  none of which were listed in the description. I only buy items that are in minimum very good condition but aim more for pristine or excellent. Even then I have had items come with stains on them or with damage. I've also had items come that were measured incorrectly and therefore did not fit. They do offer returns on some items but being in Canada means I have to pay for shipping each time which is between $30 to 50 so it's not something I want to do often or even makes sense once you calculate the cost of shipping initially ($48.00) plus the return shipping makes it not worth it. The pricing they have on some items is way off especially considering majority of items are used, I've seen them charging the same if not more then retail for used items. For example, they had a women's Adidas baseball cap with no back for ponytails which is less then $50 brand new and both times I've seen the hat they had it listed for $144. So you definitely should be somewhat knowledgeable about prices if that matters to you. The shipping is fairly fast, usually order will arrive on 3rd day which is pretty impressive for international shipping. The customs for me are usually $10 or less for orders $300 -$400 so not bad at all. However, if you get an item that is new with tags customs will charge you based on the tag price not what you paid and so I've been nailed a few times with charges about $70 on those items. I think they should definitely start offering free shipping for orders over a certain amount like Revolve does, it would get them alot more sales imo. \nCustomer service is so so, anytime I have emailed regarding an item I recieved that had damage or stains they have never offered any compensation for me even if the item never listed any issues. They also take forever to answer you in the first place and sometimes I never get a reply back and will just keep emailing them until I do. \nAll in all I think they offer a tonne of products and ones that are rare , unique and a bargain compared to retail price but just keep in mind that you never know what condition the item will come in at the end of the day . They definitely have areas to improve in and hopefully they do. Longer cart timers would also be awesome because 20 mins is not long enough!","title":"Most of the time , great experience.","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"customer","text":"No refunds and only 1 of 4 items fit.\n\nI ordered four pairs of pants with my exact measurements matching those in the item description. Only one fit, none had the original tag on so I couldn't know if they'd made a mistake or not. Because they were all on 50%+ off, there was no return allowed, which I knew going in, but given that they are so far from fitting I can't reasonably wear three of them.","title":"No refunds and only 1 of 4 items fit.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"customer","text":"Item received was far more damaged than what was offered in description and will need repair beyond what was advertised.","title":"Item received was far more damaged than…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"customer","text":"The sunglasses came dirty with make up on the nose. Shipping and price was good","title":"The sunglasses came dirty with make up…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"Lauren Wingfield","text":"So the item I purchased was definitely much more damaged than pictured and described. When you go to create a return you somehow lose money instead of getting back exactly what you paid for the item. I will be returning this item and never shopping on this website again","title":"Never again","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"customer","text":"The box it was shipped it looked like it had been attacked. The handbag itself was not damaged. The bag had a very strong order to it. It’s unpleasant. Not sure how to fix that and unfortunately it’s non returnable.","title":"Strong Oder","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"customer","text":"Buying process is always easy to deal, however I had a bad experience with returned items that I sent out to consign. Rejected items were sent back one item at time, not all in one shipping. This is very confusing to me and not economical way for the TRR either. Also during this process I have moved to a new home and updated the information immediately in the system as well as email confirmation with Ryan at consignor relations, the boxes were still sent back to my old house and left there where no one lives there and was lost at the end. I finally made call to the office and Naomi from consignor relationship is taking care of this matter for me now. I appreciate her prompt response and responsible action that she is pursuing.","title":"Returned items lost","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"customer","text":"Haven’t received any communication regarding my lost package.","title":"Haven’t received any communication…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"GV","text":"I was excited when my package arrived with my Gucci handbag and wallet. To my surprise they sent the wrong handbag. I reached out right away and was sent a return authorization. I asked if I would receive the correct bag and was told someone would contact me. The next day I reached out again and could not get a straight answer. I was told to return the item and once it was Authenticated, I would get a refund. I thought that was outrageous. Once they received the item at their warehouse, the refund should be processed but now I have to wait the additional time for someone to authenticate the bag that they sent incorrectly. I asked if on my next purchase, they could include free overnight shipping to compensate for the inconvenience and was told that I’m lucky I’m not paying for the return shipment fee.  Unbelievable and I still haven’t heard back on the actual handbag I purchased.","title":"Terrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"Pit","text":"I ordered three dresses. One of which was the wrong size. It also was described as “excellent” condition but was a dry-clean only dress and had clearly been washing machine washed. Am very disappointed that I have to pay to return ship something that was TheRealReal’s fault for sending me something in the wrong size (it was marked on the site as US size 6\/UK size 10, but actually was US size 10\/UK size 14) and not actually in excellent condition. I now know what “very good condition” means, which the other two dresses in my opinion were not in “very good condition.” The hem was hanging out the bottom of one. I guess that is buyer beware and will hesitate to order much from TheRealReal moving forward.","title":"Bait & switch beware","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"Adele","text":"I asked that my delivery be held at my local FedEx location as I was not going to be home to receive it.  TRR did NOTHING  and the package was delivered just as I did NOT want it delivered.","title":"TRR not helpful at all","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=63&stars=1&stars=2&stars=3"}]