[{"date":"2022-04-23","author":"Keith Ashley","text":"Was delivered to wrong address. Never received the jeans","title":"Was delivered to wrong address","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"customer","text":"Some clothes had noticeable defects that were not listed. Also a noticeable and off putting smell to all the clothes. \nShipping fees for Puerto Rico are completely disproportionate compared to any other site that counts Puerto Rico as domestic.","title":"Some clothes had noticeable defects…","stars":2,"location":"PR","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"customer","text":"The belt was advertised as 90 cm.   when it arrived, it is actually 80cm (too small for me).   Not satisfied at all.","title":"The belt was advertised as 90 cm","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"customer","text":"The product I ordered was  selected as exelent condition  in fact  I got very old bag   , in very bad condition","title":"The product I ordered was  selected as…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Gracie","text":"The product was in good condition except that the sender smashed the straw hat with beautiful fringed edges into a box that was too small.  Now the straw edges are bent or broken.  They also packed it upside down so the brim was completely misshapen.  I was able to manipulate the brim into the proper shape.  Very disappointed and shocked you would handle an expensive hat that was never marketed as “packable” in this manner.","title":"The product was damaged","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Denise hallman","text":"The assistant was great but the hold time before reaching a human was obnoxious.","title":"Long hold time","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"customer","text":"I received wrong item which I did not order at all!!! I can not reach customer service!!! And the item which I ordered not available any longe!","title":"I received wrong item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"customer","text":"Loved the shoes purchased… just wish they were the size that was advertised… now I have to pay to return them😒","title":"Meh…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"customer","text":"I have had nothing but issues buying and selling with The Realreal. This recent purchase was no exception. The purse arrived in way worse condition than advertised and photographed completely hiding the terrible shape the purse was truly in. That AND it arrived with broken mirror shards inside. Fun!","title":"I have had nothing but issues buying…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"customer","text":"Bad customer service","title":"Bad customer service","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"customer","text":"Love the ease of searching for these great clothes. Super easy to filter for just what you're looking for. Only three stars because some items came which were not the advertised size. Also when I reached out to customer service, it was not a helpful experience. Chat box told me to go about my day but then when I wasn't there right away they closed the chat without answering my question.","title":"Love the ease of searching for these…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"customer","text":"Honestly this is the first time I've bought through this website.  Product arrived earlier than expected so that was great. But definitely wont be purchasing from them again. Item received turned out to be women's and not mens nowhere on the page did it say this. so now I am stuck with a Item that is not returnable and money paid cant be applied to another purchase. Definitely not happy and worth sticking to places I'm familiar with.","title":"Honestly this is the first time I've…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"customer","text":"I never received the shoes, it taking days to for y’all to get back to me because I never received a tracking number or an confirmation on my order. And at the beginning y’all said my order never existed.","title":"I never received the shoes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"customer","text":"since selling expensive items shipping should be covered!","title":"Shipping","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"customer","text":"The jacket is OK; overpriced for what it is and sizing said it was much larger than it is. The lining needs to be aired out as well - it's not a \"bad\" smell necessarily, but it has a faux-perfumey edge to it that's unpleasant to me. Not sure if I'll shop here again. I have a feeling most of the items are more highly priced than what they're worth. Wish I had spent more time thrifting on my own, but lesson learned.","title":"The jacket is OK","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"customer","text":"Did not receive all my items no one reply","title":"Did not receive all my items no one…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"steve","text":"They couldn't process a verbal order as their system does not remove expired credit cards from the system, and they don't give a way for you to do it either. So customer service has two cards on their system but it doesn't show which one is current, so they submit the wrong one creating errors and unable to complete order. Also, their search function is garbage. If you want to have someone else order something for you as a gift, there is no way for them to find the item you want as the search function cannot search by item number, only by description. And trying to search on the item description can display hundreds of similar items without knowing which one is correct.","title":"Very poor user interface and unhelpful customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"customer","text":"No one helped me","title":"No one helped me","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Loretta Daniel","text":"Packaging was a complete mess! No signature required for my purchase. Just left on my porch with a busted opened box. I will never purchase pre-loved from your company ever again. And then had the nerve to say no returns WOW!  I will be putting the word out to friends and family regarding my experience.","title":"Packaging was a complete mess","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"customer","text":"The bag I ordered had a brown oily stain that was not pictured on the site","title":"Mislead","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=20&stars=1&stars=2&stars=3"}]