[{"date":"2022-03-22","author":"customer","text":"I received the Gucci Jackie O hobo and I am surprised The Real Real agreed to consign this bag; it was worn far beyond what was in the description.  The bag is of no use to me and is a final sale. Very disappointing experience.","title":"Handbag Worn Beyond Description","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"customer","text":"The condition of the bag says \"very good\". But when I received the bag, it looked very old. Very obvious wear signs of the whole bag and middle discoloration at exterior. It should not be categorized as \"Very Good\" condition.  I am so disappointed of this purchase.","title":"It is not a \"very good\" condition item.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Yi-Ling Tam","text":"After many emails, phone calls and texts, three items are still missing.","title":"Missing items","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Heidi ","text":"I was asked to send pictures of shoes I purchased that are clearly mis-sized. Did not hear back from customer service.","title":"I was asked to send pictures of shoes I…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"customer","text":"Shipping was late, and after spending 5k I think shipping should’ve been free, and also should be a required signature when receiving a package!","title":"Shipping should’ve been free after spending 5k","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"First Time\/Last Time Customer.","text":"Horrible customer service.  Ordered 2 items both XXL Mens Polo shirts.  Received 1-XXL and 1-2XB.  I understand mistakes happen.  What I don't understand is spending 35 minutes in chat hell explaining this error on The RealReal website. At first, they even wanted to charge me $11.95 to return the mis-sized shirt.  After pushing back, providing them with a photo and basically not taking no for an answer.  The chat customer \"service rep\",( who was helping 3 other customers at the same time) gave in and provide me with a return slip.   Never dealt with such rude customer support.","title":"Horrible customer service.  Buy Elsewhere","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"customer","text":"Received the wrong item.  Its been several days and no resolution yet.","title":"Received the wrong item","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Michael Sacks","text":"In the past I would’ve easily given real real five stars. Currently I am in the middle of a huge consignment that has been very problematic. There are many items missing and unaccounted for, I received items back that weren’t mine, there’s a very expensive item that was sold at a price I didn’t agree to marked returned and has been marked return for a month without being listed again. I have been waiting weeks and weeks regarding jewelry pieces and other clothing to see what is being accepted and what isn’t.  The only reason for an extra star beside the one star is my account executive who I feel is doing as good a job as humanly possible and trying to get me answers to questions. I don’t know how this is going to play out. I will gladly revise or remove this review once issues are addressed and fixed.","title":"Real real hassle. Hoping it will change.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"BC","text":"The description of the bag I ordered was red. I received a black handbag. Also, It looks like an authentic fake Marc Jacobs. Is that possible from the RealReal?","title":"The description of the bag I ordered…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"Still waiting for your team to find several items that were misplaced or lost.","title":"Still waiting for your team to find…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"New customer, very disappointe","text":"I am a new customer, and after shopping for some time, I ordered a Kate Spade bag from your site. It was to be a gift. The condition was listed as \"very good,\" which I know isn't excellent, but I thought it would be in very good condition. However, when it arrived, although it looked pretty good, it reeked of cigarette smoke. Not appropriate at all as a gift. Terribly disappointed, I went to your site to see how to return or exchange, but this item was listed as \"not returnable.\" I had not noticed anything to that effect when I purchased, so this has left a bitter taste in my mouth. I am not sure if I'll ever buy from you again","title":"New member, very disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"Gloria","text":"Packaging was terrible. Purchased a piece of Tumi carry on luggage. The box it was shipped in was about double the size of the luggage. There was no packing material in the box so it arrived completely crushed and box was split open on 2 sides. Not sure I’d order from them again.","title":"Packaging was terrible","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"Monica","text":"For UK buyers-\n\n1. The import fees are pretty big, on a pair of gucci shoes I paid £317 for, I had to pay £155 on fees and VAT. I paid £96 fees on a skirt I paid £466 on so unless you understand fees pretty well, you might be surprised.\n\n2. Going forward I would only ever buy new or pristine items. I bought suede gucci shoes marked as condition very good. Notes were light scuffs on soles. I wish I could add pics here but the heels were so scuffed there is no suede left on them. Getting a returns label is easy but knowing how to get your vat\/customs fees back seems so difficult. So just because they say light scuffs (and the pics are taken so you can't really see the damage) doesn't mean that is what is going to turn up.\n\nI have bought a lot of stuff from therealreal and this is the first time I am disappointed but now at least I have learned not to risk buying their used items. Just some advice.","title":"For UK buyers-","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"My order was canceled without reason.","title":"My order was canceled without reason.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"Linda Wiener","text":"ORDER #R733737160\nI received an order that was supposed to be in Excellent condition; however, there are five noticeable stains down the front. I called the chat line and spoke to AryaM for 14 minutes. She agreed to send an email address so that I could, in turn, send pics of said dress. I never received an email from her. While the dress is non-returnable; this should be waived, as I was sold inferior product that was noted as being Excellent. This is very poor customer service and I do not recommend this company.","title":"ORDER #R733737160","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"The description\/condition of items is not always accurate.","title":"The description\/condition of items is…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"Liz","text":"Shipping super slow.  Thought I ordered with plenty of time before event.  Now I have very little time between try on and return if needed.","title":"Shipping super slow","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"Evangeline","text":"Looks as if it belongs to two different sizes . Piece together.","title":"Dress pieces ?","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"Price was good but the MCM is very faint, likely due to the age of the bag. Otherwise the bag was in good shape. Just wish I would’ve picked up on the faint logo before purchasing.","title":"Decent price but Faint logo","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"Photos and description were not accurate to the item I purchased.","title":"Photos and description were not…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=57&stars=1&stars=2&stars=3"}]