[{"date":"2022-03-15","author":"customer","text":"I canceled immediately my item or I order.\nAlso sent email  immediately canceled all info.\nBut took so long to credit back my account.","title":"I canceled immediately my item or I…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"customer","text":"Quick shipping but don’t order from Canada if you don’t want to pay duty. I thought everything was great and then I got a bill from UPS about two weeks later so in the end it was not a good experience.","title":"Don’t order from Canada if you don’t wanna pay duty","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"customer","text":"Absolutely worst customer service and management and leadership. This company will fail without many business changes. \nVery disappointing!","title":"Won’t shop here again. Bad management team","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"customer","text":"No clear sense of satisfaction.\nInvestigating a non-delivered package it may take up to 10 business days.\nMoney was paid immediately not after 10 business days......","title":"No clear sense of satisfaction.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Skip Emerson","text":"Sizes were incredibly wrong. One shirt was not even a men's shirt but a woman's blouse, but they have experts, right. Cost me money and I will never shop with them again. Zero stars if I could.","title":"Sizes were incredibly wrong","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"customer","text":"The blouse has many spots and very bad condition even you mentioned \"very good\" condition. I was so dissappointed and wont shop with you any more.","title":"The blouse has many spots and very bad…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Fiona ","text":"Good service re delivery etc, but not very impressed with the dress I ordered. The elastic on the shirring around the waist had lost its elasticity and the dress therefore didn’t hang as it should. I’ve had to replace the shirring, which was an additional cost I wasn’t expecting. It was advertised as being in ‘excellent’ condition, but was clearly not.","title":"Good service, less impressed with my purchase","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Rab Shyne","text":"So my wife purchased what she thought was a Cartier Gold plated Lighter as the item was described as that. When we received the lighter it was a Dunhill rollagas with the red cartier authentication card and gold plated take down tool that isn’t used for these type of lighters 😂😂\nHow does something like this get past “Expert Authenticators” oh and the lighter on the bottom of it by fuel port was clearly marked Dunhill made in Switzerland. I wish I could upload the chat with the return agent and pics of what we received.","title":"So my wife purchased what she thought…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"customer","text":"NIce glasses but description stated that they were polarized. NO. They were prescription. Not returning due to trouble for amount of refund.  Not interested in shopping here in the future.","title":"NIce glasses but description stated…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Liz Jones","text":"An horrendous experience as a new customer. I was expecting better from what looked to be a reputable company.\nFirst of all, when I set up an account, I was given a new customer store credit of $25. I tried for several days to purchase a couple of items but no matter what payment method I tried or what device I used, it kept saying my payment was declined.\nI contacted customer service by email and they advised that something called an \"auto-block\" was put on my account. I buy and sell designer items, and I spend large amounts online all the time....I have no idea why they would block a new account without letting you know that there's a problem. I wasted hours trying to place the order, believing I was doing something wrong. They told me to wait 48 hours for them to remove the auto-block. \nSo I tried again 48 hours later and now my store credit had expired because of their incompetence and delays. \nI contacted customer services to ask if they would reinstate my store credit as it was an issue at their end that caused the delay and I received no reply whatsoever. I sent a follow-up message and, again, I've been ghosted. \nI don't think my request was unreasonable since I am fairly well-versed in customer service but, even if it were something they were not prepared to do, I'm flabbergasted at how such a big organisation would simply ignore their customers. A simple reply, whether yes or no, would have been enough.\nI feel so disgusted by their rudeness and complete disregard for basic customer service, that I will never use this company again and I leave this review and others to forewarn anyone thinking of buying from them.\nIt's yet another example of blatant unaccountability. They mess up and when you politely ask if they would rectify, they ignore you!!  As if their error hadn't cause enough inconvenience already.\nI've been in sales for over 18 years and I cannot imagine treating people in this way.\nI'm not some entitled rude person, demanding things I'm not entitled to. It's not even about the money, it's about the principle of it all. \nHave a bit of integrity and honour The RealReal. You may not care about the average person who's a relatively small customer, but if you alienate all of us, you'll soon be left without a customer base. Shame on you. \n\nAnd as I say in most of my reviews, PLEASE don't leave some lame message with an insincere apology asking me to contact you and you will happily resolve for me. We all know that it's a face-saving exercise, it's lies to make you look like you are taking care of the situation to those who read the review when, in actual fact, I'll be treated in the exact same way if I were to contact you again. I've already contacted you twice about the latter issue and I've been ignored, so contacting you again will get me no further. Disgusting, unprofessional and unaccountable.","title":"An horrendous experience as a new…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"customer","text":"Item was absolutely perfect but they left the security tag attached. It’s different from the normal ones so i’m unsure how to take it off and i don’t want to risk ruining the the piece of clothing i got. they attached it to a tag on the inside and if i cut the tag off, there’s no real way of authenticating the item.","title":"Item was absolutely perfect but they…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"customer","text":"I did not receive my product","title":"I did not receive my product","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Dear Customer","text":"Although I love the appearance of my earrings, the description said they were white gold. I cannot find any marking that says they are gold; they look like silver. Also, they are very light weight. I am hoping they will hold up.","title":"Not as described?","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"customer","text":"I ordered a lamp which I never received although the website stated it was delivered.  When I finally was able to speak to a real person, which takes an act of congress to get someone on the phone, I was told that the item I ordered was damaged during delivery so I would be reimbursed after a review of the order.  Eventually I received an email stating that I would be reimbursed for the item but would be charged shipping charges and would only get this after I returned the item.  But I NEVER received the item and have nothing g to shio to be charged shipping.  This item cost close to $2000 and I still have not received anything, including my money back.  Furthermore, the customer service number immediately hangs up upon connection so I can never reach anyone to help. If I could rate TheRealReal a \"ZERO\" I would.  There is NO customer service with this company.  My next step is small claims court to attempt to recoup my money.  I advise people to be careful when ordering from this place.","title":"Be cautious.  No customer service if you have an issue.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"customer","text":"Fraudulent Listing\n\nWhen I purchased the ring, the valuation report listed the ring as having of Estimated Retail: $13,380.00, when the item was delivered the Estimated Retail was listed as $1,338.00. I have images of both in case the RealReal would like to help solve this issue. It is very disappointing that they would decrease the estimated retail value after the purchase without notifying the customer. Even if it was a typo, the customer should be notified of the change.","title":"Fraudulent Listing","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Rachel Lam","text":"My dress was perfection. I was disappointed to receive a customs charge.","title":"My dress was perfection","stars":3,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"customer","text":"The blouse I got was damaged but the description didn't indicate that fact. I then had to fight with your customer service to get a refund beauuse the item was \"non-refundable\". I thought you did quality control for all of your items???","title":"Not so much quality control","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"Janice","text":"I purchased 3 pairs of black jeans.  Only one of the three were actually jeans.  They were Rag & Bone, one of my favorite brands.  I also bought Theory and they were black knit dress pants and the other pair is Veronica Beard - also not jeans.  I thought I was purchasing a L, but when they arrived, they were marked size 4.  I will not be ordering from TRR for quite a while.  Sometimes things work out and sometimes they don't but since TRR is not even giving proper descriptions, it is hard to trust them and then you have to pay to return something you did not want.","title":"I purchased 3 pairs of black jeans","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"Boris","text":"I ordered this bag for my wife because she is a huge fan of Isabelle Marant. When the bag arrived we found out that it is a Jerome Dreyfuss Bag. Luckily she likes the bag and it is in a good condition. But it is not a Isabelle Marant bag as mentioned on the website.","title":"Wrong Brand in description","stars":3,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"Selena Scott","text":"I love my product however, the description stated it was gold hardware and when I received the item it was silver hardware.","title":"Great product wrong description","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=65&stars=1&stars=2&stars=3"}]