[{"date":"2022-02-12","author":"customer","text":"Was disappointed in the authentication process. Bought a David Yurman ring for my wife, it was clearly a fake.","title":"Was disappointed in the authentication…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"TOM","text":"I ordered three items, one of which was a pair of Nike running shoes in what I believed was a men's Size 11.5  As it turns out, the shoes were a women's Size 11.5 (much smaller), although your website was silent about gender.  When I returned the shoes for being too small, your return authorization stated \"Men's,\" so apparently you were fooled, also.  In any case, I'm not happy about having to pay for return shipping.  The error was yours.","title":"Women's Shoes Instead of Men's","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"Nadia Palermo","text":"Terrible quality. My item was damaged and not reflective of the quality stated in the description when I bought it.","title":"Terrible quality","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"customer","text":"Did not resolve my requests. Offered no assistance at all","title":"Did not resolve my requests","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"customer","text":"It’s the second time I buy on TRR and I bought both times items listed as excellent. Both times items arrived broken.","title":"Items are not label correctly","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"Jac","text":"I would like to be able to put actual sizes on my profile. Large comes up as size 12 when browsing. XL comes up as 16. I am a 14 so nothing is the right size. But I love the selections espeially shoes and handbags.","title":"I would like to be able to put actual…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"Aubrey","text":"The bag was dirty and had obvious marks that could have been cleaned, and the parcel was horribly packaged. I would be embarrassed if I ever shipped something that looked this terrible.","title":"Dirty item …","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"Maureen McCausland","text":"I remember that pocketbook it was a beautiful pocketbook back in time,  but when I received it looked really beat up! It wasn't worth No $70.00 I threw better pocketbooks out not worth the money.","title":"Beat up and worn out","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"customer","text":"Wrongs sizes received for TWO of the THREE pair of designer shoes that I ordered. The handbag is not authentic. I contacted TRR and still have not received any response on these issues.","title":"Wrong sizes not authentic","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"customer","text":"Sold me a fake bag. Not sure they do any type of authentication. Purchased a chanel bag for $4000 that did not even have a serial number inside. Will never ever purchase from this site again!","title":"Sold me a fake bag","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"Rose Waldman","text":"Do NOT consign with the RealReal. I just did, and boy, do I regret it! They offered me a $50 \"bribe\" to consign with them, and now that they put my clothes up, I can see why the bribe was needed. One of the dresses, for example, is a Carolina Herrera brand new dress with tags that I purchased at a Carolina Herrera store and never wore. Not only was it never worn, it hadn't even been tried on since I owned it! (My daughter felt it wasn't her look.) The dress, which originally retailed for $700, went directly from the Carolina Herrera shopping bag to the Real Real. It sold the first day they put it up. Do you know what my earnings are? 16 dollars! Sixteen whole dollars for a 700 dollar dress! They put it up without saying it is brand new with tags. In fact, they wrote, \"minor pull throughout.\" The dress was BRAND NEW. There wasn't a single pull anywhere unless it happened in transit to them.\n And the other clothes I consigned were put up with equally low price tags. When I gave them the clothes, they told me that if they don't want one of them, they'll mail it back to me, so I figured I have nothing to lose. But I see now that instead of them spending money on shipping, they keep the clothes and put them up at ridiculously low prices, so that they sell quickly. What thieves! I could have put my clothes up on Ebay -- yes, a bit more work involved -- and easily netted six times the amount I'll be earning here. I will NEVER consign with them again. Don't fall for their scam.","title":"A scam! Don't consign!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"Rhonda Hopson","text":"The shipping time took quite awhile.","title":"The shipping time took quite awhile.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"customer","text":"Terrible service. No item and no refund. I was promised that you would contact me but still waiting. I have contacted you 3 times. The first 2 times I was promised that a RTS was arranged and it was an easy process and I would receive a refund with no issues. The 3rd time I was told that they would contact me. Nothing. I asked to speak to a supervisor and was refused. The bag is sitting with you and you also have my money.\nFraud! You also charged me $600 more than the advertised price. I can buy the bag brand new with tags for a cheaper price then you charged me!","title":"Terrible service","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"customer","text":"Love the selection of items, but selling with TRR is not great. They put deep discounts on your items without letting you know. You’re better off selling on eBay or Poshmark where you have more control and make more money on your items. I won’t do that again.","title":"Love the selection of items","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"Michael Anzalone","text":"Shipping is expensive , sub par , takes 5-6 days.\nSaving on the website and putting in a basket for 20 minutes , come back and it’s gone. I’m not buying everything at once. At least leave it in my basket!","title":"Shipping is expensive","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"Karla Santos","text":"Sizes are not accurate. Do not waste your money.","title":"Sizes are not accurate","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"Peggy","text":"Very nice ring. Tanzanite was not as vibrant as I thought in the pictures was a bit darker. But all In all a nice ring. I feel it was a bit over priced but will keep it! The emeralds were tiny but really nice. Fits nice I. The hand. Was a different kind of ring!","title":"NOT AS NICE AS THE PICTURE!!!","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"customer","text":"I do not believe my purchase is real","title":"I do not believe my purchase is real","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"customer","text":"Far from helpful. Don’t think the person tried to solve the problem at once.","title":"Far from helpful","stars":1,"location":"KR","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"customer","text":"Overpriced items with inaccurate descriptions of clothing items. Unhappy with purchase and can’t even return it. Place is a rip off and will not be recommending it to anyone.","title":"Overpriced items with inaccurate…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=92&stars=1&stars=2&stars=3"}]