[{"date":"2022-02-16","author":"Jordan White","text":"The LV bag I bought my wife was marked as “excellent condition” with no visible signs of wear. However there was a very obvious white mark on the EPI leather that would not come off on the side of the bag. I had to touch it up with sharpie which will no doubt wear off in time.\n\nHappy with the site navigation and ease of use, but in this case the description\/condition was extremely misleading. Had the flaw been highlighted, I likely would have passed on the specific bag in favor of a more mint condition one.\n\nOrdered a wallet which will show up tomorrow. We’ll see how it goes for round 2","title":"Misleading Condition for LV Bag","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-16","author":"customer","text":"My order was promised days ago. I have not received as of yet!","title":"My order was promised days ago","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-16","author":"Barb","text":"I think there is a severe lack of photos, and the descriptions are way too broad. I tried contacting customer service for additional info\/photos and was told she could get it for me and that she could hold the bag while we awaited the info, only for her to say she misspoke and wouldn’t hold the bag. Never got more info. Purchased the bag basically blind, there was no mention of the smell, or the stains on the interior in the description. The bag arrived in a box with no padding, this is a $2,090 bag that I’m paying $800 for banging around loosely in a cardboard box. On top of it all it’s non refundable… I think if you are not going to offer refunds you need to severally step up the items listed above or just offer refunds this is 2022.","title":"I think there is a severe lack of…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-16","author":"Elliot Siegel","text":"Terrible. No help and way too slow","title":"Terrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-16","author":"customer","text":"No where did my product say what gender it was for. I filtered the shoes i was looking for by my size and i assumed since i told the app i’m female it would give me female sizes. It never said what it was and when they came they were huge and mens. Maybe i mis read but maybe they should clarify that. Other things about the product seemed off and they should’ve disclosed that. I know they were used shoes and i expected normal signs of usage but they had missing studs that would’ve been nice to know about before purchase.","title":"Product details are misleading","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"customer","text":"I double checked that everything I ordered was returnable. As I was awaiting packages and checked invoice I saw return status had been changed on two items to final sale. I am appalled. I presume you’ll credit me accordingly.","title":"Changed policy after I bought","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"customer","text":"the authentication of my item was mislabeled on the website. it was labeled as brown, but when you google the item number, it shows up as red. a huge and easy fix mistake by the authentication team at TRR.","title":"the authentication of my item was…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"customer","text":"Item is no where near excellent condition. It looks very aged and distressed.","title":"Item is no where near excellent…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"customer","text":"I perched a bag from St. John. It’s in good shape all though it came with a really bad smell that I can’t get off. Another thing u would think that it would come clean, there was hair of the previous owner and white stuff.. not worth 196$ this is something that could have been avoided.","title":"I perched a bag from St","stars":2,"location":"IL","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"customer","text":"It wasn't clear that the item was final sale.  I would have appreciated it being somewhere other than in the details I had to expand to see.  Now I am stuck with a purse that has a strap that is too short(I am very tall) and I don't much care for.","title":"Look for \"Final Sale\" in details","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"customer","text":"I ordered a pair of LV boots that were completely fake. I compared them with my authentic pair that I purchased and the LV store. The website describe them as a size 4EU. I compared the real real LV boots to my boyfriend and they were about a size 9 US men. Extremely disappointed.","title":"I ordered a pair of LV boots that were…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"customer","text":"Very late in responding to consignment questions. Again percentage for consigned item is pretty low comparing to other stores","title":"Very late in responding to consignment…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"Tiffany","text":"The wallet came in with a old vallet parking ticket inside one of the card pockets. The description of the wallet did not list that there was a monogram of the initials on the wallet. Was very embarrassed when this was gifted to my wife as a Valentine’s Day gift.","title":"Embarrassing Gift to my Wife","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"customer","text":"Used item the site did not advertise as selling used item and it was a waste of money I bought a purse it’s still in my trunk I will give it to a homeless person I was gonna throw it in the dumpster","title":"Used item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"customer","text":"Awful — sent me shoes in the wrong size. It was listed online as my size. The return \/ refund process wasted time. I shouldn’t have to pay for shipping when the product sent to me is not what I ordered.","title":"Awful","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"customer","text":"I ordered a small bracelet that weighed a couple of ounces, at most. There is a flat delivery fee of 12.95. Seemed excessive, but I understand it’s a flat rate. After one week, it has not shipped, and I contacted customer service, who said it would ship within 48 hrs. It shipped 4 days later. And it was sent the slowest rate possible, arriving a week after shipment. The order took almost 3 weeks to arrive. Not the service I expected.","title":"Slow, overpriced shipping.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"ANIH","text":"I ordered a dress from the real real.  Upon arrival and opening the box, I noticed the dress was filthy.  There were mold spores on the dress itself and visible dirt stains on the hem of the dress.  I reached out to customer service and they just gave me instructions on how to start a return, no apology, no credit or discount for future orders.  This really left a bad taste in my mouth and I will not be ordering from them again.","title":"Worst Service of All time","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"Joe Avila","text":"I ordered a mens wallet and got a card holder.   All the pictures of the item were wallet pictures The header on product said card holder and I thought ok wallet holds credit cards.  I paid over $100 for the wallet got a card holder and paperwork says it’s non refundable.   Not happy, I want to return item and get my money back.","title":"I ordered a mens wallet and got a card…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"customer","text":"Easy enough to order and came super quick.  Bag was mostly as described but the photos did not completely detail some of the wear on the bag and it was not the easiest to navigate\/compare items of interest.","title":"Easy enough to order and came super…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"Leslie Bannon","text":"I gave 2 stars due to the length of time in getting my items listed and the accuracy of important details about the item. For instance, listing my size 6 shoes for size 9. It took over 3 months to get most of items active, and way too many phones and very long hold times to get clear answers. It was a much different experience from what I was told by the processor who picked up my jewelry, clothing and shoes. \nMost of all my items have sold, and I may send them more items, but now I know what to expect. \n\nLeslie","title":"Horrible Customer Service","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=89&stars=1&stars=2&stars=3"}]