[{"date":"2022-02-11","author":"customer","text":"I wish I knew more about the condition of the bag...the handles are so worn out that they can no longer stay up on its own. In the photos, the handles are shown staying up so I had no idea. I know this is a used bag, but the worn out handles ruin it for me and I can't even return it. :(","title":"I wish I knew more about the condition…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"customer","text":"Omg this app is the absolute worst. The promos don’t work on anything & the PRICES ARE INSANELY INFLATED!!!","title":"Omg this app is the absolute worst...","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"Sophia","text":"I was sold a fake Gucci bag. I compared it to the one I recently bought directly from the Beverly Hills Gucci store (both bags from the same Supreme mini bag collection, slightly different model, same structure). I knew as soon as I felt it taking it out of the bag. Terrible packaging for \"luxury\" items. That should have been my first sign. And zero acknowledgement on any of the papers that the Controllato card was missing. I don't need the card per se, but I needed to know that TRR's Authentication team understood how important that missing piece would be to paying over 1k for a preowned Gucci bag from 2020.","title":"I was sold a fake Gucci bag","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"Customer","text":"Horrible customer service. I paid for a louboutin box and the shoes we’re to come in a dust bag for a present for my wife on Valentines Day and neither happened. Customer service dragged this out for more than 12 hours via text then tell me it will take 5-7 days to hear back from the warehouse they emailed. Horrible customer service after spending so much money on something that was suppose to be so special. Valentine’s Day & dinner are now ruined. I would have accepted a discount or something on the next order instead I’m waiting on email that customer service doesn’t even know what that will entail after Valentine’s Day is over. This experience does not make me want to shop here ever again I can tell you that. Horrible horrible customer service.","title":"Ruined Valentines Day","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"Star Lynch","text":"I received purchases on time and packaged very nice.  However, one of  the items I purchased, which I could not return, did not have the right size indicated.  It was a pair of See by Chloe pants and the size was right on the jeans - size 27.   I would not have purchased these.  Too small.  They indicated medium and they could have been more specific.  The sizing is not easy to read on their items.","title":"I received purchases on time and…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"customer","text":"The purchasing part was easy however my package was never delivered . I have been trying to get help from the real and the post office .. I have yet to hear back from anyone . I have ring cámaras installed and the package was never delivered to me or anyone .","title":"Delivery is the worst","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"Elizabeth","text":"Aquatalia booties great. Manolos are a mess - major damage. Disappointed.","title":"Aquatalia booties great","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"Julie","text":"I bought a small yellow gold set of post earrings. They are beautiful and just what I wanted. But, they didn’t come with the post backings. These are a gift and should have come with the gold backings.","title":"Happy and Frustrated","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"customer","text":"I received the wrong dress and then had to pay shipping charges to return a mistake I didn’t make.  I will not be ordering again.","title":"I received the wrong dress and then had…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"customer","text":"purse smells like cigarette smoke.","title":"purse smells like cigarette smoke.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"customer","text":"The shoes are great, but the purse is far from condition described on your website- it has damage on the leather straps at the base of the handles, has dirt on the inside (inside the liner creases) and smells funny…now I know why it can’t be returned 🙈","title":"The good and not so much","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"customer","text":"The shipping was super fast, and the shoe I bought weren’t damaged by that process at all. The only gripe I have is the shoe itself; the seller rated the quality as “very good” but the shoe is pretty broken in, and with that quality rating and the price I paid I would want it to be slightly less worn. Other than that, I love it!","title":"good shipping, quality rating system is iffy","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"customer","text":"Expensive John Varvatos Jackets\n\nHalf eaten Food in pockets\nButtons falling off\nLargest seam on jacket coming apart on the back\nTear in armpit","title":"Eaten Food in pockets","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"customer","text":"I have had a pretty good luck ordering from The RealReal in the past unfortunately the last order was a disaster. I had my eye on a pair of Salvatore Feragamo men's sneakers size 11 . I was intrigued by the design which was kind of lacy . When they finally went on 30% off I decided to order them. When they arrived I noticed that they were WAY to small and upon doing the web search I discovered that they were actually Ladies sneakers... If Real Real can't distinguish between men and women styles how good are they ar authenticating other aspects of items they are selling.....","title":"Messed up","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"Anita Arthur","text":"I was going to sale my Christian louboutin with the real real but i changed my mind because someone wanted to buy it. However when asked real real to return my Christian louboutin, it took them forever. I have called several time to no avail. Real real is terrible with their correspondence when you want to sell your product.","title":"I was going to sale my Christian…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"customer","text":"Still waiting for someone to get back to me. When I email no one ever responded. When I texted I was told someone would get back to me within 24-48 hours STILL WAITING\n\nTHANK YOU","title":"Still waiting for someone to get back…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"Kelly","text":"If the shoes have scuffs, just say they have scuffs. They also were not cleaned. I'm wondering if the only service this company provides is a finders fee.","title":"If the shoes have scuffs, put that in description","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"Deena","text":"Was not happy with these shoes.  There was a large deep gouge on the back of the shoe cutting through the patent and that was not noted in the description.  And the shoe was listed as a size US 6 \/Italian 36 but it was at least 2 sizes bigger even though the shoe did say it was a size 36 on the inside.  In looking further at the details, I’m pretty sure these are knock-offs.","title":"Knock off Prada","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"customer","text":"Shipping terrible.\nGood item, but it arrived 10 days after the promised date completely crushed and half torn open. I was shocked. Unacceptable after paying $50USD for shipping.","title":"Shipping terrible.","stars":3,"location":"NZ","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"customer","text":"Bag looks like it belongs in the trash very old and worn out no life left I am very disappointed with this purchase","title":"Horrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=93&stars=1&stars=2&stars=3"}]