[{"date":"2022-02-23","author":"Biggie Smalls","text":"Well the sunglasses I ordered were pretty long, but the sunglasses were not packed in anything from keeping them to be damaged. The sunglasses were sent in a big box and were stored in the real real bag. I feel like the sunglasses could have been damaged. Luckily they were not. I recommend packing accessories with bubble wrap or something else to keep them from harms way when being shipped.","title":"Accessorie packaging recommendation","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"customer","text":"No response. I will be singlehandedly doing my best to promote Vestaire, Poshmark, Mercari and even offerup amongst my friends and families and social media followers as you guys are thieves.","title":"No response. PUBLIC Lawsuit coming.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"customer","text":"The dress was exactly as described, except the picture wasn't at all color accurate. I understand that screens can vary, but it was the difference between a soft royal blue (pictured) and a gray, baby blue (actual item).\n\nIf the customers shouldn't rely on the pictures to determine the color of an item, the description should at least list whether the color is light, medium, or dark.\n\nI will be keeping the because the color is acceptable for the event I am attending and I don't want to deal with the hassle of returning ti, but I definitely wouldn't have purchased it had I known how light the color is.","title":"The dress was exactly as described","stars":3,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"customer","text":"The package that my bag was in was taped poorly. The bag I bought was supposed to have the tags and none came with it.","title":"The package that my bag was in was…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"customer","text":"It’s took over 6 weeks to list all of my items. \n\nIt’s took 5 plus emails to figure out what was going on. Zero communication. No follow up. My Rep never even emailed me back when I emailed stating that my largest item still hadn’t listed on week 6. So I had to call in , which took forever because of wait times. Took another two weeks to get an answer. \n\nYou really need to get better at the listing process. And you should also consider lessening the option for returns. If a seller has to wait 6-7 weeks to list. Plus wait if the buyer returns their item. It could be 4-5 months before they’re paid out. \n\nFashionfile paid me in 4 days. Once they received my items. I will not sell again with TRR.","title":"It’s took over 6 weeks to list all of…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"Elijah Mccabe","text":"Rip off bait and switch not what i ordered. customer service is a joke to deal with BAD This company should be sued in a class action law suit","title":"Rip off bait and switch not what i…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"Miki Jenkins","text":"I didnot receive responses to my emails and my jewelry was not put up for sale for 2 months. One very expensive piece was reduced in price without my approval or knowledge.","title":"I didnot receive responses to my emails…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"Laura","text":"Item was not as described or as pictured. Item was much smaller than pictured. I think it's sad I'm paying for shipping TO BUY something and if I have TO RETURN something.","title":"Item was not as described or as…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"customer","text":"found the bag cheaper on the Tumi retail site after I ordered it (final sale). Disappointed that the RealReal would sell a used bag for ~$50 more than the Tumi retail. Usually I check with the retail site but I this time I didn't because I wasn't thinking clearly. Assumed the RealReal wouldn't rip me off like that. Never again, will always be triple checking.","title":"found the bag cheaper on the tumi site…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"customer","text":"Size descriptions are not accurate and often don't make sense, and return shipping is very expensive... and because of inaccurate descriptions you will inevitably need to return... but here I am continuing to order...","title":"Size descriptions are not accurate and…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"Description","text":"Description of shoes read 8 1\/2 when I received them the box had nine and the shoes were a size 9","title":"Description of shoes read 8 1\/2 when I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"Anna Vestergaard","text":"I bought a pair of sunglasses and afterwards I saw, that I could buy them cheaper from new. The pair from real real was used. That's hopefully not the purpose of this concept. Double check if you can get you stuff from new before you buy at Real Real. Fine service though.","title":"Price awareness","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"Thomas","text":"I purchased these items for my big trip and paid for expedited shipping so I would receive my orders before I left, however 1 package made it and the other didn't. So I had to buy more clothes at retail while in Vegas. I called multiple times to find out why 1 package said it had not been received by ups for 2 days and no answer. Not a good start to a potential business relationship","title":"Expedited shipping fails","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"customer","text":"Have been trying to get site credit they say I have earned for two months and have yet to receive it. I have spoken to several representatives and still no results.","title":"Have been trying to get site credit…","stars":2,"location":"PR","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"customer","text":"returns take too long to refund.\nyour warehouse sent me an email confirming receipt of my return over 5 days ago and I still have not received my refund.  WHY IS THAT?  If you are going to hold hostage my money, then at least you should allow me to put desired items on hold while i wait to receive my credit so I can purchase the desired item.  fair is fair.","title":"returns take too long to refund.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"Jeannette","text":"The bag looked beautiful and black, without a description of color. It really looked black.\nI received a bright blue bag.\nI am of a subdued nature, and I am 79 years old.\nI had no intention of purchasing a bold anything.\nI will not use nor encourage anyone to use TheRealReal.","title":"Poor description!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"customer","text":"Item is a different color than listed.  The shipping took six days.","title":"Item is a different color than listed. Very slow shipping.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"Jennifer","text":"I chatted with customer service about a mistake that you made. I ordered size 6 Isabel marant boots as advertised on the site (it said boots were size 6) and you sent them in size 7.  He assured me I would not pay shipping but my return says shipping is deducted.  Please rectify this situation.  That is not only false advertising but fraudulent on behalf of your customer service.  Extremely disappointing.","title":"I chatted with customer service about a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"customer","text":"I bought a silk blouse that was listed as pristine condition. When the blouse arrived, you could clearly tell the blouse had been worn, and the previous owner just tied the tags to the shirt. I understand that this company receives a lot of clothing to review. But it was something I noticed as soon as I saw the blouse. The main reason why I bought the blouse was because of the condition it was listed as. It’s disappointing because the last few items I’ve purchased haven’t been as good of quality as they were listed as.","title":"I bought a silk blouse that was listed…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"Jane","text":"Two bad experiences: the Tory Burch dress I bought was in fact an Alice & Olivia dress. Clearly labeled. Next: I bought two Emilio Pucci scarves described as 100% silk. Both were actually just cotton scarves. Sending both back and managed to at least get TRR to pay for return shipping. No apology or explanation on their end. I’m done trusting their site.","title":"Two bad experiences","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=84&stars=1&stars=2&stars=3"}]