[{"date":"2022-02-13","author":"Cassandra","text":"The backpack had a lot more flaws than what was described. Also the pictures that were posted of the backpack didn’t include the loose threads, spots on the nylon and the wear on the leather. Very disappointed.","title":"More Flaws Than Described","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"Cheryl","text":"This was my first purchase from this site. I bought a jacket that was posted as a size large , but it fit more like  a small- medium. I could barely get my arms in the in it. Plus the quality wasn’t what I expected considering the price.","title":"This was my first purchase","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"Sharon","text":"Quality is not great\n\nFirst time purchaser - thought the quality would be better for the price I'm paying, but there were more scratches than I expected and dirtier than expected. I have to get one of the purses professionally cleaned. Unfortunately cannot return the items either. Overall, won't be inclined to purchase from the RealReal again.","title":"Quality is not great","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Customer","text":"I like the idea behind and have been their customer for a few years already. Though, based on my last order (February 2022), a few items were overprized given their conditions. For example, I paid almost $50 for wool pants which had a tear and were repaired and it was not even mentioned in the description. I returned the item, but was not expected to get pants with mended holes. The return policy is good, -$12 for shipping back though.","title":"I hope the pricing will get better","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Lisa","text":"I didn’t get anything answered!!!!!! Not educated in Gucci product! Very frustrating!!!!!","title":"I didn’t get anything answered!!!!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Ej","text":"Received a pair of JORDAN shorts that were damaged without drawstring. Was going to return them, but your cost of $12 is not worth it","title":"Received WORTHLESS pair of shorts, asked to pay $12 to return","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"customer","text":"The bag was not packed into a box that fits the size and bag handles were bent when arrived  - this is a hard handle Chanel medallion bag. If you are a bag lover, it is definitely a no-no to treat a Chanel bag like this, which will lose its intrinsic value.","title":"The bag was not packed into a box that…","stars":2,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"customer","text":"One out of two items was wrong and the tag to the item wasn't even included. The return policy would end up almost costing me 1\/2 of the cost of the item.","title":"One out of two items was wrong and the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Lee","text":"The Rolex I ordered did not arrive as described or pictured in the listing. First, the watch was listed as in working condition, however when I received the watch the crown was broken and I have been unable to properly set the time or close and screw down the crown. Second, the listing stated the watch bracelet would fit a 7.5\" wrist and the pictures showed the bracelet coming with 13 links. The watch arrived with only 10 links and barely able to fit a 6\" wrist. Overall I am not happy with this purchase.","title":"Product arrived not as described or pictured in listing","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"R.Alba","text":"There was an incongruence between the item description and the actual status of the items. The items are not returnable, I tried to make a claim but they told me that I needed to return the items so they can make the refund. \n\nAll of this after the first agent told me that will proceed with the refund. \n\nVery unhappy with this purchase and customer service.","title":"Very bad customer service.","stars":1,"location":"DO","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"graciela adams","text":"poor inspections of items","title":"poor inspections of items","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Susan Toler","text":"I ordered a Mens 3XL dress shirt and a size L was sent to me.  Oh and found out there are no returns… very disappointed! Will not be using The RealReal again.","title":"Dress shirt for wedding wrong size!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"customer","text":"Your service has beeen good and timely. Not very happy with the shoes. “Minor scuffs” is more trending towards MAJOR. I’m not inclined to wear it. Looking for a shoe cobbler or maybe take to Gucci.","title":"Your service has beeen good and timely","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Expected better","text":"It’s despicable that they make you pay for return shipping and only give you a credit and not your hard-earned money back after shipping a damaged item that was listed as perfect condition.","title":"You are punished for The RealReal’s mistakes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"customer","text":"The item I purchased did not fit, I requested a refund- it as denied. The did offer to have me consign the purchase. I would still like a refund.","title":"The item I purchased did not fit","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"customer","text":"The scarf said it was \"in box\" however it was not in box","title":"The scarf said it was \"in box\" however…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"customer","text":"The description of the purse I bought was way off, it’s deformed and discolored, neither was shown iN the pictures but now I’m out a nice chunk of change. Completely disappointed.","title":"Do NOT buy","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"customer","text":"I purchased a gold necklace with stone. Stone was broken out of setting and necklace chain was tangled in a ball upon arrival. Returning and unlikely to order another from realreal","title":"I purchased a gold necklace with stone","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Kelli Morris","text":"I bought Stuart Weitzman over the knee Midland Boots.  I received the wrong size and the boots had a very bad smell.","title":"Bad sell bad purchase","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"customer","text":"Package was not delivered even though I received notification that is was.  I was home the whole day and there was not package delivered.  UPS is not help","title":"Package was not delivered even though I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=91&stars=1&stars=2&stars=3"}]