[{"date":"2022-04-03","author":"customer","text":"My order was never delivered. It’s so hard to get someone to reply to my concerns.","title":"My order was never delivered","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"customer","text":"Smelled very very strong of perfume. Was obviously not cleaned before sale.","title":"Smelled very very strong of perfume","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"customer","text":"The issue has not been resolved and the item I was sold does not appear to be authentic","title":"The issue has not been resolved and the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Christine Kohls","text":"This purse was nothing like what was shown on the website. It was said to have one spot on it. I had multiple stains the inside is filthy and there is a metal around the strap loose. I would never have bought this bag. And it is non returnable. I know why now.","title":"This purse was nothing like what was…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Jessica Levin","text":"I placed an order on March 26th and still have not received it. The tracking number does not work. I emailed customer service, but have not heard back.","title":"Unsuccessful order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Marco Hogans","text":"I just wish I could’ve gotten the box with my purchase but other than that everything thing was great I’m pleased about my purchase","title":"I just wish I could’ve gotten the box…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"elaine autery","text":"The item was smaller than  Expected","title":"The item was smaller than  Expected","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Kat D.","text":"I was kept on a chat for one hour to try to get a full refund, including shipping and handling both ways, for earrings that had  a defective clasp. The company should have immediately agreed to pay for the shipping.\n\nInstead, they offered a credit for the shipping. I contacted them within one hour of getting the earrings, and wasted an entire hour. They finally made it right, but I have a bad taste about how they treat customers when their quality control is bad. \n\nThe earrings are up for sale again one day after they received them back. Did they fix them that fast? Doubtful…","title":"Poor customer service when item was defective","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"The item was misrepresented. It said women's, but it was girls.","title":"The item was misrepresented","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"I question the authenticity of this item because the second time that I wore it, it came off of my wrist unknowingly and I lost it.  I have other Tiffany jewelry that I have worn for years and never had a clasp or link break. Very disappointing to spend that amount of money to only have worn it twice.","title":"I question the authenticity of this…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"Package arrived in bad shape\nItem runs big and was not stated in description","title":"Package arrived in bad shape","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"I recently ordered six pairs of shoes from The RealReal. These are all from designers I currently own. Some of the shoes are exactly as described. Two pairs however are not. Both of these pairs although my size, are so completely tiny and narrow that I cannot fit them on my foot. These are both designers I own and wear. There may be something wrong with the manufacturing on these specific pairs, but I feel that the fact that they are unnaturally narrow and small to the point that they cannot even be put on, should have been mentioned in the description. Instead it just says this designer fits a 1\/2 size small, which I already am aware of and in this case is not at all accurate.","title":"I recently ordered six pairs of shoes…","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"Shipping takes too long","title":"Shipping takes too long","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Arizona ","text":"Horrified at the fraud.","title":"Horrified at the fraud.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Customer","text":"My husband bought 2 items from them, and I bought a bag. It seems their condition rating is arbitrary. The item I bought was supposedly in \"excellent\" condition but came with nicks and scratches that are unresolvable. The bag was also slightly deformed. The items my husband bought were both described as in very good condition but came in different degrees of wear as well.\n\nBut the shipping was fast. Too many items there though that are unreturnable so pay attention to that. Also, and this is not on TRR, but buyers in Canada should look up duties and taxes when calculating the total cost of goods. Can be a shocker.","title":"Condition Rating is iffy at best","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"Good product but the promo emails from the RealReal are incessant and frankly off-putting. I got what I wanted and will be closing my account cause this is ridiculous.","title":"Good product but the promo emails from…","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"I was upset because the shoes I bought were listed as a size \"8\" but when I got them they were actually a size 6. I can KIND OF understand why this mistake was made because the size is listed on the sole which was sort of scratched from wear which made the 6 look like an 8. BUT, the shoes came with the original box and the box clearly listed size 6. TheRealReal luckily gave me a full refund.","title":"wrong size shoes sent, luckily refund was given","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"The product was listed with the wrong brand name","title":"The product was listed with the wrong…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"customer","text":"I was prompted to switch to viewing products in Canadian dollars and accepted. Little did I know, the prices I was shown were still in US dollars. I purchased something for $1500 Canadian including all fees. Later checked my credit card statement and was charged $2000! So bad… be careful!! Prices stay in USD!","title":"Prices Misleading - Be Careful!","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Callae Sutton","text":"Your pictured item and what I received were not the same at all. You showed a place setting and I received 6 random pieces. Not what I intended to purchase.","title":"Misled by your pictured items.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=44&stars=1&stars=2&stars=3"}]