[{"date":"2022-03-18","author":"customer","text":"Loved my purchase, but not packaged well. The box was basically open, I could put my hand through it.","title":"Loved my purchase","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"Lost loyal big spender","text":"I’ve been a loyal customer for many years now, and have spent thousands (!!!) of dollars, but I am just not happy with them anymore. They’ve gotten way too large. There is so much inventory that you can’t wade through it to really find what you want. At the very least, the ability to narrow results down by items’ condition. But, even that wouldn’t be enough, because I’ve received so many things that have been categorized as “very good” condition that are far from it. I’ve received shoes that were sized for a man, but sold as women’s footwear. I’ve received earrings that ended up being so odd I could not even determine how to put them on - when I finally got them on, one fell apart. It’s been so long since I’ve been pleased with a purchase I’ve made with the Real Real. I’m actually incredibly disappointed in what they have become. They used to be upscale. No longer. Their focus is on bringing in as much stock to sell as possible, and getting it out as quickly as possible. Due to this, they accept items in poor shape, and do a shoddy job with their listing descriptions and details. And, I can also say they bamboozle you if you consign. I consigned many high end items and got barely anything in return, which makes me sick. Never again. It’s a mass market clearing house now, which is sad. I miss the original Real Real - the REAL real real.","title":"Mass market clearing house","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"customer","text":"The purse was filthy! And there were damages that were not disclosed. The hardware looks horrible. Horrible purchase","title":"The purse was filthy","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"Jon","text":"Bought a pair of sunglasses that ended up being prescription, with no mention of it on the description rendering them unusable. It’s been a week and I’m still to receive my refund","title":"Bought a pair of sunglasses that were prescription-refund takes forever","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"customer","text":"Loved my shoes! The shipping is astronomical compared to any other online shopping app. I paid over $50 to ship a pair of shoes plus was charged an additional $20 from UPS. The shipping was nearly as much as my purchase.  As much as I love the idea of the RealReal, I doubt I would be shopping there often.","title":"Shipping prices are terrible","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"customerLissette","text":"The shoes didn’t fit , they are a 6 and fit like a 5","title":"The shoes didn’t fit","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"customer","text":"Frustrated with shipping charges and no return label provided. Spent more that $50 for shipping and return an item that did not fit. Money wasted.","title":"Frustrated with shipping charges and no…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"customer","text":"Shipping is expensive - I bought a $20 tee and paying $12 for shipping is crazy, and it took over a week to receive it. If I’m paying that much for shipping, it needs to be sent quicker.","title":"Shipping is expensive","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"customer","text":"They take forever to process a return.","title":"They take forever to process a return.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"customer","text":"Miserableeeee expierence stay away!!","title":"Miserableeeee expierence stay away!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"Emily Z","text":"It took me over two hours to explain that the US size labeling on a particular brand was a whole size off. The Real Real lead me to believe I was buying a sUS size 8.5 shoe when it was actually a US 7.5. I even sent them a screen shot of the brand’s sizing chart. They did not want to give me a refund for the misleading size listing. I was finally allowed a refund after eating up my whole morning. I still don’t think they understand they have the US sizing wrong for Maison Margiela shoes. Over disappointing for my first Real Real experience.","title":"TRR didn’t want to admit to incorrect size listing","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"Octavia Farmer","text":"Bag I purchased was filthy and the other one was fake. I’m one and done with this place.","title":"Fake and dirty handbags I received","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"mary grammas","text":"One pair of shoes were identified incorrectly size. It was one size larger.. another was fine but said fits to size… it doesn’t.. to small… customers merry service was accommodating but the inconvenience of going they this process was disappointing!","title":"One pair of shoes were identified…feedback","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"customer","text":"I was sent a very expensive garment with the security tag still attached ? Still have the security device attached because I haven’t been able to resolve the issue ! So incredibly annoying ,bad quality control on RR part. I am a seller and a buyer !","title":"Horrible quality control","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"customer","text":"Nothing wrong with delivery but glasses were more warn out the what the description said","title":"Nothing wrong with delivery but glasses…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"laura","text":"The worst client experience I’ve ever encountered. Submitted a complaint about one of my consigned  items and pricing that was WAY too low in January. Followed up SEVERAL times and no one gets back to me. Disgusting level of service. Will consign and purchase on other sites moving forward.","title":"The worst client experience I’ve ever…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"customer","text":"Takes way too long to get your items listed and your items returned. Poor communication.","title":"Takes way too long to get your items…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"Liz","text":"The shoes I ordered were the wrong size and I have to pay to ship them back. The second pair I ordered had a small piece of ripped leather and I can’t return it.","title":"Not as described","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"customer","text":"The buying experience was easy. The sales associate coordinated shipping time with me so that I can be home to sign for item. Item was left without acquiring signature and box was secured with one tape across, and the length of the box was opened. The item received was questionably tampered with. I asked UPS about this but they cannot confirm who is at fault. But I took photos of the package at my doorstep and contacted customer service right away. I returned the item and still waiting for refund almost 2 weeks later. Not cool and this delay in return\/refund experience makes me hesitant to purchase from the real real.","title":"The buying experience was easy","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"M. Mccall","text":"This is the second time I have ordered an item from this site and the description is NOT accurate. The jacket was listed as a US6 but the jacket I received is clearly labeled on the sewn in designers tag as a US10 UK14, so two sizes bigger then listed. It was also marked as very good condition but there is an obvious old food stain on the front, appears to be red sauce like spaghetti sauce or pizza sauce that was poorly cleaned off. This should have never been sold on a luxury consignment site. It might be a high end label but ruined enough to belong at Goodwill.","title":"This is the second time I have ordered…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=61&stars=1&stars=2&stars=3"}]