[{"date":"2022-04-06","author":"Customer","text":"My experience was not good. While TRR sold many items, they were sold too cheaply and they lost at least 8 of my items. Very disorganized, takes forever to get thru and no follow-up. Would not deal with again with this management team. Terrible.","title":"Terrible service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"customer","text":"Could be way better. There were a few times I got a person after a day and then had a sentence or two in and then they dropped me after. It’s a headache.","title":"Could be way better","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Michael Beyer","text":"Generally merchandise is accurately described and fairly priced.  But have had frustrations with the (overseas?) online customer service staff not adequately addressing my questions and problems.  On one occasion I spent over 30 minutes back and forth with the online agent, with LONG delays between messages, but ultimately my problem was not solved.  On another occasion I received an item with the inventory control tag attached. I was afraid to remove the tag myself without damaging the garment.  Since the nearest TRR store is 366 miles away, I was hoping they would send me a return shipping label to a TRR store\/warehouse where they could remove the tag, and mail the item back to me. No luck with that suggestion! It was recommended that i take the jacket to the \"nearest confectionery\" where they could remove the tag (?!)  Couldn't provide the specific names of any confectioneries near me.  And who in the US uses the term \"confectionery?\"","title":"Frustrations with customer service","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"customer","text":"The size on the shoes I ordered was wrong. Listing said 9;5 and they were a 9.5 N.  Way too slim for my foot. No phone number included with packing slip. No phone number found on website.  I wanted to speak to rep so as not to pay shipping charges to return and went through a 2 hr total texting ordeal waiting and misunderstanding throughout the process of the robotic texts and human texts.  Decided to sell shoes in my store to avoid wasting more time. Also had a customer service rep from TheRealReal give out my personal cell phone number to one of your consignors living in NJ.  When she called she thought I was a rep from TheRealReal. Not sure how this happened but the credibility of the company definitely came in to question. I called the Atlanta store to voice my concern and they basically said there was nothing they could do.","title":"The size on the shoes I ordered was…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Donna Myers","text":"The Bag is not what I was looking for, which happens.  Not being able to return is super disappointing!!!!  The only reason I was on your site was because my houseguest showed me a few fun items.  I will continue to shop with Fashionphile as their customer services is on point!","title":"The Bag is not what I was looking for","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"customer","text":"I bought an item on sale and I didn't know it was not returnable because the area it said non-returnable was so small I didn't notice it.  Also, the item said fits true to size, but was runs a full size smaller and didn't fit.  So I had to consign it instead of returning it.  Non returnable items should have it stated more noticeably.  I really liked the item & would've liked to exchange it for a different size or something similar, but now I'm out the money until it sells.  If it ever sells.  Just started buying\/selling from here and this is disappointing and makes me want to stop.","title":"I bought an item on sale and I didn't…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"customer","text":"Quite Horrible\n\nService is non-existent for something this risky. No return request at all, even to be heard regarding an item that was defective from the moment I got it, you can't submit a request through the site! \n\nNot to mention I need to have two accounts because it seems as though my first one was banned after I didn't want to consign anything after seeing what they'd pay for it.\n\nFor a website that handles used items, they have really horrendous service skills. I will be disputing my purchase with my card company as I'm not paying for defective merchandise.","title":"Quite Horrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Molly Meloy","text":"I love the bag but there was some damage that wasn't described.","title":"I love the bag but there was some…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Christine","text":"You can not click the boxes by sending emails in response but not actually solve anything.","title":"You can not click the boxes by sending…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"customer","text":"The shoes i purchased was advertised as a 7.5 when i got them they're 7M. Not the same. I was excited getting the Vera Wang Metallic heels only to find out it the size was falsely advertised.","title":"Disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"customer","text":"I got a pair of Manolo Blahnik shoes for my wedding, I am a 5.5 size and the shoes were huge! like 2 sizes bigger, there is no way those shoes are a 5.5, they must be mis sized or mis labeled ,I talked to customer service and the only option they gave is to consign the shoes with them, i got them on a sale so I knew I cannot return them and get my money back, but i was expecting they could be more helpful, at least return them and get store credit or something, since there is definitely something wrong with the shoes! i mean is not that i just didn't liked them or something like that, so now I'm stuck with a pair of huge shoes I will never be able to wear, and I cannot consign cause even if I'm able to sell them to someone else, when they don't fit the customer will just return it back to me; definitely feel scammed!","title":"I got a pair of Manolo Blahnik shoes…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"TFamod","text":"The glasses weren’t as they were described","title":"The glasses weren’t as they were…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"J Congdon","text":"I had a problem with my account (it was “blocked”) and I couldn’t purchase. I tried to get this resolved multiple times and no one called me back or could help. By the time my account was “unblocked”, the sale had ended and I paid $50 more than I should have.","title":"Terrible customer service.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"customer","text":"received items I didn't purchase and not the item I did","title":"received items I didn't purchase and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"customer","text":"The items were dirty","title":"The items were dirty","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"customer","text":"Item was a little more roughed up than described","title":"Item was a little more roughed up than…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"customer","text":"Late delivery","title":"Late delivery","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Ashley Barton","text":"The company was pleasant and professional to deal with. Unfortunately, the product I ordered\/received, didn’t match the description or the photo from the site.","title":"The company was pleasant and…","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"customer","text":"Text experience was awful. Just wanted to talk to a person","title":"Text experience was awful","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Monique","text":"The worst customer device.  Fictitious advertising","title":"The worst customer device","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=41&stars=1&stars=2&stars=3"}]