[{"date":"2022-04-03","author":"customer","text":"Prices were good at 75% off. Purchased denim. Sadly, they were listed as Midrise, but were 100% Lowrise , so I will be donating them instead of wearing them.","title":"Prices were good at 75% off","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Keia","text":"The experience was Great however the product was trash. I should move just bought the bag new like I started too. I could not see how scratched up the Tory Burch bag was and I even went back to the photos to see if I missed it. Nope, couldn’t really tell in the pictures presented online. Bag was sooo scratched up I wouldn’t carry it anywhere- No returns or exchanged as well….Sandals we’re great!","title":"1st Time purchase and disappointed","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"katherine wong","text":"I was supposed to receive a $500 credit for a future purchase during a promotion for a $2700 bag I recently purchased. I contacted customer service and they sent me a vague response with no follow-up. I had signed up for their first look membership but have cancelled it due to this experience.","title":"Do not trust their promotion s","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"LaShina S. Chambers- Ulloa","text":"Package came in time stated . Shoes were calculated good for size but cut small so didn’t fit. No return nothing !!! They are kids shoes so shoul have been able to exchange size . Would not recommend also shoes have a stain on the front but not seen in picture","title":"No compromise site ..","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Deborah","text":"I have bought several things from real real and I have returned 4-5 things in total. I have not even got a refund from the first thing I ordered and they chatrge you shipping to order the item and another 11.95 to return the item. So it cost you 25.00 a purchase even if u return it.","title":"Will think twice before ordering","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Joan ","text":"6 months ago I consigned 6 items.  I noticed in November none were on TRR site.  I contacted my rep to which I never heard from her until Jan 18, 2022.  Very frustrated I reached out to TRR.  In numerous emails I was contacted and said search was underway for my items.  After weeks of nothing finally received email items were lost and TRR would do a buy out.  My rep finally did respond in Feb and on same day I got notice from TRR an item, LV bag, is to be on site and would I agree with pricing.  I did not even have time to respond before I got notice ITEM was sold!  WHAT?  I have been in contact with TRR also regarding item that was sent back to me Nov 29, 2021...I have yet to receive it and it is LOST!  Frustration continues!  I now was paid out for 4 items still waiting for LOST item and 2 DY pieces to be paid for!  I have contacted TRR and have heard NOTHING!  I am so put out with TRR!  I may NEVER consign with you again and certainly will not refer my friends to you!  \n\nI was a happy client for years and it has all gone downhill!!!!!!!!\n\nJoan K Istre","title":"6 months ago I consigned 6 items","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"customer","text":"Wrong size was listed. Wrote to customer service to get reimbursed for shipping and did not hear back.","title":"Wrong size was listed","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"customer","text":"very bad, a package returned on feb 4 hasn’t been refunded fully, terrible service and cheating specialists","title":"very bad","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"customerBRITTTNRY F=DOYRN","text":"MORE DAMAGED THAN DESCRIBED","title":"PASSPORT WAS SCUFFED BADLY AND NOT ABVLE TO MEMON=VR","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Happy Grad","text":"The 800 dollar purchase was fake. However if I hadn’t sent it for verification I would never have known. They didn’t even offer an additional bonus for the error. Very untrustworthy.","title":"The 800 dollar purchase was fake","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Suzanne","text":"Good vs very good is questionable.  I purchased 2 categories purse at very good rated bags.  1 Louis V and one Gucci.  The Louis was definitely very good condition and love it!  The Gucci as Very good was highly questionable.  I’m certain if I try to resell it would not rate is very good.  It’s a nice bag but there was a lot of fraying and it smelled funny. So overall I’m going to say average with the Luis ranging on excellent","title":"Good vs very good is questionable","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"customer","text":"Receive a \nBurberry watch\n-length of watch bracelet was not given, no replacement links.\n-had to purchase a new bracelet, via a jeweller shop.\n2nd item\nTiffany bracelet\nThe length stated was incorrect.\nToo small\nItem is unless to me.\n3rd item\nPrada belt \n-listed as light wear (incorrect)\nPortion of the length of the belt, had come apart, stitching missing.\n\nCharged additional $146 for shipping on delivery","title":"Three items in a row","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Brenda","text":"There was never an answer.  The agent asked for a photo and I said I already sent the dress back.  I just wanted the $12 return fee credited for sending the wrong dress.","title":"There was never an answer","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Leslie","text":"You have had items of mine since Feb. 9 that are still not live. Your website says \"We’re back on track! Current processing time is back to 2-3 weeks from the time your items arrive at our authentication center.\" So why are my items not yet for sale after nearly 2 MONTHS? Also, you sent back a pair of sterling silver and diamond earrings with no explanation of why you can't sell them. I see earrings on your site that are enamel and \"faux\" pearl. Isn't diamond and silver at least as saleable? Not impressed...","title":"Slow, inconsistent processing","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"customer","text":"I did not receive the correct item. Terrible service.","title":"I did not receive the correct item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Nan","text":"Good stuff, but imo it’s a bit much to have to pay for shipping AND returns. It cost me about $24 to see if an item was right for me. It wasn’t .. expensive experiment. Sad.","title":"Good stuff","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Colleen D","text":"I still have not received my order.  It is on its way back to sender.  I will not get it in time if I get it at all.  I have heard from no one from RealReal to follow-up.","title":"I still have not received my order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Lacey","text":"The bag I purchased arrived on time, and was relatively matching the description provided on the website. I think there were a few details missed, but it was not a concern of mine. The shipping box arrived extremely torn apart, the tape was mostly ripped, and I could clearly see the contents of the box. For a company that sells high end, expensive products, I had much higher expectations for how it was shipped and the box quality chosen. In my opinion, This lack of quality shipping box could increase the possibility for theft (since you could see inside the box through all the tearing) and\/or damage to the actual product","title":"Great service, horrible shipping quality","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"customer","text":"Didn’t contact me for the invalid address.\nThe shipping back to the sender without notification.","title":"Didn’t contact me for the invalid…","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Kate A.","text":"I bought these as a backup for my current pair that I absolutely adore just in case of an accident. I’ve owned mine for almost a decade. I was surprised when, although described as minor scuffs on the frames, the lenses were fairly noticeably scratched up too. It doesn’t look like it will impair vision, but my current pair looks brand new in comparison. Despite being a luxury brand, the quality I received wasn’t worth the discount price I paid.","title":"I bought these as a backup for my…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=45&stars=1&stars=2&stars=3"}]