[{"date":"2022-05-04","author":"Claudia Gonzalez","text":"I had to return my first order due to a size issue and ended losing the first time shopper discount plus enrolling discount, between paying for shipping, return and shipping again when I reordered the belt, ended up paying more then if I would have gone to the store. Good quality but I’m not sure I will be using them again. Would be nice if you could exchange an item when there is a size issue rather then having to do a full return.","title":"Lost my first time buyers discount","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"Justin","text":"Sent my product back without any explanation of what to do next.  Are you selling it for me?  Did you not want to sell it for me?  Nothing.","title":"Sent my product back without any…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"customer","text":"Be cautious if ordering from Canada. Got smacked with tons of duty charges and you have to pay for shipping to return. Not worth all the hidden costs.","title":"Be cautious if ordering from Canada","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"Kevin","text":"It’s been over 2 weeks since receiving “like new” Adidas Clima Warm Blast sneakers. I’ve put in 2 request tickets for a return shipping label and refund as these shoes have dog hair all over them and inside of them, worn out soles and writing on the insides completely worn. Neither request has been responded to but y’all send me 4-5 email deals a day and this survey.","title":"It’s been over 2 weeks since purchasing…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"customer","text":"The product descriptions and photos are absolutely abysmal. I understand that you guys are working at scale with huge quantities of merchandise, but dang, can we get some trustworthy measurements? I'm talking hip, thigh, leg opening, front rise, back rise, shoulder width, sleeve length, sleeve width. I used to work QC for an apparel company and I know that taking these measurements can be painstaking, but it would make it SO much easier to buy with confidence if I had more to go on than \"mid rise, straight leg, size small\" (which could apparently mean a wide variety of totally inequivalent sizes). And the photo quality! Black pants do not show up well when photographed against a white background with no close up details. I was SHOCKED to find that one of the pants I bought had a tuxedo stripe! Not only was it not visible in the pictures, it wasn't noted in the description! It would have been a pleasant surprise had the \"measurements\" been more accurate. Instead I have pants that don't fit that are not returnable due to the sale terms. NOT complaining about the price. Y'all keep doing those big sales. But if you're going to make deeply discounted merchandise non-returnable, at least let us know exactly what it is that we're buying. Feels like buying a mystery bag from a cheap fast fashion brand. (Will it fit? Will it look anything like the pictures? will it be made of the material it is listed as? Will it arrive looking like a garbage bag??) I get better descriptions, measurements, and pictures from sketchy eBay dealers than TRR. Unfortunately, I'm probably going to go back to buying secondhand designer direct from individuals since I can ask questions about the actual product and get actually helpful information.","title":"going back to eBay","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"customer","text":"My bags arrived quickly. \nWas disappointed that I paid USD Prices when I clicked on the Canadian flag and signed in with my account. This preference should be saved under your account information. If I cannot tell which currency I am paying in, I will not return to this site. Also an estimation on duties should some how be communicated. One bag was perfect, the other had lots of tarnish on the steel trim that I wish was mentioned in the description.","title":"Choosing to view in Canadian dollars doesn't always work","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"customer","text":"Ordered shoes and received the wrong size. I reached out to customer service and was never contacted. I returned the shoes and was never credited the return shipping fee for their mistake!","title":"They sent me the wrong size","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"customer","text":"Both jackets had perspiration stains and smelled. The Lafayette jacket had stains along the back collar. My first purchase on Real Real. I was surprised the fabric was not dry cleaned before sale? I do like the styles and design, but was disappointed they smelled. It seems as if the price should be credited since I am incurring dry cleaning costs for both, close to $35.","title":"Both jackets had perspiration stains…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"customer","text":"Sizes WAY off.\n\nWhen I tried to make the complaint on their online chat I was disconnected. Its unfortunate to get hit with shipping + restocking fee for several items that are not the right sizes as the website claims.","title":"Sizes WAY off.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"HG","text":"Of the three items I recently purchased, one was more worn (and dirty) than described, and on another the sizing was way off.  I wasn't able to return the items easily as the orders didn't show up on the my purchases page, so I had to spend time getting chat help to make the returns. The person who helped me said it was a technical glitch. \nShipping was fast, and the refund processed in a timely manner.","title":"Items not as described, returns difficult","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"ITNYC","text":"Some of the ties I got are great, just as they looked. A few however don't live up the pictures and descriptions. \n\nFor RealReal- If you could have a way to zoom in more on the products, that would help the experience. \n\nDisappointed I am not able to return the items and will have to donate now.","title":"Hit or Miss with some items","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"customer","text":"I never received the purse that I purchased. And, never received a response from the customer service team when reaching out to let them know.","title":"I never received the purse that I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"customer","text":"Customer service is extremely slow over chat and they dont update the help. I asked to be refunded for some fee and the customer service said yes over 1 hr of hack and forth. The next day only to find out that it the agent didnt do as promised.","title":"Customer service is extremely slow over…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"customer","text":"The buying process is easy enough, but good luck trying to speak to customer service about anything. I reached out over a week ago about an item that was mislabeled or shrunken because the posted measurements don’t match the actual item and nothing. I’ve sent two emails and heard nothing back. Don’t expect any support.","title":"Beware: zero assistance on customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"customer","text":"I’ve seen mannequins with jumpsuits around their waist, ordered a pair of pants which according to measurements should have fit, but the measurements must have been done incorrectly, titles of items clearly do not match the item. Items like a blazer listed as one size fits all- clearly not the case. All in all, would like to see better attention to detail and quality control, especially with all sales final and not trying on before ordering.","title":"Missed opportunity for quality","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"customer","text":"Store cancelled items in middle of being shipped and claimed to not have been responsible for the request. Ups indicated otherwise. Then I was conveniently on the hook for their return processing fees. Basically paid to get the run around and have time wasted and still not have anything to wear. Thank you for nothing!!!","title":"Store cancelled items in middle of…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"customer","text":"Horrible customer service. I emailed over a week ago about an item that was missing from my order and never received a reply. You’d think that they’d care to answer emails when your purchasing designer products.","title":"Horrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"customer","text":"TRR messed up my orders big time: one order contained mostly damaged items that did not match product descriptions, and the other contained 2 smelly, untagged items. Customer service tries their best to support but they are given a lousy script that is made of 3 answers only.","title":"TRR messed up my orders big time","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"Britt bratt","text":"Recieved packages in a timely manner but the items were discolored and very unclean. One item had animal hair on it while the other had a stain from what appeared to be food.","title":"Unsatisfactory","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"Shopper in VA","text":"The picture of the wallet I ordered did not accurately display the amount of wear or blemishes on the wallet. The description mentioned some wear but it was intentionally vague and nondescript. TRR should display numerous—varying angles—pictures of the items it sells. It should be required that blemishes are pictured as well. Shoppers understand the merchandise is used but shouldn’t be surprised by its condition when product arrives. The shipping process is not transparent and delivery messages are not sent, only first shipping notification. The time from purchase to shipping varies with no notification until item is shipped.","title":"Inaccurate picture of product","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=7&stars=1&stars=2&stars=3"}]