[{"date":"2022-04-05","author":"customer","text":"processing time is too long!!!","title":"processing time is too long!!!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Mawiyah Burns","text":"The item I ordered was not as big as shown in picture; seemed more like sunglasses for a little girl or teenager . It would be nice to add that description to items if they are for younger girls.","title":"The item I ordered was not as big as…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"customer","text":"The process was frustrating and communication worse. Although I get WAY too many emails from the company, when it came to getting information specific to my things, I got very little. I have been waiting on a check that never got to me to be reissued from quite a while ago as well and there is no communication.","title":"The process was frustrating and…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"customer","text":"I was disappointed as the magnetic closure was broken and it was not disclosed on the for sale page.  this should have been shown as a flaw. I could send a photo of when I first opened the box if you would like.","title":"I was disappointed as the magnetic…","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"customer","text":"Shopping online will always have the nuance that you can not see the item in person and try it on. That said, online businesses should minimize the barrier to entry by offering things like free shipping. I placed an order that I thought would fit and of course none of the items did. I tried calling the store but they can't offer free shipping unless you spend $1,000 which is astronomically high. That said, this experience is a reminder to not buy on the RealReal because I end up wasting money. If free shipping was offered I would purchase much more knowing that I don't have to lose money if it doesnt fit","title":"Shopping online will always have the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"customer","text":"The condition of the purse did not meet the description. The strap on the purse broke almost immediately. The purse was not in good condition and should not of been sold as is..","title":"The condition of the purse did not meet…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"customer","text":"Take forever to list items\n\nAccepts returns even though they are final sale which is disrespectful to the consignors","title":"Take forever to list items","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"customer","text":"I purchased an item on the site that was advertised as being NWT and it came without any tags of ANY KIND. I asked for a credit and was offered $25 which I don't think is sufficient for not getting the product that I paid for. Generally you pay a higher price for NWT item than you would for an item in perfect condition, more than a $25 difference, so I was asking to have the difference put in credit for which satisfies me as a customer but also requires me to spend more money on the site, which I would think would be a win win.","title":"I purchased an item on the site that was not as advertised","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Rico Nelson","text":"The product I purchased were expensive sunglasses.  The site showed pictures and said they were in “Good Condition”.  \n\nI put them on day one and they literally fell in half on my face.  I need to see my refund quickly to even begin to consider using this service again.","title":"The product I purchased were expensive…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"customer","text":"The items had stains. It’s the last thing you want in anything you buy.","title":"The items had stains","stars":2,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Christine Bieger","text":"The product is not in as \"good\" condition as I expected, but then again maybe I expected better.  It was dirtier and torn and I didn't expect that","title":"The product is not in as \"good\"…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"customer","text":"I was super excited to receive my purchases. Overall, the shopping experience was great and packages arrived promptly. One of the items fit its description accurately. The other had additional issues not outlined in the description. Also, I think I missed the fine print somewhere that I would incur customs fees.","title":"Overall ok experience","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"customer","text":"I bought my first Louis Vuitton purse (or so I thought) and was so excited to receive it! I had specifically made sure to buy on here because I had heard nothing but good things about this website, so I thought I could trust that everything was authentic. Well when I received the bag I was shocked at how fake the bag was and how it passed their “authenticity” process! The bag was obviously fake leather, the gold was fake and tarnished, the inside was a cheap cloth lining, and so many more red flags were found in less then 5 minutes after I opened my package. I was so mad and hurt that I couldn’t trust this website after all. I will never recommend this site to anyone and am utterly disappointed. The only reason why I would even rate it one star is for the fact that I received my money back and was able to ship it back for free as well. Buyers be aware that not everything is authentic!!","title":"Louis Vuitton purse…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"C. King","text":"I have shopped at TRR over the past 6-8 years. I have been pleased until most recently. The package that I received lacked visual presentation. While I understand that TRR offers consigned merchandise, consumers are spending their  “hard earned dollars” to acquire purchases from your establishment. When someone makes a purchase amounting to the sum of $1100.00 or more, there is probably some level of enthusiasm involved.\n     I was less than excited when I saw that my CHANEL belt arrived and appeared to be tied up in a “generic” dust bag and dropped into a cardboard box without any type of additional wrapping inside the box.   Needless to say that I was very disappointed!! In addition to that, I did not receive the correct size of the item that I ordered. \n  This is the first time that I have had to return anything ordered from TRR. \n   It is too early to say whether or not I will be doing any future at TRR. \n     Sincerely \n      Mrs.C King","title":"I have shopped at TRR over the past 6-8…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Mandy Welty","text":"The box my items were shipped in, was clearly old and reused many times. \nThe box was crudely taped up and falling apart! \nNot ideal for thousands of dollars in garments that were purchased. \nAlso, making customers pay the shipping fees for returns is not very fair. \nEspecially considering how shipments are handled.","title":"Poor shipping and return policy.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"customer","text":"Hi, I received my bag yesterday. The box was barley together with the handle exposed. There is also a lot of makeup stains inside the bag front pocket which wasn’t in the description. I would have liked to discuss this with customer service, however I couldn’t find a phone number listed on the web site. I also expected there to be some sort of certificate of authenticity. The bag is listed as non refundable.","title":"A little disappointed","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"customer","text":"Tiffany bracelet I bought was advertised as 6.75\" and is non-returnable (on sale). It is NOT 6.75\", it is smaller and has a cheap link added to try to get it close to 6.75\". \nShoes I bought were advertised as 10.5.... no size anywhere on the shoe and they are NOT 10.5... maybe 8... and in poor condition. I would actually be embarrassed to donate them to a charity even.\nThe clothes were great! All fit and as described. BUT out of $330 order 65% of it is useless","title":"Buyer beware!!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"customer","text":"The coat was listed as great condition. It was a kids Moncler coat. In fact the entire coat was nice condition- but the actual Moncler tag was in dirt condition like used more than any Moncler coat I’ve ever had- the emblem that’s on the side of the jacket was “ pilled” and grey in color not white anymore. It was on a 30 percent off kids sale so I kept it - And I had a $50 credit  bc the jacket I had previously ordered was actually not available anymore after I had paid - so it came out to such a reasonable price for the jacket I kept it, otherwise it would’ve immed been returned, DEF A BIG  DEAL WHEN THE MONCLER emblem looks years old dirty, not to be labeled as great condition. This has ultimately led me to now NEVER EVER buy anything that’s final sale bc I feel I can’t trust the condition labeling, that’s unfortunate!","title":"Listed as Great condition! Moncler emblem dirty and pilled!!!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"customer","text":"The purse still hasn’t shipped after over 3 weeks so I will be canceling and getting a refund.","title":"Never received purse after payment","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"customer","text":"It cost me 25 dollars to find out the shoes were too small. Never again!","title":"It cost me 25 dollars to find out the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=42&stars=1&stars=2&stars=3"}]