[{"date":"2022-05-02","author":"Lynn","text":"Love the clothes offered, and my order was quickly shipped, in better condition than some other consignment sites I've tried. However, a big flaw, IMO, is that they hide in the fine print whether an item is returnable or not!!  You have to scroll down below the price listing and click on Shipments and Returns. Only after clicking on the fine print do you find the information on whether an item is returnable. Even when an item is in your cart, it does not say if an item is NOT returnable. This is a little devious to me, it should be very clear, particularly once an item is in your cart, whether it is returnable, or whether you are stuck with the item if it doesn't fit or is in bad shape. After contacting customer support, I did manage at least to get store credit for the unreturnable items I wasn't aware of. So still giving them 3 stars for doing the right thing.","title":"Love the clothes, but they hide returnability of items!","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Stewart","text":"Shoe sizes are not designated relative to e.g. US or UK. SI SHOES were too big","title":"Shoe sizes are not designated relative…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"I placed my first order with the real real, a size 10 boot and when it arrived they were size 13. I reached out to customer service a week ago and have not heard back. Can someone please get back to me so I can have them swapped for the right size.","title":"I placed my first order with the real…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"I purchased a scarf and the listing said “Excellent. No visible signs of wear”. When it arrives, the scarf has a lol of pull threads all and the LV tag, one corner thread in broken. It has a lot of wears. The worst part is that I paid ~$10 and I have to pay more for the return :( what a bummer :( I wanted to try purchase a small item first, but it’ll be my last.","title":"Listing Condition is way off.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"Very expensive shipping and returns -- wouldnt order again.","title":"Very expensive shipping and returns --…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Reluctant customer","text":"The item had a bit more wear than reported (stress damage at handles), but it's still nice. Will only consider excellent or pristine condition IF I purchase again.","title":"Buy excellent or pristine condition...","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"Never received a reply.","title":"Never received a reply.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"Poor communication between them and shipping company. Took several times restating my issue before it was addressed","title":"Poor communication between them and…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"Great except shipping was $50!!!! The only reason I made an order was because of the $25 credit for first time buyers. If you can lower shipping, I'll make more orders.","title":"Great except shipping was $50!!!","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"Currently a very low rating. I bought a pair of Tory Bruch wedges, that on your website were listed as size 12. The shoes I received are much smaller than a 12, I do not have issues with Tory Burch sizing and regularly wear this line so I know the issue is with incorrect sizing on the listing. This is not my mistake or because I dislike the product, etc., yet I am being charged a return and service fee.","title":"Currently a very low rating","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"The bag did not advertise \"Mini\". It's too small and I can't return it. This is my first experience with the Real Real. I'm not pleased.","title":"The bag did not advertise \"Mini\"","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Tracey","text":"I purchased a handbag and received 2 1\/2 pounds of instant mashed potatoes instead of a handbag.","title":"Instantly Disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"The item I was sold has been painted and altered. Had I know this I would have purchased. I prefer original quality. I will be sending it back and will lose money because of this transparency failure.","title":"Not honest about the condition of the bag.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"Horrified. Horrible customer service","title":"Horrified","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"No customer service exists with TRR.","title":"Terrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"KL","text":"Order is currently lost in transit and still waiting to hear back on when I will get a refund or a resolution.","title":"Order is currently lost in transit and…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"I ordered shoes that were clearly marked a size 6, but I received a size 6.5. I had to follow-up multiple times to confirm if the correct size was in the warehouse to which they were not. I received a simple 'we are sorry' but nothing else. Bit frustrating after having waited for an order.","title":"I ordered shoes that were clearly…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"A Jack Spade leather bag was torn and broken in two spots. It could not possibly have been properly inspected. I had to text pics for a refund and TRR deducted $11 for the return. Not good.","title":"A Jack Spade leather bag was torn and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"TRR is great for buyer. You can always find a deal and there are usually promos going on. For sellers it is a TOTAL ripoff. \nI only use it to sell items that I am willing to accept a few dollars for. If you are expecting a big payout you are not going to find it by selling with TRR.","title":"TRR is great for buyer, terrible for a seller","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Saira","text":"I was very happy 2 years ago with my purchase.\nThis year I had worst experience.\n1st of all I ordered something that I had been saving for months. I didn’t received it. I call and call and cal and call. I called for 5 days in a row to find out where is my purchase. Every day I was told to wait 24 to 48 hours. Finally, I had enough and cancel my order to find out that the item has been missing from warehouse and no one can locate it. Terrible, terrible customer service, got hung up multiple times, on hold for like 45 minutes and such. I made another purchase of similar item since it wasn’t exact what I wanted but whatever. Now these 2 items that I purchased came in tangled ( necklaces) in multiple knots. Took me 2 hours to carefully untangle them. The Real Real is not what it was 2 years ago. I would never recommend it to anyone anymore. 2 stars coz at least this time I got my order👎","title":"Disappointment after disappointment","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=10&stars=1&stars=2&stars=3"}]