[{"date":"2022-03-03","author":"Alex","text":"I returned a pair of Boots January 9. They were received at the warehouse January 11th. I started calling at the end of January to check on my return. Each time I spoke with someone they put me on hold and then assured me that it would be credited in 24 hours. I received my credit at the end of February!! I would call this poor customer service.","title":"I returned a pair of Boots January 9","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"Barbara Michele","text":"I have an item that was received 12\/02\/21 and has not been Listed. I’ve made many attempts of calling , email and video chats but still it sits.\nPlease advise,\nThanks,\nCheri Simpson","title":"I have an item that was received…please expedite this item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"M Mohler","text":"A bit disappointed to see that the Kate Spade handbag listed as “patent leather” was actually pretty cheap-looking pvc - as clearly stated on the label inside. \nI see on google that most “patent leather” is no longer real leather, but this bag looks just like what it is, plastic. \nI wish the listing had stated “faux, or pu, or pvc”. I do feel misled.","title":"Feeling misled","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"customer","text":"As a seller, I’d rate TRR a negative 10.  You’d have nothing if you didn’t have people selling, yet all of your policies favor the buyer.   You allow them to use and wear items and then return them with your overly liberal return policy.  You should take the promotional discounts from YOUR profit.  We didn’t offer the discount YOU did.  Finally, you play a terrible game when it comes to paying people.  Holding on to funds for weeks or months because of your ridiculous pay out schedule.  As for the purchase I just made, I’d give it a two.  It was a piece of fine jewelry wrapped in tissue paper and tape.","title":"TRR is the worst","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"customer","text":"I CAN ONLY GIVE ONE STAR BECAUSE WHILE THIS LAST ORDER WAS CORRECT, EVERY OTHER ORDER HAS BEEN THE WRONG ITEM AND A NIGHTMARE TO BE CORRECTED.","title":"I CAN ONLY GIVE ONE STAR BECAUSE WHILE…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"Nate","text":"I attempted to edit an order but the design of the text based help failed miserably. I ordered 2 jewelry items late one evening and then found early the next morning that many of my saved items had been reduced in price so I wanted to order 5 additional items to combine with my pending order.  I followed the text help prompts and had two relevant options D) cancel order and E) other.  I selected other which sent me into a black hole canned response mechanism stating that someone would her back to me soon. As the minutes passed and knowing the cancellation window was soon ending, I tried to re-enter the help queue to access the cancel prompt, after which expecting to go about rebuilding my shopping bag hoping to see my canceled items placed back into inventory.  This failed design of a help system would not let me renter the help process on this order, presumably programmed to think that my request had already been satisfied. About 45 min later customer service contacted me about the help request and stated that they could not help me with combining my orders or cancelling the first one since it was already sent to UPS. After many pauses and apparent internal conversations, the rep said all he can do is one time credit 12.95 shipping on the new additional $750 order after I processed it.  That was 1 week ago and I see no credits available in my TRR account.  This seems like such an easy customer service request. TRR needs to take ownership of the poor design and unacceptable service in rectifying it. The system should simply let one return to the help queue to cancel the order or at the very least have indicated that selecting ‘E) other’ would prevent you from ever returning to the queue to cancel the order.  I expect at least $40 credit applied for the duplicate $12.95 shipping and the $28.50 lost sale price on one of the items in the first order as this is how much I’d have saved by simply clicking cancel first order and rebuilding the cart.","title":"Real Help customer service needs real help","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"RD","text":"Sizing of items have been incorrect. Unfortunately if you purchase an item on final sale which was incorrectly sized, you are stuck with it. Very disappointing! The consumer should at least be able to return at no cost and be given a site credit due to the fact they are not at fault for misrepresentation of item.","title":"Sizing of items have been incorrect","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"Hilary Ross","text":"it was ok- took forever to ship- takes forever to sell... not the best.","title":"it was ok- took forever to ship- takes…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"customer","text":"Size were off on what I purchased and not consistent. Clothing was nice though and in good condition","title":"Size were off on what I purchased and…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"Connie Melton","text":"I did understand that the item can not be returned.\nIt does look ok and the condition is good. I was however\ndisappointed in the fact that the necklace is _very_heavy.\nIt was a lot to pay for something I will probably never wear.","title":"Pretty to look at!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"kathy Schaedel boyd","text":"I purchased a bag that did not live up to the depictions on the website \nAm waiting to hear how to rectify","title":"I purchased a bag that did not live up…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"customer","text":"False advertising. Item did come as advertised. Missing items. Very unhelpful and slow customer support. Item itself was nice. WOULD NOT RECOMMEND THIS SITE TO ANYONE!","title":"False advertising","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"dawn alura","text":"Sent me the wrong size item.  Was listed incorrectly then charged me to return it.  First and last time ordering from them.","title":"Sent me the wrong size item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"customer","text":"Our luxury consultant is absent when we need her the most.  She told us info about the process that isn’t necessarily true.","title":"Our luxury consultant is absent when we…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"Carrie","text":"I reached out to them to get instructions for return, not available on app, and they asked for order number, I supplied it and they failed to respond. I followed up and no answer. Now return window is closed and I am stuck with something that does not fit. Will not shop there again.","title":"Bad customer service, false return policy.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"Pat","text":"The top I purchased said it was xl but I received a large and it is sized more like a medium. If the sizes fit smaller than average women sizes they should indicate. I was so disappointed. Then I learned from small and almost hidden notice items under a certain amount or on clearance are non refundable. No thank you I won’t order from your company again and I will spread the word amongst my friend who would like to buy name brand items at discount prices not to bother! I feel for the average prices are still not budget friendly!!","title":"The top I purchased said it was xl but…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"customer","text":"I’ll never shop here.  It’s a scam and defective items sold.","title":"I’ll never shop here","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"customer","text":"I ordered a Reformation blouse but was sent the wrong one. I contacted them to ask them to send me the correct one and the people i chatter with her very helpful and said that they would contact the warehouse to send me the blouse i ordered. A couple days later i received a refund for my purchase without any explanation. I contacted them again to ask what happened and they said they could not locate the correct item i originally purchased, so i was given the refund. It was disappointing to not have them directly explain what happened and that i had to ask them myself. Also disappointed that this whole situation happened at all. The staff should be more mindful of what the order actually is and execute it correctly.","title":"I ordered a Reformation blouse but was…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"customer","text":"I never received my item. Contacted TRR multiple times and was constantly told to allow additional time and I would be contacted. They never contacted me and I would have to follow up with them, only to be told, the same thing I was told, 2 days before. Allow more time! It has been 2 weeks since my order was suppose to be delivered and they are still telling me to wait. The post office says the package was returned to sender and TRR is telling me it’s in transit. They took my money and I never received the product. Terrible first experience with this company.","title":"Never received the product or REFUND:","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=77&stars=1&stars=2&stars=3"}]