[{"date":"2022-02-17","author":"customer","text":"I’m so upset because the necklace I bought was beautiful but I wore it for the first time today and the chain broke in half. It didn’t get tugged or caught on anything, just broke as I was unhooking it. Such a bummer because it was a lot of money & I never spend this much on myself. Might not be any one’s fault, just wish the quality of the piece had factored into the price more. Still want to keep it, will just have to pay to find a nicer chain to put it on :\/","title":"Beautiful piece but broke immediately:(","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"customer","text":"Quality is good but size is not matching on the your website.","title":"Quality is good but size is not…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"customer","text":"The bag didn’t match the pictures, it said authenticity cart and it came blanc, it was not fill with purchase date or store.","title":"The bag didn’t match the pictures","stars":3,"location":"CO","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"customer","text":"Very short return window. It doesn’t even start when your order is delivered, so if shipping takes awhile you’re stuck.","title":"Very short return window","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"customer","text":"Purse came with a Very Good rating.  Also received very quick.  However, too big of a pen mark on outside of purse and lining inside looked like either bleach or maybe a wad of gum was stuck inside and lining was very discolored.  To me looked like dried gum that was pulled out of the bag and this grossed me out.  I was able to return it with no problem.  Not sure what qualifies this very good rating.  Prompt receipt of product & able to return allowed me to give it an average rating.","title":"Purse came with a Very Good rating","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"Tom P","text":"Not sure the lV is authentic.","title":"Purse","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"customer","text":"It’s the smell inside the purse, on the stuffing and the box that made me give this a 3. They all stink, I’m trying to get rid of the smell but it’s proving to be challenging! If I can’t this was a waste of money!","title":"Purse literally stinks","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"Caro","text":"The Prada dress I ordered doesn’t just have stains in underarm area as it stated, the stains are everywhere. Also, it’s definitely not a real Prada dress. The material is cheap, the stitching is ridiculous, says it’s made in Slovakia, and the tag that says Prada was sewed on horribly.","title":"Knock off Prada","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"cb","text":"The Chanel boots were in good condition except they didn’t send the box and dust bags. It was on their description that box and dust bags are included.","title":"The Chanel boots were in good condition…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"customer","text":"I still have not received the package","title":"I still have not received the package","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"customer","text":"I purchased an item on Feb 11th as a present for my wife.  I paid extra for the expedited shipping. That was a week ago and they can’t tell me when or if the present will actually show up.  Meanwhile they won’t refund my purchase for another 5-10 business days    They did refund the $ for the expedited shipping and everyone I spoke to were friendly but very disappointed that my wife’s Valentine’s Day gift isn’t here and have no idea when or if it will actually show up","title":"Nightmare","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"Mary Beth  Cassarini","text":"Hi I need to exchange the belt for a bigger size. This one said m for medium. It is an xxsmall. I weigh 100 lbs and it no where near fits me. It is made for a Barbie doll. It was over $500. Please let me exchange for a larger size. Thank you. Please get back to me on this matter asap. It was very false advertising.","title":"Hi I need to exchange the belt for a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"Kimberly Mocella","text":"My purse came and I was so disgusted!! The inner board lining had disintegrated and was literally crumbled on the bottom of entire bag. We won't get into the orange powder like salty material that is impossible to get out. I will have to rip entire lining out, pay to have it totally replaced.  This purse is a piece of trash.","title":"I CANT BELIEVE I PAID FOR THIS!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"Justin","text":"The Real Real is close but still far away from being perfect. It starts and ends with shipping and returns. You are losing 95% of the business I would send your way because of this. I have zero interest in paying for these fees in this day and age. Might I suggest a subscription service for free returns and free shipping or at an absolute minimum free shipping when I am purchasing a 500.00 dollar pair of shoes.","title":"The Real Real is close but still far…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"customer","text":"My handbag came in a huge shipping box. When I opened it, there was only one small piece of bubble wrap and the Prada box with the bag inside of it. The Prada box had ripped apart on account of there only being that one small piece of bubble wrap in the box. I’m soooo bummed bc I wanted to display the box. They didn’t even rubber band the box shut, so I’m sure it just slammed around inside the shipping box. Luckily the bag itself was well wrapped and was not damaged. I really expected better from a company that deals in high-end bags, and should know that the box is part of the purchase and experience just as much as the bag itself.","title":"Poor packaging resulted in damaged handbag box","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"customer","text":"The item came with a red wine stain on the sleeve. Very disappointed. Wouldn’t buy or sell again.","title":"The item came with a red wine stain on…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"Tony A","text":"The LV bag I was sent had multiple stains that was not included in the pictures or description. It also had a terrible smell.","title":"Buyer beware!!!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-19","author":"customer","text":"Items did not match description, arrive dirty and\/or with multiple visible snags even when described as \"good condition\".","title":"Items did not match description","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-19","author":"customer","text":"Taxes were higher than the order value","title":"Taxes were higher than the order value","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"},{"date":"2022-02-19","author":"customer","text":"Wouldn’t purchase from The Real Real again. Bag had defects on it that were not listed in the description notes. For the amount of money spent, I would have expected the bag to have come in better packaging and I would have expected some sort of authenticity certificate. Not impressed.","title":"Wouldn’t purchase from The Real Real…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=88&stars=1&stars=2&stars=3"}]