[{"date":"2022-04-29","author":"SS","text":"I used to shop the RealReal constantly, I’m one of those who “invests” in retail as therapy & constantly look for unique pieces. AKA shopaholic.  Found many great pieces over the years but quality has tanked. \n\n RR was the only “re-sale” venue I use\/ used, I’ll likely stick to Sak’s\/ Nordstrom, etc. moving forward.  \nThe last two purchases have been (1) a disaster and the second, extremely disappointing.\n\n1: Roland Mouret dress, arrived with an obviously broken zipper, half back zip - dress hanging open with the zipper hanging 1\/2 way down & missing the top counterpart.  The label was attached via a safety pin, it could have been attached to any dress (so much for authenticity).  Neither was noted under ‘condition’, it was listed as “very good”.  Customer service was shockingly rude & unhelpful, especially given the literal  thousands I’ve spent at RR.  They didn’t even offer to pay for shipping to send it back.  \nA year 1\/2 later I decided to give them another try.  One of the shirts purchased, listed as “very good”, looked so used my sister said it should be donated when we were purging my closet.  Pilled & the color was super faded.  Another dress had armpit stains,...  it’s not a deal if you can’t used the clothes you buy.  \nIf you decide to purchase from RR, I suggest New With Tags, Only (although, back in the day I was burned once with a NWT purchase as well).  \nI doubt I’ll be using RR for retail much if at all in the future.","title":"Disappointing & on occasion, outright theft\/  false advertising to the extreme","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"Kate Spade ♠️ fan","text":"I bought a dress. First time purchase from your site. It came in damaged. I reported and requested return instructions. Then no response. Disappointing lack of communication and a damaged red Kate Spade dress. I've been loyal to another site and their practices are excellent. That might be where my disappointment lies. I think I thought all site would be that great. Thanks anyway.","title":"I own a damaged red dress.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"Joel","text":"My account was locked when I tried to do payment, it took 48 hrs to solve the issue & most items I wanted to buy were gone.","title":"My account was locked when I tried to…","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"S.L.","text":"I'm very disappointed with my first purchase with RealReal. I knew it was pre-owned and I knew it was graded as only \"good\" but the description failed to mention that the inner lining was completely torn. Had I known that I would've chosen a different bag. Now I question the accuracy of the description on the website. It's one thing to miss a minor scratch but a completely torn inner lining cannot be missed. Whether it was left out intentionally would be arguable, to say the least. I'm not sure I would purchase again with such subpar first impression.","title":"Very disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"K.C.","text":"The shirt that I ordered says size L not Large tall","title":"Wrong size shirt","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"customer","text":"It was my first time buying anything on here and it was cancelled.","title":"It was my first time buying anything on…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"n\/a","text":"i bought one thing and got endless promotional emails","title":"i bought one thing and got endless…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"customer","text":"I was sent a fake LV bag and even if it was real- the condition was not as stated. I was sent a fake bag in poor condition.","title":"I was sent a fake LV bag and even if it…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"customer","text":"This is my first purchase on The RealReal - the size of the shoes were SO misleading. They do not fit in the slightest and I cannot return them because they were final sale.","title":"This is my first purchase on The…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"customer","text":"End product was great but delivery took too long.","title":"End product was great but delivery took…","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"customer","text":"I asked to be applied or adjust the first time $25 code to a customer service one day after my purchase but they refused. Also, one of my items was different than online description. So I asked to refund but should pay a shipping fee again. I really don't like the RealReal customer service.","title":"Bad customer service and shipping policy","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"customer","text":"Still haven’t heard back from customer service.","title":"Still haven’t heard back from customer…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"customer","text":"Shipping to Australia is bad","title":"Shipping to Australia is bad","stars":3,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"customer","text":"I payed extra for special gift box that I never got and my dress came with a missing button on top of that.","title":"I payed extra for special gift box that…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"customer","text":"I am disappointed! I got a brand new leather evening jacket which I was hoping would not be pushed and jammed in a pouch and arrive all cracked up and the suede was ruined! Also the description on the site  did not made it specific that the jacket was actually a suede leather and not a leather leather, which could have been okay if the sensitive soft suede was not ruined by the poor and careless, packaging and shipping.","title":"I am disappointed","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"customer","text":"I usually give the Real Real high marks- but my last purchase came with a surprise-two melted Werthers caramels in my skirt pocket","title":"I usually give the Real Real high…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"customer","text":"I wish there had been a photo of the black mark on the side of the shoe. It was not properly identified","title":"I wish there had been a photo of the…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Mrs Schweitzer","text":"The item I ordered stated it was a 27 waist but when it arrived it was a size 28. The representative said I was wrong to think I was getting a size 27 because if I had checked product measurements it would have revealed that it was a larger waist than the 27 waist like the product info stated. 😂 but that this was going to be corrected on the website.","title":"Different size than ordered","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Not matter","text":"I'm definitely not happy with customer service.\nI have couple of months requested return my stuff, they offering them for 80% off without my permission and they ignore me. Finally after multiple times sending emails, chat with representative and call them they took my stuff from page, it's pass a month by and I still have returned about half items. Sad part is many my stuff sold for couples of dollars in time they ignore my return request. I think they have huge mess in storage and company.","title":"I'm definitely not happy with customer…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"customer","text":"One item was in far worse condition than described. A second item was described as a wool scarf but it was a cotton blanket. \nAnd I’m still waiting to hear back from your customer service rep about sending these items back.","title":"One item was in far worse condition…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=13&stars=1&stars=2&stars=3"}]