[{"date":"2022-02-21","author":"Lisa H.","text":"I purchased a pair of sunglasses that was said to be in excellent condition with no scratches. I received them with obvious scratches on the lens. And I was charged $12 for return shipping. In other words I paid for their misrepresentation. First and last purchase on this site.","title":"I purchased a pair of sunglasses that…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"Linda","text":"Shipped fast, but ship fee is kind of high. T shirt was fine, but the Sezane jeans were about 2 sizes too small. I wear an 8 and 29 in jeans. These are new with tags that say 29. They fit more like a 6 or 4. Don't know if they were mislabeled by manufacturer?","title":"Disappointing","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"Ashley Wadwell","text":"This company is horrible. Horrible customer service and you get screwed over with selling your items to them.","title":"This company is horrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"customer","text":"Item received was scratched and not at all in the condition advertised.  These sunglasses are unwearable!","title":"Item received was scratched and not at…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"customer","text":"The dress I ordered (size M) was more like a tent  all other services were acceptable","title":"The dress I ordered (size M) was more…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"Angela A. Moore","text":"The processing of items is slow and the commission rates are not great.  They are great for shopping but not so great for selling your luxury items.","title":"The processing of items is slow and the…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"CR","text":"This process almost killed me with a heart attack. Indeed poor communication The Staffs are not well trained and they just leaving behind their keyboards. They don't write notes or documents. It's very annoying and time-consuming every time you call them and repeat yourself all over and over. Communication is ZERO. Expect to wait at least 3 months before you get your commission with back-to-back texting to reach their so-called customer service.","title":"This process almost killed me with a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"winceiam","text":"Although I was able to find a pair of shoes I really liked, they were listed as a size 9 but were actually a size 12. The size 12 was inside the shoes and even on the box they arrived in. Not sure how this happened but because of the RealReal's mistake, I now have to return and pay for shipping and also lose my first purchase $25 off promo. Not quite the first experience I expected. I graciously left a 2 star rating only because shipping was fast. 😏","title":"Wrong size listed!!!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"customer","text":"Terrible customer service. I have been told to wait 24-48 hours for a photo of a item that was never delivered. I called in multiple times and was told a manager would reach out to me within the hour. It’s now been over a week with no response.","title":"Terrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"customer","text":"There was a little bit more wear than the picture showed. I felt like I over paid a little.","title":"Picture not accurate","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"Lauren Bice","text":"This was my first purchase of a Louis Vuitton handbag. I was skeptical about the authenticity of the bag and contacted customer service. I asked for documentation to verify the authentication process and they said they are understaffed because of Covid and could not provide. They offered for me to return the bag for authentication which is confusing because should they not have authenticated it before they put it up for sale?  It was described as in “very good” condition but it does not look like it has ever been used. It even had blue plastic on the feet. Would no one have ever removed this and does LV even put plastic on the bag feet? Not sure what I will do, but probably will not purchase from them again. If it is authentic, it is amazing condition but cannot confirm and they were not too reassuring.","title":"First and Maybe Last Purchase","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"Whitnee","text":"I was disappointed with my purchase. With a rating of Very Good I expected more. The bag smells offensively like fried food. I was very happy with the ease of purchase and quick shipping.","title":"I was disappointed with my purchase","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"customer","text":"My issue has not been resolved.","title":"My issue has not been resolved.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"NANCY","text":"Different in size on prada shoes was drastically different thanWhat was  stated.The shoe size was not one size smaller but tWO smaller.","title":"Different in size on prada shoes was…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"customer","text":"The bag arrived later than expected and originally scheduled (4 days later) and the bag is in good shape but smells heavily or perfume\/cologne.  I will try and figure out how to reduce the smell so I can use the bag.","title":"The bag arrived later than expected and smelled","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"customer","text":"Bag I purchased, non refundable … looked different in pics. Appeared more structured than when it arrived. But processing\/ shipment was fast and consise.","title":"Bag I purchased","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"Curt Reamer","text":"Boots were perfect except the description did not give the width of the boots. They were a “B” width and did not fit! I wasted money having to send them back. Could have avoided the trouble only if this had been in the listing.","title":"Boots were perfect Except….","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"Laurie","text":"The sweater I received is nice, and seems to be in good condition.  My problem with it is that is smells strongly of perfume.  I have aired it out for a couple days and it is still unwearable.  I guess I’ll spring for dry cleaning before I am able to wear it.  I was also not aware that the item is not returnable, but that is probably my fault!","title":"St John’s cardigan","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"DISAPPOINTED","text":"I ordered a BV Knot Clutch that was final sale. The description said it was very good, minimal damage. So I bought it. I was apprehensive because of all the news about TheRealReal selling fakes but it was a good deal so I went for it. When I received it I noticed the knot on the clutch was wobbly! And there were stains inside. None of the photos showed the stained side of the clutch and the description failed to mention the knot handle was barely holding onto a thread. Disappointed. I'm out $600 and I have to find someone to fix the knot. I should have known given all the bad news about this company. I wouldn't be surprised if it turns out to be a fake AND for this review to not show up on the website. You lost a paying customer, I will NEVER order for this company ever again.","title":"TERRIBLY DAMAGED, INACCURATE PHOTOS AND DESCRIPTION","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"Kristine M.","text":"I wish there was an option to pick up or drop off at your physical locations thus helping save on delivery and shipping fees.","title":"I wish there was an option to pick up…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=85&stars=1&stars=2&stars=3"}]