[{"date":"2022-04-16","author":"Lauren","text":"Product was in worse condition than described. I also paid for a gift box, but the item came in the regular cardboard shipping box.","title":"Product was in worse condition than…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Unhappy Never Will Buy Again","text":"Bought 2 shoes thst claim to be in excellent condition. Also read they run 1\/2-1 size small so I ordered a size 8 (i wear size 7 shoes), and not onky were they small but i was only allowed to return 1 thought it both did  not specify it couldn’t be returned -!!\n\n Instead it offered consignment for the Jimmy Choo wedges thst were sais to be in excellent condition but it definitely wasnt and probably why they didnt want it back. Also, i had to oay to ship it back and be charged an additional $12 for thr label i paid for…such a scam. It definitely wasNOT in exellent condition and fit was awful and they were Pradas!.  Also it says I have 21 days deom date od purchase to refurnn\/consign, etc but it took 14 days to get my items! I had to rush yo thr overpriced UPS store so i wouldnt be late. However, what about changing the return policy to 21 days from date item is delicious bs bought - read fine print and evem then, a lot of things are missing since mosf song read it. Scam scam scam. Id never recommend this site to anyone who doesnt want to be ripped off. \n\n  consignment I’m only given 50% of listed price which is MUCH lower than I paid- such a scam. Also, i got 2 calls and 3 emails regal consignment within 24 hours or less in rececing my items. I asked them to take me off their list but then they chose go ignore itnor didnt read my email and texted me instead and ignored anything that asked them to stop messaging me. \n\nI’ll NEVER buy from here again.","title":"Couldnt return 1 of 2 shoes, & pay to ship items back","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Debi F.","text":"As a Seller, I was contacted by a rep that offered to pick up my items the next day instead of having me ship the items.  This was a great idea until no one came to pick up the next day or the day after that.  I emailed the rep., Kira, and told her no one picked up so she scheduled another pick up.  No one picked up again, so I ended up shipping it with UPS.  That was disappointing.\n\nAs a buyer, The items I've purchased have been very good but can run a little small overall, so I've had to return some items, which was easy to do.","title":"Mixed Reviews","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Anita lachance","text":"I was extremely disappointed with the merchandise.  The advertisement for the earrings were extremely misleading.  And only got the detailed description when the package arrived. I cancelled the auto pay and now trying\nTo figure out how to return the item    I was soooo excited to receive the order and soooo disappointed","title":"I was extremely disappointed with the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Kacie Vance","text":"I ordered a large shirt. I got a shirt the size a 6 year old could wear.","title":"I ordered a large shirt","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Sheri","text":"The automatic representative that I talked to did not understand what I needed… He thought I needed something about my account when I was trying to ask him how can I consign some thing … Because I believe my representative left and I don’t know who my new one is… I’m sure she contacted me at some point but I didn’t need you guys for quite a while and I can’t find her name anymore?? That’s what I wanted to find out and your automated service could not help me. I’m sorry that it was a big waste of time.","title":"The automatic representative Was a waste of time for me.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"customer","text":"my box came open and the bag had some minimal scratches that were not mentioned when I purchased.","title":"my box came open and the bag had some…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"customer","text":"I ordered 2 14k gold diamond infinity rings in two different sizes. The smaller ring lost a diamond 12 hours after wearing it. I’ve never experienced such low quality from TRR. In addition, the customer support and next steps are so difficult to determine. The chat bit does not help an already complicated situation. I’m still waiting for SOMETHING to happen so we can resolve this… \n\nCertainly hope I’m not duped out of 500$\n\nAriane Craig","title":"I ordered 2 14k gold diamond infinity…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Nettie","text":"Unfortunately my Burberry Boots did not match the description on the Real Real website. They were in very poor condition with embedded scuff marks all over the boots, brown paint down the length of the shaft on both boots, the color was extremely dull and worn, only one boot had an insole, and one boot had a disgusting gigantic ball of hair on the inside. Needless to say, they were returned!","title":"Very Poor Condition","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"customer","text":"Np one answered question on the chat site and left me hanging","title":"Np one answered question on the chat…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"customer","text":"I’m not happy about shelling out for shipping both ways. Paying shipping to returns items is offensive.","title":"I’m not happy about shelling out for…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"Javier sanabria","text":"I tried to get my shoes expedited but even though I pressed the option the website didn’t compute and got my shoes a week later","title":"I tried to get my shoes expedited but…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"customer","text":"Orders strappy sandals and a purse. Purse was perfect. Strappy sandals arrived broken. TRR refunded me for the shoes but my review is negative because of the wasted time searching\/waiting for\/picking up the shoes from UPS\/returning the shoes to UPS, AND ALSO the energy and time I had to put in to fight to get shipping costs refunded (aka, the bare minimum compensation).\n\nVisual description and fit of items were accurate.","title":"Got customer support for broken shoes, but had to work for it","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"customer","text":"The shoes I received had the correct condition listed and they were actually better that I expected. The shirt I received, however, was listed as “very good” and I would not agree with that. The under armor sign was very worn and the shirt did not smell great when I received it. This was my first time ordering with The Real Real and probably my last. I had higher expectations for the price.","title":"Not what I expected…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"customer","text":"The product was exactly as described, a LV bag with minor wear throughout. The shipping on the other hand left a lot to be desired. The bag was in a protective cloth bag and thank god for that because I don’t think there would have been a purse otherwise. The box was too big for the purse and it was torn to shreds with the purse falling out when it arrived. I would think this is not how high end designer product should be treated… especially when you’re paying that much for an item, it should still feel like your buying first hand, just with different wrapping. Solid product but the delivery both literally and figuratively were severely lacking.","title":"Delivery","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"Rosa Buttel","text":"How can I review my dresses when I haven’t even receive them yet. Considering I spent over $60 on postage, I expected better service.","title":"How can I review my dresses when I…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"Disappointed Debbie","text":"Clothes were not represented as well in person versus the web. I want to return products but there is an $11.95 convenience fee. That's just not cool if I'm not happy with the product. \nWon't be ordering here again :(","title":"Clothes were not represented as well in…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"customer","text":"Sold me a broken\/ damaged ladies handbag. \nI have tried to contact them but no response.","title":"Sold me a broken\/ damaged ladies.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"customer","text":"Product was not as shown on the pictures and can not return","title":"Product was not as shown on the picture","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"customer","text":"Decent prices and selection. Shipping is way overpriced. As a seller, the reimbursement just doesn’t make it worth it.","title":"Kinda over it","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=29&stars=1&stars=2&stars=3"}]