[{"date":"2022-04-13","author":"customer","text":"Should be free returns.","title":"Should be free returns.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"PG","text":"I was not satisfied with the packaging and shipping costs and the time it took to be delivered. It was a flimsy cardboard box with only one piece of tape across holding it together with half the box top crushed in, was not secure, no bubble wrap or paper stuffing at all. It also took 10 days to receive and you charge$$ for shipping. Could have been shipped priority mail for less.","title":"I was not satisfied with the packaging…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"J Rescigno","text":"The product I received appeared watered down. The color of the detergent was a pale orange compared to a bottle that I received directly from the vendor, which was a much darker orange. Also, the bottle was not wrapped correctly and had spilled. I will not order this product from you again.","title":"Tangent GC Fine Wash","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Marketing lies","text":"I purchased this mesh baseball cap and when it came in the mail it was the smallest hat I’ve ever seen.  There was no size on the site and I assumed it was adjustable.  It is not.  Worst purchase and worst customer service.  The charged me $70 to re-stock an item they miss advertised.","title":"I purchased this mesh baseball cap and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"JRD","text":"I reached out to customer service 4x via a well mannered email with no response (a consignment coordinator did email back stating she couldn't help and I needed to connect w\/ customer service). I purchased less than a handful of other up-cycled items in the past, and were fine, but after inspecting the last items I ordered, I questioned the authenticity (I have photos of the products which I sent to the customer service people). Truly negative experience with lack of communication from their support team. Shame that some unauthentic items are being circulated on the site as there are lovely items. Learning lesson for me and be careful with the items you are choosing as you don't want be suckered as I was.","title":"Authenticity of Several Items Questionable","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"customer","text":"I purchased Gucci Square Gradient Sunglasses on 4.2.22 which had been described as in \"excellent\" condition. When they arrived, the glasses were covered in filth and the lenses are scratched so badly over the field of vision that I cannot see clearly while wearing them. To add insult to injury, they are non-returnable and I spent a significant amount of money on them. I will not purchase sunglasses from this site again as the item description cannot be trusted.","title":"Gucci Sunglasses","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Yining","text":"My order is lost and I’ve been talking to a customer agent who assured me long waiting time with carrier in UPS is normal. Now I know another person from another district received my box and this is frustrating","title":"My order is lost","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Lauri in West Des Moines","text":"I will never buy from the Real Real again.  I was told that I could return a Chanel bag within three days.  The day I received it I called because it was not as nice as I had hoped.  Customer service gave me the run around and I had to ask to speak to a supervisor before I was given a return shipping label.  Not a good experience and will not shop there again.","title":"I will never buy from the Real Real…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Fathima","text":"By law they are supposed to collect sales tax for shipments to US but not for shipments outside of US. (check their zendesk link on this)\n\nHowever for a pair of glasses, I paid $51 and shipping to Australia, they have charged sales tax of $12.60 which is nearly 25%. They refused to refund and made all sorts of excuses like I don't have to pay customs duties but what has that go to do with a sales tax. Customs duties I pay to Australian government and they wouldn't care if I had paid a sales tax to the US.\n\nSpoke to 3 different agents out of which 2 of them Leo M and Remy were clueless and didn't give the right responses and only Rachel tried to help to some degree. At the end, I was to send a mail to customer services which I had done before and because I didn't even get an acknowledgment contacting these guys through chat. \n\nPathetic business trying to rip off their customer.","title":"By law they are supposed to collect…","stars":1,"location":"LK","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"customer","text":"Items got canceled in the middle way. The package had been sent out but you told me you could not find the item... it sounds like a lie.","title":"Items got canceled in the middle way","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"customer","text":"I will never use real real again. I have been a customer for many years.","title":"I will never use real real again","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"customer","text":"Definitely not a real Kate spade.  Was described as leather and it was not.  The zipper did not match the color of the bag.   Definitely, assuredly, not real.  Contacted customer service, awaiting reply. Sure","title":"Definitely not a real Kate spade","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"allison","text":"I emailed customer service about contents inside of a bag I ordered, and still haven't heard back. When I received the bag I had ordered, it was filled with old tissues and gum wrappers, which meant that no one had gone through and quality checked this bag. I would expect more from a luxury site, especially when purchasing a bag that was $2,000.","title":"I emailed customer service about…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"customer","text":"My items sent were in poor condition. One was really old and smelly. The other was a mens size shoe and not a women. I did get my money back.","title":"My items sent were in poor condition","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Ingrid","text":"Read the reviews online about the ongoing issue that customers have with this site - both with purchases and with consigning. DO NOT WASTE YOUR TIME WITH THEM. \nI didn't listen to those reviews and am regretting it now.\nIf you shop and\/or consign w TRR - You WILL be disappointed too.\nI had a terrible experience with their consigning department.\nAnd I am returning a $95 Rag and Bone baseball hat that I received from them that was listed as in \"Pristine - new with tags\" condition.\nIt arrived having been worn enough that the interior of the hat was discolored with .... sweat? make up?  ... not sure - but it going back.","title":"B E W A R E","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"customer","text":"Bought a Louis Vuitton Damier Azur Lymington bag that was within aproximatly $100 of full retail price, the bag was not in as good of condition as I expected it to be. it was a bit dingy and dirty and just never got the feeling I got a good deal for what it cost. this was my first purchase from The Real-Real and I'm not sure that I will take that risk again. I certainly couldn't recommend to my friends.","title":"Bought a Louis Vuitton Damier Azur…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"customer","text":"International purchase -item purchased did not meet the standard criteria as advertised. Customer service extremely slow to respond with big gaps of silence and inability to resolve issue.","title":"Item purchased did not meet the…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"customer","text":"Shipping keep continue to change the date. Paying $12 for shipping and for returning again. Not worth buying a second time from the real real","title":"Shipping keep continue to change the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"customer","text":"Item was sold as excellent condition which, according to RealReal description, is an item without tags but clearly has not been worn. The item I received had clearly been worn. I want to shop in a sustainable way, but this was disappointing.","title":"Item was sold as excellent condition…not great","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Colleen Sifuentes","text":"First-you cannot get anyone in the phone. Second, the app tells you to email customer service. Then you send the email and they email you back telling you to text a number. Lastly, you text, as instructed; however, you are Texting a chat bot=NOT HELPFUL! \nI ordered a Gucci sweater that I have been trying to buy since 2017. I was BEYOND excited to finally find one on The Real Real. First, I paid for overnight shipping but I NEVER received the sweater hence my reason for contacting customer service. After 48 hours, I received an email refunding my overnight shipping but WITHOUT an explanation for the missing sweater and WITHOUT a full refund for the missing sweater so I had to email customer service and go through that same nonsense process. After 24-48hrs, I received an email stating that their inventory was messed up and they don’t actually have the sweater so they issued a refund for the sweater. SO DISAPPOINTING! AND NOW, that same sweater now shows “COMING SOON.” And of course, I STILL WANT THE SWEATER so I emailed customer service AGAIN to try to ensure a way for me to get that sweater at the same price I had originally purchased it, but they emailed back with the POOR response of “all you can do to watch it in the app and try to purchase it again.” WHAT IN THE WORLD!? How would you rate this customer service?","title":"POOOOOR-First-you cannot get anyone in the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=33&stars=1&stars=2&stars=3"}]