[{"date":"2022-04-18","author":"Mrs. C","text":"The watch didn't work.\nIt's useless if it doesn't work.\nSaid it was working on website.","title":"The watch didn't work.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"Odor Issues\nThe sweater I ordered is good quality, although maybe a bit more worn than described. The big drawback was it arrived reeking of perfume and in clear need of immediate cleaning.","title":"Odor Issues","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"Lori Lemon Bergeron","text":"The RealReal sold me a fake Hermes  Birkin that was returned to them and they have yet to refund my money.  They stated that the bag is real and put through and authentication process.  One look at the interior pockets and it's clear that this bag is not authentic.  I had my sales girl at Hermès verify it was not authentic too.  The company will not speak with me over the phone.  They have had the bag since 3\/3 and have yet to refund my nearly $13k....or even provide a store credit.  I have copies of all email exchanges and the UPS return tracking labels.","title":"The RealReal sold me a fake Hermes …","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"The Chanel bag was purchased for my wife for her birthday.  The item came in very quickly, although I had a scare that it was stolen due to the main box being busted in and damaged.  The product inside was fine, but it seemed like the box was just too big for the product box and UPS\/Fedex must have just stacked things on top.  \n\nAs far as the purse, it was a chanel black lambskin bag.  The post described the item as \"Very Good, Details:Light wear at interior; minor creasing at base.\"  When the purse arrived, the creasing was very prevalent at the base and it seems like as a designer store they would have at least stored it stuffed or attempted to prevent further form from messing up.  The other problem it had which wasn't mentioned is the top rims of the purse the leather was rubbed off nearly completely. I'm fine with used products, but the purse was far from very good, and it seems like this was intentionally overlooked.\n\nSlightly frustrated as it was my first purchase on the site, not sure I'll be a return customer as it was a bit of a surprise on the condition and the no - return policy could leave you with a far more damaged purse than you purchased and not being able to return it.","title":"The Chanel bag was purchased for my…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"I paid extra for early shipping it’s been a week still haven’t Received my order","title":"I paid extra for early shipping it’s…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"For the amount of money we pay, especially over a thousand dollars, why should we pay shipping","title":"Paid Shipping?","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"MARGO MOSES","text":"Shipping took a long time and I’m in the same state. Product was good though.","title":"Shipping was slow but product was good","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"Dear customer service, I am a bit surprised because until now the service was quite good, but I had a problem with a delivery and I did not have any reply. Also, it is the second time an item is described as very good and it is not in great condition.","title":"Dear customer service","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"The product I ordered was not what I ordered and I can’t even get an email back, I sent the product back and still haven’t gotten a refund!","title":"The product I ordered was not what I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"Julia Phelan","text":"Horrified beyond belief. I’ve sold many items on TRR in the past, including valuable jewelry, and never had a problem. This time, However, TRR LOST A VALUABLE DESIGNER BRACELET WITH DIAMONDS that was sent with other items in the package and they claim it wasn’t received. Unbelievable. I WILL NEVER DO BUSINESS WITH TRR AGAIN. I used to tell my friends to shop and sell on TRR. Never ever again. Horrified with this business practice.","title":"Horrified beyond belief","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"Rhonda WIRTH","text":"Shoes arrived looking more worn than I expected. Also sizing must of changed because my other Gucci shoes are 39 and these were huge! Maybe due to the age of the shoes? Was able to return easily.","title":"Shoes arrived looking more worn than I…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"customer","text":"horrible shipping and practicing procedures! found something filthy in my pocket","title":"Dear God","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"customer","text":"Size of shoes was incorrect: at least a full size smaller than listed on site. Final sale item, so unable to return and even if they could charging $12 for return on your mistake would be ridiculous.","title":"Size of shoes was incorrect","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"lala taylor","text":"I've been buying and selling on the RealReal for 8 years now. The site can be good for buyers, as prices are competitive. It's awful for consigners, and it got worse over the years. On average I wait for two months for my Chanel and Hermes bags to be priced and listed on the site. I ALWAYS have to contest the pricing as they will try to go as low as possible. They claim applying some sort of pricing algorithm, which is bunch of bs. Customer Support is not responsive. I often have to write multiple times on the same issue to get a response. Overall the company seems to be super shady and lacks fundamental transparency and basic customer service. I'm officially done with RR as buyer and seller. Fashionphile and Poshmark is where I'll be selling from now on.","title":"Horrible Customer Service, Not Transparent Pricing, Super Slow Consignment processing times","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"KimA","text":"I like the bracelet but the black detailing on the bracelet was a thin strip of plastic that was falling off.","title":"Not exactly what I expected.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"customer","text":"Slow to answer, lazy to answer, passive response, and evasive answers    To be honest, I feel really bad and disappointed","title":"Slow to answer lazy passive","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"customer","text":"Purchase was easy and shipping was great. However the shoe was listed as a size 10 but is a size 40 in EU which is not a 10","title":"Purchase was easy and shipping was…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"customer","text":"Good sneakers, service, delivery time. More wear\/stretched around the tops (ankles) than I would like.","title":"Good sneakers","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"customer","text":"There was a used piece of gum in the pocket of my bag. I had to scrape it out myself and there is still a stain.","title":"There was a used piece of gum in the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"Michelle Lane","text":"The Site is great, I bought 3 pair of shoes on the Real discount non returnable and shoes ended being too small, now stuck with 3 pair of shoes I cant return. The boxes arrived beat up, broken. How ever the shoes were lovely. I will end up having to donate.","title":"Too small","stars":3,"location":"PE","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=26&stars=1&stars=2&stars=3"}]