[{"date":"2022-03-23","author":"customer","text":"While I did love shopping with The Real Real, I'm unlikely to do it again because of the high shipping cost for international customers. Not to mention you have to pay taxes and duties which is quite pricey as well. You're already paying a high price for the items. Having high priced shipping as well just isn't realistic for international customers. If shipping became more affordable I would definitely shop The Real Real again.","title":"While I did love shopping with The Real…","stars":3,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"Shipping takes a long time","title":"Shipping takes a long time","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"I have to give a 3. The reason is the purse was described as having light discoloration on the lining. The purse actually has discoloration on the purse strap. So what is “lining” to you?  Also, the pictures should have shown exactly where the discoloration was. If you are experts you need to be honest! I even called before I made the purchase and asked for more pictures. I was told those are all the pictures you had. If someone is making a big purchase you should have plenty of pictures to sell. \n\nI do love my purchase though.","title":"I have to give a 3!","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"The purse is very worn.","title":"The purse is very worn.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"Donte","text":"Sold me a used shirt 😡😡","title":"Sold me a used shirt 😡😡","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"Ordered two pairs of shoes, one pair was brown (not black, as advertised). The other pair were a men's size 7, instead of women's (as advertised). I was charged $12 to return shoes that were completely misrepresented on their site. Buyer beware.","title":"I pay for your mistake?","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"I ordered a very nice pair of shoes at a very good price. The description of the shoes did say that there were no size markings, but the shoes measured as a US 12. When I received the shoes, they were in great condition, but could not have been larger than a size 10. My son, who wears a 10-1\/2, could not get the shoes on. So not only was this disappointing, but to have to pay $11.95 return shipping made this an overall less than pleasant experience.","title":"Not a great experience","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"The wallet I ordered is in fair condition, moderate  visible wear outside and inside. Not minor wear as described.","title":"The wallet I ordered is in fair…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"When I asked for assistance regarding concern about an item that I purchased I had to deal with an operator that did not understand or address my concerns, and when I emailed the main email address to ask that my concerns be addressed, this communication was ignored and never responded to by any other staff member, despite my online chat response telling me that warehouse staff would answer my query.","title":"When I asked for assistance regarding…","stars":3,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"If zero stars was an option I would choose that. Ordered some boots online and was sent a similar pair to what I had ordered, but two sizes down. I ordered a size 10 and they sent me an 8. Terribly disappointed when I went to try them on as I couldn’t even fit my foot in. Ugly stepsister moment. Upset I then checked the website to see where they could’ve gotten confused, to see that they charged me for the more expensive pair. Please send the actual item you are advertising, or check the sizes before shipping to avoid this from happening to any other customers. First time ordering from here and might be the last","title":"Negative stars","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"TRR is a great way to buy clothes.  Almost 75% of my wardrobe is thanks to TRR.  But recently customer service has gotten horrible.  I've attempted to contact customer service regarding several issues and have gotten NO response.  I emailed and attempted to chat on several occasions, but was not able to connect with anyone.  Its been horribly disappointing because I love purchasing clothes from TRR but cannot continue to do so if customer service continues to be this poor and non-responsive. Upsetting :(","title":"Great Clothes, HORRIBLE customer service","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"Marlene","text":"Ordered a jacket and got it on time. Order never said final sale, which was on the jacket ticket. It was too small and had to have the buttons moved. It’s still too snug…. But I do love it. A small dilemma in the grand scheme of things…","title":"Ordered a jacket and got it on time","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"Received a jacket today described as “excellent” condition but it has stains all over it. I’m so disappointed and feel like this could have been avoided if The Real Real had done a better job inspecting the item.","title":"Received a jacket today described as…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"I ordered something, and it wasn't delivered to me, no one really contacted me, and the refund process has not started yet. Please start it. I need a refund.","title":"refund for undelivered item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"Shoes arrived damaged. Will not order anything again","title":"Shoes arrived damaged","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"The sizing is off - you should really post more details.  The \"OS\" = one size, should have had what the chest measurement was.  They are too small....so now I have 2 garments that don't fit and I can't return.","title":"The sizing is off","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"Quality was described as very good, the wear and discoloration of the leather, scratches on gold hardware, and loose kiss-lock would suggest that this item should have been described as good.","title":"Quality is good not very good","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"Pros: The website is well designed for the most part and I especially like the Obsessions feature. \n\nRoom for Improvement: I think their filters could be better, especially with regards to brands. I'd love if I could save filter combinations. The shopping cart timer feels incredibly rushed, especially when I'm still looking for additional items. I wish we had 30 minutes instead of 20. \n\nGeneral: It's unlikely I will purchase anything from TheRealReal online again just because return shipping isn't free and it's hard to tell from pictures if an item's going to fit me well or what the material feels like. If they open a location near me (Seattle), I'd love to go shopping in person.","title":"Good but online shopping for pricey items doesn't work for me.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"Incorrect size measurements, have to return. No picture of the belt with the size on it. Had to go off info the real real provided and it was incorrect measurements.","title":"Incorrect size measurements","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"customer","text":"I was sent a fake mcm bag…I was not satisfied with the purchase.","title":"Fake MCM bag","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=56&stars=1&stars=2&stars=3"}]