[{"date":"2022-02-24","author":"customer","text":"I reached out to customer support last week and did hear back within a couple of days which was great. I exchanged a few emails about a purchase issue and was then asked to correspond through the account associated with my RealReal account. I did so, but have not heard back from customer support since.","title":"I reached out to customer support last…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"customer","text":"I was super disappointed in the condition and quality of the Gucci purse I purchased. I understand I purchased a vintage item and I was expecting a decent amount of wear and tear but the bag arrived peeling from every side, leather bits falling off when handled, the inside fabric completely detached from the leather interior with glue bits stuck all over from where it was once adhered. Even if I could get over the subpar condition, the worst part was the filthy state in which the bag arrived. There was female hair covering the inside of the bag, pieces of debris in every fold and tons of dust. I thought with how much The Real Real states that they perform a thorough inspection to authenticate every piece, they could at least do a quick cleaning! Perhaps a shake-out and vacuum? Felt like I bought it at a dirty flea market or something. I do not usually do reviews but this was my first time buying pre-owned designer items- is this the norm? I would have rather purchased a brand new bag that is not a designer for the same price. Oh well.","title":"I was super disappointed...","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"First time customer","text":"My first purchase was not what I expected. After reading that my purchase was considered \"Very Good Condition\" I purchased it. When I received my item I was incredibly disappointed in the quality. It should have labelled as Good Condition or less. I am very weary about the descriptions now.","title":"Disappointed with my first purchase","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"Cecelia Rose Stewart","text":"I received my items. Everything looked great. When I went to try on, one of the blouses was super small...I looked at the tag and it said it was a size 3. I figured it was my mistake, so I checked what I had purchased--it said Large, which is what I was expecting. I reached out to customer service, and haven't heard back. It was on sale, so I cannot return it. Hoping it will fit someday, it is beautiful. I just wished someone would have responded...it was clearly an error on their part. I could be mistaken, but I don't believe a 3 = large in any sizing. I will order from therealreal again, however, I will be much more cautious next time.","title":"Mislabeled Items","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"Mom of three girls","text":"First time user here. I ordered a pair of size 1.5 girls shoes and received a pair of size 5 baby shoes. I had to text, email and call The RealReal 8 times to resolve. Customer service reps thought I should have to pay for the return shipping, despite the fact they agreed with me that I received the incorrect item. Still awaiting my refund and doubtful I will purchase from The RealReal again.","title":"Terrible first experience","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"customer","text":"I'm happy with the bag. There was a slight ink mark on one side of the bag, and a bit of tarnish on the Michael Kors logo. There were a few personal items in the side pockets, including chapstick, hair ties, hand sanitizer, business cards etc.","title":"Included some personal items","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"customer","text":"Paid for a Chanel coin purse bracelet that was $1495 on the TheRealReal when I receive the item it came with it’s original price tag. The original price tag was $675, I was charged double the price for this item. The item was returned with returned shipping waived.","title":"Paid for a Chanel coin purse bracelet…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"customer","text":"The sunglasses were listed as being basically new, with no noticeable signs of wear. The inside surface is smeared with make-up and the lenses are filthy. I have not attempted to clean yet as I wanted to document. So it is unclear what will come off and what will remain. It appears your quality reviews are very inconsistent, dependent on the variable judgement of individuals reviewing on behalf of The Real Real.","title":"Quality of product received does not reflect online description","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"customer","text":"Just ok. Product description said 'minor mark at front' and it definitely isn't minor, but returning to TRR is too annoying to deal with. Always just ok with the experience of shopping here.","title":"Just ok","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"customer","text":"Blouse had good sized rip at collar and the button holes were so stretched out buttons wouldn’t hold.","title":"Blouse had good sized rip at collar and…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"customer","text":"The shoe was supposedly in 'good condition but the heel was literally moving when I got it. Highly unstable shoe. Not jimmy choo by any account. Highly disappointed. The shoe is unwearable. Used does not mean useless.","title":"The shoe was supposedly in 'good…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"customer","text":"The clothes have a very strong stale smell, almost like a thrift shop but stronger. Shipping to Australia was $70, not sure what I was thinking paying that much for both orders but certainly won’t be doing it again.\n\nCustomer service was also abrupt and unhelpful when I asked to add an item to my order. \n\nAlso, be mindful of currency conversion as the website plays tricks in not showing the correct currency.\n\nIn saying all this, if you can handle the smell, the mediocre customer service and cost of shipping, the delivery was quick. Items came in under 2 weeks and were packaged well. \n\nOverall: I don’t recommend this site unless you are desperately after a retired item. \n\nUnderwhelmed.","title":"The clothes have a terrible strong smell…","stars":3,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"customer","text":"I have sent over 30 emails trying to cancel at first trying to correct my site information. You had items that weren’t even mine on my side that ultimately ended up even sold. For over a month now I have been requesting to cancel and to return all of my clothes. I mean all of them. I do not have time nor the patience to deal with the continuous errors and problems with my account as a new consignor.  furthermore as a buyer, I spent two weeks trying to find the width size of a pair of black Ferragamo riding boots. Finally I took a chance and just bought them only to find they were a AAA and too small. So I return them two weeks ago and still do not have credit back. Plus I found another pair of Ferragamo black riding boots and even though I used your text and went back-and-forth on another 10+ emails trying to find out the width size with no luck or response from anyone. Just a generic email that they would be in touch and that’s been over A few weeks.  they advise me to go ahead and buy them and if they didn’t fit I could return them. The scenario that I had just already been through.   Not to mention that you have to pay for a return. So unfortunately I wouldn’t even give a one star as this is been a very time consuming and when I see this company chop up an outfit that I had just paid well over $1000 for that matched  i’ll stop here. I have been requesting all my items to be returned and even the rep I have had told me she would take care of it.  That hasn’t happened yet either.","title":"Unhappy first time consigner","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"Maddie","text":"Item was mislabeled, arrived with stains, and I was not compensated as requested to get the stains taken care of. This points out issues with your garment vetting, advertising, labeling, and subsequent customer service.","title":"Item was mislabeled","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"Casey K","text":"I feel mislead.  While the item I purchased is great quality, one very important detail was left out of the photo and out of the description. I would never have purchased it had the photo and description been clear.","title":"I feel mislead","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"customer","text":"I used to love Real Real and years ago would have given it 5 stars. Not anymore!  I've been a consigner and buyer for years but lately they're falling down on everything. No more talking to a person in customer service. Text or email which takes much longer and makes complicated issues much harder. The descriptions of items is very sloppy. Fur isn't identified just listed as \"fur.\" Well there's a difference between sable or rabbit. Jackets are called trench coats when they're not. An item described as \" very good\" had inside the worn out cuff a 4 inch shredded tear with white fill falling out. Men's shoes sold as women's....all happened to me within the last 3 months.","title":"I used to love Real Real but not so much now","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"Price Shocked","text":"I am a customer in Canada. When I log on RealReal I identify as Canadian and indicate that I wish to quoted prices in Canadian dollars.\nI paid with Paypal for a pair of shoes that were supposed to cost CA$ 160.00. the charge was $251.63 followed by an tax and duty fee paid to UPS of $25.99. This is 27% greater than the price on the website.\nI know that I have to pay for shipping, currency conversion and duty but if the the price quoted was closer to the eventual charge shopping at RealReal would be a lot more fun.","title":"Way more expensive for Canadians","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"customer","text":"I found 6 piece of hair when I cleaned the bag…..\nThe shipping is fast and the bag is very cute. Hope they can clean the bag before sending to customers.","title":"Not clean","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"Jeannie","text":"I purchased 5 pairs of shoes and was very aware of the condition as the pictures are very good, however, one pair had damage on the toe that did not show in the picture.  Two others looked a little more worn than expected.\n\nThis was my first time so will be better quality as listed in future. \n\nI love my pair of flats from Oscar de la Renta they came in the original box - obviously never worn.\n\nLesson learned - pay more buy less.\n\nThis is an amazing site - will definitely be visiting again.","title":"Buy less - Pay more","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"customer","text":"When I ordered a bag I looked closely and read the descriptions carefully. While the description had noted a slight discoloration in the bag lining, there was actually a hard sticky substance caked on. Thinking that there were no returns I carefully removed the substance by scrubbing and not thinking about it while trying not to damage the leather by cleaning the lining. I was very disappointed that the description and product did not match, and contacted the company to register my dissatisfaction and flag it for their quality control since I didn’t think returns were possible. They were a bit flippant about it, offered me a return, but since I had already spent time addressing it, I did not accept. I will definitely not be purchasing on the Real Real again, although I gave one extra star because in the end they did offer a return (although nothing else, and I don’t know if I had returned it if they would have given me issues about carefully washing the lining).","title":"Bag condition was not as described…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=83&stars=1&stars=2&stars=3"}]