[{"date":"2022-03-07","author":"Customer","text":"Bad return functionality. Impossible consign functionality on website.","title":"Bad functionality","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"EVELYN CORDOVA","text":"my item were both to be in the original box and they were not and a few months ago one item was delivered to wrong add never got a refund","title":"my item were both to be in the original…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"customer","text":"Sadly nothing fit correctly and paying for shipping then a return shipment is unfortunate. \nAlso, one garment had a very strong odor.","title":"Did not work for me.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"customer","text":"I wish I had known the site credit offered to me would only apply to future purchases. Associate didn’t mention that. Size of the bag was off and authenticity is questionable","title":"I wish I had known the site credit…","stars":3,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"customer","text":"Overall I love TRR- but I am disappointed by the quality or condition of my purchases 40% of the time. The belt buckle on the Prada belt I just purchased for $200 fell off the first time wearing it. A sweater I bought that listed condition as good was riddled with moth holes. Great items with tags but everything else is suspect","title":"Overall I love TRR- but I am…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"customer","text":"The shipment was abandoned by sender. UPS said the sender didn’t attach my phone number or contact details which is why they couldn’t contact me. I emailed the real real 3 times now, no response yet.","title":"Terrible service - did not arrive!!!!","stars":1,"location":"IL","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"Tran Pham","text":"emailed follow up and never heard back","title":"emailed follow up and never heard back","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"Katie","text":"First time ordering from the site. Found some darling designer pieces in great condition. The only problem is, I haven't received my order! Placed the order on 2\/26 for my son's birthday on 3\/6. The birthday has come and gone, and my shipment tracking keeps pushing later and later. Initially expected on Friday 3\/4 and now saying Tuesday 3\/8. I'm not one to usually complain and not sure if it's TRR or the shipper's fault, but it's upsetting to invest in something special and get left waiting.","title":"First time ordering from the site","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"Theresa","text":"Return shipping fees and RMA process is absolutely not competitive and makes me always think twice my purchase and will try to find elsewhere.","title":"Return shipping fees and RMA process is…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"New Customer","text":"The shoes arrived quickly.  I gave 4 star as they looked more worn than in the photo.  So I was disappointed in that fact.  I like to buy \"like new\" with little evidence of prior use.  These were white Ugg slip on sneakers and they just look very used and dingy.","title":"The shoes arrived quickly - But Showed A Lot of Mileage on Them","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"Red Threads","text":"RealReal priced my consigned items way below resale market & often botched their descriptions. It took months to get items listed. Payment’s an interminable wait. I’m owed approx $1K, but I’ve been paid a paltry $13 so far. I’d never consign with RealReal again.","title":"RealReal - really bad resellers","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"Robin Josey","text":"The sweater I purchased had clearly been worn many times, had a lot of pilling, and didn’t smell fresh. If I had seen it in a resale store, I wouldn’t have given it a second look. A $75 lesson—probably won’t shop here again, and definitely if it’s no refund. The description made it sound a lot better than it truly was.","title":"Buyer’s remorse","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"Bad customer service, couldn’t get a hold of them. Too expensive to pay shipping for orders and returns ($50 for two returned dresses is way too much)","title":"Bad customer service, expensive returns","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"I would order more if there was free shipping.","title":"I would order more if there was free…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"BB","text":"The sizing was grossly inaccurate.","title":"The sizing was grossly inaccurate.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"Hannah Margolies","text":"i didn't get my package and i reached out for help. i haven't heard back and have not recieved my clothes.... i deserve a refund but they are trying to sweep it under the rug and ignore me.","title":"i didn't get my package…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"Hello, I recently purchased a pair of sunglasses from the real real and am extremely disappointed. First, they came and the arms of the sunglasses were so loose the sunglasses could not even be worn. I had to take them to a repair store to be tightened. The side logo then fell off and the quality is overall very bad. The condition was labeled as “very good” under the description and that is indeed not true. Very disappointed and would like my money back.","title":"Bad Dior Sunglasses","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"UniqueXtravaganza ","text":"I’m so disappointed because you come across great deals but the customer service was bad I’m still waiting for my purchase ,I was told they’ll call me back n never did .I been sending text n emails going in two weeks ups routed my package never attempted as claim I have ring doorbell camera never seen him attempted.now usps supposedly according to the real has my package and I went to post office no package n look up updates on my real account no info ,I call them and representatives working from their homes been giving run me the run arounds .The texting system they have to reach customers service was a horrible experience I ever had ,still I have no professional feed back or resolve situation . I hope to resolve this in such a way so that hopefully others won’t go through the same ,","title":"TheRealRealFrustration","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"Not satisfied with goods. Chart with costumer service for return. No one could help. The store is not a good place to buy goods, do not recommend.","title":"Not satisfied with goods","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"Liron Zilberbuch","text":"I’ve purchased a purse on Sunday 2\/27 and didn’t notice that the shipping address was wrong. I immediately contacted customer service and informed them. The rep said that he can’t change the shipping address and that he would call the package back and refund me. I was still interested in purchasing the purse but was unable to buy it until I get the refund and the item is available for purchase again. It’s been a week and I haven’t received my money back, and the bag is still unavailable.What a mess for nothing. Just poor customer service.\n\nI’d be happy if someone can tell me the status of the refund and the option to buy it.\n\nThank you,\n\nLiron","title":"LV purse purchase 2\/27","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=73&stars=1&stars=2&stars=3"}]