[{"date":"2022-02-05","author":"customer","text":"I dropped my items off at the store almost 3 months ago. Throughout this time I have had little to no updates and had to constantly follow up on the status myself only now to find out that one of my items is being returned and will take another 45 days. I have received offers other places which I should have pursued but had heard good things about the RealReal. I am extremely unhappy with the process and will definitely suggest my friends go elsewhere when consigning such high priced items. I would never consign with the RealReal again. Absolutely terrible customer service. Super sketch that they don’t give receipt, timeline, tracking etc. Just don’t do it.","title":"Don’t Consign Here!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-05","author":"J L","text":"My first two orders with this place were positive, but then I wanted to return a $150 Cuyana jacket.  I returned it within the timeframe, but on my account, it says the order is not returnable.  WHAT?! I started a return well before the 14 day limit, and sent it back well before 21 days, and it's not eligible for a return?! Yes, I got 20% off this jacket, but it is eligible for return because it wasn't 40% off.  Why did you even issue a RMA and shipping label when the item turns out not to be returnable?  \n\nOn top of that, their shipping and returns policy is a ripoff. Almost $12 for shipped and $12 for returns? Along with ripping off people who sell on consignment? Your company deserves to go out of business.","title":"THIEVES","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-05","author":"TDorman","text":"I purchased an item (Item # ZGN68121) described as a \"card holder\", sized 3.5\"(h) x 3\"(w); however, when it arrived, the item was actually 5.5\"x 3.5\" and the retail tag included with the item described it as a cell phone holder. I chatted with a sales rep \"Samar\" on 1\/22\/22 describing the problem and requested a full refund (item+tax+shipping = $94.73) - not the partial refund described on the RealReal site (item only, less return shipping and tax = $68.99). Samar indicated that because the item was not as described I would receive a full refund. I am still owed $25.74 for the item that the RealReal incorrectly described and sold to me. \nI notice that today the dimensions of this item are updated to 5.5\"(h) x 3.25\"(w), but it is still described as a \"card holder\". So it was partially updated online. I can provide the full transcript of the chat with Samar if needed.\n\nUpdate - I attempted to contact customer service again at 1000hr EST, and this time was never able to connect with a representative because responses occurred 6hrs later (1400hr EST first reply) when I missed the text and attempted to reconnect, that was again responded to 7hrs later (2300hr EST second reply), to which I received the response: closed, try again Monday.  \n\nCAVEAT EMPTOR","title":"Item not as described and ~full~ refund not provided as promised","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-05","author":"A.L. from Boston, MA","text":"Unfortunately, I have no choice but to give TRR one star. I wanted to purchase a black leather bag from a certain designer. The listing of the bag that I wanted to purchase featured a photo of the bag in black leather. The website states that the photos listed are the ones of the real item. However, the description of the bag said it was blue leather. I contacted TRR before purchasing to inquire about the discrepancy. The associate assured me that the bag was black leather, and if the bag that arrives is blue, I would have been eligible for a refund and return because it would have been an error on TRR. The purchase was a risk, but I figured that with my documented conversation and promise that I would be able to return if it were blue, I hesitantly spent $2K on the bag. The bag delivered was blue leather. I contacted TRR to initiate a return, only to find out that nothing could be done because the bag was described as blue leather on the product listing. The prior-to-purchase conversation was brought up and reviewed by the sales associate. Even after reading the correspondence, the BEST thing that they could offer me was to consign the bag back with TRR (which would have me lose A LOT of money on a bag that I never had worn). I purchased the product under false pretenses. This purchase was a lot of money and for a site like this, I would expect more professional and human customer service. I know I took a risk that the bag would have been in a different color, but the mistake was on TRR for two things: 1) not picturing the actual item for sale and 2) not staying true to their word. I will not be shopping on this site again and will advise friends to do the same.","title":"Misled and out $2K","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-05","author":"customer","text":"Received a pair of shoes that were listed and categorized as a size 8. After receiving my order I realized it is impossible that the shoe was size 8. I found the label hidden in the shoe that read size 6. Did not have a good experience getting a free return label even though it was clearly not my fault. Spent 45-1hr of my time to figure out an error made by the company.","title":"Received a pair of shoes that were…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-05","author":"customer","text":"Dress size was misrepresented as a size US 6, the size chart on the designer’s website says it’s a US 4","title":"Dress size was misrepresented as a size…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-05","author":"customer","text":"I have to say that my first RealReal experience has been very disappointing. I purchased an Ebel watch that was supposedly in good condition and also evaluated by a horologist and that it met time keeping standards. Upon receiving the watch I immediately knew something was wrong. It was not keeping time. Took into an Ebel certified watchmaker, they changed the battery, and it still did not work. I can't return it because the product was \"final sale\" and it is VERY difficult find a customer service phone # or email and I am left sending a Facebook message. The watchmaker is now fixing the watch which is going to cost me another $400. I would NOT recommend the RealReal to anyone. It is unreliable and it is hard to imagine that all products are actually evaluated and authenticated thoroughly and by a qualified professional.","title":"Broken Watch","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-05","author":"kbsf","text":"A fur coat was supposedly rejected for consignment.  I was notified that it was being returned to me but at the wrong address.  I immediately called, live chatted and emailed to correct that but have had no resolution.  UPS will not let me change the shipping address because the shipment did not originate with me so I'm at a loss for where this coat is now.  It certainly hasn't gotten back to me, and no one there will help me with this problem.","title":"Fur Coat Lost","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-05","author":"Staci","text":"I was surprised that the purse I bought did not match the one in the photo.  I'm most upset on the fact that I loved the purse but felt it was falsely advertised on its condition and color.  I purchased two pairs of shoes and felt the price was reasonable.  Both pairs matched their photos which I appreciate.  One pair needs some cleaning on the inside.  I was surprised that they weren't cleaned out before sent.  Now I understand that The Real Real isn't like an ebay or Poshmark seller that tries to make the product the best it could be for good reviews.  \n\nWith that, customer service was very kind to let me return the purse.  I'm still not certain if it was the same purse from the picture.  We returned the purse at the Marin store and the lady was absolutely hesitant about not accepting the return until she found the return number issued by customer service.  She was not happy about the situation.\n\nAfterwards, we purchased a different purse costing twice of what I originally invested in the first purse.  The sales person was aggressive with the handling of the bag.  So much so, I thought he might rip it or scratch it.  It was uncomfortable watching him struggle with the bag while he was trying to inspect it and look at it.  I was thinking he might be differently challenged yet for a high-end seller, I was surprised at how he handled the store merchandise.\n\nOverall, it was interesting 🤔. There were lots of glitches along the way, but I kept a few of the items to see how I felt about buying second-hand luxury .  Not sure, though, if I am as eager to purchase from The Real Real as I was for my first purchase.\n\nI'm adding to my review.  One, the lady at the Marin store who took our items was very nice and had fabulous customer service.  I would go back and buy something just because she was so helpful and customer service oriented.\n\nLastly, I just cleaned out the gunk in the Tod's mules.  As I was cleaning out the dirt and grime, I realized both shoes are completely broken.  I'll call customer service, but I'm surprised at the quality with gunk and dirt in the shoes and the fact that they're both broken and unwearable and a dirty stained purse (I still think it's the wrong purse sent) that looked nothing like the photos.","title":"I was surprised that the purse I bought…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-05","author":"BF","text":"I really wanted to like this company. I consigned with them and an agent contacted me very quickly. I gave them six coats and many ties, and a very expensive leather bag. \nTurns out THEY choose the prices. A two thousand dollar leather bag they sold for 240 dollars. My commission was a little over one hundred dollars. \nWhat a rip off!\n\nI consigned Ferragamo and Fendi ties worth hundreds of dollars each. They sold them for 24 dollars, 28 dollars, and my profit was a meager 55 percent of this-23 dollars. They are in charge of putting a price on each item and want quick cash. They will sell your products for low prices, take the quick cash, and send you a meager check with taxes and other fees taken out. \n\nThey said they would list everything before Christmas, and it took them months! I could not and still cannot track any items. I have contacted customer service and they will not write me back.","title":"Ripped Me Off!!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-06","author":"customer","text":"I brought 3 rings in person to the Madison Ave NYC location to expediate the process October 2021. The RealReal forgot about the diamond engagement ring, the most valuable item so it I had to keep asking when it would go live. Finally it went up over 80 days later January 2022. The manager apologized but my diamond engagement ring missed being posted for Thanksgiving,Christmas and New Years all the holidays when proposals occur. VERY upsetting and disappointing:(\nAnother ring was returned and relisted which confused me since I received my commission. It took over one month to reply to my concerns but finally was told this is their policy for returned items. I was very stressed and suspicious being kept in the dark for so long which is unprofessional.","title":"RealReal forgot to post engagement ring missed holiday sales & other ring sold received commission & now relisted very suspicious!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-06","author":"TW","text":"The pics of the Chanel bag didn’t show the true condition. I was shocked when I received it to see how faded it was and completely faded at the corner and the zipper pull a different color(brown). Now I am being quoted 550-650 to repair it after paying $700. I can’t even carry it bc it looks horrible. I won’t purchase or recommend that anyone purchase anything that’s not returnable. Felt like I got ripped off!!! Fashionphile reviews the true condition of its bags with actual pics and TRR should too.","title":"Chanel bag in horrible condition than shown, pics altered","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-06","author":"scoop","text":"It has been a long process since I submitted my items to be sold with The RealReal.  It has been more than 6 weeks and still, items are not listed.  No communication from The RealReal about why, what, when, how for delay.","title":"It has been a long process since I…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-06","author":"customer","text":"First time buying and I was really disappointed! The item was dirty and had an odor. Also it did not include all parts of the actual item and the pictures \/ description did not mention that!","title":"First time buying and I was really…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-06","author":"customer A. SISON","text":"This site is so frustrating. I wanted to buy an item, but the size posted was confusing. It said Medium but also says Designer size 2 in the description. Contacted their customer service (which is really the worst ever!), and they told me they would update the size in 24-48 hours. Obviously, that never happened! Tried again.. Twice even! Still they would tell you that they will send an email to update. But I never received such emails for the updates.\n\nWork on your customer service. If I can give a score of zero, I would.","title":"This site is so bad","stars":1,"location":"PH","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-06","author":"Michelle A.","text":"I’ve shopped for 2nd hand items plenty. Was was so disappointing was the fact the sunglasses did not describe any type of scratches on the lenses. These were significant scratches and were right in the center of the glasses. 👎🏻 So all in all I LOST MONEY because I had to pay for shipping back! No thank you I’ll stick with With the company’s that have proper customer service guidelines on returns.","title":"Not honest description, and You get charged for it!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-06","author":"customer","text":"Pricing valuation is terrible, valuation is less than 10% of value with additional discounts added. Payout ends up being less than 1% for items in new condition. You advertise  get paid 3x more which is absolutely false. Your customer service reps are very good.","title":"Pricing valuation is terrible","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-06","author":"customer","text":"HORRIBLE ORDER NOT RECEIVED. \nSecurity systems show no delivery. Would like refund issued asap. I've asked for proof of delivery. Neman's delivered something today and I saw the guy take a photo of the box and the address - similar with Amazon. I suggest you determine proof of delivery. \n\nThen was asked to manage the research to figure out where the order went. Work on your customer service.","title":"HORRIBLE ORDER NOT RECEIVED","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-06","author":"Unhappy","text":"Avoid the RealReal. I bought a vintage Dior bag described as “very good”. But there were MANY undisclosed flaws. Handles of the bag had cracks along the glazing, and severe peeling of the paint. Leather on the handles was almost separated (coming apart). Pen marks, and various small stains inside the interior. Also pockets had stains inside (unusable). None of these flaws were disclosed in the description. This was my first and last time purchasing the RealReal. Would rather go to Fashionphile.","title":"Avoid the RealReal!","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"},{"date":"2022-02-06","author":"customer","text":"Bag is permanently created on back side where it looks like it was stuffed in the bottom of someone’s closet for quite some time. No returns so I’m stuck with it.","title":"Bag is permanently created on back side…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=98&stars=1&stars=2&stars=3"}]