[{"date":"2022-05-01","author":"Chris Collins","text":"The clear plastic bag containing the earrings had visible black flecks inside, and sure enough the enamel paint was chipping off on both earrings.  I had wasted my $25 store credit on defective merchandise.","title":"Disappointed Customer","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"Pam E.","text":"Was disappointed that my ‘Excellent’ condition (no visible signs of wear) Valentino bag arrived with obvious damage to the front clasp. I went back to check on the post to see if I had missed something or ordered the wrong bag. Upon really zooming in to a photo you could just see some discoloration on the clasp. Honestly, would not have purchased this if it was made clear to me. It’s also non returnable. Now I will have to send it out to be repaired.","title":"‘Excellent’ condition not so much….","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"Tai","text":"I like to return what I purchased. The item were states Tiffany T chain bracelet. What you sent me where Tiffany T chain bracelet narrow.","title":"I like to return what I purchased","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"KC","text":"I never received my order, and customer service was unresponsive on the text chat.","title":"I never received my order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"Grossed Out","text":"Top marked as in “EXCELLENT” condition. Arrived with tears in neckline, reeking of perfume, and covered in dog hair. Gross.","title":"Top marked as in “EXCELLENT” condition","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"customer","text":"Excellent service","title":"Excellent service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"customer","text":"I have been disappointed the the REALREAL customer service department. Whenever I have a problem such as items being returned to me as a consigner, it takes 2 weeks to get the item sent back. By that time, it has usually sold. Also, I have on many occasions, sent in item that are sent back to me because :Item not on current consignment list even though I have the identical item currently listed, AND the site allowed me to list the item in order to ship it. Most of my concerns get the general reply of \"I will need to send it up the chain of command\" and it take forever to resolve the problem. I have also requested items be retuned to me when marked down 70% or more. The original item was sent in new with tags but returned to me with tags removed and a realreal tag stating this item cannot be returned if this tag is removed, so I think the item sold, was returned by the buyer after cutting off the tags and wearing it, then returned to me. I have questioned this several time and submitted original tags pictures, but get no response.","title":"Terrible Customer Service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"Kevin","text":"No where did the listing specify that this was an extremely narrow British “C” width shoe.  In the absence of a width spec, the buyer would assume medium\/normal.  It seems rather apparent that the folks at The Real Real aren’t as knowledgeable in high end brands as they claim to be and don’t understand the importance of including images of such information in the listing.  It’s printed right there in the shoe.  And they’re nonreturnable.","title":"Short on information and nonreturnable","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"I paid $64.95 for a Mara Hoffman dress with the $32.50 resale tags left on. Didn't leave a good taste in my mouth. Cute dress though.","title":"I paid $64.95 for a Mara Hoffman dress…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"There is some stuff inside the bag . It seems that no one cleaned the bag before.","title":"There is some stuff inside the bag","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"Bag was faded on the sides. Pictures misleading","title":"Bag was faded on the sides","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"RMP","text":"My original purchase the item was gone. So received a credit.  I purchased a Joie blouse then and it is not up to the usual quality standards I’m accustomed to from the real real.  I would have returned the item but it would not be worth it for the shipping cost to return so might just donate.","title":"Not up to The Real Real standards","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"Shipping costs are very high. Customer Service is almost impossible to reach.","title":"Shipping costs are very high","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Lenka Zajicova","text":"Terrible. their items usually come in a horrible condition","title":"Terrible","stars":1,"location":"CZ","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Mario","text":"The shoes I received were plastic and imitation.  So I immediately went to home page to request a refund and return - the site generated an error that I was past the return time.  I had not had the shoes 10 hours.  There was also no way to contact anyone.","title":"Fraudulent","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"TU","text":"I request my packages be sent to a pick up transit point since The real real uses UPS to ship. Twice now I’ve had items be sent to my home address and not my transit pick up point. Which those items said it was going to the pick up point.  It makes me fearful to purchase higher priced items just to be shipped to my house and be picked up by a random person stealing packages walking by. Additionally my last package did not come with literature saying it’s certified by the Real Real nor a manifest \/ packing list of what I ordered came in my box. I’ve emailed twice prior in regards and received no response other than the automated response.","title":"Not being sent consistently to my home","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Diamond Das","text":"I absolutely love the product; however, I was a bit disappointed as the packaging was subpar.  Firstly, the box was actually open, and the gift box, which I paid an additional few dollars for was green, not black and it was bruised.  I was a bit confused.","title":"Product lovely, packaging lacked severely.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Sherry Obrosky","text":"This purse was NOT as expected.  I know I cannot return it.  That being said, I will try and re-sell it somewhere.  \n\nThe purse itself was ok.  Quality was semi-ok.  But, the inside of the purse smelled absolutely awful.  It is horrific.  It smells like \"cigarettes\" or something musty and nasty.  I am absolutely NOT happy and probably would not use your services again.  I would not chance this kind of thing ever again.\n\nI thought it was going to be so much fun having a website like yours to order from.  Very, very disappointed. Would not even give one star if I didn't have to.","title":"This purse was NOT as expected.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Mariana Fresnedo","text":"The shoes I bought were the wrong size. \nI bought 10.5 and received 8.5. \nThe sweater was pretty damaged.\nThe other 4 items were OK. \nIt's a risk, very easy on the return though :)","title":"The shoes I bought were the wrong size","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"customer","text":"I purchased a Marc Jacobs bag rated Excellent. It was not, there was gum, pills, keys and coins in the inside pocket. These items stained the lining of the bag. I am giving Realreal 3 stars because customer service promptly addressed my concern and gave me a $25 store credit.","title":"Bag was not in Excellent condition","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=11&stars=1&stars=2&stars=3"}]