[{"date":"2022-04-26","author":"Lorna K","text":"I have bought a lot from TRR. Mostly a success, I had failures but I ended up giving it away. The 2 North Face ski pants were not well described as ski pants. It also has ski lift ticket and human hair and pets hair. Please make sure you walk  used clothes before selling it. Disgusting.\n\nThe Missoni purse looked like a cheap jacquard material and very slouchy. Again, for the sake of the environment I will not return it, will use it for a while and may give it away. \n\nThe candles are quite beautiful and artistic. Too expensive for me to burn it. \n\nI guess I’ll stop shopping for a while. I’m getting all misses.","title":"I have bought a lot from TRR","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"customer","text":"just arrived, it is smaller than I expected (not really a US 4, more like a 2) but  the item is otherwise as described","title":"smaller than expected","stars":3,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"customer","text":"I reported part of a missing order and was never responded to.","title":"I reported part of a missing order and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Katie O","text":"Incorrect size was shipped!","title":"Incorrect size was shipped!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"customer","text":"The security tag is still on the bag that I received.  I now have to go to a local store to have it removed, and then let RealReal know how much it cost so I can be credited.  Less than ideal experience :(","title":"The security tag is still on the bag!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"customer","text":"Very incorrect on the size, again, and my purchase had to be split due to a buggy website. Adding more unnecessary shipping fees. I'm wasting money on unnecessary shipping.","title":"Very incorrect on the size","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"customer","text":"Customer service sucks","title":"Customer service sucks","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"customer","text":"Easy website to use.  Item was shipped and delivered promptly.  The quality was great.  However, without the generous discounts offered, I am not sure I would have placed an order.  The item's regular price was quite high for used clothing.   The shipping and handling charges were far too high, definitely more than your shipping cost.","title":"Easy website to use","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"sampej","text":"The shirt colour was very fade and RealReal indicate it was in excellent condition. It wasn't.","title":"The shirt colour was very fade and…","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Debcustomer","text":"I was a tad bit disappointed in the condition of the bag.  I will have to clean the inside of the bag because it still had makeup residue  in at as well as what appears to be some animal hair.  The Tory Burch logo is also scratched up which is an easy fix with a gold pen.  I was just disappointed but I will fix the logo and clean the bag myself.  With that being said, I won’t be a returning customer.","title":"I was a tad bit disappointed in the…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"customer","text":"Your return policy is garbage. You take money for returns like the scam you are","title":"Your return policy is garbage","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Sarah Najafi","text":"i recently purchased a Longchamp wallet, which to my surprise when I received it, was not leather.  it is plastic... Really, a designer brand in plastic ?","title":"i recently purchased a Longchamp…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"customer","text":"Absolutely horrendous customer service","title":"Absolutely horrendous customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Ken ","text":"The problem is you don’t always get what you order I got a 2 pc suit which is what the ad said but only got the jacket but haven’t gotten the pants I should be reimbursed half of the money . Once you purchase a product you own it so why did I get half an order . And this happened on the very first order . In one week I have six different orders 4 of the orders are not complete.  And I email customer service no response","title":"Don’t count on it","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"customer","text":"Shipping was fast which was great. But they had my bag labeled as good condition. It was not. There was a tear in the canvas and a large white mark. Neither of those showed in pictures. I was torn between the one I got and another bag both the same, however the other bag was labeled as fair condition and higher price. I took good condition as better than fair so I went with the cheaper one but wish I would have just spent a little more for the other one because it looked better in the pictures. Very disappointed in my very first authentic bag.","title":"Shipping was fast which was great but bag was not what I expected","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Kate","text":"The dress ordered said discoloration consistent with normal wear, it neglected to state bleeding colors due to not being laundered properly. The designer tag inside was half cut off and dangling and the dress smells TERRIBLE. Overall, extremely disappointed.","title":"Disappointing purchase","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"ANT","text":"I only received 1 shoe lace with my shoes!","title":"I only received 1 shoe lace with my…","stars":2,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"customer","text":"The shirt looks fine but it arrived in a wrinkled ball of tissue paper. Could be from Zara. It doesn’t look new although it says it was new. It’s fine but it looks like really bad and cheap at first glance","title":"Good item arrived in Zara-like ball","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Carla T.","text":"I only received a 10% store credit, not refund, for a misrepresented item I purchased. Only one flaw was listed and when the bag arrived, many more flaws were apparent and should have been disclosed. I had to fight to be compensated and learned at the end this \"compensation\" would only come in the form of a credit. As if I could trust TheRealReal with another online purchase...","title":"Misleading Descriptions on Condition","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"customer","text":"My box came open, fortunately what I ordered was in there","title":"My box came open","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=16&stars=1&stars=2&stars=3"}]