[{"date":"2022-04-22","author":"customer","text":"Missing the strap \nSo I can not use it as cross body this is the reason I bought the bag ! \nAnd it is non refundable !","title":"Missing the strap","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"customer","text":"Shirt not true to size.","title":"Shirt not true to size.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Angela Clark","text":"I have been on both ends of the spectrum with this company as a consignor and buyer. I cannot safely order anything and expect it to arrive described carefully; something so simple as correctly stated the correct color. Take your business elsewhere. They are the least bit concerned  tying up your hard earned dollars than they are getting it right the first time.  Stick a fork in me I am done with this company.","title":"MANY ISSUES IS AN UNDERSTATEMENT","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"customer.   CG","text":"I gave this rating based on my last purchase.  The size given was incorrect as well as the measurements and color.  Very frustrating.  That said - I have made some amazing  purchases on other occasions.","title":"I gave this rating based on my last…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"customer","text":"Customer service is horrible!","title":"Customer service is horrible!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Kimmyj","text":"I was so excited to get my gold shoes. Was expecting them to come UPS but they were lost. I did get a refund but rather had the shoes.","title":"No red bottoms for me","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Jayna D.","text":"Things get discounted without any information from TRR. When things sell, I never seem to get the advertised consignment rate…my last sale was 30% commission on an item deeply discounted (without my notification nor approved amount). It’s disappointing because it seems fair but I don’t seem to get what is presented as the terms. I will not be sending any more items to consignment with TRR. It’s not worth it.","title":"Not as good as it seems","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"customer","text":"Good, but shipping period is some slow.","title":"Good","stars":3,"location":"KR","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"customer","text":"I ordered a Burberry keychain, but received someone else’s purchase of a hair bonnet.  I bet if it was a Rolex they’d make the refund\/exchange process easier.  I was never offered the keychain I paid for.  I thought they would expedite the shipping process, but they just offered a simple apology, and instructions on how to send the incorrect item back.  Upon receiving the item, they will issue a refund.  It’s been 2 days and ups has not come to pick up the package.  I hope this doesn’t carry out for much longer.  I’m out 108$ dollars.","title":"I ordered a Burberry keychain","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"customer","text":"I purchased an item which was received in a timely manner. Even if I bought from the Canadian website, in Canadian currency and that it mentioned delivery to Canada, I was not informed that I would have to pay to UPS an enormous fee for customs. I paid 30$ for shipping for a small item and ended up paying over 110$ To UPS in extra for a 200$ item… I wrote 3 emails to Realreal (one before paying the extra fees and 2 after as I was forced to) and never got an answer back. I got the item but I have to say the responsiveness is inexistant and the service is very deceiving for this company","title":"Shipping to Canada but watch for the hidden fees","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Andrea Miller","text":"The customer service rep did not solve my issue. She kept me waiting for hours, she seemed to be busy doing something else except for her job. She said she was sending me the label for the information below and sent the wrong label for another shoe!! I told her it was incorrect and she never replied!!!!!!!!!!! I explained everything to her and had to repeat myself many times. If you are able to read the messages of the last conversation, please do so because this has been a huge inconvenience. I want my refund!\n\nThis is the one I need the label for \n\nOrder Number: R211623243\nOrder Date: Apr 16, 2022\nORDER NOT RETURNABLE\n\n\nChristian Louboutin Decollete 554 Patent Leather Pumps\nCHT240241","title":"The customer service rep did not solve…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Michael franker","text":"I ordered a pair of Gucci sliders. Size 6, but when I got them they were a size 9.","title":"I ordered a pair of Gucci sliders","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Robert Massie","text":"The shoes condition was listed as very good but there was visible damage to the stitching and leather that was not shown clearly in the photos.","title":"The shoes condition was listed as very…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"KK","text":"I paid $195 because I had a voucher (would have been $225 otherwise) for a used La Ligne sweater that I’ve been looking for. La Ligne sweaters are $250 brand new. Shipping is ridiculously expensive on The Real Real for some unknown reason. The sweater arrived and smells awful. Like moth balls. Definitely not how a $195 sweater should smell. I tried contacting customer service and got a response that they’d give me a $20 credit towards another purchase. That wasn’t going to cut it. Who is paying for the dry cleaning or whatever else it will take to try to remove the awful smells from this sweater? Their text customer service service does not do anything except verify info - no one ever responded. I finally googled how to call them and was able to talk to someone who then was able to refund me $20 to cover the costs of cleaning. Not a good experience. Are the clothes vetted in anyway before being sent out?","title":"I paid $195 because I had a voucher…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"customer","text":"Items condition not accurate","title":"Items condition not accurate","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"hebel","text":"Ordered 4 shoes, came in 2 separate packages and one package was 2 weeks late. Shoe quality was as described","title":"Ordered 4 shoes","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"customer","text":"Fake designer.\nI bought a Louis Vuitton wallet from the realreal and it was absolutely fake.","title":"Fake designer.","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"LESLIE CECILIO ","text":"Fast shipping and easy shopping but the problem\nIs they sell their items too much. Like overpriced.","title":"Fast shipping and easy shopping but the…","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Maria B","text":"I really liked my order but one of the tops was stained which is surprising considering how strict TRR is with inspecting every garment. \nI’d love to leave a 5 star review but not this time.","title":"7 out of 10","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"jcc","text":"This was my first time using TRR. It was just OK and I'm on the fence about continuing. The prices were good and the merchandise was in good condition.  On the downside, it was difficult to see the product in the image provided.  Essential details to the brand were not included in the description so the merchandise I received was not quite what I thought I was buying. The order shipped in multiple packages yet only one tracking number was provided in the order details. One item I purchased could not be found in inventory so I got a note that I would be credited. Items were slow to ship. I had questions. I sent 3 separate outreach emails to customer service (one for each question). Never got a reply on any of them. All in all, my first impression is  \"you get what you get\" and it's a pretty  one way relationship.Meh.","title":"This was my first time using TRR","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=21&stars=1&stars=2&stars=3"}]