[{"date":"2022-03-08","author":"customer","text":"The descriptions were wrong.  A skirt described as black was grey (and not returnable). A sweater without measurements provided was described as \"fitting true to size\" but was actually cropped (and not returnable).  Third item was ok, I just didn't love it- and it was returnable -but they require you to buy the return shipping label through them - and charge $13 which is more than it would cost for me to buy shipping myself.  Overall not a great experience.","title":"The descriptions were wrong, most items final sale.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"It’s not what I ordered. And they said no returns on handbags.","title":"It’s not what I ordered","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"customer","text":"First time buyer. I was very impressed with the quality of the product. Delivery service was excellent. I  will purchase again.","title":"First time buyer","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"Order # R348323255\nItem Number HMM38586\n\nLeather feels like it's been shoe-polished\nMetal buttons also have a layer of black paint\nOverall quality is very bad\nNot like the DIOR leather jacket I bought before","title":"Order # R348323255","stars":1,"location":"TW","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"This time I had 2 big problems.\nGucci sneakers were men size and not women. So the 38 was a 42….\nAnd an Isabel marant sweatpant came really damaged…. Even with a hole","title":"This time I had 2 big problems.","stars":3,"location":"AR","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"return and refounf is too slow.","title":"return and refounf is too slow.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"Maria Cabrera","text":"Normally I have been a fan of The RealReal.  I have purchased several items and have sold items too.  But the purchase I made recently was very disappointing.  Arriving today was a cute Burberry blazer and a Piazza Simone top.  The top was ok, very high in the underarms but at 75% off it's ok. The blazer on the other hand, also 75% off, was given a \"good\" rating but failed to mention marks on the sleeve and yellowing at the cuffs of the sleeve and neck area.  Unfortunately it's a final sale.   I would not have purchased the blazer, even at the very discounted price, if I had known of the issues.  I will take it to a dry cleaners and see if it will help, but overall I was very disappointed.","title":"Quality control took a day off","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"My e-mail is blowing up with offers i am not interested in!!!!!!!!!!!!!","title":"My e-mail is blowing up with offers i…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"Photo quality doesn’t depict true flaws of the item purchased. \n\nStain on bag is significantly darker and more noticeable in person than in the photos. \n\nIf it was a returnable item, I’d definitely send it back.","title":"Photo quality doesn’t depict true flaws…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"I ordered a lot of stuff and everything was in super bad condition. Really disappointed.","title":"I ordered a lot of stuff and everything…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"Generally I love The RealReal, however my last two orders did not work out. One was cancelled four days after I placed the order. The second order arrived damaged, even though the condition was supposed to be excellent. \nCustomer support was helpful though!","title":"Generally I love The RealReal","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"Bought 5. 4 of them was great and good shape. One was white but it wasnt white anymore. It looked much more worn and dirty than pics showed.  Disappointing for the cost! No returns and I dont want to resale with someone feeling the same as I do. I wish I could get back my money and send it back.","title":"1 of 5 very disappointing","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"No authenticity sticker on the camellia Chanel wallet on a chain. I’m sure it is not real. Not leather inside. Paid 2800.00 for something I will never use. No return. Major disappointment. Never again.","title":"Ripped off","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"Mary","text":"For very expensive, polarized, designer Chanel sunglasses rated by RealReal as in \"excellent\" condition, I waited excitedly to receive them. Imagine my great disappointment when they arrived to see they were VERY crooked & loose on my face; they could not even sit straight on a table! They were clearly damaged. How in the world did RealReal rate them \"excellent?!\". (I'd hate to see what some of the lesser rated items are like on RealReal!!) I feel cheated & disappointed, & wary of buying anything again on RealReal. BEWARE.","title":"Chanel Sunglasses","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"I was mislead by the listing - it said “faint scratches on lens” and there were in fact deep scratches and customer service refused to help me. This was my first purchase with TRR and it will be my last.","title":"Disappointed","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"The wallet I ordered was rated as very good.  Just one below like new, but when you opened the wallet one of the dividers for the cards was pulling apart. A very clear flaw and made the wallet unusable as it would only get worse with use.","title":"The wallet I ordered was rated as very…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"I had sent in 4 items and only 3 posted and sold already and my last item isn’t even posted and I have asked for an explanation but I get the same excuse.","title":"I had sent in 4 items and only 3 posted…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"customer","text":"Shipping took a long time and the tie arrived damaged so I had to take it to someone to have the tie holder sewn back on. Not a good first experience.","title":"Long shipping then had to repair","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"Susanne","text":"I bought a fake bag from the real real  last week, it’s a ridiculous thing I’ve never met before! \n\nAnd no refund and reply me even by a email !","title":"I bought a fake bag from the real real …","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"Texasheat","text":"Purse was missing the strap. Maybe I failed to read that in the description. I think that purse could have been cleaner.  There was hair inside of it.  Yuck.  I do love the concept of resale.","title":"Purse was missing the strap","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=71&stars=1&stars=2&stars=3"}]