[{"date":"2022-04-11","author":"customer","text":"I recently placed an order and while 3 out of 4 products came as described, one was not labeled properly. The website listed the shoe as a size 5 but did not specify women’s or men’s anywhere on the posting. It came up while searching for women’s shoes, so I assumed it was a women’s size 5. Because it is a sale item, it is final sale. So despite the fact it is the wrong size and was not labeled accordingly, I’m out $200. I gave two stars due to the other products descriptions at least being accurate.","title":"Inaccurate Sizing\/Labeling","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Ala Bocharnikov","text":"The item was misrepresented by the company. It was presented as brand new with tags. However, the item was washed and has stains (have photos). You can also see signs of wear which was not inspected or described on the site. Extremely disappointed and regret paying for shipping both ways.","title":"The item was misrepresented by the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Customer","text":"I ordered two pairs of jeans that were rated as \"Very Good\" condition on the RealReal. The first pair was great, but the second pair was ridiculously stained all along the lap. The stains were rust colored and obviously not part of the design or wash of the jeans. I was shocked as these certainly shouldn't have been approved for resale much less marked as \"Very Good\" condition. I went back and checked the image listing online and I could see tiny hints of the stains online, but just barely.\n\nReturning the jeans would cost me money, so I reached out to their customer service via text. The person helping me sent me an email with a shipping label and they said it would be a free return, but the email specifically said I'd be charged $12 for returning this item. The customer service rep said I wouldn't, but I didn't like feeling like I'd have to go off just their word. \n\nAll in all, this was a lot of extra work, resources, etc. for a product that had no business in resale at all.","title":"Received stained jeans that were NOT fit for resale.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"PER","text":"I felt that three pieces of clothing marked “very good” condition were far from very good. The jacket had pen marks on the front, the poncho had scuff marks on the shoulder (looked like it had been walked on) and the pants had a bleach stain. I would call these items unsalable. I’ve sent items in far better condition that have been returned. At the very least, the condition ratings should be honest and accurate.","title":"I felt that three pieces of clothing…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Bill","text":"Packaging was horrible. The tip of the golf shaft protruded through the box & was sticking out a half inch. Lucky it didn't get damaged in shipping.","title":"Packaging was horrible","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"customer","text":"They don’t accept returns","title":"They don’t accept returns","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Filomena R","text":"I ordered for the first time from RealReal Canadian website. I ordered 2 dresses that were beautiful, described as pristine, but each had a tear. The sizing was off…both were marked as 10-12 and were more of a size 6-8. As well, I paid 150$ to import from the US. I wasn’t aware of this as I believed I was ordering from a Canadian website.\nThe company was great in returning for full refund within the 21 day return policy. However, it did cost me 60$ to return…therefore I have no dresses and am out 210$.","title":"I ordered for the first time from…","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"customer","text":"You take my stuff you take all of it you don’t have a problem when I buy something you send it within a week when I ask for something back from the stuff that I gave you there’s no answer and you keep it and you’re stealing it from me now I want all my stuff back you are not professional I thought you were you stole my sneakers you never sent them back March 25 was a blouse that I purchased from you and it wasn’t the sneakers you are thieves and I’m going to take other measures if I don’t get my sneakers back within a week you’re very quick to send stuff when I purchase it and you don’t send the things that you have that of mine back","title":"You take my stuff you take all of it…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Josie","text":"As far as the site, shipping, and price; all was fine, but the item I received was not the size advertised therefore are to small on my feet, and I am returning. I would go ahead and get another product but they are charging me a restock fee so I think I am just going to take my money, and run. Gotta love paying for something that is not your size, and a return\/restock fee.","title":"Disappointed","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"customer","text":"If you are used to customer service\/care, presentation\/quality of your purchase from the original vendor, ordering from this sight is more than disappointing.  Perception is in the eye of selling you short.","title":"Perception:  low score on this sight","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Chris","text":"The watch we purchased was advertised as an automatic movement, and was described as having been thoroughly inspected and reviewed.  When we received the watch it was a quartz movement, not an automatic.  When customer service was contacted, their (very quickly suggested, almost as if to hurry up and fix - or minimize - the problem without actually fixing the problem) solution was to send the watch back right away for a full refund.  The experience all around was not great, and it causes concern about larger purchases and whether items (especially watches, with intricacies and complications) are REAL at all.","title":"Watches may not be inspected as-advertised.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"customer","text":"The concierge service picked up my items on Feb 28th. Several of my accepted items were finally listed last week, and multiple items are still not active (it is now April 11th)! The whole process has been inefficient—and no explanation or communication from the RealReal. The website currently says turnaround time is 2-3 weeks—definitely not my experience!","title":"Long delays","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"LBM","text":"Waiting for a return label to be emailed to me, I reached back out to say I had not received it and have not heard from customer service or received the label.","title":"Difficult to return items","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"customer","text":"Terrible. Bag was listed in “excellent” condition it was totally trashed. Customer service did however make it right and refund my money. But won’t shop again.","title":"Terrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"customer","text":"The dress in the photo is wrong. They put the dress backwards, so the front of the dress should be on the back, and the back of the dress should be the front. Disappointed.","title":"The dress in the photo is wrong","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"customer","text":"Hit or miss. I’ve gotten not authentic items and sees 6 when ordered a 0","title":"Hit or miss","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Annie","text":"This was my first experience with The RealReal.  I don't think I'll do it again. From poor customer service, multiple items sent that were the wrong size, an obscure return policy on what's final sale (even if it's damaged or the wrong size), and a less than stellar tech experience with returns, it just isn't worth the hassle and the time I spent trying to get help sorting out problems. And you'll pay $12-13 for shipping, both to receive and to return. Beware that you won't get great help if you have a problem, it will be slow and you'll have to just \"stand by\" until they finally respond, and you might get stuck with items you can't return and nobody around to help you if the return is not your responsibility (e.g. the wrong size shipped in the first place). I'm going to shop and support local consignment instead.","title":"Not the best experience","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Koko","text":"Ordered a sneaker that was advertised on the website as a woman’s 7.5 only for them to be delivered and they were actually a 7.5 in MEN!  I will say, they were in great condition which added to the “let-down” because I wanted them so bad and wished they were my size. \n Disappointed. Returned. Annoyed.","title":"Disappointed. Returned. Annoyed.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"customer","text":"Tried to return items but one came without a tag so I contacted customer service 5 times through texting each time getting ignored was impossible to find number to call you","title":"Tried to return items but one came…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"customer","text":"Totally not enough pictures to show the details of your products. If there are small defects, you should show them in the pictures and some people will be okay with them, instead of getting surprised.","title":"Not enough pictures","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/therealreal.com?page=35&stars=1&stars=2&stars=3"}]