[{"date":"2017-02-19","author":"Maria","text":"I have bought several items from this site and I was very happy with my purchases. I had a problem with a transaction once and I contacted customer service but they replied 1+ week later and I had to find a way to work it out myself besides the fact that they keep a percentage of the transaction for their services. Still, I will keep on using it because I can find many items in very good prices, I wouldn't recommend it for expensive items, but as long as buy only cheap stuff,  in case something goes wrong you won't lose much.","title":"Bad customer service, but good idea","stars":3,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=14&stars=1&stars=2&stars=3"},{"date":"2017-09-23","author":"Amanda Watt","text":"TERRIBLE TERRIBLE COMPANY. A seller sent me a pair of shoes size 9 when I purchased a size 6. I wanted a simple straightforward refund as I didn't get the item I had purchased and Vinteds customer service WOULD NOT offer any refund, although their policy clearly states that refunds are offerered in my situation. I disputed it on PayPal and eventually received a full refund via PayPal. Then... VINTED BLOCKED MY ACCOUNT for opening a PayPal dispute. AVOID VINTED!","title":"TERRIBLE TERRIBLE COMPANY","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=14&stars=1&stars=2&stars=3"},{"date":"2017-10-08","author":"Kathrin Leist","text":"Attention !!! SOME HACKER KEEPS ON CHANGING MY IBAN, so 3 times the money went on an account that I dont know. I CHANGED IT and one day later it was again the FRAUD HACKED IBAN. I LOST 100 EURO like that, AND THERE IS NO EMAIL I CAN WRITE TO VINTED. I WROTE ON THE FACEBOOK OF VINTED.FR NOTHING NO ANWER. THIS IS CRIMINAL!!!!","title":"Attention !!","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=14&stars=1&stars=2&stars=3"},{"date":"2018-01-28","author":"Gwen Branton","text":"Awful. No reply from seller after payment. Item never received so cancelled for refund. I won't ever us this awful site again. App deleted.","title":"Don't waste your time and money","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=14&stars=1&stars=2&stars=3"},{"date":"2018-02-14","author":"Janis Robson","text":"if i could i wouldn't have left one star\nso vinted is a safe way to sell unwanted items \nsince selling a pair of boots i am still waiting for payment , am now being ignored by the buyer and there is no way to contact vinted, but the link they gave me to contact them doesnt work and there is no telephone number \n  it seems to me a way for sellers to get ripped off with no way to complain \nwhat reputable company doesnt have a phone number or even an email address \nNEVER EVER AGAIN\ni suppose i am just expected to wave Goodbye to an expensive pair of boots \nbut as they say you live and learn","title":"What reputable company has no way of contact ?","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=14&stars=1&stars=2&stars=3"},{"date":"2018-09-03","author":"Kourtney ","text":"I couldn’t access my account earlier on . Finally i got into my account but all my information is gone like my bank info  and address. Can’t see the items I bought this week  and ive paid for these items  .   So if my items come for delivery  I can’t hit pay on Vinted because I can’t see them .  There no customer care or help . Very disappointed and very annoyed .  I feel like Vinted  isn’t keeping information safe .   Do use Vinted 😤😭😡🤬","title":"I couldn’t access my account earlier on…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=14&stars=1&stars=2&stars=3"},{"date":"2018-11-16","author":"Yann","text":"Hard experience being cheated by an unethical & unfair buyer.\nUnfortunately no support from Vinted team which is really tough is this case!\nDo Vinted really care ?","title":"Hard experience being cheated by an…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=14&stars=1&stars=2&stars=3"},{"date":"2018-11-22","author":"JC","text":"Awful. Buyer wont confirm receipt despite it being signed for. Money has been pending for days but can’t pay it out. Desperate for the money but no response from them or buyer. They say the money is mine? Ok why can’t I have it then? They say it drops into your account after 2 days??? Lies","title":"Awful Thieves and Liars","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=14&stars=1&stars=2&stars=3"},{"date":"2018-11-26","author":"JK","text":"Terrible customer service - please avoid. I made 2 purchases on Vinted and had problems with modifying the shipping address. The sellers I dealt with were great but unfortunately we had to rely on Vinted who never read the messages properly and never helped. On one hand, I contacted them about editing the address and after weeks of back & forth, they asked me to contact the seller despite my telling them that we've been in contact from the start - same from the seller side. It's now been over 1 mo without any progress from Vinted and so I raised a dispute with Visa. Vinted messaged to say disputes outside of Vinted aren't allowed and I needed to cancel this within 48 hours or be blocked. I cancelled this with visa within 24 hours and was still blocked. The message says that I did not reply (and yet the reply button on that chat was disabled and the email address is 'no reply'). Please avoid!!!","title":"Disputes filed with your bank = blocked","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=14&stars=1&stars=2&stars=3"},{"date":"2018-12-22","author":"Simran","text":"No! You did not block this account because of multiple accounts so why the hell are you lying! All my items are genuine the only reason why I made anoth r was because you !! Blocked me for selling genuine items they are all real kylie stuff not fake I even showed proof so unblock this account now you wrongly blocked this account so unblock me right now or I will take this matter further for deleting customers accounts for no bloody reason so reply to this message cause that’s why I had to make a new one in the first place!\nblocked me for s loving genuine items and now won’t reply","title":"Very bad would give zero stars","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=14&stars=1&stars=2&stars=3"},{"date":"2019-02-03","author":"Kerri Muzz","text":"Absolutely do not use Vinted. It's an amateur show. Not user friendly. Not trustworthy. Terrible customer service. You won't sell anything for a fair price because the buyers on it are looking for cheap deals. AVOID!","title":"Absolutely do not use Vinted","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=14&stars=1&stars=2&stars=3"},{"date":"2019-02-09","author":"Chloe","text":"too many scammers. \n\nthe app has some sort of deal with hermes (a delivery service where most packages actually go missing). \n\n4 items i sold have gone missing with hermes so vinted gave the buyer a refund so now i don't have the items OR the money. \n\nwould give 0* if i could, won't even get into how SHOCKING customer service is. there is no seller protection in the slightest.","title":"too many scammers","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=14&stars=1&stars=2&stars=3"},{"date":"2019-03-27","author":"Sandy Barton","text":"I have been scammed on vinted & their support team have sent me a message to say if I don't respond in 48 hours, they will refund my buyer, but I need to contact her to arrange to post my bag back! But they have blocked my account so I can't reply to the buyer or themselves! My bag is a genuine Gucci bag from 2003, the buyer received & said it was a fake adding photos to prove it, the photos were clearly not of my actual bag, but another bag (mine has red & green Gucci straps on the photographed bag was all black with brown edges!). I informed vinted of this & in their responses they never addressed this, despite photos of my bag still being available on their website. On checking the buyers reviews she has cancelled 21 previous sales! I know now she has stolen my bag by scamming me (& 21 others), she said she would post it back & hasn't, I'm going to see if trading standards can help me. DO NOT USE VINTED, you will have a few lovely buyers, but you will be scammed on expensive items & vinted allow it, their response positively encourages the buyer to repeatedly steal items with no recourse for the seller. Will report to any regulator I can find that covers this.","title":"DO NOT USE, Your items will be stolen!","stars":1,"location":"IN","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=14&stars=1&stars=2&stars=3"},{"date":"2019-04-09","author":"Eric Depierre","text":"Avoid at all cost !!! Do yourself this favor.\n\nI've been scammed by Vinted. \nI bought a Ralph Lauren shirt with Vinted, and I received a really bad quality fake shirt. Vinted tells me it's not their responsibility...\n\nAVOID THIS APP","title":"Avoid at all cost !!","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=14&stars=1&stars=2&stars=3"}]