[{"date":"2022-02-17","author":"Michelle Donnell","text":"Does not even warrant one star what a joke,  bump sales to take your money so your gear is not even worth selling!  Absolute rubbish!  Don’t use this website to sell your items\/goods 😠","title":"Does not even warrant one star what a…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"West","text":"It's OK of you are a seller, go for it! If you are a buyer then it's a different story , you don't have much protection, on ten sellers you lucky to find 5 good ones. it's worthwhile taking the risk! Make life easy for your self ,be out of troubles.most of the clothes I  have purchased had bad perfumes embedded in them  some with small stains ,you are unable to prove your claim  even you photo will not show then ,and if only the seller will accept  the return   you need to pay a much bigger postal charges to return  them .\n If the seller will  not  accept the return ,then  you have been scammed. Vinted will not give your money back","title":"It's OK of you are a seller","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"Faten Aly","text":"I have a very bad experience from the. Company , -I ordered an item stating the item was a very good condition but unfortunately it was not but in a very bad condition  . I was surprised to ask me return the item and pay the postage in full without any loss for the seller who was dishonest .when I read their terms I found this silly point they did not take any responsibility for the returning item that encourage many sellers to deceive others . I do not recommend any people to buy from them .","title":"I d not recommend buying from this site.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"Suzanne","text":"Wish I had checked this site out before ordering. It has virtually no buyer protection and the buyer is required to pay return postage even in cases where goods are not as described. I strongly advise avoiding this site.","title":"Wish I had checked this site out before…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"SauleSaule","text":"Excellent platform for scamers. Learned my lesson.Sold my coat, packed perfectly in hard box. Buyer only after week of receiving item indicated arrival on  app with refund request. Item was trashed. Nothing like it was send. Customer Service is absolutely useless. Non of my evidence, prove of delivery date or pictures how item looked before didn't help. Rules or term and conditions,policy that buyer should follow ignored to. Item was returned like a trash.  And yes I found lady on social media dressed up in my (horrible condition ,that  even didn't fitt her as she described for a return reason) coat. She trashed item for a week and returned just like that.  Because Vinted allowed. Covered in all kind of hair, oversprayed with parfume and just not even fit to give to charity. But I believe in karma.","title":"Excellent platform for scamers","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-02-26","author":"kiki","text":"Vinted totally sucks, they are charging you for buyer protection and then they don't provide any!!! First they sold me a fake bag, which seem legit, but they I wanted to resell it and they told me it's fake you can't!!! They were totally  ok to sold me this in first place.. second time I wanted to give it a chance and they wrote I have received smt that was still on the way to me and they said it happens and I should confirm delivered and then complain, that it was not delivered yet!!! Of course if you complain it's not delivered, while you click it was, you have problem  too!!! Isn't it wonderful?!!!","title":"Vinted totally sucks","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"Lissette","text":"I ordered a 8eu ZARA second-hand dress. Despite the fact that I was the recieer not the seller, it was remarked by Vinted that I had to chase the missundersdtanding with SEUR deliver which stole my order and always refer to \"El paquete ya fue entregado\" according to their systems. I never recieved any code to pick up my package at the delivery point. I called more than 8 times to SEUR put a file case never recievied an call back or update. AT the end package was returned to the warehouse and I ask the person who sold it that she should fix it and since she recieved the money she did nothing. I will never use this again.","title":"I was stolen a 8eu ZARA second-hand dress!!","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"Kc","text":"Purchased a bag for £380. Received it. It was in an appalling condition. Tried to get vinted to accept the return but vinted refused. They took £20 in 'buyer protection' fees but did not 'protect me. Absolutely useless.","title":"No buyer protection for me, despite £20 buyer protection fee","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"Seán McDaid","text":"I have sold a number of items, the value being over £200. I didn’t know that my bank account had been closed. Vinted Advised to set up a new account and they would redirect the money.\nThis has not happened. They asked for bank statements from both accounts, I did this, they then asked for a copy of my passport, I gave them a copy. Then they asked me to get verified, I did this. They then asked for details of the items sold, I went to my account where I discovered they had deleted a number of items. I had back ups.\nThen they asked for bank statements again, back to the beginning! \nI asked why they could not identify the non payments from their accounting system, should be quite easy? No response.\nWhat can I do?","title":"They will not give me my money!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-03-06","author":"vanessa perroncel","text":"Does not even deserve one star, legal action should be taken against them, who makes the decision on the other side of that computer???? I bought a Nintendo switch with 4 extra games and a labo, box was supposed to be quite substantial because of all I bought, but instead I received a tiny plastic envelope!!! Sent photo proof to vinted and their reply was let’s wait for the package to be shipped back to seller?!?!?! What package? I’m shocked, especially as after buying I started having suspicions and in digging I had found the same photos used multiple times under different ads and still they keep telling you to wait, even though you pay for buyers protection there is none!!! I’m starting to think vinted are the scammers holding on to our money like that on their accounts for weeks \nTHEY SHOULD BE CLOSED DOWN","title":"Does not even deserve one star","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"Angry","text":"Awful site! Only gives buyers free shipping options which require a printer. I ended up having to fork out myself to send my item by Royal Mail as didn’t want to mess the sender round after we tried Hermes & In Post. Vinted have given me 1 star review and accused me of not sending the item and cancelled my order? So I’ve now lost a brand new £40 dress that I was only selling for £12.50 anyway and I won’t get my money as Vinted have accused me of not sending it. Just use eBay ! Much better even with the fees","title":"Awful site","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"Jill Saward","text":"Gave this mob a try just recently , I was fooled by the TV advertising, don't touch them, the whole system is a fraudulent mess! No seller protection or help. \nI have emailed a lot to see why I have not been paid, the buyer has paid and received the goods yet I have nothing. Theft? No customer response, just bots, back to eBay for me:( No stars","title":"Don't let the adverts tempt you, this is an awful company","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Helen P","text":"The pits. I ordered two items from a seller which turned out to be counterfeit. Despite paying insurance fee when buying Vinted were not interested and continued to let this seller continue despite the fact I wasn't the only person that had been sold counterfeit goods. Vinted don't give a damn. I'm going to report them but doubt I'll get anywhere. Iost £90. Dont chance this website bunch of cowboys supporting cowboy sellers","title":"The pits","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Justine Trim","text":"I'm not a member of vinted but randomly my credit card was used on their website. Luckily my bank noticed and contacted me to ask if it was my purchase. Card cancelled immediately and payment refused. I then get some hideous bodysuit through the post three days later. Where the hell did they get my details from?, and who sent me this disgusting garment. Clearly little or no security so open for abuse.","title":"Avoid. Not a safe website.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Raffaella Romagno","text":"My account has been blocked for violating the rules, as some items are counterfeit.  It is absolutely false because I have all the certificates that can prove the authenticity of the products.  There are so many people who scam every day and it is not right that the profile of an honest person be blocked.","title":"My account has been blocked for…","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"Lisa","text":"I was really enjoying buying on Vinted so decided to use it when clearing out my house. Listed a lot of old and new things just make a little bit of money back from things I had that weren’t going to get used. Main thing I enjoyed about Vinted was that buyers are responsible for selecting and paying for their own shipping, all I had to do was print and post which took a lot of the hassle out of selling things and made more worthwhile. \n\nLast week a seller had messaged me to say an item she bought hadn’t arrived. As the 2 days were almost up for me to get the money transferred, I messaged customer service and asked them to hold the payment until I was able to resolve the issue for the buyer. I then messaged the buyer to inform them that I had requested for payment to be held. Next morning I wake up to a message from Vinted stating that it had been brought to their attention that I was using my profile for ‘commercial activity’ and to ‘generate a steady income’ and that my account\/IP address had been permanently blocked. I had been selling on Vinted for 6 months and made £100 max. Definitely not a steady income nor indicating any commercial activity or ‘monetary gain’ - which is another no-no on Vinted apparently. \n\nTheir guidelines states that users will be given a warning and they will seek to provide support before blocking users. This was not the experience that I had, my account was fully blocked and no warning given and no way to dispute their claims as apparently once you’ve been blocked, you cannot be unblocked. \n\nOverall, a really disappointing experience from such a huge platform who are pushing their advertising to get people to join but then placing a permanent ban so easily. Especially when there are many, many profiles on there which are actively and obviously using the site for commercial gain and face no consequences.","title":"Blocked without warning, unable to dispute","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Jennifer Blake","text":"Absolutely pants! The worse place to sell your items. Items are always being removed for no good reason at all. And terrible non-existence customer service!! Doesn’t make any sense at all. Bunch of wined up merchants. Useless. I’ll stick with eBay thanks.","title":"Don’t Waste Your Time Selling On There","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"Joanie Byrom","text":"Do not use vinted . The buyer protection is worthless. I paid for a item the parcel was damaged not able to send . I don’t get compensation so what is buyer protection. When you do complain there nothing they can do . It a joke do not use them\nDO NOT USE VINTED","title":"The buyer protection is worthless","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"R Stevenson","text":"They block your account without giving a reason at all, their customer service is shambolic - you can only talk in app, no phone number, no email, no social media presence; heck their last FB post was over a year ago. They've been investigated for European data breaches, they barely give a damn if you're package is late \/ lost (I was chasing for answers for 2 weeks for items that were lost; citing chasing Hermes, I doubt it). Just read people's comments on Facebook to find out how and why Vinted are vandals.","title":"They block your account without a reason","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"Scammed","text":"Totally scammed by a seller on a pair of Dior sunglasses. Vinted backed the seller and will not offer a refund. DO NOT BUY FROM THIS SCAMMERS PARADISE.","title":"Totally scammed by a seller on a pair…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=2&stars=1&stars=2&stars=3"}]