[{"date":"2021-10-04","author":"Joanne O'Brien","text":"No option to leave zero stars . I have bought a lot on vinted without problems but last week I have bought two items listed as age 14 - two different sellers- when I received them they were only aged 12 - I was refunded but I have to return both tops to the sellers- by tracked post - I will end up about 12 pounds out of pocket for two items I didn't want. There is no customer services - just seems a never ending round of automated messages. I will probably not bother buying again - will go back to ebay - least I felt I had some backup as a buyer.","title":"No option to leave zero stars","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-07","author":"Alexa Traylor","text":"Too much faffing around getting the payment received to you. Easier on e bay much easier","title":"Too much faffing around getting the…","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-08","author":"NM","text":"My first purchase - live and learn! The payment was instantly taken out of my account but then I was told that there was a problem their end with the payment. Just checked my bank account and they have taken the money twice and yet no order accepted! I now have to wait for them to ‘refund’ the money or dispute the payments. Have to wait five working days! Not holding out much hope! Wish I hadn’t bothered!","title":"My first purchase! Never again!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-08","author":"Nina M Moniz","text":"Very poor app. I would not recommend anyone to use it. Very bad experience with this app.","title":"Very poor app","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-10","author":"kyle swayze","text":"Vinted canceled my sale after I confirmed that I had sent the item and the buyer had received the item,they then refunded the buyer.I now have to run after the buyer to get paid. This was not the first time this happened with Vinted.","title":"Vinted canceled my sale after I…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-12","author":"TheRev","text":"AVOID AVOID CON Vinted customer service is so bad it puts others with 0 rating to shame , if you don't mind getting ripped off and filling the pockets of the vinted staff then go for it. Personally all the ads on tv and the hype must be some sort of scam or fraud , for something else, cause its the worst service I have ever had the miss fortune to use.","title":"AVOID AVOID CON Vinted customer service…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-13","author":"Malcolm “Bucky Ranks” Richards","text":"Vinted. I sent a parcel, it disappeared I been waiting for my payment for 9 days. Plus they told me I might get £20 Nov. 3rd, even though my leather jacket is selling for £30.","title":"Vinted","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-17","author":"ambie","text":"Terrible company. I sent a referral link and they never credited the voucher to me. I questioned it and they accused me of having 2 accounts. I proved evidence that this wasn’t the case but they just said tough luck. Very fraudulent so won’t be recommending them to anyone else, in fact will be telling people to avoid them","title":"Fraudulent company, beware","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-18","author":"Lisa M","text":"Really poor. They set out postage prices but you end up having to pay more, I had to pay twice for one item and they refused to refund it! DO NOT USE..","title":"Really poor","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-20","author":"Peggie - your Benefits Platfor","text":"I recently sold a pair of Valentino trainers, the buyer claimed they weren't authentic and opened a case for a refund, Vinted asked me for proof of purchase, either\/and pictures of the trainers that weren’t included on the original listing as evidence of authenticity. I didn’t have proof of purchase as they were purchased by an ex partner and I didn’t have extra photos (because why would I?!) so they ruled the trainers not authentic, they refunded the buyer which I found extremely frustrating but I had the intention of getting the trainers officially authenticated and I would resell them. However, Vinted  advised the buyer they didn’t need to return the trainers! Which is absolutely appalling, the authenticity checks were so meagre, based purely on the buyers feedback! I have tried and tried to raise this with their customer care and legal team and have offered to pay for them to have the trainers returned and for them to perform a proper authenticity inspection and have been completely ignored. The trainers was originally £565 and the buyer got to keep these for free simply by saying they weren’t authentic.","title":"High risk for selling designer goods","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-21","author":"Amanda Avery","text":"Absolute scammers. No support for users. Ebay is still the better option - and stuff sells much faster on Ebay too.","title":"Absolute scammers","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-24","author":"Gabby Konieczna","text":"Sold 1 thing bought 1 thing. Money came quickly ect. Put couple of things myself but it has been 12 months and I haven't sold even 1.","title":"Sold 1 thing bought 1 thing","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-24","author":"ElenPap","text":"As per previous reviews, I “sold” a pair of expensive Russel&Bromley shoes that were in great condition  (unworn). The buyer raised a dispute claiming that the item did not meet its description and the size was not displayed on the item. That was not true, as the item was sent in its original box with the size clearly written on the box and in the inner part of the shoes. Vinted asked me to prove it which was impossible as the item was with the buyer who finally kept the pair of shoes for free after deliberately lying.I felt I was scammed and I was unable to do anything about it...","title":"Avoid!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-25","author":"Liliana Miceli","text":"Ti \"puniscono\" se per errore posti 2 volte la stessa foto 🤮🤮🤮🤮🤮🤮😰","title":"Ti \"puniscono\" se per errore posti 2…","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-27","author":"chloe","text":"I have £138 in vinted wallet \nThey asked me to verify my ID \nI do not have a passport and they’ve said nothing they can do ? I’ve offered letters \/ online checks birth certificates but they said no !! They won’t let me withdraw my money for the items I’ve sold !!! \nAbsolutely disgusting company \nRobbed me of £140 !!!","title":"I have £138 in vinted wallet","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-28","author":"Tieto Mallamo","text":"Worst costumer care ever possible\n\nOnce a package comes back to you, you have to hope they find you the one time they come to you, then I asked Ups where it was and they told me to ask Vinted, I asked Vinted and they told me they \"opened an investigation\" THAT LASTED 3 MONTHS, after that, they told me it was at the warehouse outside my city as an unclaimed package, because after that time it automatically turns into this status. Now, I know where the package is but I can't retrieve it, because you can't claim it for delivery. And of course, Vinted doesn't give a damn that they wasted 3 months on me and the package is now unrecoverable.","title":"Worst costumer care ever possible","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-29","author":"Tammie Whitney","text":"I sold items on vinted fast thought it was fantastic until I wanted to withdraw my money from vinted and had problems with verification.","title":"Vinted kept all of my money","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-29","author":"HeavenIsHome","text":"Vinted have blocked my account over 10 times, each time have been for over 3 days and each time they have unblocked it and apologised. Most times were due to selling AUTHENTIC designer items. And I have provided a proof of certificate with the listing. \n\nThere customer service team send undermining messages that are automated and robotic and never look into the item to see if its authentic. \n\nAfter they unblock my account they dint wipe away the strikes that they place against my account\n\nMeaning that every time there robots block my account it is automatically permanently blocked.\n\nThen the vinted customer service team refuse to look into my authentic item responding with automated responses and saying that they can't help me.\n\nEven though I send proof of authenticity and certificates of authenticity \n\nTo top it off, they keep me waiting days on end until someone stumbles along the claim and unblocks my account \n\nI am very happy to take legal action against vinted at this point. \n\nThey damage my selling reputation everytime they block my account \n\nThey restrict everything that helps a sale to run successfully, I cannot contact vinted about issues with confirmation of orders. Or reservation ends.\n\nBecuase of the restrictions placed on my account I also cannot track my items goint or coming. I cannot see my orders that are pending.\n\nThis is the worst customer service I have experiance on over 10 occasions. \n\nAnd I have proof of every occasion that they have ignored me and blocked my account for no reason and they won't get away with it.\n\nI have never been so upset with an app. And I type this review with true honesty \n\nIf they fix these issues, get a completley new set of employees. Invest in a telephone then it would be a decent app.\n\nBut instead they hide behind a chat so they can't confront issues head on.\n\nIt's terrible","title":"Do not use, taking legal action","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-10-31","author":"Sylvia","text":"Giving this a 1 star because the italian ad is so bad. Too loud. Too hyped. Too much. Too many vinted ads. The woman with the voice sounds so annoying and her face… don’t even start there… her face just pisses me off. Sounds with her annoying voice can duck off. Very bad very very. Oh and I’m not downloading that trash app if your ad is super bad","title":"Giving this a 1 star because the…","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"},{"date":"2021-11-02","author":"Maureen Walker","text":"Rip off its crooked don't use it.","title":"Rip off its crooked don't use it.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=5&stars=1&stars=2&stars=3"}]