[{"date":"2022-01-04","author":"Matto Project","text":"Parcel lost, no help from the customer service. I had to deal directly with the transporter myself ( over one month of insisting, lot of time wasted ) yet the creation of the shipping label is completely in the hands of Vinted ( you can't chose what level of insurance you want for your item ). The package was declared lost by the transporter. I was refunded (by the transporter) only 1\/7 of the real cost of the item sold as this was the declared value. No help or compensation from Vinted at all so far.","title":"Parcel lost, no help, no refund","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-01-11","author":"Anisha","text":"f I could I would give zero stars.\n\nI ordered an item in November. A month later its shows as stuck in transit \/ on the way and so on. All of this time I have had conversations and updates from the seller without any issues.\n\nThen randomly Vinted updates the item as delivered and released money to the seller. The tracking still showed the item as in transit. I was not notified its delivered - as far as I knew, I still had to wait for the item to be delivered to the shop for collection. I kept waiting. When I contacted the seller, as expected, no response even after a week although till she received the money I exchanged updates everyday.\n\nI then contacted Vinted. Vinted realised they had messed up but would not back down. They claimed item was delivered on the 13th although could not provide any evidence or proof. I sent screenshots on tracking which till 18th shows as in transit. They didn't say anything to address this. From what I see online now, this appears to be a common scam from Vinted. They mess up and then ask buyer to deal directly with the seller although they very well know seller won't bother to respond. I am not giving up, if only for the principle of it. I am happy to go through all legal routes so Vinted can once and for all stop this organised scam. I have all the proof and evidence I need for a legal case so happy to take this forward.\n\nMy tips for others - I have learnt my lesson, will not be buying from Vinted anymore.","title":"Organised scam run by Vinted","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-01-11","author":"Jonathan Hawes","text":"I bought a shirt on Vinted thinking it was a mens medium. It turned out to be womens medium and was far too small for me. The buttons fastened from the opposite side too. This was not mentioned in the product description. I contacted the seller to arrange a return and they fobbed me off and were not interested. It went to a Vinted decision and they ruled in favour of the seller. Im £25 out of pocket. This is very unfair and I will never use Vinted again. The arrogance of the staff as I pleaded for a reversal in their decision is abhorrent.  I also had past experiences of buying stuff that was already sold and Vinted users who never send the stuff. Stick to Ebay in which you get better customer service and consumer protection. Do not use the Vinted app.","title":"Extremely poor customer care.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-01-13","author":"Sand","text":"Not even worth one star.\nOk if everything is ok but if you receive something broken like I have, the seller gets the money and I get something that’s for the bin. Tried to get a refund but they finalised the sale, cheers vinted thanks a lot.\nBeware and don’t buy anything expensive !!!","title":"Not even worth one star.","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-01-14","author":"Customer","text":"A great platform for scammers so be warned! Atrocious customer service. It seems as the seller you have no rights if the person lies about the item you send. It seems the buyer gets a refund and can keep the item whilst the seller gets nothing. Great platform if you want to scam people out of money and items. Truly recommend for this purpose only!","title":"A great platform for scammers so be…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-01-15","author":"Miss M","text":"Avoid Vinted like the plague! And tell others to do so too!\n\nAbsolutely terrible, I wish I could leave minus stars.\n\nI will never sell or buy from Vinted again, and I will continually dissuade the use of this app to everyone I know. This app facilitates scam buyers. As a seller you are not protected here, I recommend eBay, Amazon or Depop, NOT Vinted. \n\nI sold a bundle of 2 books, upon their arrival to the buyer she claims I only sent her one book. I know this is not true. I am meticulous with my checks and I no longer have the “missing” book in my possession. I asked for proof that she only received one, she sends me a picture of the package which has clearly been opened, had a book removed, and then resealed with tape to look like there’s one missing. In the photo the package is covered in a tonne of tape and it has clear rough edges that have been hacked at with scissors, I know I didn’t send it in this condition because I use bags with sticky tabs! I don’t use tape to seal the bag, only to attach the label. It is painfully clear that the package has been tampered with by the buyer. The buyer of course is unresponsive to my messages, and will not reach an agreement with me (because she wants to scam me). I then have to involve Vinted support and unsurprisingly, they rule in the buyers favour, now she has 2 of my books and her money back as well! Vinted told me that because I didn’t use a cardboard box to send 2 small paper back books, they’re not liable! Their guidance does not state the use of cardboard boxes is mandatory, only ideal. Also, would this have ended differently if I used a cardboard box? Probably not! I’d still be out of pocket. \n\nIt’s absolutely disgusting that this has been allowed. I accept that she has scammed me out of one book, but on top of this, the buyer did still send photographic evidence of having one of the books in her possession. So, I point this out to Vinted and they tell me once again that because I didn’t use a cardboard box they won’t do anything, and they also closed the case not allowing me to reply! What?! Where is the money for this book the buyer has shown she’s received? Vinted has facilitated a scammer to steal from me. In fact, handy tip incoming: I’ve learned that if you want something for free off of Vinted, just pretend it didn’t come! Tamper with the packaging and it’s all yours, and so is your money! \n\nThank goodness these books weren’t worth too much. I’m sure this happens constantly to other sellers with much more expensive items, and I feel awful for those sellers who have faced what I did and the horrendously insulting Vinted support. \n\nSo, thanks Vinted, I am now two books down and I have nothing to show for it!\n\nIf you want to lose your items and your money, Vinted is the place for you!","title":"Avoid Vinted like the plague.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-01-23","author":"Charles-Louis Orsini Photograp","text":"L’application refuse ma piece d’identité et bloqué mes avoirs. Aucun service Sav ou passez par un avocat.\nSeule réponse, toujours le même message automatique qui ne règle rien.","title":"L’application refuse ma piece…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-01-25","author":"louise","text":"Not as easy as adverts make out. Buyers want reduced prices all time. What’s point in 51 people favouring your item if not buying. And if you have covid & can’t post items but ok with the buyer to post when can get to post office as I chose to do this way, they say times up. Who needs 4 quid for god sake. Don’t recommend. Give items to charity or sell to Eastern European shops","title":"Not as easy as adverts make out","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-01-26","author":"pauline","text":"Absolutely disgusting DO NOT USE  VINTED THEY ARE THIFTS, they have robbed lots off times and not given me my money,there are many scammers on vinted who buy the item then say it's not original to get there my Ney back and keep the item,i have had many people do this to vinted them ask for proof off purchase which I have provided the receipts for the items i sold but still they did not give me my money instead they gave the buyer a a full refund and let them keep my items there policy says if someone reports it's not original you a a seller are required to proof it is..they are absolutely conning poeple and even if you show proof they still do not give you anything,this company is disgusting and i will be be reporting them to everything i can,how can they keep getting away with this time and time again.","title":"Absolutely disgusting DO NOT USE …","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-01-28","author":"Daina Kasnikovskiene","text":"Hey, I am a buyer who paid for a backpack a month ago. Then after a few days I got an email informing that the purchase is on its way, just waiting for a delivery company to update its info. And nothing since then. I suspect that maybe I fell a victim of a scam website with a visually similar domain and layout called vintd.fr, instead of vinted.com. Maybe some of you made the same mistake as well. By the way, for a couple weeks I could \"track\" my purchase by a given tracking number, but now a link doesn't work. I emailed to given address contact(at)vintd.fr, but  sending failed. Please be very careful with scam e-shops.","title":"Beware of Scam","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-01-31","author":"Mandy Cole","text":"If there was a ZERO rate I would have used it. POOR POOR POOR!!!!\nDon't use","title":"If there was a ZERO rate I would have…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"Sasha Temple","text":"AN ABSOLUTE DISGRACE! DEFRAUDED ME OUT OF 900EUROS!!!\nA very long story short, I bought a Loius Vuitton bag on Vinted which arrived 24\/01\/22, it was a beautiful bag, but it wasnt really practical for me, so put the same bag on Vinted for sale on the 01\/02\/22. Vinted then deleted my advert because the bag was not authentic!!! When I asked them to refund my 900Euros for the fake bag I was sold the week before on their site. They refused!!!!\n\n1st they said we try to ensure we adhere to the laws regrding counterfeit goods, but we didnt notice this one on time, many apologies for the inconvenience. \n\nThen when I said, this is an absolute disgrace, you cannot allow a buyer to pay 900Euros for a fake bag and a week later refuse to offer a refund, afterall you pay buyer protection when you make the purchase. Total silence, I have been ghosted by Vinted customer services. \n\nI was completely unaware that it was not authentic, it came in the box, with the dust bag, code inside, absolutely identical to the one on the Louis Vuitton website.","title":"AN ABSOLUTE DISGRACE DEFRAUDED OUT OF 900EUROS","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"Mrs Helen Horton","text":"1 star is too good for this company.  I sold an item I dispatched it via buyers instructions to use Royal Mail, the website wouldn’t let me add the tracking info, therefore Vinted refunded the buyer who now has the item and I’m out of pocket re the item and postage.  I’ve been SCAMMED","title":"SCAMMED","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"dw","text":"If you are a buyer you’re ok.\nIf you are a scammer you’re ok.\nIf you are a legit seller they will perma-ban you for the life, they will ban your account, your phone number, your personal details, your IP, your location and your device. For what reason? They will not explain! Avoid this ****, please.","title":"This **** app just deserves a nice bad review","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"joann","text":"This platform is horrendous for seller protection.  It is a paradise for those who will scam people out of clothing and money, use at your peril.  Customer service did nothing to resolve my issue as a seller when a buyer purchased a bundle she claimed that the bundle was incomplete and then claimed the items were dirty.  Looking at the photographs it was evident that someone (not me) had actually stood on the clothes shoe prints were visible.  Vinted did nothing about it and issued the refund anyway, even though the bundle was incomplete upon return.","title":"This platform is horrendous for seller…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"J t","text":"Needs investigation \nTo many scammers using this platform \nAlso noticed people selling fake moncler and moschino so of you're into designer dont buy from here you're guaranteed to get scammed.\nToo many snides out their so if you're selling make sure you take a video of item being parcelled up also take indeph pictures of the item and I mean every part of the clothing you are selling people lie and say item is faulty \nYou have to be aware on these sites \nAnd that means being cautious yourself  \nIf I'm being g honest I wouldnt bother  selling on this platform \nReviews speak for its self","title":"Needs investigation","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"carol boreham","text":"Took my mobile account number bank account number still wouldn't pay me for the tops what sold scammers","title":"Took my mobile account number bank…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"Kelly Wilkins","text":"OUT OF POCKET AFTER BEING SCAMMED!\nAbsolutely shocking customer service and 'policies'. An item I ordered was DISGUSTING - covered in stains, holes and STANK. The image the seller used was straight from google (thanks reverse image search) and was listed as \"VERY GOOD\". You'd expect (especially when being forced to pay 'buyer protection fee') to get a full refund, however vinted maintain it is on the BUYER to cover return fees. So now I'm sending this manky product back, going out of my way to drop this thing off and pay postage, only for the scammer to have lost nothing. I wouldn't be suprised if the same item is listed again and someone else scammed. It makes 0 sense. Shocking, shocking company! Will be unimstalling and warning everyone I meet to AVOID!","title":"OUT OF POCKET AFTER BEING SCAMMED!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"Client","text":"vinted espionne mes messages\nvinted me tutoies\nc'est une bande de branquignoles","title":"vinted espionne mes messages","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"},{"date":"2022-02-16","author":"Kerry","text":"I just went to buy something off this app after seeing it on a tv advertisement, the jumper including p+p was £7.20 in total however when they went to take it from the bank… my bank warned me this could be fraud. I then looked a so many reviews 🙏🏼! Full of fraudsters I was warned.","title":"Full of Fraudsters I was warned","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=3&stars=1&stars=2&stars=3"}]