[{"date":"2019-11-26","author":"Steph Lauterstein","text":"Worst company ever - to avoid at any cost.\nI sold some expensive designer shoes on this app, unfortunately Vinted is forcing you to ship it throw their own partners - mainly Hermes.\nThe package was lost and the only compensation offer was £50 for a pair of shoes I was initially looking to sell £150 (agreed price was £90).\nSo on one hand, you do not have a choice and need to use the worst parcel company in the UK, and on the other hand, the compensation offered to the seller is ridiculous!\nWill never use them again!!!\nMuch better to use Shpock!","title":"Worst company ever - AVOID IT","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2019-11-28","author":"Veronica Frankie Mckenna","text":"Disgusting! Items were stolen from a parcel I sent a buyer, contacted Vinted. They then proceed to refund the buyer and not me, saying the items were stolen as items not packaged properly. They were packaged the same way as every other item I have sent and received, I was then sent packaging guidelines for Royal Mail to put me in my place. Which was no good as I sent with Hermes and broke no guidelines? The package is a large plastic postal package which is waterproof and had seal, which I then taped over to be extra secure! These packages are standard and there is nothing wrong with them, most customers use them  and it says nowhere they are substandard. I have had items stolen because the package was opened by someone, the did not fall out, the package is clearly ripped open and taped down again, but I am being blamed and not compensated? This company is a joke and their customer service appalling! Beware, I am not out of pocket and out of product!","title":"Disgusting","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2019-11-30","author":"Keezy Carter","text":"Worst site ever ! They cheat customers, shady practices, they steal money by not giving you boosters you paid for, and their customers service is crooked !","title":"Worst site ever","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2019-12-08","author":"Kuo June","text":"i didnt receive my parcel,i asked seller to help,\nbut seller said its delivered，i asked vinted.fr service to help，but vinted said ：“ask seller to help ” its so ridiculous。\nI don't know if seller wrote the correct address？She cannot provide evidence about parcel。 i didn't receive the parcel， and seller did not help me to contact the France post to find where is the parcel 。 i have no idea， france post said only seller can find where is the parcel，because i dont know sellers phone number and so on。 and she did not provide the information to me。 i waited a lot of time ，im very disappointed in this seller ，Very bad attitude，Irresponsible！！\n\ni asked paypal to help，then vinted blocked my account !\nvinted ,are you gangster？?\n\nplease refund money to me！","title":"i didnt receive my parcel, ! vinted blocked my account !!","stars":1,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2019-12-18","author":"Rosy","text":"THESE PEOPLE DELEIVERED MY PARCEL TO A LOCATION 20KM AWAY FROM THE ADRESS I SPECIFIED. THEY TOOK NO RESPONSIBILITY WHATSOEVER FOR THEIR MISTAKE. THAN THEY TOOK MY MONEY AND DID NOT REFUND EM TELLING ME I WAS LATE IN FOLLOWING UP. DIHONEST.","title":"THESE PEOPLE DELEIVERED MY PARCEL TO A…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2019-12-26","author":"Riana","text":"HORRIBLE CUSTOMER non service! computer generated emails with emojis that resolve nothing, back and forth, there is no buyer insurance even though you pay for it with each transaction. \n\nIt is too bad, because it is a good idea and some of the sellers on the france -belgium- holland- luxembourg site are super nice, i have bought some great things for awesome prices from people who really care about this world, write nice messages, put in extra gifts.\n\nBut there are some rotten eggs that ruin it with false info, half used when they say it is new, another sent to wrong relay far away, and one bad apple who left a bad taste in my mouth. \n\nso buyer beware, there is NO SAFETY net at all. they will never help you.","title":"HORRIBLE CUSTOMER non service","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2020-01-04","author":"hu derksen","text":"What a nice idea and what a bad site! The site freeze often, parcels are hard to receive, and contact with Vinted is almost impossible. I'm happy that TheNextCloset 'opened' their doors...","title":"What a nice idea and what a bad site","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2020-01-05","author":"Roza Salahshour","text":"I’ve have never met such an irresponsible reseller. They have lost parcels and tell me to go fetch on my own. Take 0 responsibility, but don’t hesitate to take ur money for undelivered parcels. I want my refunds.","title":"I’ve have never met such a...","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2020-01-12","author":"June Hourihan","text":"I have been buying and selling on Vinted for years. I’ve had some good experiences and some bad. I’ve always found the customer services horrendous but the buyers and sellers I’ve been really lucky with. I have a 100% positive feedback until today. I accidentally cancelled an order after the seller didn't post out after 4 days. I sent the seller a reminder but there was no response, so stupidly I thought it was a good idea to cancel the order, which most people would. Vinted offered me a refund, then gave me negative feedback. I have sent them numerous messages asking them to remove the feedback to no avail. I had one customer service adviser being sarcastic and recommending I go elsewhere. I couldn’t believe it 😳 Vinted has no loyalty or respect for excellent buyers and sellers. I have spent literally hundreds of pounds with them this week and am absolutely gobsmacked that they can treat good people like this. I would not recommend Vinted and the 1.4 star trust pilot feedback says it all.","title":"I have been buying and selling on…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2020-01-22","author":"Guerchanok Eliza","text":"Terrible service very unprofessional no staff to help, but pretend to know everything, I posted a pair of louboutin bough on vestiaire 100% authentic I own many of them,  uploaded every detail they asked me and they claim it's a counterfeit, lol!!! and treated me to close my account Oo!!! the funniest thing they did accept someone else pair of fakes with a bad signature of louboutin on insole an a white dustbag hahaha! there is no such thing!!!! Do your job correctly! I will never ever visit this dishonest untrustworthy website ever again, and would not recommend to anyone to sell or buy anything! this place is a big joke!","title":"Terrible service very unprofessional BIG NO!!!!","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2020-01-31","author":"Dahlia Lee","text":"All the time blocking the original clothing and stuff but THE REAL FAKES  that you can see from first sign they keeping. 🤦🏼‍♀️","title":"All the time blocking the original…","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2020-02-01","author":"LJB1974","text":"This is a con! I sold some items eventually and received some of the money into a holding account. Then apparently I posted something to an address one door down and the buyer never could get it!!!! Unbelievable! I asked for proof of the address message supplied through a message I But vinted are unable to provide this! So the buyer amazingly purchase a bundle of 5 items of high value and I get nothing! They can keep the money I’ve banked, otherwise you need to give this Lithuanian website your bank details.... ha ha I don’t think so!","title":"This is a con! Lithuanian criminals","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2020-02-25","author":"William McIntyre","text":"Vinted is weird.  The first thing you need to know is that they may or may not be in cahoots with the courier MONDIAL RELAY. It's very inexpensive but something is wrong here. Parcels going missing at an astronomically high rate (read around on here, facebook, and the vinted forums -- a search for 'colis perdu Mondial relay' will turn up hundreds of threads. And just look at their FAQ \"what to do if your parcel is lost is question #1 -- that speaks volumes). This is speculative, but Mondial relay may be stealing parcels systematically from vinted given that its always the high value parcels that go missing and never the small dollar or less interesting stuff. Just whatever you do DON'T USE Mondial relay for a high dollar or unique item bought on vinted. Use COLISSIMO which, despite the goofy name, is actually the OFFICIAL French post parcel division. In fact, use DHL or UPS because the French post is kind of screwed up too from what I hear, but nowhere near Mondial relay levels (10k bad reviews for Mondial relay on trustpilot, 1.6k for colissimo. Just go with the numbers here, not the rating, everybody is here to leave a bad review).\n\nThat being said, Vinted is the best app of its kind other than maybe eBay in terms of the variety, quality and low price of the items on it. A huge amount of dazzling designer steals straight from France, which is basically the secondhand designer capitol of the world -- and they don't use ebay, so its all here -- can be found here and I highly recommend that aspect of it. Just be extremely careful with shipment because MONDIAL RELAY is NOT TRUSTWORTHY WHATSOEVER. They lost a 300 euro one of a kind Balmain prototype meanwhile they delivered a pair of 20euro boots no problem and all the seller's other small dollar H&M jeans.","title":"Wonderful marketplace but WATCH OUT for Mondial relay","stars":2,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2020-06-01","author":"MC","text":"I used to like Vinted a lot but lately they keep deleting my listings claiming I made a copyright violation by stealing the pictures but in reality I TOOK ALL OF THEM!!! And I spent so much time taking the pictures so it’s very frustrating.","title":"Fake copyright violation","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2020-06-07","author":"Shruti Patel","text":"Very poor, fraud on account and vinted did not respond to me","title":"Very poor","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2020-06-11","author":"Florence Thom","text":"I like the concept. BUT if there is an issue, it is very difficult to get in touch with the Vinted help. The buyer must pay AGAIN the postage if PB with the item sent. And WE pay an insurance!! So What is for?","title":"Vinted..","stars":3,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2020-06-13","author":"Bianca Popovici","text":"I wonder when this application it will be closed? I received some fakes from Jacadi and the service client just transferred the money to the seller. This is the worst service client in the world","title":"I wonder when this application it will…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2020-06-21","author":"minki","text":"I sold my glasses and I have been waiting for my money for a month and a half !!!! they keep the money!! don't sell there !!! horrible scoundrels are...","title":"I sold my glasses and I have been…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2020-06-27","author":"Lu Wa","text":"Super principe, mais service client nullissime","title":"Service client deplorable","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"},{"date":"2020-07-02","author":"Anouk Denoyelle","text":"Terrible experience with the customer service. They don't even try to look for a solution with you...They don't ask question about the problem you have and stop answering after the first message they received. very disappointing","title":"Useless customer service","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=12&stars=1&stars=2&stars=3"}]