[{"date":"2022-03-27","author":"fuzz sLL","text":"they stole my 1.9k euro and said that i've done fraud lol when i didnt, im begging them for like 1 year to give me any proofs or any suspicious thing that i've done on my account so i can explain to them and they are ignoring me, acting dumb and etc lol, last thing for me to do will be to sue them to be honest, they are pushing me to sue them","title":"they stole my 1.9k euro and said that…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"Lotta Än","text":"I never got my 20 parcels which I ordered from Vinted.fr. They cost me over 170euros. Vinted said they could help, but in the same message it came out they can't help me. I never got any refund from Vinted.","title":"20 parcels lost, 170+€ no refund,","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Assad Saoud","text":"Account blocked with no justification. When I asked about it they closed the discussion\nClient support us dogmatic. They are not here to help but rather to tell you you should find solution on your own.\nAbsolutely no follow-up, issue explained multiple times and when they switch support agent they ask again the same stuff or ignore what was writen before....\n\n\nWe should sue them.\n\nWho is ok to create a petition for doing so?","title":"Account blocked with no justification","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Seby G","text":"Outrageous! This site encourages dishonest buyers and you risk losing your branded items because they give reason to thieves and dishonest! They do no professional checks and no support to recover your items if doubts or dissatisfaction.","title":"Outrageous","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Mrs L","text":"Rubbish .. I advertised some handcrafted wall pictures, in the correct category I might add … each time they were removed some straight away, others a week later. I changed the wording each time, to see if that would remedy the listing. But, no. No indication as to why they were removed just a bog standard computer generated email. Come on VINTED get your act together. Stop using a computer generated admin process, which IMO just picks up on words used to advertise. One star rating is far too good…","title":"Items continually being removed … WHY?","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Kristine Andryan","text":"The worst site I had met, 90 % of the items are fake. Service client is horribly. I lost a lot of mony there and when I ask them who is going to pay my money back they say that they are working to stop sealing fake.","title":"The worst site I had met","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Laura","text":"I decided to list a few used items that I didn't want anymore, in this way they would be still used by someone and I could get some money back of what I originally paid for them. \n\nOne day suddenly Vinted closed my account without any real reason. They just told me I was doing 'commercial activities' and making a steady source of income. I had listed only 7 items and I sold 3 in a period of 3 months, how come was that commercial and a source of income?. They don't have email or phone number or any way to discuss the situation with them. They will just send you an automatic message with a generic text, clearly a template they use for everyone without giving you a proper reason for blocking the account or giving you the chance to discuss it. They just don't care about you. They kick you out and close the door so that you cannot even complain. \n\nReally frustrating.","title":"Very frustrating experience","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Lauren","text":"Bought a couple of items back in Nov 2021. The money went out of my account and I received the items, no problem. However two weeks ago I received my bank statement showing that the amount for these items has been taken again, over 3 months later. Contacted vinted, they said there has been a problem with their ‘Payment service provider’ and some monies were not taken at the time. I have sent them copies of my statements showing that they have taken money twice over and over again and now they are just ignoring me. I hopefully will get the money back from my credit card company but the scary thing is they have held onto my card details all this time and have taken money without my permission.","title":"Awful - trust the reviews","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Dianne Ong","text":"Worst app ever!!!!!!!!","title":"Worst app ever!!!!!!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Linda Baker","text":"Terrible.. I noticed I’d been charged for an item I hadn’t bought.. seller sent a photo of postage receipt which wasn’t my postcode. I hadn’t bought the item, it  scared me.. I blocked them with my bank, and closed my account.  Vinted did respond and say they’d noticed suspicious activity on my account.. but I wouldn’t ever use tge site again. I had many successful transactions, but after this.. no…","title":"Terrible.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Ella Perry","text":"I'd give it no stars if I could, awful service! First time seller, selling a vintage designer bikini with all authenticating evidence and still they chose the racist buyers side because she was confused about it being made in another country because the seller had no knowledge of the designer item they brought. They are useless and you can't speak to any one for help either and definitely do not have a team to authenticate items as i had my item professionally authenticated and somehow still wasnt good enough for them. Avoid at all cost, not worth the hassle! Go to depop or ebay to sell. Definitely don't use this lot.","title":"I'd give it no stars if I could","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Shaheeda Marine Perera Lussene","text":"First time on Vinted and the parcel that I had to sign to receive is deliver to someone else just like that and Vinted doesn't care, no help nothing\n\nJE VIENS DE  REJOINDRE et malgré un colis contre signature, le colis est livré à une autre personne, et Vinted ne propose aucune aide. Rien","title":"1st and last time","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"A Pickup","text":"I wish I had read the reviews before placing an item on Vinted.\nI sent my item as advised and now I am still waiting for funds to go into my account.\nAutomated replies on Vinted - no monies.\nI will not use again","title":"I wish I had read the reviews before…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Giovanni scotti","text":"Absolutely shocking. Experience eBay is much better.be carefully when you buy on vinted","title":"Absolutely shocking","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Jane","text":"The system has glitches. If one blocks a seller, messages still can be received. Support team does not see multiple messages as harassment. In fact, support team is useless. Responds fast, but do nothing in reality. Do not mediate, do not stand by the right side. Bottom line - their policies are only words and nothing else. \n\nBoth sellers and buyers have no protection whatsoever. Even when factual evidence is presented. \n\nSome sellers sell faulty items from time to time. Even when they have majority of good reviews and just a few bad. Generally, no effort is made to reconcile the situation from both seller and Vinted. \n\nEvidently, even here, on TrustPilot, Vinted does nothing to respond and to resolve negative reviews.\n\nDo not recommend and will not use again.","title":"Idea is good, execution is bad.","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"MR ANTHONY COOPER","text":"TIME TO GET VINTED CLOSED DOWN NOTHING BUT CROOKS","title":"TIME TO GET VINTED CLOSED DOWN NOTHING…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"Anthony Hyde","text":"Please everyone. Look at the huge amount of negative reviews and keep well away from Vinted. An absolute crap site and app. The cringeworthy advertisement campaign must tell you that. There’s a reason for that. The company is desperate as the concept and reality is rubbish. If you want to try and sell something please try eBay or gumtree.","title":"Please Avoid Vintage!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Anoniem","text":"Just look at the reviews here. This company is so awful, it's incredible.","title":"Just look at the reviews here","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Ling Chen","text":"Bunch of bullies. Constantly flagged my account as a commercial account and can’t tell me why. Would not hear me out, tried my best to prove i wasn't a commercial seller. Banned me today. I have only ever sold my own stuff that i no longer use\/want. Some new, some used. Always took the time to take good photos, wrote a clear description so whoever was interested in the items could have all the info without having to contact me. Had 100% positive feedback because i made the effort to be a good vintie and to provide a pleasant experience. Apparently if you do provide great photos, great description, own alot of new stuff that you never used, you’re commercial. Thank you Vinted for such a wonderful experience.","title":"Bunch of bullies","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"Nicholas David Booth","text":"SCAMMERS & THIEVES\n\nAfter a scammer lied a said I missold an item, I have been blocked on this app and they have still got my money. AVOID AVOID \n\n(Buyer said I gave the wrong sizing - the proof was a chile wearing the jacket - she said it was her and it was too big!)","title":"SCAMMERS & THIEVES","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=1&stars=1&stars=2&stars=3"}]