[{"date":"2021-08-03","author":"Lara Lee Byerly","text":"I have sent you messages on your website\/app tons of times you constantly ignore me and don’t care PLUS I HAVE CONTACTED YOU ON HERE MANY TIMES AND YOU IGNORED ME EVERY TIME ‼️‼️😡😡","title":"I have sent you messages on your…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-08-21","author":"sharron","text":"This platform needs investigating\nI have lost money as a buyer and as a seller\nI purchased a mulberry bag, on arrival it was clearly a fake so i reported an issue and requested to return it for a refund. They said they were investigating it and requesting more evidence from the seller. I got a message that the bag was authentic and the seller was paid instantly. So i listed the bag to resell, within 10 mins vinted deleted it, telling me it was fake, they threatened to close my account if i tried to list it again.\nI sold a bundle of 3 items two were £30+ and one just £2.50 The buyer reported a dot on the lower priced item and requested to return for a refund. I clicked to accept, instantly vinted refunded the full amount and manually cancelled the transaction. No returns information. NOTHING\nThey told me they do not provide partial refunds, and told me i had cancelled the transaction myself and paid her back in full. I did no such thing, the message said the transaction had been manually cancelled by VINTED. They said i would have to deal with the customer outside of vinted, maybe she would agree to refund me via bank transfer. YEAH RIGHT\nThis is why 80% of the bags listed are fakes, and why it is a breeding ground for scammers.\nVinted make millions through the payment protection they charge on every transaction, the only time they ever refund is when it can be proved the couriers lost it. Then there is £50 maximum you can claim, and it takes weeks and weeks before they will investigate it.\nOn both occasions i contacted them with my issues. They gave their decision and then blocked me from being able to contact them again about these transactions.\nHow they are allowed to trade is beyond me.\nI wonder why they have never responded to any of the reviews. They do not try and defend themselves because they can`t.\nSecond-hand fashion platform Vinted is already worth 3.5 billion euros. Vinted, an online platform for second-hand clothing, raised 250 million euros to support its further expansion. During the financing round, the Lithuanian company was estimated to be worth 3.5 billion euros.12 May 2021","title":"This platform needs investigating","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-08-23","author":"Alice  K","text":"Twice now I’ve tried to buy an item on Vinted and there was apparently an “issue on their end”.  Two payments were charged from my bank account instead of just the one. This meant that I was paying twice for an item. BOTH times Vinted have not been helpful at all and I have NEVER received a refund. It’s an utter scam. I would not recommend.","title":"Twice now I’ve tried to buy an item on…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-08-25","author":"carole ellis","text":"Don't really want to give 1 star but it won't get published otherwise. Found a great deal for a bundle of 5 items with 50% off but when bundle weight requested the buyer decided they didn't want their items to go for this price and wouldn't send a parcel size and label.\nContacted customer support expecting them to be on my side as the Seller was truly out of order and changing the rules of the sale-you don't put the price up after the price has been set!!!! Customer services said they had no part in the negotiation-what a load of piffle!! The Seller set a discount and should have honoured it.","title":"What are Customer Services here for?","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-08-26","author":"Valeriavangaii","text":"It’s scam platfotm. An example of how the platform brought together scammers of all stripes in one place. If you want to be left without things and without money, then you are at the vinted!  the platform is always on the side of the scammers. Support service just doesn't exist","title":"It’s scam platfotm","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-08-31","author":"Usually Bubble","text":"What a pity I can’t give zero stars! Utterly shambolic and incompetent. Wish I had read the reviews first! I contacted Vinted prior to setting up an account as I am in UK but my billing address is overseas, so I wanted to check I wouldn’t run into problems, before investing time and effort in listing everything for sale. Quote: “There will be no issues….even if the billing address is not in the UK” Apparently NOT SO as I found out when someone attempted to purchase one of the items I advertised…..took 3 days for Vinted to tell me I couldn’t use a billing address outside UK. When I sent screenshots of the previous conversation with them, they stated “please ignore the message…..people make mistakes….” Oh yes, they do and I did when I used Vinted!!! DON’T GO NEAR IT!!!","title":"DON’T GO NEAR IT!","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-09-08","author":"SD","text":"AVOID AVOID AVOID! Dreadful company to deal with when there is a problem with your transaction. \nVinted threatened to block my account if I did not close my most recent PayPal dispute (which PayPal found in my favour, thank you PayPal!). \nVinted, if you're reading this, block away because I won't be silly enough to use you again!","title":"AVOID AVOID AVOID!!","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-09-10","author":"Alessandra","text":"The worst second app never seen. Customer service completely useless","title":"The worst second app never seen","stars":1,"location":"LU","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-09-13","author":"TAIS  TAKEHARA","text":"If you wanna sell, you gotta pay, when you finally get a buyer, you have to go to a delivery point, what's okay, but then the delivery point doesn't exist. You complain and they say that it's frustrating, but they can do nothing, you have to turn down on the offer. They hang up right on your face! And that's all so disrespectful! You literally pay to work!","title":"Slaving work!","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-09-15","author":"Monia","text":"The worst app and custumer service you will ever experience","title":"Just awful","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-09-19","author":"X Æ A-17","text":"Constant issues with items getting taken down wrongly, customer service impossible to reach and even more impossible to talk to, they just respond with templates without reading your messages. Then after weeks and weeks of trying, and about 100+ messages to them, they eventually admit the fault and just say 'sorry for inconvenience' ... like they haven't just deleted hours of my photos and descriptions for no reason?! \n\nRinse and repeat every few weeks. \n\nThankfully I haven't got too much money tied up like the other reviewers here. Nightmare to deal with.","title":"No Customer Service Response","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-09-19","author":"vicky","text":"Avoid \nTried to sell a Pandora braclet that was not a fake and told it was Vinted were rubbish.   I would rather have a coronary instead of using this app","title":"Avoid","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-09-20","author":"E C ","text":"Wish I could give Vinted no stars! \n\nVinted is full of scammers & they offer no real protection to buyers or sellers. \n\nThey charge you for 'buyer protection' which only covers the item. - You have to return it fully tracked at your own expense - which can often cost more than the item.\n \nOne seller sent completely different item to the one I purchased. Another sent an item so bad, I wouldn't clean the floor with it.  That's almost £20 wasted in just a couple sales. \n\nThe last seller didn't even bother to send the item or reply to messages and Vinted left me an auto negative review for cancelling after 5 days. \n\nAll that money sitting in Vinteds holding account waiting for their non existent customer service to sort out the issue. They're laughing all the way to the bank. \n\nIf you do finally get hold of customer services, they are rude & unhelpful & a true reflection of how awful this site is for buyers & sellers.","title":"Shockingly bad experience.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-09-20","author":"LOLA","text":"VINTED team is a real thief.\nThey do not take responsibilities for their mistakes nor problems happening on the consumer journey.\nLately, I’ve shipped a pair of shoes via VINTED, new with tag on -which I bought for 220€ In store- to a buyer on the app for 165€. The parcel was lost, and I had to chase them to get a proper answer. Eventually, they promised a full compensation, but I only got 25€ refunded, amount which was actually paid by the transporter. VINTED is not compensating one single euro from their pocket to sellers, who literally lost their item, and obviously doesn’t think at all about working out proper insurance in order to protect its users. \nI am honestly shocked by the terrible customer service I just experienced…","title":"Run away. VINTED is a thief","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-09-22","author":"K_N_L","text":"Zero stars. Wish I had checked reviews before buying something through Vinted. Refusing to refund money for a parcel lost by Royal Mail weeks ago and only respond to messages to say \"wait longer\". Complete scam and have no hope of getting my money back.","title":"Zero stars awful \"customer service\"","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-09-26","author":"Ali","text":"Haven’t used vinted yet and definitely won’t after these reviews. Thanks for the heads up everyone!","title":"Haven’t used vinted yet and definitely…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-09-27","author":"Just me","text":"When selling designer clothes, I was ripped off by a buyer who said it was fake. Because I, don't save receipts for years (unfortunately), I couldn't 'proof' that it was indeed real. The buyer was allowed to keep both the money and the item, after 'examination' by Vinted itself. I wonder how they verify the authenticity of an item without actually seeing it? However, I prefer to work with companies that act ethically.","title":"Unethical","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-09-30","author":"Isabelle Quevilly","text":"Terrible experience on my first ever sold item. They never paid the fund after the buyer said it received the item broken. The buyer wasn't able to prove the packaging to MyHermes because they took it apart before taking pictures. Yet Vinted decided to refund the buyer (70 pounds) for over 100 items I shipped, 1 was broken. They didn't ask to return any items. \nThey refused to communicate with me : what is the process they use to make that decsion, they refuse to let me make a complain or to contact MyHermes. Absolutely appalling !","title":"Terrible experience on my first ever…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-09-30","author":"Yohann Roy","text":"Article commander ariver au point mondial relay et perdu ou donner a un autre client bref jamais recu le colis mondial relay se dédouane et vinted se lave les main en bref avis au futur acheteur vous payer 5% du prix de l'article en plus pour une assurance qui n'assure pas en bref fuyez vinted+mondial relay de vrais bandit de grand chemin.","title":"Article commander ariver au point…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"},{"date":"2021-10-04","author":"Customer","text":"Absolute Joke!!! Payments never got through, either PSP or server problems, but they will blame your bank...Customer service are useless!!! Vinted Third party Mango Pay sucks!!! Refund awaiting time up to one month. Always a problem!!! I do NOT recommend!!!!","title":"Absolute Joke!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=6&stars=1&stars=2&stars=3"}]