[{"date":"2021-05-17","author":"Lucy  Curtin ","text":"Absolutely terrible customer service - so many emails to sort out trivial problems","title":"Absolutely terrible customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-05-21","author":"Carolyn Worlock","text":"Vinted works really well until there is a problem. I have sold a number of items without a problem. Posting labels are sent via the Vinted system pre paid by the buyer. I have had the misfortune to have lost an item in transit. The label was attached and the item sent in good faith but did not arrive. I have been told there is no record of it being sent. I was given a receipt at the shop I dropped it off at-not worth the paper. It doesn't show up on Hermes system so not sent and cannot be investigated further. As a seller  you have no control over the postage and have to send your items in good faith. I have lost the dress and been made to feel like a criminal. I had hoped for better.","title":"Vinted works really well until there is a problem","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-05-23","author":"Rosemary Hooper","text":"There should be a no STAR option for this appalling so-called Company. All we can do is complain to OFCOM, Trading Standard Authority, and the Advertising Standards Authority to get their AD taken Down !!!","title":"There should be a no STAR option for…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-05-23","author":"Sarah A","text":"Would be ok if some of the buyers didn't mess you about. You go to all the trouble of sending an item with tracked delivery. For some reason my parcel was sent to a parcel shop instead of residential address. I don't have a clue which parcel shop. I used the address that was provided and went from there. Buyers sometimes don't bother to collect items or probably because they haven't been notified maybe.","title":"Would be ok if some of the buyers…","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-05-30","author":"Michelle (customer)","text":"Disgraceful service....not only am I now out of pocket for postage but have not been paid for Adidas shorts worth £35 all of which is made worse by not being able to speak or get through to a person !! The automated message was irrelevant and useless.  The worst experience of online shopping\/selling I’ve ever had...avoid this app at all costs!!","title":"Disgraceful service....not only am I…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-05-31","author":" Suzanne Fowler","text":"Vinted is great whilst things go well but the moment theres issues it is totally rubbish. \nThere is NO seller protection.\nA dress was bought and posted and than the buyer made a claim dress zip broken and material ripped. I showed vinted photos taken day before postage that showed all was fine on leaving me, but they chose to side with buyer. I therefore loose the money and get a broken dress back in return!! Makes me feel any buyer cld receive an item decide they don't like or it doesn't fit than damage item and claim refund?!? Hows that fair","title":"No seller protection","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-06-02","author":"Chrissy Bertram","text":"I have been a loyal Vinted buyer since last year, but I just realized they have HORRIBLE customer service and are charging customers  for their Buyers Protection Fee on small size shipping packages, but not offering the protection on this size! They are falsely charging buyers this fee and getting away with it! I found out the hard way. Recently I had a “small” package lost and Vinted told me the insurance is not provided on this size. I have sent 3 messages asking to explain why they charge the fee for this size even though they do not offer it. I can not get anyone to respond. How can they get away with this!?","title":"Vinted\/Buyer Protection Fee","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-06-03","author":"Julie Malpus","text":"I sold an item on vinted when the buyer received them she decided she didn’t want them vinted cancelled the order on her behalf gave her a refund and my buyer as kept my item so she has her money back and my £120 item. My buyer as blocked me now when i asked her to send my item back, got in touch with vinted they said there’s nothing they can do it’s between myself and the buyer I’m absolutely disgusted what kind of site is vinted I’m going to seek legal advise the buyer who had her money back and my item continues to sell on vinted why would a site let someone who has kept my item and then blocked me continue to use the site! do not use this site, I’ve always used sites for buying and selling and had no problems but vinted there criminal.","title":"Avoid vinted at all costs","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-06-04","author":"Colin Edwards","text":"Most of the buyers and sellers are good and trustworthy, but Vinted itself treats them like dirt. Robots should be better than this by now.","title":"Robots should be better than this by now","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-06-08","author":"Mary","text":"Please don’t use vinted I accepted a return buyer had no tracking but wanted money I said I need my item back so she called me all sorts of disgusting things Took pictures of my home went on social media to slander me I tryed to help her but she didn’t care She put up things on different groups she even called my family Stocked me and my area and more but vinted did not care or answer said it was between us And did not ban her yet in her reviews she’s calling other sellers names Customer service is awful no address no phone number","title":"Please don’t use vinted I accepted a…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-06-12","author":"Julesy","text":"Their so called support is useless. They charge a buyer protection fee for every transaction but if you don't let them know within 2 days of an issue they close the case and won't help.  It just means you have to trust that sellers are honest but Vinted itself is a waste of space.","title":"Their so called support is useless","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-06-18","author":"Danii Thomas","text":"This doesn't even deserve one star. Vinted's customer support is probably one of the most atrocious I've experience. You'll get generic replies to issues and no real help. I invited a friend which is supposed to get you a £5 voucher and then a £10 voucher when they sell something. The forth voucher I was accused of having 2 accounts and took 2 weeks of both of us talking with them to finally prove we are separate people. Then the second voucher I was told I haven't actually referred anyone because apparently they keep no notes. It's still unsolved. I asked to speak to a supervisor as I wanted to make a complaint and I was told to \"Report it to my local authority\" I thought it must have been a joke. I asked what they meant by that and they proceeded to tell me what a local authority was.\nPoor, poor, service. Do not recommend","title":"This doesn't even deserve one star","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-06-19","author":"noisette","text":"I think overall the platform is not as bad as it is quite an easy to use and understood platform compare to others. However, there are several things they never improved and that for me result in the 2 stars review. It has been years I use vinted but there is never a obvious way to contact vinted if encounter any problem \n( I have been using vinted for a long time so for me is not that difficult but this complaints have been filed by so many other people and they just never been heard by Vinted ). \n\nHowever, the main reason for giving them 2 stars is the poor quality service. I personally rarely encounter bad experience on vinted but I couple unpleasant experiences is quite enough. And whenever that happened, vinted never resolve anything, and sometimes for both seller and buyer. They often just ask buyer and seller to \"talk\" to resolve the issue instead trying to help the situation. (this have happened to a lot of people according to the forum I read) For me that is quite irresponsible on the part of vinted, which result in a 2 stars review.","title":"It's okay, but need changes.","stars":2,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-06-28","author":"Debora Orlandi","text":"Awful experience, both with seller and with Vinted. The pictures posted by the seller depicted a Funko Pop with mint box and figure. When the Pop arrived to me, I noticed many creases on the box and the transparent stand base  was missed. I sent some pictures to the seller in order to show him the creases and the lack of the stand base. The seller said that he didn't know about the missing stand base because he never opened the box (!?) and he offered me a 5€ refund to buy another stand base (!?!?). Moreover, he said that I was dishonest because when he sent the Pop to me there were no injuries on the box. Just insane. I wrote to Vinted to explain the issue and Vinted ruled in favor of the seller because according to Vinted the seller's description was fair. That's the seller's description:\n\n\"Funko pop Pulp Fiction - Mia Wallace (rare) funko pop, mia Wallace du film pulp fiction de Quentin Tarantino \/ ORIGINAL NOT A COPY\"\n\nI think it's not fair to omit that a piece of the figure is missed, it's not fair to post pictures that show an apparently perfect box and ask the price for a mint rare Funko Pop (144€). I'm a newcomer on Vinted, the seller is a long-time user with more than 400 sales on Vinted. I think that's the reason why Vinted ruled in favor of the seller. Too bad, Vinted: now I understand why you have really bad reviews (1.4\/5) on Trustpilot!","title":"Awful experience","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-06-30","author":"Riana","text":"AVOID vinted at all costs. I sent a gucci bag to a customer with UPS, they lost the package, it has been 7 weeks. 20 messages back and forth with vinted robots and they have suspended the transaction so i dont get reimbursed and the customer doesnt get her money back either!  they had said that we can make a claim and be refunded on june 15th, that date came and went and nothing, they tell us to be patient and wait longer. there is no protection even though they take out a fee for each transaction. horrible service!","title":"AVOID vinted at all costs","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-07-03","author":"Jan Parker","text":"Bought quite a few items from lovely people without issue. Payments left my account and shown as payments to vinted,  no problem. Until.... last item bought and my bank called because of potential fraudulent payment pending. It was to a company called Mango Bay? They researched it and said it was a utility company. I knew nothing of them and payment was stopped and an investigation started. Later that day I got an email from Vinted telling me that I had breached the terms of my contract and my account was stopped.  I checked again with my bank the following day and the payment to Mango Bay was suddenly showing as Vinted. I cancelled the investigation,  released the payment and immediately emailed Vinted customer services to advise them and ask why their payment request was Mango Bay? Not heard a thing despite reminders and my account remains cancelled!!","title":"Mystery account and very disappointed with customer services …","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-07-09","author":"Bron","text":"If you get a good seller\/buyer and the transaction is seamless then I wouldn’t have a problem with the app. BUT as soon as you encounter a problem and have to deal with customer services you realise what a terrible terrible service it is. They never ever resolve anything and just give repeated robotic replies. I was sent completely the wrong size shoes than advertised. Seller refused to compensate and Vinted ruled in favour of the seller despite me sending photo evidence. It was like banging my head against a wall. Second time was to do with the Royal Mail fees being more than they charge the buyer. Again no resolution and no compensation. If you’re going to use the app just pray nothing goes wrong as you’ll be out of pocket","title":"Worst customer service EVER","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-07-12","author":"Tracy Clarke","text":"Lost £25 as seller did not send item and vinted said they could not help . Stay away from them .","title":"Lost £25 as seller did not send item…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-07-16","author":"La Chad","text":"One of the worst websites I've ever interacted with. It gives so many issues, refuses to allow you to log in, continuously redirects you to the login page. I don't know who does their website but wow, really bad job. So user unfriendly I actually just walked away.","title":"One of the worst websites I've ever…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"},{"date":"2021-07-28","author":"Ewelina","text":"This app is a joke. I sent an item, provided a picture of receipt where you could see date, reference number, address of a buyer etc. Byuer got notification that her parcel is waiting for her, she went to the post office and it was not there. When tracking reference number you can see where it is. Vinted canceled transaction and buyer got her money back. She didn't have to prove she has tried to pick it up. I had a proof I sent it. Confirmation from royal mail was not enough for them. It was a cheap parcel, but it doesn't matter. No point to sell stuff using vinted. No point to have a conversation with 'martynas', not very competent consultant.","title":"This app is a joke","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=7&stars=1&stars=2&stars=3"}]