[{"date":"2020-12-13","author":"Jon-mee Versacchi","text":"Sign-up process and user interface on desktop is the worst, regular bugs when confirming phone number, email address during setting up the account. Account confirmation link from their confirm-your-email-message leads to a 404 page not found site. After merging international (French\/Dutch) vinted with German kleiderkreisel it’s impossible to have different accounts running in both of the countries – the site gets confused by everything, from a proxy to not being able to login when both accounts use the same phone number foreign to their \"native region\"... also every new tab will slow down your browser like crazy.","title":"Site performance from last century","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2020-12-29","author":"Guillaume D'hoen","text":"Pire application que l'on puisse trouver ! Comportement totalitaire et réponses automatiques du SAV sans queue ni tête.","title":"Pire application au monde","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-01-02","author":"Gina","text":"Removed my listing because photos were taken from the website. How am I supposed to list a new item sealed in a bag and never used?!? The item has never been opened and will lose value if I unpackage it so how am I supposed to list an item like that?! eBay never has a problem with using stock images in combination with own","title":"Weird copyright rules","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-01-11","author":"Nathalie Joshua","text":"Appalling customer service. They seem to make up the rules as they go along.\nSAV incompetent, je ne recommande pas Vinted.","title":"Extremely unhelpful customer service","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-01-13","author":"D.","text":"I wrote here before but i will write again. I don't know who checks listings there but i saw counterfeit items and apparently, customer service can't differentiate fake fur from real (obviously it's fake). It was last time i put something on sale there.","title":"I wrote here before but i will write…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-01-15","author":"Megi Alushi","text":"The worst application ever. They support only the buyers no matter who is right. I sold a pair of shoes that were in very good condition. The buyer did not like them and broke them in order to say that she didnt accept the shoes because they were broke. I sent to vinted the photos that i had in application and the shoes were in perfect condition and didnt have a single mark. They didnt even talk to me for that case but just gave the right to the buyer and I will take back the broken shoes. Thats a shame!","title":"The worst application ever","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-01-19","author":"Brittany grace","text":"I had to give away items from my closet to keep a buyer from backing out due to an error in their system. I am really upset. I have little money, am not getting as much because of COVID. I really need clothes that fit me and i cant afford new. I gave away money I could have used. I am unsure if i will continue to use vinted. I ranted and raved about it to a lot of people but i am going to inform them that if there so happens to be an error they leave it to the seller to dig out of their pocket and pay for it. I have posted this review a few times and i wont stop do other people know not to invest their time and money on this terrible app","title":"TERRIBLE site.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-01-22","author":"Maxime C.","text":"I give it 2 stars, because it IS very easy to use and customers friendly. \nIt just works. \n\nUntil they decide to issue you warnings or suspensions or accounts for no reason.\nThen, you discover they can't justify any of their actions against you. \nIt's just a blank wall of \"read the guidelines\". \n\nIt's been a year I'm talking with the very nice persons at the Customer Support. \nA year half my sells are \"perfectly fine\", and the other (exact same half) are \"worth warnings and deletion\"\nVery nice, but fully unable to give you any clue, proof, fact, argument or reason why half my articles are just banned on sight, and the other half is good. \n\nAnd that's... just illegal, sorry.\nIt's obvious Customer Support have no datas or power at all, of course, and are just here to copy paste the \"read the guidelines\" message over and over, with a kind word to customers to ease the pill. \nThey're nice.\n\nBut Vinted is just automatized and acting weird and illegally, beyond that, by just shooting down people and articles at random, and being unable to prove or argue any of their decisions. \n\nIt's a no go. \nYou HAVE to be able to justify your actions. BOTH vinted AND us!\nEspecially when your engine is acting so freaking WEIRD!","title":"I give it 2 stars","stars":2,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-01-25","author":"Katia Visentin","text":"I have been buying on vinted for a little while now and everything has been great and deliveries pretty fast.\nNow that i have a problem i can tell you that the costumer service is completely useless, it is shocking.\nI have had a problem with an item which i have contacted the costumer service for and the girl is completely ignoring my explanations and proofs while i have had a clear email from hermes that my parcel has been damaged and lost. This is ridiculous. Not sure this girl is really paid to work.","title":"costumer service completely useless","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-01-30","author":"Sergiu Les","text":"This is a total fraud. When everything goes fine it's ok but when you have a problem with a product that arrives broken for exemple... then you understand it's a total fraud as you need to pay a mandatory insurance but hey refuse refund.\nBIG FRAUD...","title":"This is a total fraud","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-02-04","author":"Abdildayeva Galina","text":"Very bad platform For Sell , all the time is delate  your picture or block They constantly block for you invented reasons and sell fake luxury goods","title":"Very bad platform For Sell","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-02-08","author":"Therése Bäckman","text":"I have liked Vinted until I had contact with the customer service.I bought a Burberry scarf from a seller, when I received it, it was clearly fake. I went to a Burberry shop who confirmed directly it was a fake scarf. After contacting Vinted, they took 3 days to do nothing and then they answered that the seller wasn’t able to proof it was real so I can return it. RETURN IT!! They ask me to commit a crime and send a fake item back to the seller. They do not even give her a warning or anything. So I need to commit a crime and send it back, pay 10 EUR for the delivery, and then the buyer is OK to keep her account and continue selling fake items. They are such a joke. They have been so unprofessional and even rude in their responses. My recommendations are to NOT by brands from this site because Vinted is just full of lies and incompetent people. They ask their customers to commit crimes. I wish I could report this somewhere and let someone really investigate in their business as they are criminals and do not care at all.","title":"Vinted ask you to commit crimes!","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-02-11","author":"Ghrissi","text":"People can sell inauthentic products and when you discover that y’re f**ked, @vinted just ask you to destroy the product that you paid with an extra 5% (protection fees LOL) 👎🏽👎🏽👎🏽","title":"Scam Marketplace","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-02-11","author":"Freya Richards","text":"DO NOT SELL FROM HERE!\nI have been a depop user for so long and this app, although the outreach is good (i got sales) I literally couldn't put the order through because my post code was \"invalid\". when looking for where to fix this, there is nowhere you can talk to anyone to fix any problem no matter how big or small. It was SUCH a big mistake downloading this app, stick to depop!!","title":"DO NOT SELL FROM HERE!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-02-13","author":"gill","text":"Do not use.\nThere is no protection for sellers. I sold an item and posted it promptly. According to Royal Mail the item was delivered but the buyer cancelled the transaction and received a refund. I have no item and paid out for postage too. Vinted do not respond to messages just reply automated message saying issue resolved. It is not resolved and I am just so annoyed. I have removed all the items that I had listed. Please be aware sellers there is no help for sellers.","title":"Do not use.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-02-20","author":"Joanna J","text":"The worst selling app, they doesnt care and ignore people. I should read reviews before.\n'Buyer protection' is a bull**it, not protection","title":"Dont use it","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-02-22","author":"Chiara Laregina","text":"Horrible costumer service, they keep replying with the same automatic message, I have bought a counterfeit bag and they are not trying to resolve the problem in anyway. Really frustrating. I would do not recommend.","title":"Horrible costumer service","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-02-25","author":"david rogers","text":"Stay away from this site. I bought an item and paid for it. I received item and thought that was that but was not to be ?   Because the seller missed the shipping date i got banned from using again even though it was the sellers fault for missing the shipping date. i did everything as that was asked and it was Vinted who made the error yet no apology or nothing.  The site appears to be  poorly ran  so i would stay well clear !!","title":"Stay away from this site","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-02-26","author":"j.hwang","text":"My first two orders were great! The buyers paid quickly and they were happy with their orders and left five star reviews. But for my 3rd order the buyer went to her local parcel shop and picked up her parcel. But when she got home she put in an issue with vinted saying that her parcel was open and that there was nothing in there. But when I dropped off the parcel I made sure that it was sealed and I triple checked and so did the shop owner. I was so disappointed, as I  had previously been using Depop but started selling on Vinted because there was no commission. But unlike depop they don't have ANY seller protection. So the buyer got a FULL refund and got to keep the item that I sent but they pretended that they never got. So I got scammed off of my money and I will never use Vinted again. I am disgusted and horrified in the seller's point of view. I would reccomend using Depop or Ebay instead.","title":"Will never use it again!","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"},{"date":"2021-03-03","author":"Ahmed ibrahim","text":"To whom it may concern, \nIf there’s -5 stars I would have recommended!!\nDO NOT USE VINTED!! You will lose your time and money they have unbelievable poor customer service they will never contact you if you have issues they will respond to you very poorly and unprofessional I really advise you use Wallapop or other app or website at least worth your time and effort. \nBelieve me I been using it for a while and I just deleted it today! \nI’m glad there’s a lot of choices for professional companies that will help you out sadly Vinted isn’t one! \n\nGood luck!","title":"To whom it may concern","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=10&stars=1&stars=2&stars=3"}]