[{"date":"2020-07-03","author":"D.","text":"I managed to do two successful sales, but if you have good quality clothes this website is not for you. Cheap prices bring cheap attitude from buyers. Buyers here will always expect you to sell items for coins.","title":"Cheap attitude from buyers.","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-07-11","author":"Donna","text":"Disgraceful customer service. If you have an honest seller then great. However there are also dishonest sellers and so beware Vinted customer service is non existent.","title":"Disgraceful customer service","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-07-17","author":"Dariusz","text":"Avoid it! 3 transactions and 3 problems. The customer service is useless, closing disputes without answering. Totally useless. I guess its good to use only with honest sellers when they don't have to ship item but meet in person","title":"Avoid it","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-07-22","author":"Helen Rooney","text":"I have sold on ebay for years and did a bit on Deepop too, but I will never use Vinted again after just one sale \n\nI sold a dress to a buyer and sent proof of delivery. The post office marked the postcode slightly wrong on the proof of postage. The package was slightly delayed, as most Royal Mail packages are at the moment due to Covid. The buyer worried that it hadn't arrived and raised it with Vinted on the 5th day. Vinted automatically refunded the buyer, telling me it was because the post code was wrong. Vinted do not seem to understand that even if the postcode is wrong Royal Mail will deliver it to the correct address as the correct address was marked up on the package. \n\nI contacted the buyer to ask her to send it back when she got it. She was super honest and told me she had just got the package and everything was correct, including the postcode, She has now been told by Vinted that she will need my bank details to send me the money once she gets a refund as she wants to keep the item. \n\nIf Vinted would have allowed a few days grace and had a better understanding of the UK postage system this whole issue would not have happened. They need to train their staff better","title":"I have sold on ebay for years and did a…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-08-04","author":"SOFIA","text":"The worst customer service!!! \nI contacted customer service because my parcel was sent to a wrong address and they told me to do nothing they were going to cancel the order and make me a full refund and now they say it is my fault and they will do nothing. I have all the conversations I had with them were they clearly instruct me to do nothing and then they say is not their fault! Now I have lost my money and my parcel and they will DO NOTHING!\nWOW WOW WOW amazing they can not take responsibility!","title":"The worst customer service!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-08-06","author":"Bianca Popovici","text":"Very low client service support!!!! And also liar publicity that promote selling without taxes but you can pay up to 4€ commission and for this money you will never receive any support from them!!!","title":"Very low client service support!!!","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-08-25","author":"Jazz Wiseman","text":"Terrible customer service","title":"Terrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-04","author":"Morgane ","text":"J'ai vendu une paire de chaussures de mon mari. Le mardi 2 septembre, l'acheteur a confirmé la réception et la satisfaction. J'ai demandé que l'argent soit transféré de mon porte-monnaie électronique à mon compte bancaire, mais malgré le courriel de confirmation, le transfert était en attente. Le lendemain, j'ai contacté le support pour demander des explications et ils m'ont dit que c'était normal, que parfois il faut 48h et donc d’attendre. Après 48h, le transfert est toujours en attente et le support a eu le courage de me dire qu'ils doivent enquêter pour comprendre le problème et que je devrai attendre des semaines. Nous avons vendu ces chaussures très chères parce que notre bébé a besoin d'une intervention urgente. Désespérée, j'ai essayé de téléphoner à Mangopay et une dame très gentille m'a répondu qu'elle ne voyait aucun problème avec mon paiement et qu'elle contacterait Vinted immédiatement pour faire débloquer le transfert. Malgré tout cela, Vinted n'a pas encore débloqué mon paiement de 3000€. Mon avocat m'a dit qu'il s'agissait d'un détournement de fonds et que Vinted serait légalement responsable si quelque chose arrivait à mon enfant, mais il est pire et je me sens impuissante et désespérée parce que Vinted ne me donne pas l'argent pour payer l'intervention. J'ai fait part de la gravité de la situation à Vinted mais, de toute évidence, ils ont plus intéressé par les intérêts bancaires sur mon argent et de celui d'autres utilisateurs malheureux (je suis sûre que je ne suis pas le seule dans cette situation) que par la santé de mon enfant.\n\nI sold a pair of my husband's shoes. On Tuesday, September 2nd, the buyer confirmed receipt and satisfaction. I requested that the money be transferred from my e-wallet to my bank account, but despite the confirmation email, the transfer was pending. The next day, I contacted the support team to ask for explanations and they told me that this was normal, that sometimes it takes 48 hours and therefore to wait. After 48 hours, the transfer is still pending and the support had the courage to tell me that they have to investigate to understand the problem and that I will have to wait weeks. We sold these very expensive shoes because our baby needs urgent surgery . Desperate, I tried to phone Mangopay and a very nice lady told me that she saw no problem with my payment and that she would contact Vinted immediately to get the transfer unblocked. Despite all this, Vinted has not yet released my payment of 3000€. My lawyer told me that this was a misappropriation of funds and that Vinted would be legally responsible if anything happened to my child, but he’is worse and I feel helpless and desperate because Vinted is not giving me the money to pay for the surgery.I have told Vinted about the seriousness of the situation but obviously they are more interested in the bank interest on my money and that of other unlucky  users (I am sure I am not alone in this situation) than in my child's health.","title":"ARNAQUE SCAM","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-30","author":"Suzie Russell","text":"BUYERS BEWARE! In principle a great idea! But these guys are inefficient and untrustworthy. The site is riddled with fakes and items fit only for the bin. Complain to customer service and if you are lucky enough to to get a timely reply you’ll simply be told that, and I quote ... ´Vinted simply connects buyers and sellers and is not responsible for authenticity or accuracy’","title":"BUYERS BEWARE","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-10-07","author":"Beauty Yoga","text":"Do yourself a favor and DON'T use Vinted. They lost my pack and it has been 2 weeks already and they refuse to refound me saying that the delivery provider does't answer them about the pack therefore they can't do a thing! And if you start searching another way to get your money back, you will see that they have a policy that allows them to take 28 working days to make a refound. It's pathetic!","title":"Do yourself a favor and DON'T use…","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-10-13","author":"Ali","text":"Appalling, they want closing, after using them for 2 years there abouts they suddenly asked for passport or driving license or id card. I have none of these, when I signed up they did not ask for these. When I told them I do not have these I had a snotty reply of them basically telling tough s$#@ and have a nice day.","title":"Appalling","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-10-13","author":"Rose","text":"I recently sold a watch over Vinted. Unfortunately the straps were damaged during postage, and it arrived broken. Naturally, the buyer complained. I contacted Vinted support, confident that they would be able to help me. I could not have been more wrong. It turns out that they assume all their sellers are lying cheats, who would deliberately sell broken items. They offer no help or support, and are incapable of reading the messages sent to them. Every message I received from Vinted felt like a slap in the face, and I will never ever buy of sell on this website again. I can not advise more strongly against using the awful website.","title":"The worst experience of my life.","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-10-20","author":"Perukia","text":"I was sure to be alone but what  a surprise to see all this bad reviews😶 I experienced lot of them. Fake products, bad customer services, insults and lie from buyers, customer service....😲 omg 😱 \n\nJ'ai eu une si mauvaise expérience que je ne sais pas par où commencer. Lisez les commentaires autour...c'est vrai.\n\nNo  es un buen idea.","title":"No. Non. Niet.  Ne ...don't!!!","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-10-21","author":"Amin","text":"Take this company down I hope they run out of business what a horrible app stay clear of it use ebay or amazon not this horrible app what do you expect from a company based in Lithuania f**'* robbing b****","title":"Take this company down I hope they run…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-10-22","author":"ALESSANDRO ANDRETTA","text":"I’ve not received any assistance from Vinted. I received an item totally different his description and Vinted ask to me pay return cost in order to obtain a reimbursement. Despite must pay 0,7€ + 5% of amount for protection which basically doesn’t exist. Unfair marketplace, to be kind. I also work for the second globally marketplace after Amazon and I can’t image a worst place for buyer. My aim is to draw the attention of EU committee for trade and Spanish consumer associations and also in Italy, my native country. Please image if I had received a second hand dirty socks in the box instead of a Gucci bag and for Vinted I should have pay sending back expenses to recover my two thousand euros. \nOne solution: chargeback and delete account.","title":"Risk of scam","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-10-26","author":"nadja","text":"A lot of dishonest sellers lost so much money it’s just insane how rude they can be,even when you ask them in advance if there is something wrong they reassure you it is not what you receive it’s garbage!\nThe customer support basically doesn’t exist!\nEvery 3rd item I bought was damaged!\nThey found a perfect way to get rid of their garbage!\nDon’t buy anything there it’s a horror!","title":"A lot of dishonest sellers lost so much…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-10-28","author":"M","text":"Why it’s so much worse than UW:\n- you have to wait at least 5(!) days for you money (why?)\n- you can’t sell your handmade face masks, for some the only way to earn some money these days,\n- no customer service, no reaction, ban for no reason,\n- scammers who claim buy items then say they never arrived, so they get the items and the money and leave you with nothing","title":"Why it’s so much worse than UW:","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-12-01","author":"Joe Bar","text":"Faite attention beaucoup de contrefaçon, j'ai fait supprimer plusieurs article !!!","title":"Faite attention beaucoup de…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-12-09","author":"Sel","text":"Terrible customer service. I am locked out of my account because I do not have a EU phone number to use, and when I asked if they could help me enter back into it, they took days to respond to me, going in circles, and eventually , gave me no alternative solution. I am out 30 Euro and a pair of shoes that I really liked. DO NOT RECOMMEND. STAY AWAY FROM THIS WEBSITE.","title":"Terrible customer service","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"},{"date":"2020-12-09","author":"Alphy ","text":"I think the app is great and useful, but I think they have a long way to go in terms of user experience. When you save search items, buyers are now just stuffing their ads with keywords and brands that are not relevant that trigger your wanted searches. If you’re looking for a specific product, be ready to scroll through tons of ads to find the actual brand and product you’re looking for.","title":"Great app, but needs work","stars":3,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=11&stars=1&stars=2&stars=3"}]