[{"date":"2019-04-18","author":"Evija Velmere","text":"Good for selling and buying cheep articles. Doesn't take responsibility what so ever. Helpdesk corresponds to their terms and conditions without further discussions. Therefore please never buy or sell anything valuable. Integrated shipping partner Mondial Relay \"lost\" two of my packages i sold, you get compensated 25€ max which is not even a half of what i sold for.","title":"Good for selling and buying cheep…","stars":3,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-04-23","author":"Un Petit Feu","text":"Worst experience ever. The support is a total joke. Don't buy on this website unless you want to throw your money by the window.\n\nI have purchased an Air Jordan pair of shoes and I never received the product. The Post Office said it was delivered but I've never seen the colour of the package nor the pair of shoes, which I paid €150 for. \n\nI warned Vinted support about that and they kept sending me the same message over and over again (\"We're sorry to hear that you didn't receive the product, please contact the post office\"). I asked the Post Office to make an investigation to know where the package was. I sent Vinted support a proof that I opened an investigation case. The investigation isn't finished yet, but they closed the litigation on Vinted between the seller and me, even if the Post Office didn't give me an answer about the result of the investigation. \n\nSo the seller received his money and I paid for nothing. I asked them but they said that \"the Post Office said it was delivered so it's delivered\". \n\nLuckily I paid with PayPal, so I opened a litigation case with PayPal. I warned the Vinted support about that and they said that \"according to their Terms and Conditions\", my account may be blocked. BECAUSE I OPENED A LITIGATION CASE ON PAYPAL. \n\nAnyway. I'm asking for my money back and they don't have proof to give to justify the closure of the litigation. \n\nThey threatened me to block my account but they can, actually I don't care at all and I won't buy on this website EVER AGAIN.","title":"Worst experience ever","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-04-27","author":"Lieke","text":"The first 3 sells go very fluently, it seems that Vinted helps you a bit with getting views on the app. Afterwards your items don't get any views anymore even if you pay to boost them. Even if you take great pictures like Vinted discribes you to do. A bit disappointed. Money transfer from the sold items went ok though.","title":"Impossible to sell items","stars":2,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-06-16","author":"Marylou Chenu","text":"Site à fuir, je n'ai jamais reçu ma commande car le site ne m'a jamais dit que l'expédition avait été faite (Ils indiquent pourtant qu'un message va nous être envoyé au moment de l'expédition par le vendeur). Cependant, j'ai bien payé le vendeur, je voulas donc un remboursement. Voici ce qu'ils m'ont répondu: \n\n\n \"Hello Marylou,\n\nI'm sorry this deal hasn't worked out as planned.\n\nUnfortunately, I’m no longer able to suspend this transaction since the payment has already been released to your seller. 😞 \n\nWe really care about safety and always give buyers 2 days after the order is marked as delivered to let us know if anything goes wrong by simply clicking the \"J'ai un problème\"  button. You’ll get the option to contact our support team. From there we'll be able to investigate further.\n\nPlease contact your seller about this. Many sellers are happy to offer a replacement item or a refund! Please note, if you agree on a refund, the seller will need to refund you externally (via PayPal or bank transfer) since the funds are no longer on Vinted. \n\nI hope this helps and I hope your next purchase will go as planned, 🌼 \n\n\nIeva || Support Team\"","title":"Site à fuir","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-06-19","author":"nadja","text":"70% OF THE ITEMS I ORDERED CAME BROKEN, FULL OF HOLES, STAINS, STINKY,NOT A TRUE SIZE,AND SO ON!\nAND I HAVE TO PAY FOR THE RETURN SHIPPING!\nTHE SUPPORT IS LIKE TALKING TO A ROBOT, REPEATING THE SAME THINGS ALL OVER AGAIN NOT HELPFULL AT ALL!\nHORRIBLE!","title":"70% OF THE ITEMS I ORDERED CAME BROKEN","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-07-01","author":"Claudia Cocci Grifoni","text":"Once you sell items you don't actually receive money in your account!! And obviously, their customer service email doesn't work (no one replies!!!) This app is a joke...stay away from it.","title":"You sell items but you don't get paid!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-07-02","author":"Laura Jones","text":"Id give zero if possible\nCustomer service is a joke its all generic copy and paste basically telling you they arent interested\nThey delete 'multiple listings' when tey items arent even remotly similar\nAnd block accounts for no reason at all\nAVOID AT ALL COSTS\nUse depop sphock and ebay instead they are so much better","title":"Id give zero if possible","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-08-06","author":"AS","text":"Not worth it\n\nIt's not worth the time, unless you want to sell things that aren't really worth much or that you don't care about. If you try to sell a luxury item, they'll take it off the website and then ask for proof that the item is authentic, they'll ask you to add pictures of the tag and so forth. However, even after doing exactly what they ask you to do, they still won't add the item back to the website. And on top of that, there's no way to contact them to ask why they're not putting it back.","title":"Not worth it","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-08-13","author":"Louise D","text":"AVOID AT ALL COSTS. Extremely bad company. Sellers are not protected against scams at all.\n\nI sold one coat (value RRP 150€) on Vinted last year, the coat was exactly as described in my listing. The buyer complained to Vinted saying (and lying!) that the size was not correct and not as described. The story behind this is that she clearly lied and said that as an excuse to return the item because she didn't like the coat. \nDespite all the proofs I sent to Vinted, the buyer was authorized by Vinted to send me the coat back. The buyer had her refund, I lost my money and she apparently sent the coat back with Mondial Relay: the 150€ coat never arrived to me and has been lost (or stolen?). I lost my money, my coat has been lost and I have not received any compensation or any money back from Vinted. The buyer lied, Vinted trusted her without any proofs. \n\nVinted doesn't protect the sellers agains scams at all, I don't recommend anyone to use it.  \n\nIt is impossible to have a discussion with a person working for Vinted as you only receive meaningless automatic\/robotic replies to your complaints. There is absolutely no customer service. AVOID AT ALL COSTS.","title":"AVOID AT ALL COSTS: SELLERS ARE NOT PROTECTED, MANY SCAMS, NO COMPENSATION FOR SELLERS, AUTOMATIC REPLIES, NO CUSTOMER SERVICE","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-08-18","author":"Hailey","text":"I got scammed out of an item. The buyer refuses to answer my messages and Vinted customer service insists that it's my fault. Worst customer service I have ever received. I will never purchase or sell from this company again.","title":"I got scammed out of an item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-09-03","author":"Sand Elula Parker","text":"0 good management ! 0 good customer service. They do what they want but not they should do for customers !! they never follow the account and decide to block you for unjustified reasons. They never listen customers but they love to keep your money for 20 days even you pay a protection for buyers ! meaning this website is just a shame regarding the management and the way to think that customers buyers and sellers are just toys and bank ! let it and go on ebay that it is more international. You don't have any problems to use mondial relais if you dont want to use it. You pay a comissions ok but the protection vinted is really expensive and never protect you. They don't control even people who sell copy of luxury brand don't control if a vuitton is real or fake meaning never buy on vinted !","title":"0 good management 0 control of fake brand 0 good customer service","stars":1,"location":"VN","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-09-09","author":"Grande123","text":"Would give 0 if I could. Horrendous app and it should be deleted and banned tbh. I have got scammed multiple times and they never respond to my complains or even address it they just sit back and allow the scamming to happen.","title":"Would give 0 if I could","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-09-09","author":"Review101","text":"Disgraceful app. I hope majority of people will see this and decide not to download the app. It’s a scam website. They ignore you when you are being scammed by people and allow the scamming to happen. The last two times my items have been sold on there, I paid postage for the items and also paid for them to need signatures. The buyers have just decided they didn’t like the item basically and pretended it hasn’t delivered yet despite it saying different on tracking and with there also being a signature given when it was delivered. Then, a few days later deciding actually now it’s came but this is wrong and they have damaged my items and sent images of the vandalism they have done to my item and with these images been allowed to send them back to me IN THIS CONDITION. I was threatened by the site that my account could be terminated because of the fact my items ‘weren’t as described’ numerous times. They also let the buyers keep the item and also get a refund so you are left without your item neither the money you were promised and the buyer gets given your item for free. It’s absolutely ridiculous honestly. Don’t ever sell your stuff on here. They literally don’t respond to your messages if you send a couple to them if they haven’t responded the first time. No help at all. You are literally ignored when asking for help. Anyone who works for this website should be disgusted with themselves watching and allowing people to be scammed. This is a sin.","title":"AVOID AVOID AVOID","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-10-06","author":"Kieran long","text":"Awful website, they scam and rob your money. Not only that they take your items and don’t give you any compensation whatsoever. Awful.","title":"Awful website","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-10-15","author":"Ashley Kellers","text":"Ridiculous\nThe amount of scammers on there\nThere's no help from the team who just keep telling you to \"just be patient \/ wait a few more days\" - I've been waiting over a month for something I never received and Vinted tell me they're going to close down that account. Well, it's still up and running.\n\nAlso recently auto generated the wrong address for a buyer of mine and there's no way of checking on the system where it was sent to, so now not only do I lose an item, I lose the money too as buyer won't confirm receipt. Absolute joke.","title":"SCAMMERS","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-10-18","author":"Aliah Fighlia","text":"i did have smooth transactions by selling items in vinted. the only hassle is that most of the time when im uploading new items to sell they keep on removing the article about authenticity security even if im providing details and photos of what they asked to prove the authenticity of my items. and cannot even argue by that because they are using the robotic message which I cannot respond or argue because they dont accept respond. i hope they do somerhing about this issue. otherwise selling and buying products from this site is good.","title":"i did have smooth transactions by…","stars":3,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-10-25","author":"Rosy","text":"The platform itself great! But the customer service in France is poor. They took no responsibility for a mistake on their part. I got my parcel sent to a destination 20 km away and they suggested I go fetch! I was appalled.","title":"The platform itself great but..","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-10-30","author":"Aga","text":"Scam app. A lot of scammers on here. \nConfusing app, when something goes wrong the team washes their hands and don’t take responsibility for anything. \nAvoid","title":"Scam app","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-11-02","author":"Th B","text":"Vinted is surprising .... too many kinds of articles even the prohibited one... surprised sometimes to see the prices offered online. Vinted should try to have a better view on the new posted articles... \nOtherwise, it's ok and \"customer service\" very reactive.","title":"Vinted is surprising ...","stars":3,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"},{"date":"2019-11-21","author":"Emrah Yüceer","text":"Been sent a counterfeit product by the customer and no way to get my money back. Vinted sending back and forth emails for 10 days. Worst customer service ever","title":"Been sent a counterfeit product by the…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=13&stars=1&stars=2&stars=3"}]