[{"date":"2021-11-06","author":"A. Starr","text":"Be careful when doing business via this website.\nThey have a threshold of how much you can sell, and when this limit is reached (and they can't say how much is the limit), they only release the payments (of items you already sold!) to your bank account IF you give them ALL information they demand, such as a copy of your passport\/ID card, etc.\n\nSo if you are not willing to give copies of your documents, do not sell via Vinted.\nAlso, there are fake messages being sent to you requesting you to send documents to them.\n\nThese fake messages look EXACTLY the same as messages from customer support, so be aware, is possible that you will be scammed very easily and without even noticing.\n\nI sold 4 items via Vinted and it went well regarding the buyers and their payment to Vinted. \nIt did not go well with Vinted paying me, since I am not willing to disclose my passport to them. So they have almost 600, Euros that belong to my last sale (a purse) in their possession. I am contacting my lawyer to dispute this and I will no longer use this website.\n\nSo my final tip is: take the time to READ ALL their CONDITIONS before you make the effort\/lose the time to list your items in there - you might sell, ship your merchandise and be left empty handed.","title":"Be careful when doing business via Vinted","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-11-07","author":"ES Carter","text":"I've been buying\/selling on Vinted for about 6 months. I had over 400 5 star reviews from buyers and sellers.\nI stuck to the rules. I thought it was a good place to sell even though it can take ages to get your money from a buyer and if you receive something tatty\/damaged\/fake it can take Vinted ages to resolve despite them charging buyers a 'protection fee'.\nI always used the money in my Vinted account to buy more things, never once making a withdrawal as it was a way to sell our unwanted things and buy preloved, as Vinted proudly state 'shopping doesn't have to cost the earth'.\nThat was until my account got blocked today for no valid reason. The automated response for the blocking did not apply to anything I had sold or done on the site and they refused my right to appeal.\nThey've also STOLEN all the monies I had in my Vinted account and I cannot access any of the transactions where I am waiting for things to arrive that I have bought, so I will have had around £250+ stolen from me in total by Vinted. THIS IS THEFT plain and simple. I will be contacting Citizen's Advice regarding this in the UK. I cannot see, after having read so many awful experiences and stolen monies via Vinted, how they can continue to get away with this.","title":"BEWARE. I wish I'd checked reviews before using. Don't get sucked in by their advertising.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-11-09","author":"Honeeyg Honeyyg","text":"Help ! My account is locked I have written to them several times , email , twitter etc and still no reply ! I have over £600 in my account and have worked hard to sell on there I have hundreds of  all 5 star reviews . I want my money and they are ignoring my emails\nDoes anyone know what I can do ??","title":"My account is locked I have written to…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-11-20","author":"Alison Addicott Metcalfe","text":"Terrible selling site.They let anyone sell anything in any condition.Filthy items listed as new!!!!DO NOT USE VINTED.The customer service does not care about buyers at all.Awaiting an item which has taken weeks to arrive.I really want to delete my account but can’t as this order is pending.I DO NOT RECOMMENDED VINTED AT ALL!!","title":"VINTED IS A TERRIBLE SITE!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-11-21","author":"Leonardo Carrer","text":"They kept saying that my dunks were fake even though I got them from Nike!!! Asked what led them to such a conclusion and they didn’t reply. When browsing half of the posts are fake but they never seem to be taken down!","title":"They kept saying that my dunks were…","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-11-27","author":"Damian Magennis","text":"Was tempted to try Vinted but judging by reviews will stay well away","title":"Was tempted to try Vinted but judging…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Dee Hulbert","text":"I recently used vinted to buy two pairs of trainers. I have spent £100 and received neither purchase. One appeared to have been stolen in transit but it is almost impossible to resolve and get support from vinted. Sellers are under no obligation to resolve issues as they are with Ebay.\nVinted customer service doesn't actually exist. It's impossible to get help\/support if there is an issue to resolve. I will never use it again.","title":"Don't use vinted","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Ann Ayo","text":"I sold two very good condition jackets on Vinted. Two weeks on, I have not received my money from Vinted despite the buyers accepting them. I have constantly contacted Vinted via the app( as advised), but there has been no payment made available to me.\nI would never recommend Vinted to anyone. I would’ve been better off giving the items to a charity shop. At least I would know the money would’ve gone to a good cause.","title":"I sold two very good condition jackets…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-11-30","author":"Tfmg","text":"Vinted is captial SH**T. end of story!","title":"Vinted is captial SH**T","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-12-06","author":"Alicia SAES LOUARN","text":"My parcel was stolen before I got to retreive it at the point relais in the 19th arrondissement. The woman that sent me the parcel got reimbursement very quickly, but as the buyer never did, and it was a nightmare to even go through the process. Super disappointed, i don't recommend it and will never buy again on Vinted. And regarding the customer service, it deserves ZERO stars. Fuyez ...","title":"My parcel was stolen before I got to…","stars":1,"location":"NO","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-12-08","author":"Brooke Holiday","text":"Vinted have a contract with hermes.\nHermes are \"loosing\" peoples parcels left right and centre. You pay vinted a buyer protection fee but where are they when hermes loose your parcel? Nowhere to be seen. Get told to wait a month before they'll even consider looking into it.\nAvoid.","title":"Vinted have a contract with hermes.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-12-13","author":"Scam Alert","text":"I bought some shoes from Vinted & was in London travelling when they arrived (seller sent 10 days late so I couldn't guarantee being at home at the time). \n\nAs I opened the box, I could instantly tell they were not authentic.\n\nI contacted Vinted and said that since the shoes were delivered for 2+ days, they couldn't do anything about it and that I should contact the seller for a refund.\n\nI contacted the seller about the authenticity of the shoes and they deleted the account!!\n\nI told Vinted about this and said they couldn't help and said I should sell the fake shoes back on the app!!\n\nThis is awful service and I demand a refund. I took the shoes to a Nike Store and after a while they confirmed that the shoes are indeed counterfeits!\n\nIt is illegal to sell or condone the sales of Counterfeit shoes. Vinted were adamant they were real. Very very bad company - avoid!","title":"Counterfeit Shoes!!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-12-15","author":"Lynda Tate","text":"I recently sold a small item on Vinted. The buyer has the item yet I have not been paid. I want my money and will never sell on there again.","title":"No payment from Vinted","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-12-16","author":"customer Diane Barber","text":"Vinted have a lot to learn. In short they are receiving money from you and there aren’t any processes in place to protect the buyer. Be careful it takes weeks to get paid and messages are just auto-generated. Get your act together.","title":"Vinted have a lot to learn","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-12-17","author":"Iain","text":"I have used vinted as a buyer and found it is flawed. If there is an issue with the item the buyer has to pay to return it. I bought 5 items and there were issues with three of them. Avoid! Charity shops are much better for second hand items.","title":"Buyers beware","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-12-17","author":"David Olea Duplan","text":"Do not use this app. They are not able to ensure reliability of their transportation. They make you loose time and your package will not arrive, without further explanation.","title":"Do not use this app","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-12-18","author":"Annette Dundas","text":"Absolutely disgusting customer service , they are hard to contact it’s all automated they do not help you with issues… I complained my parcel had not been sent after I purchased an item and  the seller account was blocked.. yet the customer service kept giving me standard responses even though it is obvious the parcel was not sent … the fact you are forced to pay a buyer protection fee means nothing… I’m still waiting for a response and refund I will never use vinted again","title":"Absolutely disgusting customer service…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-12-21","author":"Karin","text":"Another add removed because of copyright, untrue again of course!\nThey said I've removed the background and stole someone elses pictures, but of course that's not true. \n\nI'm using a photobooth and you can clearly see the tubes of the photobooth!\n\nWhen you explain that, they simply don't care and close the subject. I think this is the 6th time or so this happens!","title":"Another add removed because of copyright, UNTRUE AGAIN of course!","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2021-12-29","author":"rummil navarro","text":"Be aware of this company. They will use your bank account to buy stuff.i never heard of this company and yet i have 3 transaction with them😤😤😤","title":"Be aware of this company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"},{"date":"2022-01-04","author":"Blu Lanna","text":"I thought I would give it a go but wish I had checked the reviews first. As a seller please just don’t do it, I’ve only been on there two days and sold two items and I got a message this morning saying my account was blocked fourth fraudulent activity. Believe all of these negative reviews on trust pilot and just save yourself the trouble. Now I realise it’s just a scam and they are keeping all of the sellers money. I can’t imagine how much they are making from people, because all they have to do is block your account and you can no longer gain access to the money you made! Fraudulent and disgusting. The worrying thing is they have all of your details, your name, your address, your bank info so literally they can do anything! I’m going to get in touch with the citizens advice bureau and I advise everyone to check their credit score after using the vinted app!","title":"Simply avoid it.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=4&stars=1&stars=2&stars=3"}]