[{"date":"2021-04-16","author":"Julie Crook","text":"Reluctantly gave one star. Disgusting appalling company if they even exist!! No protection no follow up no means of being contactable and allowing’buyers’ to basically steal your items. An absolute sham!!","title":"Reluctantly gave one star","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-04-18","author":"Αλέξανδρος Φαρσάρης","text":"Absolute disgrace of a website. Awful seller support and protection, perfect website for scammers. I wish I could rate it less than 1 star","title":"Absolute disgrace of a website","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-04-19","author":"Maija Cingule","text":"DO NOT GET FOOLED by Alberto1719. Real name Albert Jimenez, living in La Penne-sur-Huveaune, boulevard Voltaire 164. It started when I saw pink Versace bikini in his dressing for a good price, as this person has mostly good feedbacks I bought it. When I received a parcel, I confirmed the sale, I did not check the bikini closer, because this seller was with good feedbacks, of course. When I arrived home and tried this bikini, it was too small for me, it already appeared strange for me, because I am always size S with Versace. So, I was thinking, no problem, I will resell it, I put it for resale and immediately I got a notification that it is fake, so, I was really surprised, I started to inspect it closer, I found the real ones in google from official shops to compare the photos and, of course, the I realized that it is fake, poor sewing, no CLG codes. So, I contacted alberto1719 and asked why did he sell me fake, that it is not permitted to sale fakes, I sent him all photos to compare the bikini I bought from him with the screenshots from real ones. And then alberto1719 started lying. he told that he bought this bikini in Italy 2 years ago as a real one, so, 2 years ago this model even did not exist at all, he was lying 100%. Then he told that he will send me a bill, so I was skeptical, I told him that anybody can make a fake bill with a PDF corrector, but ok, please, send me. He never sent me a bill, he blocked me. So, I added a bad feedback. After adding a bad feedback alberto1719 unblocked me and said that he can \"buy back\" this bikini from me if I delete a feedback, so we agreed and I deleted feedback, added this bikini in my dressing without any brand, simply as pink bikini, he bought it. I packed a bikini, made photos of parcel and sent it to him. And what happened? Bikini arrived in the pick-up point alberto1719 chose. I wrote a message to him and told that bikini has arrived, no reaction, at the same time he was online every day. So one week passed and when alberto1719 got an automatic positive feedback (as I had deleted my bad feedback) from vinted, he immediately started lying again, he opened a case that he did not receive a parcel (vinted explained him that parcel is waiting at the pick up point for him). Do you think he went to pick up it? No. He just wrote me some stories in his style, first that he did not know where the parcel is, after that he will pick up immediately and after some hours that he simply could not go to the pick up point. At the same time I see new feedbacks in his profile, he is definitely going to the pick up points to pick up or to send other parcels, but he is refusing to pick up a parcel with bikini. A different version each time. Now I see, the plan of this person was just to tell me that will buy back the fake bikini to avoid a bad feedback and never pick up it. And now this scammer blocked me again. I already reported him to the police. DO NOT BUY FROM THIS PERSON, SELLING 100% FAKES AND SCAMMING PEOPLE.","title":"Alberto1719 (Albert Jimenez) selling fakes, scammer.","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-04-21","author":"Marlene Brown","text":"Parcel canceled by seller money took then put back in in then they took from bank account again i contact bank told to contact vinted  give me run around basically took 12 pound of my money","title":"Taking money from bank","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-04-22","author":"Ruxandra Ioana","text":"Horrible customer service. \nThis is the second time around I have this problem ( I know, I should know better than to buy from this s***y platform). \nAgain, I have stumbled upon a fake product ( ‘Chanel’ sunglasses this time). Contacted the seller. No response. Contacted the so called “customer service” with proof of the sunglasses being fake. Their answer ? I should send the product back to the seller (on my expense) and once the seller confirms having them back, I get reimbursed. \nAre these people encouraging fake products on the market ? Of course ! \nThey don’t even look at your input and just decide what’s best for them. \nNow I ask, why do we pay the buyer protection fee ? 🤔\nNevertheless, it’s a HORRIBLE site","title":"Horrible customer service and no care for fake products","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-04-28","author":"CR","text":"AVOID VINTED\nVery risky, the seller can ship whatevet he wants and you have no proof and n option.\nClient service does not exist, it is a robot, completely inefficient. You pay for an insurance which never applies.\nI closed my account and will never go back","title":"AVOID VINTED","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-04-28","author":"Laura ","text":"What is the Customer Service number? There is no Customer Care and Help Page is useless! You don't build a service without customer care....","title":"Customer Service: 0","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-04-29","author":"Jing","text":"VINTED IS A THIEF! AVOID AVOID! A BIG SCAM!! This company is a thief!! it’s already a month since seller refunded me . sent all proof to Vinted that refund never received in my bank it’s 2 transactions cost over £500 until now they keep saying payment provider stil investigating! it seems there’s no resolution for my case. After messaging them for an update saying same thing.  You paid buyer protection as a buyer but Vinted will be the one to scam you. This company getting broke that’s why they’re  robbing you from the refund process! You may probably have few successeful transactions but wait until Vinted  decide to rob you . Too many fakes on Vinted! This site has no authenticators online to regularly check counterfeit items if you bought fake they’ll also blame you for not asking receipts or more pictures when open a case. Now I am looking where to take this further so I can get my money back. It will be a long fight!","title":"VINTED IS A THIEF! AVOID","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-05-02","author":"JOO","text":"Ok if seller \/ buyer is honest, but woe betide you if anything goes wrong! Take your money for protection (just like the Mafia) but you can't make a claim for refund after two days of the SELLER marking as dispatched! This is despite the fact that Vinted themselves say delivery usually takes between 2 and five days to arrive!! How then are you supposed to claim when you haven't even received your item yet???\nDefinitely scamming and taking a cut as a protection racket - should be investigated!","title":"Ok if seller \/ buyer is honest but don't expect anything back for your protection money!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-05-02","author":"CC","text":"Vinted dont give a fu*k about sellers, it's run by pieces of s*it frankly so honestly close your account with them and sell on shpock, depop, ebay anywhere else that's not Vinted cause they suck. Once my last item has gone through I'm dumping this trash app 😂","title":"Vinted dont give a fu*k about sellers","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-05-03","author":"Debs","text":"They have double and triple charged me and sent through charges I never authorized. No reply when contacting customer service. They need to be shut down!","title":"They have double and triple charged me…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-05-03","author":"Robin","text":"I think Vinted is pretty neat in some ways, but definitely has some issues to work on. I love the fact that it helps you with shipping so that you don't have to do it yourself. Personally it saves me a lot of trouble. I also think that the way the site works overall is pretty good.\n\nOne big issue I have though is that Vinted feels the needs to automatically cancel an order if there aren't any shipment updates within 4 days. This creates a huge issue. \n\nDon't get me wrong, most shipping carrier companies have tickets that only last about 5 days (after which you can not use those anymore for shipping), I don't have an issue with that. Vinted has a holiday mode in case you don't want anyone to buy stuff while you are unable to ship anything for a few days.\n\nThe issue comes when carriers like MondialRelay or DPD fail to update their tracking. (Usually for about 2 days). Vinted does absolutely nothing to help the seller or the customer out in this case. If you shipped an item worth 50 bucks 3 days after you sold the item, and the tracking doesn't update for another 2 days, the order is just cancelled. Nothing you can do about it. Obviously the sollution is to just ship the item earlier, but it honestly is a horrible policy and I wish they would change it. It'd safe a lot of stress.\n\nThere is also the fact that Vinted charges you before an order is confirmed, and if the order is cancelled it takes a while before you can get your money back. Sometimes people even get charged multiple times. And customer service is basically none existent. If your question isn't among their basic issues, you can't contact them properly.\n\nThese aren't huge problems, but feel like things that could be avoided with a little more care and thought.","title":"It's not bad, but not perfect either.","stars":3,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-05-06","author":"Mrs allyson raison","text":"Vinted are they taking money transactions not authorised ringing fraud squad","title":"Vinted are they taking money…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-05-07","author":"Donna Mitchell","text":"Absolutely shocking customer service, I am a buyer who like many others have had duplicate payments . Margarita in customer service told me it was for something else I’d bought and that she’d “ she me around “ \nI am beyond shocked that they can’t even be bothered to investigate when you provide them with all the details.\nSurely they can also see your account and the things you have purchased.\nThis company needs a audit on what they are doing with everyone’s duplicate payments !!!!","title":"BEWARE TAKE UNAUTHORISED PAYMENTS","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-05-11","author":"Scott Humphris","text":"Avoid at all costs! Their referral program is a complete scam! I signed up with a relatives referral link and posted a number of items for sale. They did not receive the referral money and when we challenged them on it they accused us of having multiple accounts. A fabricated lie to excuse them from their referral promise. Shocking customer service. 1 star is too good for them!","title":"Avoid at all costs","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-05-11","author":"türkan yıldız","text":"I sold 2 burbery bags. The buyer suggested to me make them a lot for économise the shippment fee. I did. She bought them and when she recieved them she signals, the bag were fake! I have the receipt and send it to buyer and vinted. But no answer! She has only 2 comments. (she bough an items which is only around 2 euros) I already sold more than 40 items and never accused for selling fake items. The biggest problem is clearly Vinted that doesn't take responsibility even I didn't receive any answer. Don't sell on vinted specially the lux items. U r going to lose ur time and money... I fed up and never sell again on vinted.","title":"Arnaque\/ vinted doesn't take any responsibility","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-05-13","author":"Michelle?s Clay","text":"I had been waiting for a refund from 04\/04 . Vinted gave constant excuses as to why they had not issued the refund. ‘We are investigating’ ‘we are trying to find a solution’ ‘we are contacting our bank ‘ all rubbish ! Customer service is shocking !!!\nFinally received the refund on 04\/05 when they also took another 2 unauthorised payments from my account  for the same amount. I am now back to trying to get another refund ! \nI did wonder how they could make money have no fee selling . Obviously they are taking money from people’s bank accounts. \nHave reported to my bank and watchdog . \nHow can they be advertising on TV with this kind of service !!","title":"I had been waiting for a refund from…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-05-14","author":"Louise Smith","text":"In my experience the buying and selling community on the whole are sound.\nCustomer service is absolutely, breath-takingly shocking. Words fail me. In short, they have lost an item in transet and reimbursed the buyer. They have sent both me and the buyer countless contradictory messages - ranging from it was being returned to my home address as the original intended delivery depot was closed, or it was delivered to another depot and on it goes. They even suggested that the buyer received the item (despite the fact that Vinted wrote to both of us to say it they had cancelled the transaction). \nI have written to them 17 times concerning this missing item.\n\nVinted are a morally bankrupt and a corrupt outfit. I am unable to get an address for head office. There are so many similarly bad reviews for Vinted here on trust pilot. I am going to contact every news outlet and documentary maker to suggest that Vinted and their shannanigans is ripe for good investigative journalism.\nSo beware. If anything goes wrong with a transaction, Vinted customer services will simply lie to you.","title":"Shocking Customer Service","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-05-15","author":"Aneta K","text":"I wish I could give them 0* !!!!\nHaven't open the Vinted app for couple of weeks. Then when try to log in shows to install new app, ok, no problem... but then in the new app all my reviews and money from the wallet just disappeared!!! Customer service doesn't give a s**t saying that they can't see any money on my account so that's mean I did withdraw alredy!!! All my reviews disappeared also so what I took them with money?!\nDO NOT USE THIS SH^T!!!","title":"I wish I could give them 0* !!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"},{"date":"2021-05-16","author":"Anonymous ","text":"If I could give them 0 stars I would. AVOID!!!!! Thieves. I put my card details in twice after a ‘technical’ glitch. They took two payments without confirming I had bought the item. So I paid £22.40 for nothing. SHOCKING!!!! They are very casual in their customer response promising a refund in 5-14 days. After reading the stories below there are clearly issues that suit them. Reporting them.","title":"If I could give them 0 stars I would","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=8&stars=1&stars=2&stars=3"}]