[{"date":"2021-03-03","author":"Clacou","text":"Vinted a supprimé l’article que je vendais sans aucune explication au bout de 2 minutes.","title":"Vinted a supprimé l’article que je…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-03-05","author":"roberto ando","text":"Unfortunately the customer service management doesn't really follow their same rules, I have been cheated by a seller who sent me a fake branded Fred Perry polo and although I could proof it, they purposely ignored my clear pictures showing those proofs, so be careful as is plenty of cheaters users and is not convenient to purchase at the end you have to thrown  away the purchase","title":"Vinted doesn't protect from cheaters","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-03-07","author":"Beverley Hadley","text":"Item never arrived after 3 weeks\nSo vinted refunded me,\nAnother 2 weeks passed when the item was delivered,\nIn the meantime I was called a thief & a scammer!!\nSo I blocked her, vinted have now blocked me, because I got a refund ????? Now I have to pay the seller £5 before I’m allowed back on, the seller has awful feedback, but she can still sell & buy!!!!!   Terrible customer service & very rude workers!!!\nNeed to learn some manners!!!","title":"Item never arrived after 3 weeks","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-03-08","author":"Stefano","text":"Absolutely horrible. Selling there makes you exposed to scams and they don't protect you. We sold an item, the buyer wasn't happy for futile reasons. She opened a complain and she was allowed a full refund without return of the item. Basically an authorized theft.","title":"Absolutely horrible","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-03-17","author":"Sophie","text":"Joined the app, started uploading a few of my old clothes and accessories, including a few £2 friendship bracelets I'd made years ago that I had never worn and no longer wanted. The next morning I log into my account to find it is permanently blocked, with no warning, never to be unblocked and preventing me from making another account. They said I was on the app for commercial purposes (untrue) looking to make a steady income (untrue). I explained my situation to customer services, that I had probably had an honest misunderstanding about what I could sell, and that I would remove the bracelets. I was only on there, after all, to sell a few old clothes and accessories for under £10 each. I then get another notice saying I was trying to sell counterfeit goods (???). Customer service tells me they won't unblock my account, I will never be able to rejoin the app using another account, and thank me for my time with them, (all of about 15 hours). After politely and honestly explaining my situation, the treatment I received was disgraceful. After giving the app a chance, I will absolutely be sticking to Depop and eBay, and will be telling everyone I know about the farce that is Vinted. Do not join it - it is a complete waste of time.","title":"AVOID! Complete waste of time. Terrible customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-03-18","author":"Silvia M.","text":"terrible experience.\nThe idea is good but the execution is terrible.\nCustomer service disappears when you need them, they block your profile for no reason and you have no chance to delete your profile once it is blocked.\nZero compliance to GDPR, even if you block my profile I still have the right as a user to delete my profile myself.\nI really thought the negative reviews were exagerated but honestly I went through it and it sucks.\nHope a different better platform comes soon.","title":"terrible experience.","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-03-19","author":"Simran Dhanjal","text":"Absolutely worst customer service I’ve ever experienced. Not sure how it can take 6 weeks to resolve something so simple which would never have been resolved if I didn’t keep pushing almost every day to your team. Never using your app again to sell stuff. Tip- you should really look into seller protection. It’s important? If things go missing or parcels are opened and damaged or even worse STOLEN like mine, how can this not be covered if a seller fully packages these items carefully? Will be posting my honest views on social media as no one should have to go through the same experience I did.","title":"Absolutely the worst app and customer service. Do not use.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-03-22","author":"Poppy Lily","text":"This company is the worst. They have shut down their app and website with absolutely no warning to users. What an absolutely appalling way to run a business! I have outstanding orders, currently, and no way of contacting customer services. Just imagine if eBay did this! Vinted are utter cowboys. Their customer services department is bad enough at the best of times, plus, some of their policies break UK selling laws, but this time they have outdone themselves.","title":"This company is the worst","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-03-23","author":"OLIVIER DIKSA","text":"(vinted arnaque\/ scam) très mauvaise expérience en tant que vendeur, j'ai envoyé un article que j'ai pris la peine de bien emballer pour éviter la casse, l'acheteur reçoit le colis soit-disant cassé, en regardant la photo envoyée par l'acheteur, je constate que la montre ne correspond pas à celle que j'ai envoyée celle étant prise en photo étant plus usée et sale, alors que la mienne était propre et sans signe d'usure. certains petit malin pour pas dire escrocs on compris l'astuce pour se faire rembourser leur achat. résultat le support a donné raison à l'acheteur sans vérifier mes photos et comparer avec celles de l'acheteur, ils ont aussi décrété que mon colis n'était pas protégé, en gros je perd 90€ . vendeurs attentions vous serez toujours perdant en cas de litige avec vinted qui et juste bon à collecter des commission et surtout ne pas régler les problèmes . je vous déconseille les objets de valeur, vous aurez que vos yeux pour pleurer.\nje vais porter plainte pour cette supercherie lamentable faites de même si cela vous arrive .\n\nvinted =arnaque= scam\n\n\n\n\n(vinted scam \/ scam) very bad experience as a seller, I sent an item which I took the trouble to pack well to avoid breakage, the buyer receives the supposedly broken package, looking at the photo sent by the buyer, I see that the watch does not correspond to the one I sent the one being photographed being more worn and dirty, while mine was clean and without signs of wear. some smart, not to say crooks, understood the trick to get reimbursed for their purchase. As a result, the support ruled in favor of the buyer without checking my photos and comparing them with those of the buyer, they also decreed that my package was not protected, basically I lose 90 €. sellers attentions you will always be the loser in the event of a dispute with vinted who and just good at collecting commission and above all not solving the problems. I advise against valuables, you will only have your eyes to cry on.\nI will file a complaint for this dismal deception, do the same if it happens to you.","title":"attention en tant que vendeur vous avez tout à perdre! (vinted arnaque! vinted scam)","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-03-23","author":"anne","text":"Terrible experience to sell homeware. Items are deleted with no justification even though they are compliant with their policy, complete waste of time.","title":"Terrible experience to sell homeware","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-03-29","author":"Amy ","text":"Terrible experience! Always deleted my post and cannot get any help. Worst app !","title":"Terrible experience","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-04-01","author":"Connie","text":"I have been using this site for years, and honestly I've had no complaints. However due to their new website reshuffle, everything has been deleted. Everything. That includes all the emails, all your favourites, anything you had listed, and most importantly, any money you had in your balance or pending sales waiting to go through. The only way it appears that you can retrieve any of this, is if you have the app on your phone already. You can proceed to move things over slowly, however if you have open orders it seems you have to wait until they're completed until they can do anything. It's all incredibly unclear, a giant mess and it seems like a lot of sellers money has disappeared. Once I've completed this last transaction, and hopefully received my money, I expect that I'll be closing my account. I've been a faithful user for years, and this is how they treat us. A giant mess, and I'm honestly disgusted.","title":"A giant mess, and I'm honestly disgusted.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-04-02","author":"Qiancheng Meng","text":"Not a healthy market to sell or buy clothes.\nEveryone sells cheaply, force you to reduce the prices low, and the app takes buyer protection fee, yet when I reported the counterfeit Timberland boots bought with tons of photo proofs of how poor quality they are, the Vinted team still judged the seller right, and Vinted team Nourhene wrote to me  why dont I resell it to others, I cant believe they said that, as it's Vinted's first policy no counterfeit! It just nothing proper or well protected if you are a buyer like ebay.\n\nPlus, this is the only app on my phone, if I used it for 20mins, it will consume 20% iphone battery, and makes my phone very hot too, and very slow app often.","title":"Not a healthy market to sell or buy…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-04-02","author":"treasurer","text":"There are many of counterfeit articles on Vinted, you recognize them \"easily enough\" they are at a-too-low-price but stuill too high to play with your money, and the condition is not good, such as this one vinted 986330519-pull-chanel sold on CC Métiers d'Art for 4100eur and now at 1300eur \"worn once\" a fake! be careful","title":"Counterfeit articles on Vinted, plenty","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-04-04","author":"Valentina Fontana","text":"Strano, dopo 3 settimane, (18 giorni) il bonifico non è mai arrivato, ma quello che l'acquirente ha comprato è arrivato in Francia in 3 giorni.\nMai visto un sito che prima spedisci il pacco e poi ti viene fatto il bonifico. Non mi piace, non lo userò più.\n\nIt's just weird, after 3 weeks (18days) the transfer never arrived, but what the purchaser bought from me arrived in France in 3 days. Never saw an app\/site that wants you to send the package before the transfer arrive to your bank account. I don't like it and I'll never use it again.","title":"Pessimo","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-04-06","author":"Belle Pulchra ","text":"I have never seen such a problematic platform upgrade. My account was transferred to the new vinted platform on 1st April and today 6th April, my balance from buyers payments and customers reviews still have not been transferred to the new platform.","title":"I have never seen such a problematic…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-04-06","author":"mr Diagonal","text":"A bunch of crooks.\nCustomer service is non-existence. \nMy account is blocked (and hence the money on my Vinted account) despite numerous emails.\nAvoid at all costs!","title":"A bunch of crooks.","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-04-07","author":"paolo","text":"they have serious problems.  continue to hide two of my items, namely the pricetown slippers by gucci with the fur which is nothing more than sheep's hair.  it might suit me everyone has his own rules.  the problem is that there are hundreds of other users who sell the same shoes I don't understand the concern for my dangers.  when one of the team finally replies he tells me republish the ad because it was a mistake.  I do it and again it gets hidden.  I do not understand why this persistence when there are other users who sell them.  today they told me to report these users.  but why should I do this job when it was automatic with me and then there are hundreds of similar ads and I should be doing I'm flapping.  I am so sorry I have spent 30 euros to highlight my wardrobe otherwise I would have already canceled.  there are always problems.  account that is blacked out for no reason.  people who write to me because they can't buy for I don't know what reason.  a disaster","title":"they have serious problems","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-04-15","author":"Oslyn","text":"I am trying to find any sort of contact for Vinted I can’t find a email address or a phone number or an address","title":"I am trying to find any sort of contact…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"},{"date":"2021-04-15","author":"domikopi","text":"I am really disappointed with this app and suspect this could be a scam company! Everything was fine until I sold one of my items; then, I was required to submit a proof of ID - passport or driving license! Mind you: To sell stupid clothes! Who would have thought? So I send them the photo of my passport; I've blurred out the passport number (for obvious reasons) and I get a notification that my identification was unsuccessful. OK then... I reluctantly submit the original photo (nothing blurred out), good resolution and they almost immediately reject this proof of identity too!!! I am starting to think they are doing this on purpose in order to avoid paying me MY money! Not only that; apparently, you have to wait up to 7 days (!) for the money to arrive into my account- if this was a legitimate company, I would expect the money to arrive within 48 hrs. Plus, I keep getting random emails in French from them all the the time when I am based in the UK... I have to say I really regret opening an account with them. If I do not get my money within 7 days as promised, I will be calling the police to see if they can help my get my money back. All this stress is not worth it...","title":"Suspected scam company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vinted.fr?page=9&stars=1&stars=2&stars=3"}]