[{"date":"2020-09-19","author":"GS","text":"I would give 0 stars if I could - I bought an item from them, then when I tried to resell it later it was declared counterfeit??? I now have to wire them 12 euros to get my package back in 3 weeks.","title":"I would give 0 stars if I could","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-19","author":"Maria","text":"I sold an item at VC 11555535 and afterwards understood that I had made a mistake, as I sold a jacket from my sister, thinking it was mine. I checked online on their terms and conditions that I was allowed to cancel the sale by law, as their terms and conditions do not stop me from doing so. Althought this is a very silly mistake, and of course it is my own fault, which I entirely assume, I can request this, so, they would need to process it by law. Nevertheless, when I contacted VC, I was told that technically it was not possible, as the item was already on their warehouse, so technically was not mine. But, in reality, I was not paid and the item had not been shipped to the buyer anyway. How come that they create a system that they cannot fulfil themselves. It was indeed my fault, but if the system allows me to cancel the sale, for sure, they need to allow that to happen. Otherwise, the system is unreliable and I can sue them and seek compensation. It seems that the whole process is very automatic and they have no control over it.","title":"I sold an item at VC 11555535 and…","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-19","author":"Charlotte","text":"The worst customer service that I’ve ever experienced in my life. 100% do not recommend buying from them.","title":"The worst customer service that I’ve…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-19","author":"Flora kwan","text":"Bad service, process case super slow \nmy bag bought from UK, VS team no ask me give proof of information then said unable to verify authentic.\nOk, I paid delivery fee for my bag return, I gave proof of payment to VS team, but no one updates my bag, only say payment team will check and shipping within 14 days, model answer, no one to check, super bad service! I receive my bag then cut the service!!!!","title":"Bad service","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-19","author":"Ruby Tuesday","text":"PLEASE BE CAREFUL \nPlease be aware that vestiaire collection does not authentic properly I’ve seen so many fake pieces circling on there it’s embarrassing and quite frankly disgusting do not trust them to authenticate items please make sure you do it yourself. I’ve seen fake Dior sneakers and fake realisation pieces on there. I messaged a girl telling her that her dress was fake after comparing it with my real one. Very bad","title":"PLEASE BE CAREFUL","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-19","author":"Anna Belsky","text":"I really wish there was a bigger competing site in Europe.. their practices and customer service is terrible... the reviewers clearly have no experience with luxury goods and their customer service team is down right rude.. stay away and use other sites such as  Joli Closet.. they are so much more pleasant to deal with","title":"Horrific Customer Service","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-20","author":"Brook","text":"I paid extra to have my order checked and authenticated as it could have been sent direct for free. The item passed the checks but when I received it the leather on the straps was rubbed off and the hardwear was scratched. The item was listed as very good and the photographs and description said nothing about the defects. This is against their criteria for very good items which says it must state any defects. I reported this and vestiare offered me free shipping. On a designer bag this is simply not good enough if I wanted this repaired it would cost over £100. Their customer service team is terrible at communicating and they said all they could do was offer me this 'code' for free shipping and let the warehouse know to be more vigilant. I would avoid at all costs and shop elsewhere. This was my first time purchasing from them and I will never use the site again.","title":"Avoid","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-20","author":"Su","text":"I'll leave this review here but have raised the rating from one to three stars. After leaving this review, VC did act in a way I'd hav expected and actually refunded the £20. I also used the free shipping on my next order. I've now made three purchases and all the items have been as described and delivered from France very quickly.\n\n**Avoid** I've been considering a VC purchase for years and finally bought something yesterday. Before checking out I was offered £20 off my first purchase over £150. This misleading offer stated no terms so I assumed all would be fine. I'd spent an hour finding another item (to make up the total to £150). On checking out, the code was accepted but did nothing. The chat bot directed me to continue through the various checkout procedures and my discount would be taken at the end. Instead, this completed my transaction without a 'confirm your order' page, so my money was taken.\n\nOn complaining about all this faff and paying more than expected, the chat (real people) were useless; first accusing me of trying to use the code on my second order when in fact I'd never ordered before - then suggesting I must be in another country than the UK (I'm in the UK).\n\nOn further complaining by email, it transpires that for the code to work, the purchase price must be for a single item. I've been offered free shipping on my next order. NO THANK YOU! I won't be placing a 'next order'.\n\n-- edit -- \n\nFurther to my previous edit, the sunglasses I purchased have had to be refunded because the seller has said they are no longer for sale. So, I'm left with a handbag I paid £75 which I hadn't planned on buying and should only paid £50 for.","title":"customer service not the best, broken app","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-21","author":"Seller","text":"item sold 1 month ago, item checked into warehouse and accepted, NO PAYMENT. Now I am out of my item that I sold AND $. Contacted customer service via chat TWICE was promised to be contacted within 3 business days, NO SUCH CONTACT. I have been a seller since 2015 selling high ticket items from hermes, celine, Chanel, etc. I’m pulling all of my items off the website immediately!","title":"ITEM SOLD DID NOT GET PAID","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-21","author":"Nicole Alexandra","text":"Absolute disgrace. Their customer service is non existent and will just never reply.\n\nThey listed all my items without pictures and at 100 times the price (no kidding). Tried to get in touch with them, no help whatsoever. Spend your money somewhere else.","title":"No customer service, site will of issues","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-21","author":"G. J.","text":"This is the second (NEGATIVE) review I have written about Vestiaire Colletive. A year ago, I wrote about my first experience on this platform. A bag was advertised, I contacted the seller, I was sent a price-offer and I bought it. After payment was processed, my purchase was confirmed. Shortly afterwards, I received an email claiming that the item was no longer available and my money would be refunded. Pathetic. And dubious. Recently I decided to try a second time. I purchased earrings which the seller would be send directly to me. My Paypal payment went through but no email confirmation arrived from VC. After a week, I contacted Customer Service. I was told that my purchase had gone though. Why didn’t I receive an email about this in the first place? I then wrote back requesting information on when I could expect delivery of my purchase, as the seller had not been in contact, despite me sending her a message via the VC website. Now I have received an email claiming that the purchase will be cancelled because the goods were not delivered within the mandatory 14 days since purchase (still actually have 2 days to go). So my guess is the earrings have long been unavailable for whatever reason or the seller-profile was fake. This company is incapable of running a transparent, honest business. Either the items are suddenly not available after purchase or the seller can’t be contacted and never sends the goods. All of you who have had satisfactory experience with VC, I‘m really happy for you. But I for one will never have anything to do with VC again.","title":"Second NEGATIVE experience with VC","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-22","author":"Katie","text":"I've been a member for ages, and unfortunately felt compelled to tell other potential customers not to get their hopes up. Over the last year I've had six (6!) consecutive orders cancelled after the sale went through – a few times after weeks of waiting and hundreds (sometimes 1000s) of $ being transferred. It is refunded of course, but after waiting, expecting for weeks and weeks, and then suddenly the item is 'not available'. There seems to be no accountability or trust system to actually follow through on a sale. No way to leave a review of the seller or contact them, either. After these multiple bad experiences, I wonder how many of these items are actually for sale, or whether there is something else going on. It's like shopping at an imaginary store. Quite a big waste of time, in my opinion better spent on other sites where you actually receive what you bought! :)","title":"Muliple cancelled sales; no accountability","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-23","author":"Mimizan","text":"Order number 11413847. \n\nDon’t ask me to email you guys. I followed the link you sent me on the below reply but I never received an answer!! I have moved from UAE to UK and updated my profile on Vestiaire. If you sell anything from Uk they have to send you a prepaid label. All my addresses on their app is UK. I even downloaded my items in UK. But after my item was sold they send me a label that I have to pay for shipping. When I told them but I’m shipping from Uk they said yes but there is a system problem. So you have to cancel the sale. For a site that their business is ONLY online and they can’t fix their own fault , it’s unacceptable!! My reference as you asked is 11413847.","title":"I have moved from UAE to UK and updated…","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-23","author":"Katerina NZ","text":"You must think we are daft, right? Regarding item 10968327 \/ 11407218, you owe me money since the 1st of September, you have sent me messages indicating you have made the PayPal transfer, but no money is getting through!!! Does it occur to you that people selling their belongings, might actually NEED the money? Or is it easier for you to keep people's money instead? I don't think that makes for a good business now does it??","title":"You still owe me money!!!!","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-24","author":"Reyume Effa","text":"Never selling anything here again. They do the most...Something as simple as selling a bag should not take a month plus. I am not sure why a buyer would need 14 days to decide if they want to go ahead with a purchase or not. The whole time my item is just sitting in your warehouse collecting dust. very stupid process and even worse customer service team.","title":"Never selling anything here again","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-25","author":"Robbie Clasby","text":"Obviously a pre rental as bits missing, at least it was authentic but very underwhelmed","title":"Finally got the bag of my dreams, albeit half sized. Obviously a pre rental as a lot of bits missing","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-25","author":"SaraG","text":"I just received a fake LV (no code tag) eventhough I paid for VC’s authentication and the bag came with their ‘authentication’ receipt. I’ve contacted them through chat over 6 times and cannot manage to get a receipt to send the bag back.","title":"They sale FAKE products","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-26","author":"Someone who cares!!!","text":"Hi, \nI have been a seller on the website foe xxA while  but never sold anything. I have tried again this days to put an item and I saw on my account than one of my earrings Cartier gold and diamonds have been sold almost a year ago ! Without me knowing and the earrings still with me here !!! \nSo what did they sold !!???? Definitely this doesn’t smell good!!! fake ! fake! fake !!!","title":"Fake!! They sell Fakes!! To people with our pictures!!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-26","author":"Daisy Scaramella","text":"Highly disappointed!\nItems sent to me were undoubtedly not  the items in the photos\/description but they passed anyway the quality check. One pochette Hermes described as red everywhere was actually pink fluo. The seller admitted the mistake and offered me a discount but VC customers service said that the item matched the description so denied the problem. One Chanel pochette described as “new, never worn” has actually a very visible sign of a pen and passed the quality check! Highly NOT RECOMMENDED\n\nThese 2 last problems are not the only ones I had with VC. For example, once the sent me very disgustingly ysl shoes and refused to refund me... I therefore stopped for year buying from them, then I thought that things would have been better but I was wrong!","title":"Highly disappointed!","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"},{"date":"2020-09-26","author":"Daisy Scaramella","text":"Highly disappointed!\nHighly disappointed!\nItems sent to me were undoubtedly not the items in the photos\/description but they passed anyway the quality check. One pochette Hermes described as red everywhere was actually pink fluo. The seller admitted the mistake and offered me a discount but VC customers service said that the item matched the description so denied the problem. One Chanel pochette described as “new, never worn” has actually a very visible sign of a pen and passed the quality check! Highly NOT RECOMMENDED\n\nThese 2 last problems are not the only ones I had with VC. For example, once the sent me very disgustingly ysl shoes and refused to refund me... I therefore stopped for year buying from them, then I thought that things would have been better but I was wrong","title":"Highly disappointed!","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=96&stars=1&stars=2&stars=3"}]