[{"date":"2020-10-29","author":"Simona","text":"UPDATE:\n\norder#: 30620848\n\n\n  12 days after my review on Trustpilot, Vestiaire finally replied to my email. They refused to refund me. They have shifted all the blame on the transporter, who has also denied to take any responsibility for this mess. According to the transporter the bag 'correctly left the warehouse' and the package's weight was on point - even though the delivery man admitted that parcel felt empty to him when picking it up (this conversation between him and the transporting company dispatcher was recorded). \n\n Vestiaire have invited me to file a complaint at the police station and to thereby put on my detective hat and solve this issue by myself somehow. How ridiculous? On Vestiaire's website it clearly states 'all items are insured against theft and accidental damage' and that they 'insure and assume responsibility for all items'. Clearly they do not, as I have been denied a refund. This is false advertising and is illegal. \n\n29\/10\/2020\n\n  A month ago I was naive enough to order a Chloe bag (Drew en cuir) from Vestiaire. Oh boy, do I wish I had come here before making my purchase. It took double the stated amount of time for the bag to arrive and I knew something was wrong. Guess what? The bag finally arrived and well... I GOT AN EMPTY BOX FOR 650 EUROS! Somewhere along the way, someone either opened the box and stole the bag, or it was never put inside the delivery box by the seller in the first place. Either way, this happened 17 days ago and I am still waiting for my money. This is unbelievable. The customer support team have not been helpful at all and keep sending me pre-written phrases and responses and ask me to be patient. Excuse me?! I bought the world's most expensive empty box due to your unprofessionalism and you are asking me to be patient?","title":"I PAID 650 EUROS FOR AN EMPTY BOX!","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-10-29","author":"Louise","text":"fake fake fake \n\ndon't but from this app i bought shoes that turned out to be fakes don't rely on authentication from them either it's all nonsense... i don't know how they even let these leave the vc office and approved them for authentication it's disgusting \n\nthe fendi sign was falling to bits and looked glued on and the pattern on both shoes where ridiculously different \n\nplease be aware of this company they'll take your money and make it so hard for you to get refunded \n\nreference 7619596","title":"fake fake fake","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-10-30","author":"נועה שמר","text":"Hi,I sold a very expensive item and it got returned to me. \nDHL sent me a photo of the item being delivered but, it wasn’t my building or my actual apartment and he just left it there although he needed to get my signature.\nI am trying to contact vestire with no success.\nIt is a very expensive parcel that DHL just lost because they weren’t following the rules.\nHow can I make a complaint\/ demand vestire to open an investigation and redound for the missing parcel?","title":"Hi,I sold a very expensive item and it…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-10-30","author":"Susan Stevenson","text":"I lost my trusted seller  status for no reason. On a previous sale I had deleted a listing by mistake and I was told by their customer support to relist it. \nI sent it to the same customer again and it remained on my account as not sent. \nI sent an Asprey watch and in my listing\nI said it had a NEW STRAP in my listing. \nWhen their “authentication” received \nthe watch they wanted to reduce the price because they said it wasn’t the original strap and it was scratched! It was no way scratched and I tried to explain to customer service about the item which was resent. I should not have lost my trusted seller status.","title":"I lost my trusted seller  status for no…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-10-31","author":"A non","text":"There is simply no competent Customer services team to talk to in real time. In this day and age where chat bots are available that is just wrong. The online chat functionality is filled with people who don't respond and are not accountable enough to respond with meaningful answers. In a day where ebay and so many others have got it nearly right I don't understand how Vestiare have got it SO wrong when it comes to Customer services. It has taken me 10 days to get a response for my authentication even though they had the items in their presence and their response (via email) does not even paint for me half the picture of my item.","title":"There is simply no competent Customer…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-10-31","author":"Fiona Foster","text":"If you're looking for bags from brands that don't usually have a lot of fake, this is an exceptional website to check out. However, everything else is very risky, especially shoes, so be prepared to waste\/lose your money. \n\nAlso, customer service for smaller queries are actually very good through the app, I've found, but if you have greater concerns, you will most likely be left very dissatisfied.","title":"ok-ish","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-10-31","author":"Amy K","text":"Pros: two stars for having a HUGE inventory which is handy for research if you are hunting something down, and a decent email response when you need help (I agree with another reviewer who said you may not like what they put in the response though). \nCons: there is so much wrong with Vestiaire's site and app. There is a LOT of poor condition stuff and high street brands that stretch the \"designer\" definition to inconceivable limits. After getting burned on one purchase (the seller listed it as VG, it was fair at best) I use it purely for research and then go hunt down an item on another marketplace. There is no system for reviewing sellers and comments put under a product (like when someone asks a question) vanish a few weeks after appearing so helpful info gets lost. You've no way of knowing how many times an item has been bought and sold again as they just re-use the same photos. Sellers are not obliged to respond to questions and there's no action taken against them if they falsely represent the condition of an item. The site is buggy - the favourites and wishlist function especially bad (when you remove something it keeps sending you price reduction emails anyway and you can't find a way to turn them off - even several months after removing!). Which leads me to their awful unsubscribe options and lack of a clear data protection officer to contact on their unbsubscribe page. In an attempt to stop the phantom price alerts I tried unsubscribing from everything - when I next logged into the app it had subscribed me again! Epic fail for GDPR compliance there. Finally, the app is extremely buggy on Android. After a few minutes browsing you get a \"no internet connection\" error. I ended up switching between data and wifi as doing so seemed to trigger it to reconnect again. \nConclusion: Avoid, avoid, avoid, avoid...","title":"Don't bother","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-11-01","author":"monica","text":"horrible costumer service. If you have a problem with a product and you want to return it  they simply DO NOT REPLY.\nI would seriously not advise to order anything from them.","title":"horrible costumer service","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-11-02","author":"SS","text":"They try any opportunity to cheat you out of earning commission. They calculate the wrong commission and when you try to speak with customer service, their representatives are awful and condescending. Will NEVER shop or sell with VC ever again....","title":"They try any opportunity to cheat you…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-11-02","author":"Andrea Egan","text":"I am disgusted with Vestaire CollectiveI have sold 6 items in the last few weeks and have NOT received my money.They say they paid me 2 weeks ago and I have received nothing.I have contacted them and they say its a technical issue with me bank.I have contacted my bank and there is no issue.They never contact me and I have contacted them every day for a week and am getting no where.Horrendous experience.Inwill never use them again and will tell my friends the same","title":"I am disgusted with Vestaire…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-11-02","author":"GDP","text":"The commission percentages (in USD) on the VC site are not correct. As a seller you pay a commission percentage (in EUR) that is higher.\nThe goods you sell are not authenticated by VC. As a seller you receive a shipping document with the buyer as direct receiver.\nVC accepts fake photos sent by the buyer as proof for canceling the sale and “rewards” the seller by taking away his badge as trusted seller.\nThink twice, is my advice, before you decide to be a seller on the VC site. I no longer am.","title":"SELLER WARNING","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-11-02","author":"Victoria Diaz","text":"Well it happens again - as a seller I do not get paid in time.\nI've sold an item on Oct 6 and VC does not process my payment. It's now new as it has happened before.\nI've sold the order number 11674543 (an Acne Studios Cardigan). The buyer by mistake (probably) mentioned that there's a problem with my cardigan. Then later the buyer sent me a message that it has been a miss-understanding, that she loves the cardigan and she will keep it.\nThe buyer never sent the cardigan back (as VC told me).\nThe buyer kept the cardigan, and the buyer is super happy about the purchase (the buyer told me so via message).\nI contacted VC's customer service about this payment issue and they told me \"we'll contact you in 3 days). Well almost 2 weeks have passed an NOBODY contacted me. VC's customer service is inexistent, arrogant and useless. To talk to them is like talking to a robot or a wall. Even to talk to a wall could be more rewarding since their agents are very arrogant making the experience very unpleasant. They made me feel like selling bad things (when the true shows that the buyer is very happy with the purchase).\nThis is not the only product it hasn't been paid. There are 6 more products that hasn't been paid yet. I wrote all the codes.\nTo write vis trust pilot is more effective than contacting their arrogant stuff via chat as they only answer you one thing \"we'll send you and email\". It doesn't matter the question or the problem you have, the only answer is: \"we'll send an email\". They never do, or the mail you get from them is merely a technical description of your chat with them. No solution. My problem is genuine. VC exists thanks sellers that create content and they make everything very difficult for sellers. Yes, you can sell some items but it takes a lot of time, nerves and patience. Other secondhand platforms are far more \"human\" with sellers than VC. They seem to hate sellers.","title":"VC don't pay to sellers","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-11-03","author":"Ms WINNIE","text":"Updated 18 Nov 2020\nReceived the money finally\n\nUpdated on 7 Nov 2020\nI haven’t received any reply via email these few days, So I tried to contact VC by chat on 5 Nov, they have no reply for the payment, their reply’s is waiting ONLY!  They haven’t solve the problem, no payment and keep my clutch😔\n\n Reference no. 11902935 Goyard Clutch\n\nThis clutch bag had been sold on 19 Oct 2020.  VC had received it on 20 Oct and declared conform in 22 Oct 2020, however, VC didn’t give me a payment date and not complete the payment till now.  I wrote to them but their reply shocked me!!! VC replied that the buyer gave them a wrong address so they couldn’t send the clutch out and they couldn’t pay me until the goods has shipped out!  But it’s 12 days and VC never update me the status, although I sent them an emails....\n\nBelow is their reply:\nBart B (Support Vestiaire Collective)\n29 Oct 2020, 01:48 GMT\n\nDear Member,\n\nThank you for reaching out. I hope you are doing well.\n\nThe payment for your Goyard clutch bag #11902935 will be issued after we have shipped the item to the buyer. \n\nWe have not shipped it yet, because there is a problem with the buyer's delivery address. We have already asked the buyer to modify it.\n\nHave a great day.\nKind regards,\n\nBart for Vestiaire Collective\n\nI hope that VC can solve the problem immediately. Pay me Or send me back the clutch ASAP!!","title":"Reference no 11902935","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-11-03","author":"Kayla Lemire","text":"Horrible!!!\nI ordered a bag, it took well over two weeks to even send it. The seller wouldn’t answer, the customer service was frustrating, they couldn’t do anything I just had to wait. \nDon’t buy from them it’s such a miserable experience.\nGreat lack of professionalism & organization.\n\nShame on them","title":"Horrible!!!","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-11-04","author":"Mia Kahlo","text":"I bought shoes and I also paid for VC authenticity check (their “experts” should ensure that items are according to sellers description and authentic). Fast forward, I received shoes that had two different chains on them , thus, were not according to sellers description as seller never mentioned this nor did seller add a picture showing shoe to shoe comparison highlighting  the difference .\n\nI’ve spent two months texting back and forth with VC service and they could not explain why they think shoes are according to the sellers description despite the fact that seller nowhere mentioned that chain on one of the shoes is not original . Note we are taking about shoes that cost 400eur plus !!!!! \n\nVC was unable to reason their decision and I was left with a faulty item. \n\nBasically the business model is scamming buyers and protecting scam sellers. DO NOT BUY HERE NOT WORTH THE HASSLE. Zero service and super rude.","title":"SCAM SITE SELLING FAULTY ITEMS . VC expert check is also a scam !!!!","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-11-04","author":"Ms. Marquez","text":"Awful customer service - I placed and paid for an order, then two days later was told it was cancelled. I contacted customer service who apologised and said it was an error and they would fix it, my order would not be cancelled and someone would be in touch via email to remedy it.  Days went by I heard nothing and I contacted customer service again, only to be told the same thing. More time passed, still no email, so I contacted customer service a third time, this time to be told that my order had been sold to another buyer!  They offered me free shipping as an apology, but that is not nearly enough to make up for lying to me for a week and trying to cover up for their mistakes.  I will never use this service again and am deleting my account. Buyers beware - because my refund for the order still has not come through, so I've paid for an order I will never receive, and I was blatantly lied to by multiple agents.","title":"Awful customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-11-04","author":"Olena","text":"Dear all, \nToday was for me the last straw. \nI have been seller and buyer with vestiaire for a few years. \nI am expert seller and ship my items within 24 hours. \nAbout two month ago I sold Stella McCartney top , reference: 4547154, buyer chose direct shipping, I posted the item the same day it was purchased, only to find out when ups tried to deliver it, address was incorrect. After numerous chats with customer service of vestiaire, two weeks later buyer managed to update correct address.\nThis Saturday I sold Gucci jacket reference: 11670075, when I printed the label I realised the offer was sent from Romanian account holder but shipping label stated address in Germany . I posted the item on Monday, only to log in today to check , that item was supposed to be delivered today but ups states incorrect address or missing information. So I contacted vestiaire customer service, I had no clear answer how come they don’t verify addresses or customers. \nSo now my jacket is in Germany in a limbo without clear indication what will happen now.\nVestiaire leaves sellers in a bad position and open to fraud. \nIf I could give zero star I would , that’s after years of spending thousands with them and never had returned items!\nKeep away.","title":"Direct shipping","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-11-05","author":"masinarosie","text":"I made a bank transfer of 20k for a watch on Oct. 23 and VC is incapable to confirm the payment till now despite all the chats and mails sent. \n\nThe item is marked as sold after a few mails sent but the seller didn’t received the mail for shipping. \n\nI don’t know what’s happening there but this is something new. I bought hundreds of items from VC over the years and everything was ok. \n\nI hope they come back soon because it's a shame to destroy their rating in such a serious way and in such a short time. \n\nI like VC and I wish to continue to trust them.  I will come back here for a rating adjustment in case the situation will be resolved anyway and I will receive a reasonable explanation. But till then, all I can say is... be aware!\n\nUpdate - Nov. 14\nThe third week just passing and still no payment confirmation from VC for 20000 Euro paid on Oct. 23!\n\nUpdate - Nov 20\nAfter many answers from VC telling me to be patient, today I received a mail asking transaction details made (and obviously confirmed by VC) one month ago!!!!","title":"Ref 8862934 - 3 weeks ago 20k Euro payment not confirmed yet","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-11-05","author":"Olena","text":"Dear all , \nI am vestiaire expert seller and a buyer for the past seven years.\nOver the past seven years I bought and sold many items, everything was fine that until they brought direct shipping .\nAll my items are shipped Monday to Friday within 24 hours after the purchase , in many occasions the same day. I had no returns. \nAbout two months ago I sold stella McCartney top ref 4547154 , via direct shipping , address provided on the shipping label was wrong and it took buyer two weeks to update and three weeks for me to get paid, that’s after numerous chats with their useless customer service:\nOn Saturday I sold new Gucci jacket ref : 11670075, offer was sent from Romanian account holder but postage was to Germany, I was sceptical but still shipped the item on Monday morning. \nOnly to find out on Wednesday that ups attempted delivery but address is incorrect and they can’t get hold of the buyer. \nSo I got in touch with vestiaire straight away but told to wait....\nToday Thursday morning I checked ups status: wrong or missing address so I contacted vestiaire and been told I have to wait ; no time scale given and no indication; just wait and if not delivered will be returned to me or if missing I have to open dispute!\nSo not it is very clear , vestiaire allows their sellers to post direct to the buyers without any due diligence, no proof of address , to the different country , not even to country where account held. So it leaves us sellers wide open to be de frauded! \nI had no clear answers from customer service, I asked for email of their managers, apparently they can’t give it. Unfortunately after seven years and spending thousands with them this company shows luck of KYC and any responsibility.\nAvoid!","title":"Direct shipping","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"},{"date":"2020-11-05","author":"Unknown","text":"I have not received payment from VC for over a month after having had my product approved by them and  contacting them twice and being reassured each time that I would receive my payment the following week.","title":"I have not received payment from VC for…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=91&stars=1&stars=2&stars=3"}]