[{"date":"2021-12-18","author":"Anne H","text":"Never shop with this company. The mis-selling  and misrepresenting  is staggering \nI bought a man’s size 50 suit which wouldn’t even fit a female size 10. Cost £580. No refund and huge hassle with appalling Customer Services. Legal action now pending. Grossly negligent.","title":"Utter Fraudsters AVOID","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-19","author":"Martin","text":"Horrible experience.\nI spent a significant amount of time looking for a Christmas present for my wife.\nI chose an item, paid for it, the seller shipped the item to their HQ for inspection which it passed. They said the item would then be sent to me in the UK.\n2 weeks later still no tracking number or confirmation it had been sent to me.\nI contacted customer service who raised a ticket, and informed me their warehouse couldn’t find the item i had already purchased.\nInstead of offering a refund they said they would check with the warehouse again, many days past, came back to say the warehouse still cant find the item.\nI requested a refund via paypal and directly to them. Finally after some days they said they processed it and will take 5 days to refund i.e. not by Christmas.\n\nIt is a shame as their app, and products they sell look good, but let down by their logistics. I have given them my money for the privilege of wasting my time and will have no present that my wife wanted for Christmas due to their shenanigans.\nShame on them!","title":"Lost my item - unprofessional","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-19","author":"Fi","text":"I have experienced quite a few issues with VC, not sure I will be selling on it for much longer.\n\nI once received an item that had clearly been shrunk in the wash (the sleeves were way too short and I had other pieces in the same size from the same brand to compare it to). I was told there was nothing they could do and my only option was to resell on their platform.\n\nI also recently sent an item in great condition, exactly as described. This item is now being sent back to me because apparently it didn't meet the description. However I have not been told WHY it doesn't meet the sellers expectations and have been told this will negatively impact my rating!","title":"I have experienced quite a few issues…","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-20","author":"Petra Mervartová","text":"I want to do my first buy through Vestaire and looking for Givenchy Antigona. Since I am super affraid of being scammed I’ve found quite a lot about authentic Antigona and how it is supposed to look like. During my search for the right one on their site I’ve found clearly fake Antigona - the seller is saying it is brand new and never used, however features of this bag are from old models made before 2015 and also serial number is obviously made up and doesn’t match to authentic ones. Reading all these reviews here how sellers weren’t able to upload their items due to VC inability to authentify their items, it really makes me wonder how they let obviously fake bag being uploaded and of course it doesn’t really convince me to buy something through them…","title":"Givenchy Antigona fake bag","stars":3,"location":"CZ","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-20","author":"cat","text":"New app user here. I made 2 orders with 2 different prepaid Visa gift cards and the payment went through just fine. But then when I tried to make more orders after that, using different prepaid gift cards, I attempted to buy each order multiple times. It would always tell me my order was confirmed and was ready to be shipped by the seller, but would then be canceled and I would be issued a refund. On my end it would say the item has been sold to me and on the sellers end it would say it’s sold. Each time I tried to contact support to ask why it wouldn’t go through they would say “the payment didn’t go through because we detected a security issue and you’ll need to talk to your bank to approve the purchase”. I told them “it’s a gift card it’s not linked with any bank”, and they tell me “if that’s the case then try repurchasing it\/ redownload the app”. I did that and it still didn’t work, I tell them and the team tells me to just use a different payment method. Very frustrating for them to not even attempt to try fixing their system if my cards went through beforehand. It’s definitely a technical issue, and the workers I talked to implied as if I was the problem and it wasn’t their system. I gave as much context as possible each time, the workers aren’t helpful at all, saying that they’d send a follow up email when they don’t know the answers for anything. They proceed to not send the email. Extremely frustrating for me as a buyer and for the sellers too. They don’t care to fix anything and tell you “we would love to help you but unfortunately we aren’t able to” when you challenge them with a reasonable complaint and tell you they’ll send an expert to talk to you and they don’t. Also had lots of bugs, the chat spammed the bots’ default messages when I tried using the “Chat with us” feature to contact support. Had to wait for an hour for it to work properly. It’s funny because I used the same prepaid card on another designer app and the payment went through just fine. This app sucks, the workers try to dismiss you quickly, they don’t care to fix anything, and will waste your time.","title":"Awful tech issues and service","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-21","author":"Christine Lowndes","text":"I wouldn’t bother trying to sell with this company. I sold a jacket no problem then I wanted to sell some hoodies and it came back we no longer take that brand. Today I tried to sell a mohair cardigan from All Saints. All my pictures were clear including labels. It came back your item is refused. I went on chat and was advised to send the pictures again but they would only be the same as they were really clear. The operator then said maybe they already have some on like that! Unbelievable. I told her I am deleting the app. Complete waste of time.","title":"I wouldn’t bother trying to sell with…","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-21","author":"Slv90","text":"TDLR: Received fake good despite paying £20 for and waiting for authentication. Now VC have taken the bag back and not refunding me.\n\nUPDATE:\nIt’s now been 2 weeks since I returned the counterfeit bag, 12 days since it arrived at Vestiaire Collective.  I’ve heard nothing despite their website saying it’ll take 5days, and chatting with customer services chase it for me and then just respond saying there has been a delay. \n\nORIGINAL: \nI purchased a Fendi handbag and paid the extra for authentication. The handbag passed authentication and was posted into me. Within seconds of opening the box I was suspicious that the item was a counterfeit, the quality was just not what I’d expect from a £1000+ handbag. The stitching is off in areas, the branding was low quality, and I’m not convinced the leather was real. My suspicions were confirmed the moment I checked for the RFID tag (which is in all modern Fendi bags). The ‘RFID’ label inside the bag didn’t actually have an RFID chip in it. Along with the fact the other labels has didn’t match that of an authentic Fendi this confirmed it was a counterfeit. \n\nI contacted Vestiaire Collective straight away showing images and my concerns. Expecting an apology and to return the bag for a refund. But instead I’ve been told I’ve got 7 days (4 of which are bank holidays in the U.K.) to send the item back to France to be re-authenticated, by the same team who couldn’t even spot it was counterfeit in the first place. \n\nNot only am I shocked that I was charged £20 for substandard authentication— the missing RFID is such a basic check that should have been done. I can’t believe that I wasn’t offered a refund.","title":"Paid for authentication but received an obvious counterfeit!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-21","author":"Jane","text":"I have been emailing VCover and over again. First telling me that they have transfered the money for a sale of a Chanel bag of 3600 the 9th of December.\nWhen no money arrives and I write a comment here on trustpilot the reply that I owe them aprox 600 euros for a sale in 2019 but it was pulled on my credit card. When I reply this I hear nothing back. They go silent. I even replied that they could transfer for this sale minus the 600 until they would have time to check the old purchase. But nothing. I have emailed them 4-5 times now but I get no reply and dont receive my money. Basically they have stolen my money. I guess If I don’t receive a transfer within the next few days I would have to report them to the police, visa and Mastercard for fraud. \nI have over the years sold over 94 items with VC so I am\nNot a newbee.","title":"No payment still - I will have to report them","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-22","author":"Janie Rowland","text":"Purchased item, item has gone missing and Vestiaire is not interested in assisting me to locate nor refund me!  I have tried to have them help me for the past two weeks and nothing!  Pathetic and the worst customer service ever!  DO NOT purchase or sell with this company!","title":"Purchased item, item missing","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-22","author":"Ефтима Радичкова","text":"They banned my account by mistake. Took over a week to get it back. Then all my listings were withdrawn, so I have to submit them anew. But then all of the items were refused (same items that were accepted before). Their live support is useless, very polite, but doesn't have permissions to do anything.\n\nUpdate: Now that you have answered me - it's all items. I want all items to be relisted.","title":"They banned my account by mistake","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-22","author":"Mary Luis","text":"I got scam bay individual seller be ware!!!","title":"I got scam bay individual seller be…","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-22","author":"GM","text":"I have sold two items through this platform and I can't believe how difficult it is to go through customer care and getting an update. The process is extremely long and the overall lack of communication simply unacceptable. Not recommended at all","title":"Not recommended","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-22","author":"Sophia","text":"Bougt a Louis Vuitton bag which was authenticated by their verification team and find out it was fake 2 months later when the leather started to fade. Do not purchase items from vestiaire! Customer service is TERRIBLE aswell.","title":"Selling fakes","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-22","author":"Guendalina Gravina","text":"I recently discovered Vestiaire Collective, and I wish I didn't.I placed 2 orders with 2 different sellers. One of which was direct shipping. After payment I receive the email confirming my purchase has been accepted and I wait for the goods to be shipped.In this case I bought 2 Gucci bags. Fine, the first order was cancelled by the seller, no reason provided. The second order never left the original place, so I read Vestiaire Collective policy and noticed the seller has 7 days to send the item, or a full refund will be issued to the buyer. I wait up to 7 days and decided to contact the customer service. The first lady told me that I was not entitled to a full refund (appalling). So after several attempts I finally found the smart guy who new this policy and immediately issued the refunds. \nThe time I spent contacting customer service and waiting for them to reply frankly was ridiculous.","title":"very poor service.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-22","author":"Oliver","text":"Beware of counterfeit items and no support from VC\n\n1. Loewe puzzle bag\n\n- Purchased date: 28\/November\/2021  \n- Paid an additional fee for their authentication service: confirmed the bag is authentic \n- 15\/December\/2021: received a poor-quality counterfeit \n- Paid an extra fee from my pocket to get it authenticated again by a third-party company (LegitGrails); confirmed it is counterfeit. \n \n\n2. Customer service team was incredibly poor \n- No apologies and rushed with their chats \n- Informed me several times their manager will contact me, but have not heard even now \n- Not aware of their policy and kept changing their words on chats and emails \n \n\n3. No customer protection policy? \n\n- The seller posted and sold another puzzle bag after VC authentication team passed my puzzle bag. I informed VC of this and also expressed my concerns. I requested VC to update me on this matter as I did not want another victim of counterfeit. A day after, VC deleted this sold item from the seller’s archive (including another previous sale: MaxMara coat) and did not provide me any update of their action. I do not know whether VC informed the other buyers  \n- The seller’s account is still active and has posted another item \n \n\n4. No aftercare service \n\n- I have purchased a number of items from VC and paid extra for their authentication service. I expressed my concerns of their authentication service and authenticity of these items. I am particularly concerned of my bracelet (paid 5479.06GBP) and asked for an authentication fee so I can get it authenticated by a third-party company as I cannot trust their expert team. Customer service team informed me twice VC will pay for this, then changed their words only a couple of minutes after. They asked me to send it back to them for in-house authentication, but who can trust them after this experience.  \n\n\n5. Conclusion \n\n- I have read other reviews and found out there are other buyers who have gone through a similar poor-quality experience with counterfeit products even after VC’s authentication service. I hope this review helps. I have sent the counterfeit bag back and not heard back from VC yet. I would like to have a full refund and hope VC does not post this counterfeit bag again to sell.","title":"Beware of counterfeit items and no support from VC","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-22","author":"Carlotta","text":"I sold a gucci bag on Vestiare last week, which was in excellent condition.  It wasn’t very old, had been well looked after and had only been used a handful of times. I was asked to send it directly to my buyer. \n\nMy buyer raised an issue (also sent me a rather unpleasant private message at 3am) and said the bag I sent did not match the original description \/ pictures.  She said it was very damaged with tarnished metal etc which was just not true. \n\nI knew instantly that something odd was going on and was concerned my buyer was being dishonest.   \n\nVestiare told me the bag would be sent back directly to me, the buyer would be refunded and the sale has been cancelled.  \n\nYesterday morning I received my parcel from my buyer. She sent back an empty shoe box with only the dustbag and packaging I sent my bag in …… and as I could have guessed …. no bag. I instantly emailed vestiare, knowing that my buyer will of course claim the bag must have been “stolen” on its way back to me.  \n\nIt’s dreadful that there are loopholes like this in vestiare collective that allow people to get away with doing things like this. From other reviews I have since read, I am not the first person that something else like this has happened too. \n\nIn the last hour I have received an automated reply from Vestiare customer service asking me to provide courier details for the missing parcel, date and time of drop off etc. If someone had actually bothered to read my email properly, they would understand the package turned up but did not contain my bag. It is not just a “missing parcel” plus I don’t even have these details because I didn’t send the parcel! Basically another automated email reply! \n\nI cannot be bothered to waste any more time and energy and I shall never use this website again. I have not only lost the money I would have got from the sale, but I no longer have my original bag back to sell on again. This has left a very nasty taste because essentially my bag has been stolen.","title":"Buyer stole my bag !","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-23","author":"Leila Loconsole","text":"I’m sorry about the low rate, but I am seriously disappointed.\n1) when I sold twice in a row the same Prada Vintage bag Ref #17067456 (the first time you sent it back to me even before the buyer expressed her opinion concerning ‘scratches’ that you refused to accept). As a matter of fact she wanted to carry on negotiating further 50€ less, but it was too late: her answer - despite being given before the 3 days you require - wan not waited because the bag had been returned.\nImmediately after this same bag was sold again to someone else but this time you refused to conclude the sell. Now, if your QC is not comfortable with items produced 30 years ago, you should have refused the bag from the start, instead of letting me sell twice a bag and eventually cancel it because you considered it ‘not compliant’. Besides, it’s impossible to talk to a manager to have a proper clarification about problems.\n2) as for a Jil Sander jumper I was recently interested into, it seems that it’s not only items from UK that are more expensive: you ask for money for “shipping and insurance” even for direct shipping in EU. I was asked for 12€ on the top of the price the seller asked, and I decided not to go further. Vestiaire Collective has visibly changed policy and things are not as good as they used to be","title":"I’m sorry about the low rate","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-23","author":"Hana Tavcar","text":"Paying an extra postage is a bag turn off. I made a final decison to buy a bag, which I was dreaming about for months and because of the postage surprise at the end I did not buy it at the end.","title":"Paying an extra postage","stars":2,"location":"SI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-23","author":"Talia","text":"Reduced the price of my items by €400 without my permission. I have immediately noticed them. They never informed the buyer. They didn’t solve the issue and didn’t reply on me emails. An awful experience","title":"Reduced the price of my items by €400…","stars":1,"location":"CY","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"},{"date":"2021-12-25","author":"Thao Dang","text":"I do not trust this website. This is the first time I sold an item on this website. They said payment was made on the 16th and will appear after 5 days. I contact and they said wait until the 24. On 24th, I contacted them again and they basically gave me the same answer? What is this kind of answer, do I suppose to wait more? I started to get very anxious and annoyed even more after reading review from this site. They didn't give me any proof of whether do they actually transfer the money or not. Reference sold number: 19728743!!!!! Jeezzz","title":"I do not trust this website","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=28&stars=1&stars=2&stars=3"}]