[{"date":"2021-05-27","author":"customer","text":"I had been an avid user until my recent experience. \n\nI sold an item and received an email to say the item was “not compliant” on the basis it could not be exported to the location the buyer was based \n\nThe listing was approved by the platform and displayed in countries for sale based on full disclosure of the materials of the item in the listing. \n\nI reached out to customer service to explain my disappointment around the item having been sold to someone who is in a country that cannot receive the goods due to its composition following on from an email outlining that the piece was “not compliant”. \n\nSorry VC It’s time to review your trigger marketing emails. The item is compliant, rather the due diligence around where the  product was showcased on your platform was not....a personalised email highlighting the error would have been far more appropriate, acknowledging your mistake. \n\nWhy was the item listed to someone in the country that the material is not exportable? \n\nWhy should I be out of pocket for this poor experience? I have sold multiple items and am a trusted seller. \n\nWhy was I advised that the issue would be escalated and I would receive a response whilst soon after this interaction via live chat I received a text message from DHL to say I had a parcel in transit from VC due to arrive in a few days. \n\nI’m sorry to say VC but you have a long way to go when it comes to customer communications and experience.","title":"If you enjoy automated emails and chat bots this platform is for you!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-05-27","author":"Rita D","text":"The first time I have sold something via VC. For the outrageous commission they are charging a, there is no phone number to contact b, no direct email, just an online form to fill c., a useless chatbot which basically feeds you the same text as you can find under the help section. In this day and age, a company thriving to be respected and successful dealing with luxury items should aim to provide at least A or ANY FORM OF REAL CUSTOMER SERVICE. I have spent a few precious hours of my life to try to provide some documents for authentication purposes through the very glitchy web platform instead of sending ONE email to customer service.","title":"Zero customer service","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-05-28","author":"Alena ","text":"Waste of time \nI have purchased a pair of shoes. The seller never sent the item, never replied to my messages, so the purchase was cancelled. \nWhy bother?","title":"Waste of time","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-05-28","author":"Elena Sollazzo","text":"No customer service only a chat bot who cannot answer questions. I have written 3 times on their auto note system. \nI am chasing non payment for 3 items but there is no customer service. \nThey charge high commission fees but no customer service to their users. \nThis is beyond frustrating and not acceptable when they are literally keeping funds owned to me!","title":"Non payment!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-05-29","author":"AF","text":"Worse customer service on the planet and their website is poorly developed.  I ask myself how come that a company that sells online does not invest in good programming.The website is full of glitches, codes that do not work, item that cannot be bought, codes that do not work, etc. This week I received a strange email about my items going to be unlisted, unless I would click the link given. The link does not work. I sent an email and no one replied. Contacted someone via chat; it was useless. So, how can I solve this?? Every time that you have an issue, things spiral quickly, as it seems that you are dealing with puppets, not customer assistants. There is no responsibility. It seems that everyone is working unsupervised and without any means to solve issues.","title":"Worse customer service on the planet…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-05-29","author":"Magdalena Kabacinska","text":"Hello, I was just about to purchase an item for 1150 EUR after seller accepted my offer. Unfortunately when trying to pay - import duties of amount over 200 EUR pops out (UK). Instead of paying 1150, total price is 1350 EUR... it is crazy that such a company with such a huge selling margin cannot afford to cover such import duties, especially that item is delivered to the authentication Center. Your customer service has never managed to resolve any of my issues. Could you please support our buyers\/sellers more? Honestly in this scenario customer service shall be helpful, offer partial import duties reduction or promo code to try to keep the buyer & seller satisfied.","title":"Seller&Buyer ripped off and Poor customer service","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-05-30","author":"Angie black","text":"Sent me a sweater with 6 cm hole in it after I paid for “quality control “ go figure ! Zero customer service. Buy only small value items from them.","title":"Zero, terrible customer service.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-05-30","author":"yulia","text":"I have been using Vestiaire Collective for 6 months and the first problem appeared a month ago, at the beginning of May 2021. As of now I have been expecting my payment for already a month. I contacted the customer service twice through the chat bot and I managed to get in touch with operators, not the bots. (You just have to push twice that bot wasn’t helpful). And each of them told me that the payment is scheduled in 3-5 working days. I said: I should have recieved it 3 weeks ago! And they: you will receive it in 3-5 working days. But I also got the information that the problem was with PayPal. So what? They have a problem, why should I suffer? Even if I am waiting for only 8€ that is still unacceptable! I am not going to sell with VC till I get paid and probably even if I will get finally paid. Vinted has become my favorite now, and to say at the beginning I was in love with VC.","title":"Vestiaire Collective stopped paying the sellers","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-05-30","author":"R.W.","text":"I sold an item with them, it was brand new, then the buyer leaves a comment that the item was \"damaged and full of dog hairs\" not only do I not have pets, I also had pictures with the shipping label showing the item from all sides (direct shipping makes me nervous and that was actually a recommendation of their customer service) I provide them with those pictures and they agree with me and tell me that I will get paid. In writing, via an email.\nThen I receive a letter from them, the item is in their warehouse, it is non compliant (well, the buyer damaged it) and do I want it relisted or sent back.\nSo basically I have sent out a brand new designer handbag and can now sell a damaged handbag or get a damaged handbag back!\nI can only recommend to all sellers to cancel if there is there is direct shipping, because otherwise, no matter what evidence you have, the buyer can damage, or worse switch the item and it is your loss. It does not matter if they send you an email, it does not matter if you have pictures of the item from all angles while you package it and the shipping label is clearly shown, it does not matter that they say they agree with you, you sent the correct item and you are not at fault and you will be paid, you will not! I wish I could upload the screenshots of the mails they sent. I honestly have never seen anything like it!","title":"Too risky","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-05-31","author":"Mimosa","text":"I placed an order of an Hermes bag with VC. Paid 5668.35GBP. VC cancelled my order right away, as apparently due to technical issue, the item was sold to another buyer before I purchased it.  However, 2 days after I only received 5301.18GBP back from refund. So there is 367.17GBP missing. I tried to live chat VC, all responses are automated. No one is there to speak to. This company is clearly a scam of fraud. DO NOT PURCHASE from this company again. They eat your hard working money. Shame on you VC!","title":"No Full Refund Received","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-05-31","author":"Magns dn","text":"STAY AWAY .. \nTHIS COMPANY WILL FRAUD YOU !!!\n\nThey dont live up to european online shopping laws !!   IT IS ILLIGAL BUSINESS . \n\nThey will NOT refund the purschase even obligatede by european online shipping law.\n\nPRODUCT was DEFECT .. \n\nI have ALL proff from manufacture, picturs EVERYTHING . \n\nVestiaire Collective  DONT care. \n\nI have emailed and used not several hours. \n\nThe case is send to lawyer and bank for chargeback.\n\nBE AWARE THIS FRAUD COMPANY only possible to get refund with CHARGE BACK BY BANK .\n\nI will report Vestiaire Collective  to european comission","title":"STAY AWAY .  FRAUD COMPANY","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-05-31","author":"Joanne ","text":"Ordered a blazer for €100+. Item listed as \"good condition\", the definition as per website says \"if item has defects, the seller must mention them in description\". Blazer came with blood spatter on the front, not mentioned in the description or highlighted in pictures. \n\nI requested help multiple times via email and chat and I was eventually told that they won't take it any further as its now relisted and the item \"Conforms to their quality control and matches its description\". Vestiaire clearly contradicted their apparent quality rankings given for items and therefore cannot be trusted.\n\nI am extremely disgusted and feel that this item should have been sent to a crime lab, not a customer. I will never buy preloved again which I am devastated about as I really felt happy about making a change for sustainability, but my confidence is gone now.\n\nDisgraceful.","title":"Blood spattered item. No refund or return accepted.","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-05-31","author":"G FFG","text":"Potential clients:  read the bad reviews for an honest evaluation of this miserable company from France. VC is so bad that it gives France a bad reputation, which is not easy to do. Their website is 19th Century technology (France makes al their money in technology by fining successful companies from the USA); their staff is incompetent (nobody gets fired!); they take advantage of the float to frustrate sellers; they do not abide by their own rules but insist you do so.\nCalling this a miserable company is giving them too much credit!","title":"Potential clients","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-06-01","author":"Julie Wilson","text":"I've ordered three times.  The first time everything went smoothly and my item was in excellent condition.   The second time the order was lost in the post and I was eventually refunded.   Last item ordered it took the seller 6 days to confirm it was available and then waiting almost a week for it to be shipped.  I was advised it was no longer available and I would be refunded.\n\nDon't recommend.","title":"I've ordered three times","stars":1,"location":"SA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-06-01","author":"Tracy Marker","text":"Pity I can’t give a -\nI sold a scarf for £15\nAfter commission I received £2\nSell with Vestiaire at your peril.","title":"Thieving disgusting company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-06-01","author":"Cb","text":"After 10 successful sales, they sent payment to the wrong IBAN and will not rectify their mistake. It has been an ongoing issue for two months, and they still send me the same automated response. Impossible to get in touch with someone competent!","title":"Will not rectify their own mistake","stars":1,"location":"LU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-06-02","author":"SY","text":"Very disappointing service when I thought it finally was improving. I sold item Ref : 13999788 on 31 May. I printed the label and tried to book a collection for next day 1 June. DHL did not accept the waybill label and asked me to contact VC. I contact via livechat and the conversation \"disconnected\" before my query was resolved, I then proceeded to exchange 4 emails with VC. They claimed to have sent me a new label, but it is exactly the same waybill label as before. I called DHL to try again the label still does not work. I asked for a new waybill, I don't understand why that is so difficult and they just sent me the same one again. They want sellers to post items quickly, how are we suppose to post quickly when their label system was a problem?","title":"Faulty Waybill, asked for a new one, got sent same old one!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-06-02","author":"Em","text":"The bag I sold in April has gone missing. It’s now june. Vestiaire say it’s somewhere in their warehouse and I need to wait another 2 weeks just for an update. The third bag I’ve sold that has either gone missing \/ had a huge delay and terrible customer service. Avoid.","title":"Terrible service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-06-03","author":"Angelina","text":"SCAM!! I sold my celine bag in a very good condition. it arrived perfectly at their hub, after 2 days i received an email to complete some details, however 2 days later they mentioned that my bag is NOT COMPLIANT because of TEARING, so they sent my bag back. When i received it today, there's a HUGE TEAR on the side which I was not recognise before it got sent to them. The fault was absolutely came from their end. Poor to zero customer service from this company, so AVOID DOING BUSINESS WITH THIS COMPANY! you're welcome!","title":"SCAM!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"},{"date":"2021-06-03","author":"Carmel ","text":"Absolute shambles of a company. I was sent the incorrect item, sent it back and now they refuse to give me a refund. Worst customer service ever.","title":"Absolute shambles of a company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=57&stars=1&stars=2&stars=3"}]