[{"date":"2022-02-26","author":"K S","text":"I am asking everypne to beware this company.\n\nI bought two items in 2021 which I didn't like, so i relisted them on the platform. The items were checked by QC when I bought tgem and deemed compliant. When I sold them, they suddenly become non compliant, and their customer support claims it cant be helped. So eother their QC missed non-compliance when they sold it to me, or they damaged them when they received it back from me.\n\nBeware, dont buy or sell with them. I'm taking them to court.","title":"Beware!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-02-26","author":"Gabriella Rhodes ","text":"I sold a £3000 Rolex (19472802) a month ago and the item arrived for authentication weeks ago. Since then radio silence to me and the buyer saying it is under investigation but not giving more information. Needless to say the watch is real I bought it from WatchingFinder. \n\nThis is extremely distressing!","title":"No updates on £3000 item!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"Viv","text":"Sold an expensive designer jewellery  they claimed to be fake and they are not returning it to me BE VERY CAREFUL SENDING ANYTHING, YOU MAY NEVER GET IT RETURNED. Their ” customer service is non existent,they constantly make you wait then cut you off. THERE IS NO PHONE NUMBER\nBasically feel scammed me out of an expensive item I can’t get back. There’s no way of getting to talk to them effective just a crappy chat or they don’t respond WORST EXPERIENCE EVER","title":"KEPT MY EXPENSIVE JEWELLERY","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"Chani S","text":"If there was a 0 I would use that.\nI purchased a dress and the seller sent it out using the label provided. It never arrived.\nWhen I tried to get in contact with the company all I got was an automated reply.\nFinally they sent me a form to fill out.\nThis asked me for a signed letter showing that I did not receive the parcel, even though they could see this clearly in the tracking system they supply. They also asked me to send them my ID which I was hesitant to do, and didn't understand why it was necessary. I sent it, and low and behold, the person who sold me the item received all my personal details as I did hers. This is against the law, sharing my details with a third party.\nI am only meant to be dealing with the vestiaire group not the actual seller. As this is a consignment selling platform.","title":"If there was a 0 I would use that.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"Chaos Souled","text":"Not been paid after selling items. I will be escalating further. When you have a problem no one listens. There is no proper customer service and frankly they are a law unto themselves. Surely their practices must be illegal . You can’t just take items and not pay for them? \nHorrible experience, I will avoid them at all costs. Does anyone know of a more credible selling sight, VC is the most unscrupulous DODGEY place to sell. I will never ever buy or sell there again.","title":"Not been paid after selling items","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"Maria Ana","text":"I sold a Gucci bag (20357339) a month ago and they claim that their carrier( DHL) lost the item .Since then radio silence to me and the buyer without receiving any response.\nSo far no one knows what’s happening with the bag and I didn’t receive any refund neither from DHL nor from Vestiaire, although it was stolen deliberately either from their carrier or them.\nI will sue them both.","title":"They Lost my item","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"EM","text":"I decided to give an update on my experience. I sell professionally and since the last post things got a bit better.\nAs a seller I have advice for: \n- direct shipping: photograph, videotape items, attach security tags and ship. you want to avoid the item being worn and returned. (just happened again with a pair of earrings, exactly 14 days of receipt and last day to return-  I am looking to buy hygiene-locks for jewelry)\n\n- they lost a dustbag of a bag and told me i sent without. they compensated with the brands dustbag but not the one that bag came with (different style and color) \n\n-double check if you get paid or not.\nsometimes payments have been missing and i had to chase them. \n\n- check if earnings are matching with money that is sent- recently sold two items at the same price but got different amounts \n\n-their photo upload improved, but now its difficult to add photos from weeks ago - have to scroll through everything as can't choose albums\n\n- I feel like they are really trying to fix their issues they are having or had in the past. \n\nif you are prepared for the jungle then you won't face any issues ;)","title":"update on VC","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"Jess Palmer","text":"Absolutely awful, just awful. \nI have no faith left in this company and shall not be using them again . \n\nIt’s been nothing but hassle and aggravation, trying to get someone to fix an issue is really impossible. \n\nNot been paid for items sold. \n\n What a nightmare.","title":"Absolutely awful","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"Martin","text":"Most of the stuff sold on VC is fake and their quality control is laughable, they have no idea how to legit check items and take a massive commission. Do not buy from them","title":"Most of the stuff sold on VC is fake…","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-03-01","author":"Labz","text":"The app is such a mission to sign up to, you just give up in the end...upper case lower case backwards forwards left right...just don't even bother with it.","title":"*** The app is to long to sign up to ***","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-03-01","author":"Mihaela Cristea","text":"Bad experience!!!! Please dont sell expensive product there ! \nI’m a expert seller and this doesn’t matter for VC. \nI send a package with VC verification and after they received it they inform me that the package was damaged and it’s my fault because I didnt packed well the product, wich is not true (I always have a box and bubbles bag).So they will send me the damaged product back to me like this !!! \nDo not sent expensive product with VC ! \nThey dont care about you !!!","title":"Bad experience!!!","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-03-01","author":"sarah","text":"I sold an item and they asked for proof of purchase, which I provided. Vestiaire proceeded to cancel my sale without communicating why. My item is 100% authentic. Contacting support was no help - the support agent ended the chat and instead sent me an email saying that \"there's nothing they can do.\" Now they are asking me to pay for them to return ship the item. Ridiculous.","title":"Cancelled my sale without explanation…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-03-01","author":"Maureen C.","text":"I am very disappointed, i just received the item that I bought from a professional seller but its not what it's advertised. The photo is misleading. I want to return it but there is no return option. I tried to chat an agent\/staff but not very helpful.","title":"I am very disappointed","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"DP","text":"THE BAG BURBERRY BANNER (ITEM 21191979) WAS SOLD ON 18\/2\/22\n\nTHE BAG IS HELD IN THE VC WAREHOUSE.\nVC  LISTED INCORRECTLY ( DIRECT SHIPPING (FROM SELLER) WHEN IT SHOULD HAVE BEEN EXPRESS SHIPPING (FROM VC WHO HAVE THE BAG)\nI CONTACTED VC NUMEROUS TIMES, THEY SAID YOU WOULD CHANGE AND RESOLVE BUT  NEVER DID AND THEN CANCELLED THE SALE.\n\nI CONTACTED VC AGAIN AND THEY APOLOGISED AND SAID THEY WOULD RELIST AGAIN WITH 0 COMMISSION AND AS EXPRESS SHIPPING (EXPRESS SHIPPING IS DIRECT FROM THE VC WAREHOUSE)\n\nTHE BAG WAS RELISTED REFERENCE 21451446.  IT WAS AGAIN RELISTED INCORRECTLY (AGAIN AS DIRECT SHIPPING)\nTHE BAG SOLD FOR A SECOND TIME AND AGAIN THEY ARE ASKING ME TO SHIP THE ITEM (WHICH I DON'T HAVE AS VC HAVE IT...)\n\nI HAVE CONTACTED THEM 3 TIMES TO AMEND,  IT IS STILL NOT RESOLVED AND I AM BEING ASKED TO SHIP THE ITEM- YOU HONESTLY COULDN'T SCRIPT THIS)\n\nI WANNT VC PLEASE UPDATE THE LISTING AND SHIP MY BAG TO THE BUYER AND PAY ME.   \n\nI HAVE SPENT HOURS TRYING TO GET THIS RESOLVED AND I REQUEST IT IS RESOLVED ASAP\n\nEMAIL FROM VC BELOW\n\nDear debbie,\n\nThank you for requesting to re-list your item Sac à main The Banner en cuir - Burberry, réf.21191979.\n\nIt is now available online in our Express Delivery section. You can view the listing in your Account under the reference 21451446.\n\nUpon sale, you will receive £ 325.\n\nFor your ease, we will store your item at our Head Office until it sells.\n\nWe wish you a successful sale!\n\nMany thanks,\n\nThe Vestiaire Collective Team","title":"AN ABSOLUTE SHAMBLES","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"Ekaterina ","text":"Hello!\nI’m the seller.  I’ve sold socks Dolce&Gabbana and shipped them out the next day after sale. Vestiaire allows people to buy through usps and it makes problems to everybody. The item wasn’t tracked for a week and my sale was canceled, even I texted the customer support that I’ve shipped it out the next day after sale and send screenshots- nothing helped. I wasn’t paid for the sold item. The problems with the postage should be solved by Vestiare and doesn’t impact sellers ! Ref 16848316","title":"Seller wasn’t paid for sale","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"Natalie Egmore","text":"I wouldn't buy again from them now. The last couple of day's I brought a few things with them but one item I am currently purchasing I now believe is a fake but when I messaged (you are unable to speak to anyone) to ask for the order to be cancelled because I believed it was a fake, she told me I couldn't. I think what I found even more upsetting was how she handled the conversation (Georgie B) at no point did she really make me feel reassured that if it was a fake what are my option's or would or how would I get my money back, she made me feel like I was the one in the wronge and she made me feel even more upset and worried rather then helping me. I don't feel there is any protection or support from vestiaire if you believe you've brought a fake item and because of this I would feel really worried about buying from them again, I feel like it's just pot luck and if it goes wrong then there's know one to really help you sort the problem out, that was how I was made to feel during the chat with customer service today. I am currently in the middle of still buying this item as I can't stop the sale and I'm still not 100% how to fix it or get my money back. I think it's a case of hoping the seller doesn't send it then I'll hopefully get a refund in seven day's but the conversation went on so long with customer service and her not getting to the point or really apologise for the bad experience. I'm not sure if I'll buy again second hand as it's my first experience and it has been a bad one.","title":"I wouldn't buy again from them now","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"Eva Galicz","text":"It looks like I actually have been stolen by Vestiare. Sold an item of the value of £90 back in august 2021. The deal was cancelled while the item was out for delivery and i have never got the item back. It has been told that they  keep it in their hub. I keep asking for my item to be sent back as i have sold it on a different market place but Vestiare kedps ignoring my request. A proper thief & scam. Wont recommend.","title":"Scam","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"Viktoriya Tomova","text":"It is great app, I have shopped a lot through it and found great treasures…However, the customer service has been horrible for the following reason:\n\n1) chat function never works for me (massage get send but are never delivered)\n\n2) one morning I just got an email that I am banned from chatting with other members and I could not even get hold of customer service to understand why…I believe I was banned because when thanking on of the sellers I used his username and the platform algorithm though I was promoting outside sale\n\n3) could not locate working customer service number \n\nOverall I would recommend the app to a friend, but they need to resolve urgently the above issues","title":"It is great app","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"Kai","text":"Catastrophic customer service. Bought shoes and the original shoe box was shipped without any protection. The box was completely SMASHED. For a company marketing Itself as ”luxury” it does not really feel luxury to receive the original packeting destroyed. When contacting VC, their answer: ”the shoes are fine”…….. disasterous customer service.","title":"Catastrophic customer service","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"Chey","text":"I’ve had the worst experience being a seller with this company. Not luxury at all, if anything you get scammed.\n \nMy £1200 Burberry coat was kept by them for MONTHS while I was emailing them asking for it back. 2 people told me they’d already sent it back. When I threatened them the third time they FINALLY sent it back and said they would “look into it”, they didn’t. They would’ve kept it had I not kept pursuing.  \n\nI’ve sent a Louis Vuitton bag (paid well over £1000) and it was in PERFECT condition. They sent me an email saying “it has defects” and there was a thread loose and some dirt and marks inside the bag. How it this possible when it’s been kept in the box since purchased and I checked it and photographed it before sending and it’s pristine condition with no damage? I contacted support and they said that was how it was received and “they’ll look into it”. Ridiculous. NOTHING WILL BE DONE. If I receive it back and it’s worse than I sent it (which already seems it is!) I will be making a formal complaint. \n\nPlenty, plenty more to complain about. Will no longer be selling items on the site, waste of time and definitely not worth the money- they take 12% of what you make. \n\nCustomer service says the same thing over and over to everything “this never happens” “we’re sincerely sorry” “I’ll look into it”. That’s great if it’s true, but these things have been said to me every time- in a dozen of complaints now. Not worth the hassle. \n\nIf you don’t want your EXPENSIVE DESIGNER items to be damaged or stolen, I’d stay away. I’ll be finding a new site to sell on- there are many with none of these issues. What they get away with should be illegal…","title":"Avoid if you don’t like getting scammed…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=14&stars=1&stars=2&stars=3"}]