[{"date":"2022-02-17","author":"Cong Ding","text":"I am a buyer, i opened my account and have bought lots of goodies which i am much appreciated. There was one time, Vestiare themselves were selling a cartier bracelet at a good price, of couse there are a lot people interested and left comments. i am very interested and after seeing the other comments regarding the odd shape of the bracelet i decided to ask as i really want it and wants to make sure, it is selling for 6500 pounds and it is a lot of money. i asked them privately about authenticity and why the bracelet has an odd shape, was it damaged etc， instead of getting any reply, i see all comments with these doubts have been deleted within a hour, further more my private chat has been banned, without a notification, without any emails. i tried to reach out to their customer service and asking this unfair ban for my private chat everytime they copied their chat policy. i told them i am fully aware the policy: do,not offer deals outside of platform which i certainly wont do as a buyer, do not use bad language which i never do, all polite conversations about the items i want to buy. Please be aware i am a buyer, i  will need to clear my doubts before place an order. For the first few times, i can physically talk to a human, who said they will definitely look into this and have this sorted with no time, i still kept these emails, however after a few times, no reply and my private chat is still banned. The last email i have received with a very bad attitude just copied the chat policy in email and tell me my private chat is banned permenantly, again without explaination, no reason. Now i can no longer contact with customer service because i am talking to a robot and never pass my message on. Nobody will resolve my issue even when it is done unfairly. As i buyer i have rights to ask authenticity and related question. Please bear in mind guys, i was banned straight away after chat with Vestiare selling department. How snobbish and how unprofessional they are! My ID is cong1425185, i have spent 14000 pounds on the platform and thats how they treat me. This is a genuine review, i feel so frustrated and hurt the way they treat their genuine customers who pays promotely, never complaint about my orders even sometime i am not 100 percent happy, i still decide to deal with it myself rather than return. For example the first purchase of a miu miu bag, it was stated very good condition but i have received a badly worn bag, not even a fair condition. i just sold on ebay by bidding auction myself and lost 250pounds instantly. i am a literally hussle free customer, thats what i get -- to be banned from doing nothing wrong at all. I am very very disappointed, will not spend my money anymore.","title":"I am a buyer","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"Manahan Family","text":"Literally duped me with a fault item, I returned it to get a refund - and since then, I've had no refund and no one is helping. Any time I get in touch after 100 conversations, no one has any knowledge of previous conversations. So I have lost my money, been duped and now ignored. AVOID AVOUD AVOID","title":"Literally duped me with a fault item, took my money and now ignoring my complaints","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"jaysh","text":"I've had the worst shopping experience with VC. I ordered a Gucci bag for almost 1000 euros with authentification fees. They sent me the wrong bag!!! a bag that don't even cost 100 euros. Can't believe how a company that claims to be authentic and professional can do such thing. So disappointed because I was so happy with this purchase ...Now I'm waiting for them to receive the returned package. VC, if you see this update on my post PLEASE MKA SURE YOUR ITEM CONTROL TEAM RESHIPS THE CORRECT BAG I WANT IT! thanks","title":"I've had the worst shopping experience…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"Fola","text":"I placed an order with Vestiare on 14Jan2022. The order was eventually shipped out on 19Jan. By 26Jan when I kept tracking the item and realized it was sitting at the FedEx facility in France, I reached out to customer service. The initially blew me off, but then when I sent screenshots of the tracking status on the FedEx website I was asked to log in and update my delivery address. When the package still didn't move, I contacted FedEx directly and the informed me the address was incorrect but only the shipper could make a change. Went back to VC, informed them of the update. Still nothing. They kept sending me emails asking me to prove I hadn't received the package so they could open an investigation. I then contacted FedEx to see if they could return the item to the shipper so they can update the address and reship it. Guess what happened: the package was shipped to the US, sent out for delivery, and then returned because it could not be delivered. I reached back out to VC again to inform them of the issue, they confirmed by email that I would receive a refund as soon as the package is received back at their facility. Then a new issue arise. Package has been held at the FedEx facility in France pending clearing by the shipper. I've reached out to VC several times since this update. They initially assured me that I would receive a refund as soon as they get the package back, but then they went back to requesting that I prove I did not receive the package  (handwritten letter, ID, the works) and THEN they would open an investigation into a package that is clearly being held at a shipping facility. I've sent thendocumentatuin they requested, but based on the reviews here its clear that I likely will not receive a refund from them, or they'll request for me to verify my shipping address so they can send out an item I no longer want. \nGood luck with your business, VC. I am definitely no longer a customer.","title":"Order not delivered","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"Natalia","text":"My item was not accepted. No explanation, no reason given. This is an authentic Chanel wallet, with many photos showing wear and tear, I did not try to hide anything. It arrived at Vestiaire on Feb 7th then disappeared from my sold items list. I have written emails and was always assured all is fine, it will take more time. All of a sudden, on Feb 18th I get an info it will be shipped back to me. WHY? Is it so difficult to be professional and at least provide an explanation? Authentication takes up to 6 days, now it's been 11 days. \nI am wainting for a valid response. My third time selling, it was a good experience before. Now it's a joke. From what I can see it's just another day at Vestiaire... Ref number 20546634\n\nEDIT: Afterwads I got this email:\nAccording to our experts, regarding item 2.55 leather wallet Chanel 20546634.. as per our experts We have recently changed our policy with regardis to specific items. The items like Chanel or other brand items marked as \"not forsale\", catwalk items, samples, pins, packaging (such as dust-bags), uniforms, locks\/keys, make-up and lifestyles\/home decor.\n\n \n\nWe understand your frustration. Unfortunately, we are no longer accepting items which are not allowed to sell. We really appreciate your understanding.\n\n\nSO, WHAT IS THE TRUTH? These are contradictory. I am waiting for a matter of fact response. When will I get my Mony back.","title":"I'm waiting for explanation","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-19","author":"Elle","text":"1- packaging: simple brown envelope for a jacket. Arrived mis-folded and wrinkled 2- Invoice announced all taxes paid: I had to pay import taxes and review 3- color did not match photo. Appeared white\/Grey and black, is brown\/bronze and black.\nCustomer dis-\"service\" said \"just put it for resale\". In sum: I have to try to resell and put it at a price including my extra costs and VC commission plus shipping. Win for VC, one more vendor, perhaps one more commission. No sanction on vendor about the color. Lose, lose for me, waste of time and money. Trying to recover is an exercise in futility and a waste of my time. Caveat emptor. I am glad it was a trial with a small amount, I will not even consider buying again from them, especially expensive items.\n\n2nd ANSWER\nAlthough I had complained within deadline, they told me just like here: put it back for sale. Great solution for Vestiaire Collective: one more seller, perhaps one more commission if it ever re-sells. I must put it at a price including my extra taxes and their commission, I have to wait, very realistical. No acknowledgement of their error and no sanction regarding the color mismatch.  Adieu Vestiaire, should have seen your bad ratings before. It is my second trial with VC, my error is to have tried again.","title":"Buy at your own risk: Merchandise does not match picture and  extra costs","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"HJ","text":"Terrible policies which do not protect buyers nor treat them fairly. \nI reported an issue with my item after an apparent 72 hour time window (I received my item over the weekend in which I was away so did not open my package until after 72 hours of receiving it) and because of this, Vestiaire claim that they cannot help me.. \nThe item I received is not as per imagery nor description so I have basically paid £180 for a bag which now needs a professional clean which is around £100 - this was NOT within the description and the photos have clearly been edited to make the sale. \nI reached out to the seller who also has ignored me - not sure how this seller is a 'trusted' seller when they are selling items not as described and are being unfair and unhelpful. \nI am so disappointed that I have basically been scammed £180 with no help or support. \nPoor customer service and ludicrous\/ unreasonable policies. \nI certainly will not be shopping on Vestiaire again which is a true shame.","title":"unreasonable policies with little to no buyer protection!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"Eva Zimmerman","text":"After different recent issues with shipments, my items on sold disappeared from my profile. Impossible to get a reply from customer service, or in case I get a reply, it not helpful. Reading the other comments, I saw lots of negative comments, while before I was satisfied with the platform. Probably changes in management and leadership, but definitely an app to avoid in this period.","title":"After different recent issues with…","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"Xénon","text":"Ordered a bag from here, the bag was fine however, according to the description I am supposed to be getting the original box as well but when it arrived, it did not get it.\n\nTried contacting customer service, it has been a week and I still have not got a reply from them.\n\nI literally put in my order number now they are acting dumb as in they did not see it.","title":"Takes ages to reply","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"Ben","text":"I bought a Loro Piana jacket, received it and the jacket was obviously fake. I checked with Loro Piana who confirmed it’s a fake one. I sent it back for reimbursement. Vestiaire Collective checked again and insisted it’s not fake to be sure not to reimburse me. It’s a perfect scandal and shows the low quality of the review and item sold on the website.","title":"Mostly counterfeit items","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"AdaP","text":"Lately been having the worst experiences as a seller. An item that I sold has arrived over a month ago (soon 2 months) & picked up by the buyer but I still haven’t got my money. \nSo, I have no item anymore and no money. I have contacted Vestiaire at least 4 times - nothing has been done to resolve this issue… they just told me to contact the carrier company myself.\nThis is the second time this has happened, I will never use Vestiaire again, it’s simply not reliable.\nOther apps refund me after a week or so in similar circumstances, please reconsider before selling, you might lose your items and money!","title":"Unreliable for sellers","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"Nicola Jane Meskell","text":"BEWARE of this site they sell fake items at full price .\nIT IS HARD ENOUGH TO EARN MONEY WITHOUT BEING SCAMMED . I PAID €149 for a fake Alexander McQueen scarf . Do not shop here","title":"BEWARE of this site they sell fake…","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"Khanh Huynh","text":"PLEASE DO READ THE REVIEW BEFORE PLACING YOUR ORDERS IF YOU DON'T WANT TO HAVE THE SAME ISSUES AS ME.\nMINUS STARS IF I CAN DROP IT.  \nOn 29th December 2022, I purchased the item (Saint Laurent boots). On 7th January 2022, they notified me that DPD would ship my packet at 10:43 - 11:43. However, I didn’t receive any signs. Then I came to DPD's website, DPD COURIER told me that they were unable to deliver my packet. On Monday, 10th January 2022, I received an email from Vestiaire to pick up my packet. I saw the location is at Raunheim, 30 kilometers from my place. However, I still came to Rauheim, but DPD told me the packet was lost, and I have to contact Vestiaire Support. It reached 2 months from the day I ordered the item and 1 month 11 days from the day I reported the issues with VC.\nI have tried to cooperate and provide all data that VC need, including MY personal information data, my signature, my statement. But until now, there has not been a satisfactory word or goodwill cooperation from VC's side. Any announcement of their replies is non-sense, only waiting for the replies from couriers without ANY information updated. Even the DPD courier confirmed the packet had been lost since my last call to DPD. \nSo PLEASE GIVE ME THE meaningful ANSWERS THAT I NEED, SUCH AS GIVE ME BACK MY MONEY, MY ITEM, OR ANY SOLUTIONS. And please don't say \"respect for my patience\" because I can't stay calm when almost 2 months have passed with the meaningless information.\nGOOD LUCKS WITH YOUR BUSINESS. I am definitely no longer a customer.","title":"STAY AWAY FROM VESTIAIRE COLLECTIVE","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"Magdalena","text":"I have been a customer of Vestiaire Collective for 7 years now and I will not cooperate anymore with them. \nThey sold me some articles verified as original products and when I try to sell them few years later, suddenly they cannot verify them as original anymore.\nOnce I bought a Chanel umbrella and they informed me that I wouldn’t be satisfied with it, that is why they canceled the sale. I was not asked about my opinion, I didn’t get any pictures. They just send me my money back. Somebody from VC uses my umbrella probably until today.\nThe worst thing was not answering my Messages after I bought a Hermes Kelly from them. Everyone who is into fashion, knows what money I am talking about. The box was opened probably by the carrier, everything was upside down inside and some accessories were missing. I wanted to talk to them about a claim to the carrier, but it was impossible to contact anyone and they didn’t respond any mails. \nDid I buy a fake bag and they know it?\nI don’t trust them anymore and have to warn you, they are not honest. \nTry TheRealReal or Rebelle instead. Anyone but VC.","title":"Vestiaire Collective is not honest and unprofessional","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"Aisling Wallace","text":"I am extremely angry about a shopping experience on Vestiaire Collective. I paid €128 for a Sezane jacket on 13\/12\/21 which never arrived. I was in touch with VC customer care team many times including on 19\/12 and on 27\/12 and numerous times in the following weeks. The chat conversation were time consuming and unhelpful. I was asked to provide hand written confirmation the item has not arrived which I did 3 times. Today I have just received an email that they are closing the investigation as too much time has passed and the carrier won’t look into the matter. I understood VC to be a reputable company, but they are clearly not. They have basically taken €128 from me (including shipping & insurance) and I have received nothing in return. I will be taking this matter to my solicitor as it can in no way be compliant with EU law.","title":"Paid €128 for a Sezane jacket - did not arrive. No refund and VC have closed the investigation!","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"Matilda Leitch","text":"I have been an excellent seller for Vestiaire but my last sale is the most awful, unprofessional service to date.\n\nI sold a Chloe coat which they deemed not up to standard as the suitbag is from the retailer, not Chloe botique.  This is how I bought it, description states it included a suitbag (they can argue I should have said non-branded suitbag).  This is not the worst of it.\n\nAs the item was being returned to me, I received a notification from DHL to pay duty and tax.  I emailed Vestiaire right away to fix it as I should not pay duty or tax (it's a return item not a sale).  Some days later I received my coat back - with missing coat hanger and dirt marks on the suitbag.  I emailed Vestiaire right away for them to resolve together with pictures of what I sent on the day and what I received back on the day.  Still no response to this!\n\nTo make matters worse, I since received another email from DHL as collection notice for the duty and tax.  I emailed DHL to let them know it's a return for consignment and I to contact Vestiaire.  I also sent another email to Vestiaire asking them to resolve the issue.  After days of waiting for a response, I'm told it's my responsibility to pay duty and tax.  I reminded Vestiaire that I've had a return before and didn't pay anything and that it is a return  not a sale.  Still waiting for this to be resolved as well as the missing coat hanger and the fact that the suitbag now has dirt marks on it.\n\nAnyone know best authorities to take this up with?  I could probably charge them for stealing the coat hanger and ruining the suitbag.","title":"Incomple return of my sale","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"Sergi Sa","text":"I’m a seller, and have been selling for years. I sold an ANTIQUE Goyard trunk, which is over 100 years old. In the description, I say that it is antique and very old, and in good condition for it's age. Which it is. It’s a transatlantic trunk of over a century. They are returning my item because: 1. By e-mail, they tell me it is not exportable. 2. By chat they say they don’t sell this kind of items anymore (which I don’t understand, as it’s been listed for over a year). 3: In the app, it says the item doesn’t match the description, which does match it. I already said, it’s a transatlantic trunk of over a century, it’s not gonna be perfect, and the photos show it’s estate. In addition to this, the customer service is outrageous. When you ask for an explanation, they just say “I don’t know, I’m not the one who doesn’t approve purchases”. Incredible.","title":"Outrageous customer service","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"Melodee Morane","text":"I am seller of over 700 high value items on VC a few weeks ago I sold an item they decided was fake which it was not , I provided proof of purchase, its been 1 week and they have not responded to my e mails. My item is worth over £500 and I now have to PAY them to send my item back which is all due to their incompetence. In addition my seller rating has been removed because they don't know what they are doing !!! it seems their authentication experts are not actually experts.","title":"No idea about authenticity","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"Joanna Aitken","text":"Two orders within 7 days with two issues:\n\nIn the last 7 days I have placed 2 orders for boots on Vestiaire Collective both orders have had serious issues.  First order placed for a pair of Saint Laurent boots, these were used but the photos on the website showed the boots as being in great condition and described by the seller as 'very good condition'.  When the boots arrived they were in dreadful condition and it was obvious the seller has listed them for sale and continued to wear them after listing them and when the boots finally sold on Vestiaire the condition was nothing like the pictures or the desciption posted, the boots were in a disgusting condition, filthy dirty and covered in scratches and creases.  Vestiaire dealt with this situation quickly and issued a shipping label for the boots to be returned to the seller.\n\nI decided not to take the risk again and ordered a brand new pair of Saint Laurent boots from Vestiaire - order number 52216928 for £455.  The boots arrived yesterday and I immediately tried them on.  When I put the boot on my right foot I screamed out in pain and had to gently ease my foot out of the boot as there was something in the front section of the boot that had cut my foot.  I put my hand into the boot and something then stuck into my finger under my nail.  When I looked into the boot there was a large two pronged staple stuck up through the sole of the boot into the cavity where your foot sits.  The staple was at least 1\/2 a cm long.  I tried to get my hand into the front section of the boot to pull the staple out but as the boots are pretty slim at the front there was absolutely no way of getting a grip of the staple without damaging the boot. The staple is stuck solid in the front of the boot and I believe the only way to remove it is to take it to a shoe repair shop and have the sole of the boot removed to take the staple out.  I have managed to get photos of the staple inside the boot.  I contacted the seller on their sales page and she replied stating \"I tried these boots on and there was no any staples inside or any other problem\", her wording. Wow this person must have teflon feet because my whole family have now viewed and felt the piece of metal inside the front of this boot!\n\nBecause this was a direct sale I reported the problem to Vestiaire and sent them pictures of the staple sticking up inside the front of the boot.  I asked them for a partial refund in order for me to take the brand new pair of boots to a shoe repair shop and have the staple removed in order for me to be able to wear the boots. Their response is both shocking and unacceptable.  They responded as follows:\n\n'I am so sorry that you receive an item that doesn't match the sellers description.  Since the sold process of your item is Direct Shipping we cannot give you any compensation or partial refund.\n\nWe can only offer you two options:\n\n1. Relist the item without commission and receive the proceeds of the sale.\n\n2. Return the item for a full refund.'\n\nI cannot believe that Vestiaire have sent a message stating they are willing to relist such a dangerous item that has already cause injury to me.  Why would I relist an item and let someone else go through what I have experienced.  These boots were supposed to be brand new, they are clearly a faulty pair of boots the seller is selling on Vestiaire's website to unsuspecting buyers. If I buy a brand new pair of boots I expect to be able to wear them and not have to spend more money getting them repaired in order to wear them.\n\nI have now asked Vestiaire to send a returns label in order to return the boots to the seller but so far I have heard nothing further from them.\n\nThe fact that Vestiaire or the seller are taking no responsibility for the condition of these brand new boots and the fact that I have been injured just by trying them on is totally unacceptable and wrong on every level.  The pictures taken are clear evidence of the condition of these boots. \n\nPlease be aware when using this website that what is on a sellers listing pictures and contained in the description is not always an accurate portrayal of the condition of the item you will receive!\n\nI live in the UK - Standard shipping as you suggest for an item located in the UK means sending it to France for verification.  It will then be sent from France to the UK and incur import duties!  Why would anyone located in the UK purchasing an item located in the UK want to incur unnecessary import duties?? Another ridiculous response from Vestiaire!!!!","title":"Two orders within 7 days with two…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"Ellee","text":"Can I do a minus!! What a complicated unhelpful set up at Vestiaire Collective\n\nLengthy scribing to place post Submit brand logo photos.. 5 of them! When your carefully scribed post is 'not accepted' you're not told the reason & you loose ALL of the input info\n\nOn second try after a hollow chat with the bot then someone who can't tell me anything further but instructs I try again so repeat input.. result the 'computer' again says NO without giving reason 🤷🏻‍♀️\n\nAfter reading further I see there's myriad complaints so lesson learned.. if you value your time read trustpilot first & do not complicate your life with Vestiaire Collective\n\nUPDATE:\nHi VC Team Well thanks for reaching out but really.. have I the time when the link to contact you which you gave that I copied & pasted states:\n\nVestiaire Collective\nThe page you were looking for doesn't exist\n\nYou may have mistyped the address or the page may have moved\n\nTake me back to the home page\n\nIf even your customer service links do not work how can you purport to be making sure everything is for the experience of the VC customer.. can I suggest you try listing something yourself & going thru how your process works.. also making sure that there is a way to contact you directly when it’s apparent there is an issue \n\nLife for all of us is actually rather short.. simplicity & ease of use for the customer would be a beneficial endeavour for VC to have Do provide me with a working link & I’ll be very happy to follow up on the issues for the true benefit of Vestiaire customers","title":"Can I do a minus! for Vestiaire Collective","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=16&stars=1&stars=2&stars=3"}]