[{"date":"2022-02-22","author":"customer","text":"My package was never delivered. Vestiaire demanded I send a copy of my ID (for what??) and a signed letter before they would open an investigation with the courier. Then they did not even open an investigation! Now they are bouncing me around Customer Support agents who don't answer any questions. They are worse than robots because they can lie. I have been a customer for years but never again. AVOID UNLESS YOU ENJOY BEING SCAMMED.\n\nEdit to respond to their reply: You are all liars. I already heard from a rep that they couldn't do anything. I have not received a case number despite multiple requests. I WANT MY MONEY BACK. I don't have my item, where is my refund??? You are scammers pretending that \"customer service\" is doing something. I hope others stay far away. Your company should be reported.","title":"AWFUL EXPERIENCE, AVOID","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"Monica Dougall","text":"I sold a paid of Dior jeans on the site. Brand new, never worn. I took pictures of the labels and jeans only to receive an email saying the buyer has raised a concern and the jeans are being sent to us for checks. \nToday I received an email saying the sale has been cancelled due to the item not passing quality checks and if I want the jeans back then I need to pay £12 for the shipping. The jeans were purchased from Harrods around 5 years ago! They are no way fake and I seriously can't get my head around the outcome. I eventually got hold of an agent online, only to be given the run around and he then disappeared! \nPoor customer service, poor overall experience....I'd give it zero stars if I could.","title":"Awful customer expereince","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"SS","text":"I have had the worst experience shopping at Vestiaire.  It’s impossible to reach customers service. You can only email or chat with them and then they just give you the run around.  I purchased an item that was not compliant with the photo and they refuse to honor a refund.  I have never experienced an experience like this with other online luxury stores.  Shop at The Real Real they have the best deals and customer service. I will never shop Vestiaire again!","title":"I have had the worst experience…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"J Steventon","text":"I sell very little on this site, charges are extortionate, and you cannot select which shipping companies you can post your items with, it's apparently random according to their CS team, was asked to use Fed Ex to ship an item worth £20, my nearest drop off was an hour away so not economical or convenient for me to do so, so cancelled the sale, then lost my 'trusted seller' status, was not told this by their CS team, I am going to delist all my items and close my account as CS is appalling and not worth my while using this site.","title":"Poor customer service and extortionate costs","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"Daria Belinska","text":"Almost every time when I post an item for sale, the description is being modified in a stupid way, so you have to waist a lot of time to change it. The expertise of the quality team is also very doubtful as it can state an item is non-compliant because of the the minor defaults that were written in a description.","title":"Almost every time when I post an item…","stars":2,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"david botero","text":"One word... HORRIBLE. \nSold a Cartier bracelet through them. They received an empty box. They said they will investigate. After two weeks, I speak to fedex and they say VC has not started any investigation with them. Spoke to one representative saying they have started the investigation and waiting on fedex response. 2 weeks pass, I message them again saying that fedex has not received any intent of investigation from VC, and the new representative on the chat says I can open one for you. Giving me the run AROUND. Extremely horrible and unprofessional. Don't sell anything with them.","title":"One word.. HORRIBLE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"Alaria","text":"Worst experience!!!\nI wanted to sell a bag there and after they mentioned it couldn't be authenticated, they said you have to pay a return fee that is just accepted by direct bank deposit to a bank in France, no PayPal or credit card allowed. First of all, they didn't mention at all on their website how it works if you want your item back and the fee and etc. Secondly, when you want to make a wire deposit to a bank it usually has a fee of 35-45$ depending on the bank you have. I finally used an online money transfer and sent the proof of payment completely the same day. I have again been asked to sent proof of payment! then again which IBAN you use! then again proof...such a simple and straightforward thing doesn't need 2 weeks to get fixed!!!.... In the end, they sent my item, and the coin purse is not included!!! my bag is now partial, I still don't know if it is a mistake or if it was stolen deliberately! very disappointed!","title":"Worst experience ever! Avoid this company!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"Sophia Rashid","text":"Awful customer service \nI received a faulty item and there was no concern regarding a potential solution only that as 72 hours had passed they could only suggest re-listing the item which it would not get approved for! Awful site - avoid as much as possible\n\nUpdate - after this response I contacted customer service with my item reference number of #18986335 and they refused to help despite me showing this response!","title":"Awful customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"Martin Moore","text":"Having complained to vestiaire about poor service and not getting anywhere. My louis vuitton handbag is marked on their website as sold when it wasn't. Stay away.\n\nFollowing on from vestiaire reply....\nFirst of all there was no defect and had the bag had never been used as you say. \nAlso you should not mark the item as sold when it has been returned to me. This is misleading people.","title":"False advertising","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"Ekaterina ","text":"Hello!\nI’m the seller, I’ve sold the Gucci ring and shipped it to VS team, VS team received my package on 28 January, 1 month later (24 February) there is no info and no payment for my item. Now they are sending email that they received “empty box”. After the month!!! Horrible experience!\nI’ve been selling for 4 years on different platforms, first time see such horrible attitude.","title":"They lost my item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"Seol Ye Lee","text":"I've purchased Celine Crocodile Handle bag in Dec 28 2021 in price of $1300 for bday gift to mom.\n\nMy family's nightmare and her worst birthday happened. \nWhen I received it at my home country, the item was obviously plastic fake leather fake logo everything was fake. I was shocked because I've paid $15 Authenticity check. \nThey said since the item was sent internationally I have to use personal expense to return this item for 2nd check. Ok so I paid $120 to ship it back to their warehouse in France. \n\nThe item securely passed CDG Airport custom and arrived at Tourcoing, where their warehouse is located. \nChronopost attempted to deliver the item 3times but failed since either the address doesn't exist or they rejected to receive the item. So now it's on the way back to my home country. I've wasted international shipping fee.\n\nI've contacted Vestiaire Collective letting them know the situation. Their answer was \"because it's crocodile bag it stucked at CDG airport so there is nothing we can do\" I've sent them screenshots proving the item passed custom and was at Tourcoing. They ignore this email keep saying \"there is nothing we can do since we don't have the item\"\n\nThis whole process has been on going for 3months now but I will never give up. Im looking for a lawyer to sue this company. I will get my money back and get more money on my time and mental damage.","title":"Fake bag. rejected return. no refund","stars":1,"location":"KR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"Chelsea","text":"The help department were awful. My parcel was delivered to South London. I live in East London. The sales rep told me to go and get it.....lol?","title":"The help department were awful","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"Monika Lauri","text":"I ordered a backpack plus had it inspected by the vestiaire team. They then sent it to me by a postal carrier which is impossible to contact, and which shows that my item has arrived to the pickup point, to which I went to ask about it, twice, and both times they told me they do not accept tracking numbers like mine, on the app I see that my backpack has been sent back to the sender. I have tried to contact Vestiaire support who told me to send a handwritten statement and some other document, which I did - twice, and all I get it the same automated email, to send them those documents again and again... I don't know what to do anymore. I am furious, the money has long since been take off my account, with no way of contacting anyone who could actually help me. Do not order anything from them!","title":"SCAM - do not order - its impossible to contact support","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"Emily Jones","text":"Thank you for your reply but I had an e-mail to say that you are happy with the item and your team of “experts” believe that they are not counterfeit. I’m in disbelief that a pair of boots that are so obviously fake and a seller who is being deceitful, by advertising items that differ from the description,  is still selling under your platform, especially as a professional seller. The fact you have received screen shots and the boots from me and stand by the seller is very concerning. \n\n\n\n*****Edit******\nThe boots that I returned that are fakes are back up for sale and it appears that the seller has not had his status amended what so ever! Absolutely disgusting that Vestiaire are supporting this criminal behaviour!!!!\nI ordered a pair of boots from seller “Haute” on this website. It stated in the description that the boots were in a fair condition, however when they arrived they were brand new and so obviously fake, they were coming apart at the seams, they were a very flimsy material. I have received a refund, but I am concerned that this is a professional seller. I have asked if anything will be done to stop other people being scammed! But it doesn’t seem like any action has been taken! I have also asked another seller for a serial number of a boot they were selling and then it looked like the seller had changed their name and the item is “Not available for sale” This is very damaging for Vestiaire in my opinion, they should be clamping down on fake products. I will never shop here again. I’ll save up and buy at full price instead as it isn’t worth it!","title":"Not clamping down on fakes!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"K S","text":"Items bought from VC and resold without being worn are judged not conform with descriptions. I am taking them to court over this. I wonder what would financial ombundsman say about their practices! Disgusted. \n\nAlso, read the recent quality report - they found a \"pulled thread\" in a jacket that is made of \"pulled threads.\" See you in court, VC!","title":"Thieves! Avoid at all costs. Items bought from VC and resold are…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"Rosie Glossop","text":"Awful customer service. Ordered a jacket which arrived without the belt, meaning it was incomplete. Messaged the seller who told me she would ship the belt to me the next day. Did not feel it was necessary to file a complaint with customer service at this point, as thought the issue was going to be resolved. The seller seemed genuine and friendly at this point. The seller proceeds to wait until the 72 hours for customer complaints is up, then stops replying and blocks me. Vestiaire say they won`t do anything. The seller will be allowed to continue selling on the site with no penalty whatsoever. Can`t even review her like you can on depop\/ebay. Avoid buying things on vestiaire collective, especially high cost items, as you have zero protection.","title":"Zero protection for customers","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"Julinda","text":"I wonder why is such a bad reviews\nCustomer service are awful \nSomeone needs to do something about them \nI bought a bag that is been 2 weeks in their matching department,I contacted them 4 days on the row and the only thing they do is apologies \nSo far no one knows what’s happening with the bag,so I will cancel the buy","title":"I wonder why is such a bad reviews","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"Pilar","text":"I have been a client of VC for years now and I reached the point where I am so disappointed I will leave the platform. Apart from inflating prices in the last years, I have been the object in several times of discrimination and poor practices: from asking me to reduce prices of items while other sellers have those at much higher prices, to refusing to take back items in different condition than advertised, penalising me for not having invoice of a vintage article or giving me fake vouchers after retaining my money for 10 days when seller cancelled the transaction within second of completing it (lots of free financing for VC with this practice!) Customer service is very poor too. Not worth the hassle.","title":"Poor experience and customer service","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"jaysh","text":"I don't know what to say anymore because really I have never ever been through such bad shopping experience.\n\nI ordered a Gucci bag. You sent me the wrong item. I contacted your team with proofs. They sent the return label. The wrong item was returned AND WELL RECEIVED (as confirmed by you via emails and chats). I contact you all the time via chat and all you say it's still under investigation and that it would take 7 days max. Well tomorrow is the 7th day. \n\nI still don't have any news about the 1000 euros I spent or about the Gucci bag I bought. Now I don't know if it's a mistake or an intended action, all I know is I want either the correct order or my money back. \n\nI will wait until Monday but not longer than that.\n\nI have every single proof. I took a video of myself doing the unpackaging because I was very skeptical given how light the box was and the video shows your shipping label. I have screenshots and proofs of every chat and email I exchanged with your team. \n\nYou have until Monday evening to get back to me WITH VALUABLE NEWS.\n\nThank you.","title":"WORST SHOPPING EXPERIENCE EVER","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"},{"date":"2022-02-26","author":"Stephanie Té","text":"THIS COMPANY IS A JOKE. I HAVE NEVER RECEIVED MY FREE COMMISSION, AND THEY DELETED MY ACCOUNT BECAUSE IT WAS MARKED AS FREE COMMISSION ABUSE FRAUD.\nTHEY ARE PLAYING WITH ME AND MY INCOME FOR DAYS. THEY ACTIVATED THE ACCOUNT AND THEN DELETED IT AGAIN!\nCUSTOMER SERVICE IS THE WORST! NOT A TRUSTFUL COMPANY","title":"THIS COMPANY IS A JOKE","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=15&stars=1&stars=2&stars=3"}]