[{"date":"2021-10-27","author":"Sk","text":"Well, it seems that they lost my item. \nFirst I got a strange message that said „we did not receive your parcel empty“ - I firstly checked trough customer service if it’s true that they lost it or if the get it. First chat was confirmed, that everything is fine. I have all chat sending to my email Adress. Then after a few hours I got a message, that there is a problem with my item. I messaged them again and they didn’t know anything but wanted to email me. \nSo today I got confirmed, that the item is lost... \nSince what I read here, it happens often! \nI am really concerned if I will get my money and how long they will take for it...\n\nUpdate: I have send here the reference number, but nothing happened. \nI have chatted with two people now and they said, the bag is in the Warehouse. I got informed, that I will get a reply. It was days ago, nothing happened. What a surprise. \nI am really upset now.","title":"Item lost","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-10-27","author":"Sk","text":"Well, it seems that they lost my item. \nFirst I got a strange message that said „we did not receive your parcel empty“ - I firstly checked trough customer service if it’s true that they lost it or if the get it. First chat was confirmed, that everything is fine. I have all chat sending to my email Adress. Then after a few hours I got a message, that there is a problem with my item. I messaged them again and they didn’t know anything but wanted to email me. \nSo today I got confirmed, that the item is lost... \nSince what I read here, it happens often! \nI am really concerned if I will get my money and how long they will take for it...\n\nUpdate: I have send here the reference number, but nothing happened. \nI have chatted with two people now and they said, the bag is in the Warehouse. I got informed, that I will get a reply. It was days ago, nothing happened. What a surprise. \nI am really upset now. \n\nRef 18556939","title":"Well","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-10-28","author":"AF","text":"I sold the item 15817043 on VC, almost two months ago, but they lost th item on the post and I was not paid yet. This is very abbusive and illegal behavihour. Their contract with the sellers say that they have to disptach the items within 7 days to be able to keep the sale and 5 days to be able to fit into your expert programme. Nevertheless, the whole thing is a lie, because their delivery service does not work and their customer service is like a collection of boots. They do not count the time that the seller takes to dispatch the item to them (their contract with the seller) but rather the deliver time of the carrier. Therefore, if the delivery company is delayed or looses the item, the seller pays the bill. This is a very dangerous company. I have worked with them for 6 years or so, but their service is going down the hill. I beleive that they will shut down soon. Also, their authentication service is a failure like everyone says. It happened to me having the same item certified as authentic and replica several times. Also, previous workers at the company, left the company and emailed me on my private email to offer their services. So, you know how dodgy it is.","title":"Very dangerous company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-10-28","author":"Magda","text":"Since they started using Hermes my experience had been absolutely horrible. Every time I sell something in UK with direct shipping there is a problem. \n\nBefore, with UPS or DHL there was no issues whatsoever.\n\nNow I waste time chatting to incompetent customer service, then email them, every time getting different answers.\n\nMy item was delivered through the letter box. Buyer has 72 hours to report any issues. Nothing reported but Hermes doesn’t update the tracking on Vestiaire website. \n\nFive days after delivery, no payment, no update. In the meantime had three chats with them and exchange emails. \n\nDuring one of the chats they assured me my payment was on the way.\n\nThen in the email they say they need to confirm parcel pick up!! What????!!!\n\nCustomer service don’t know the difference between a parcel shop (where you can collect your parcel from if you choose this option) and a letter box! Seriously??!!\n\nHere’s a reply from them:\n\n“ We would like to inform you that we will email the buyer to confirm if the item was already pick up on the letter box.\n \nOnce we confirmed we'll process your payment as soon as possible.\n \nI'll keep you posted once I heard back.”\n\nSo the buyer needs to confirm that they picked up the parcel from their floor??? What is going on here??\n\nWhere is the seller in all that?\n\nUtterly ridiculous! Absolute clowns!","title":"Incompetent customer service, payment delays. Avoid!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-10-28","author":"Daisy Arabella","text":"Would seriously advise buying from ebay or depop instead and just paying for your own authentication as theirs is trash anyway. \nThis company do not care about their customers, they favour their sellers. \nI bought a set for £400 and it arrived in bad condition and the jeans are children's size. Even though somehow it passed their authentication service it seems they didn't notice the quality of the top, how ruined it is and the wrong sizing. \nSeriously just avoid. Not worth your time or money. You would think such a big company would have some sort of idea of how to run a business but clearly not. \nShocking.","title":"Would seriously advise buying from ebay…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-10-28","author":"Alina Lezhenina","text":"I have received shoes which were not matching description and returned them back after long discussions with support . Vestiaire claiming thay have proceeded with refund, however it’s been 2 weeks I haven’t received any transfer ( even though they’re saying in 5 days it should be reflected on my account) I’m sending emails to customer support, and it’s only silence back, no feedback nothing. Very frustrating and disappointing","title":"Refund issue","stars":1,"location":"QA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-10-28","author":"Zuñiga Medina Geovani","text":"If you look closely to the photos they are tricky and taken to hide or not show the damages on the items. They have some statements on the condition of the items that the defects have to be shown but with blurry photos you can't perceive any and also the 'verification' service allow a lot of discrepancies and inconsistencies because are not shown correctly at the photos.\n\nA lot of blank breaches from which VC take advantage of to provide products with lack of quality.\n\nIf you have trash, you can sell it on VC, also the missing knowledge of the customer value from the team  is awesome.\n\nAll other platforms maybe survive, VC is on the road to disappear very soon","title":"Defective items and photos hidden defects","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-10-28","author":"Ludmilla Churchill","text":"I wouldnt recommend this platform for sellers. I despatched all my items within 24 hours. I didnt realise that some of my items were shipped to so called ' collection points', in fact those places turned out to be Tabacconists. I was waiting on average 3 weeks until a buyer bothered to collect their parcel. Needless to say, I wasnt paid until the item was collected plus 3 days for feedback. The label didnt indicate the item was going to a 'collection point'. 2.Vestiaire uses return labels for forward shipping. It means as a seller 'you returned unwanted item' and can make no claim against a carrier. Sold items leave your possession with Vestiaire shipping labels but they refuse to take responsibility for shipping mishaps. On one occasion I had to wait for about 6weeks for a payment after the item went astray. I told Vestiaire to pay me and then make a claim as shipping was their responsibility but they took no notice. 3. The vast majority of DHL points dont accept returns, only forward  shipping thus I had to travel 20 miles to one point only that was accepting return labels. 4. I asked to send me a UPS label 2 mins walk from my home, they refused. 5. On one occasion they sold my item during the pandemic. I tried to cancel a sale unable to find a place accepting a DHL return label, web site malfunctioned and after 8 attempts cancellation failed. My item was in my orders and I was virtually harassed by reminders to ship the item. Eventually I travelled 20 miles and posted the item with a live valid label. A week after shipping they told me that they had refunded the buyer because I tried to cancel the sale. Remember that AFTER THEY REFUNDED THE BUYER the item was sitting in my orders, I was relentlessly reminded to ship and the shipping  label was live. Of course I had no idea that they had refunded the buyer. 6. As a seller you will be incessantly pursued to reduce the price. 7. Vestiaire charged me a £100 commission fee on a £380 transaction. I suggested that instead of harassing a seller to reduce the price, they might facilitate a sale by reducing their commission fee.8. Petty nitpicking about my new Prada bag stalled the sale because arguably the dimensions of a large tote were 2-5cm  larger or smaller, not sure. How does it sound to you? And that's not all. I sold 25 items, dont remember one smooth transaction; highest final value fees worst service. And dont remind me of their 'expertise', mind blowing undervaluations and overlooked faults in purchased items.\nHow on earth Vestiaire gets 3\/4 stars????? Do people have a random luck and write about an odd positive experience?","title":"Draw your own conclusions","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-10-28","author":"Petra Hartmann","text":"I purchased a vintage scarf from a UK seller, (being in the UK myself) I was not given the option for a direct purchase and the item needed to be sent to their authentication in France. The cost of this was displayed and added on to my final bill along with shipping fees. The import duty and tax section clearly stated £0 and the final cost clearly stated “total including tax.” I am now being charged £77.60 extra for import tax! Talk about fraudulent and misrepresentation of sales. I will be claiming this back through my credit card company if VC does not refund me for the mis-sale of this item. Very unfair and unprofessional system.","title":"Beware of using this company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-10-28","author":"Beckford ","text":"The seller cancelled the order, I had to inform Vestiaire collective about this. They told me that the order is not cancelled even though I sent them the screenshot. I waited 8 days as they said if the seller hasn’t sent the item they would automatically cancel and send a refund. I had to inform them of this before they decided to refund. Their website states 24 hours if paid by PayPal. 4 days later I am still waiting for my refund. I had no choice but to raise a dispute in order to freeze interest. Vestiaire collective cannot explain why they have not sent my refund.","title":"Avoid this company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-10-29","author":"KM","text":"Absolutely incompetent customer service and avoidance of issuing a refund.\nI purchased an item on the 22nd September (for a holiday i have been on and since returned!) The item was never delivered to the collection point. Every day Hermes tracking stated it was delayed. I doubt the item ever existed. Now they are saying the item has been collected from the collection point (which it was never delivered to) and being returned to sender. I have spent hours on customer chat trying to resolve issue but have had absolutely no joy. Every time i contact them they say they are looking into it but nothing happens. I have asked to be refunded and they are just avoiding the issue like its going to go away. Daylight robbery. AVOID","title":"Absolutely incompetent customer service…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-10-29","author":"Tracy Huntington","text":"Time wasting chat with 3 members who couldn't care less on the lost item over promise on information back to you","title":"Time wasting","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-10-30","author":"Sara Pazin","text":"I would give a 0 if I could. The worst customer service ive ever experienced in my life. \n\nI think the customer service line is a scam? Customer service ignores you and then tells you suddenly if you are inactive they will end the chat. i wrote back saying I am still here but waiting for you to help me and they then say “thanks so much have a great day”. The fake name was “Ricmar Ricky Jr. A”","title":"I would give a 0 if I could","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-10-30","author":"Daniil Shcherbakov","text":"I bought a used expensive bag from the UK to avoid customs fees since I'm also in the UK.\n\nInitially, the checkout page showed no additional taxes expected.\n\nSince the bag was subject to authentification, it was first sent to the authentication facility. I had nothing against that BEFORE I KNEW THAT THIS FREAKING AUTHENTIFICATION HUB IS IN FRANCE?!\n\nNow I should pay a couple of hundreds of pounds for customs fees, in other words, for importing my bag back from the authentification facility in France. BUT THIS BAG WAS INITIALLY IN THE UK.\n\nI wasn't advised that the authentification hub is not in the UK and might be charged additional fees. \n\nWhat is even more ridiculous they have such information on their website, but it is hidden deeply in the FAQ, and I found it myself when I saw that the bag was sent to France, but not when I was placing the order.\n\nI contacted the customer help, but they were useless and rude. They told me they couldn't cancel the order and shipping (I reached out to them 2 hours after the bag was shipped), so the only way I could get the bag now is to pay the fees.\n\nI demand you, Vestiare Collective, to cover the customs fees yourself.\n\nAnyway, I will never order on your site again and advise everyone to beware of your scam-like service. \n\nFinally, please, don't forget one of the general rules of marketing - satisfied client brings two new clients. Unsatisfied client takes four new prospects away.","title":"Horrible site. SCAM!","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-10-31","author":"Debra Carlson","text":"This place is fake and a scam. The customer service are useless and worthless. The expert team are not so expert. I have not received my item for almost two months now. I have talked to 10 agents! 10! But it seems that everyone who works there have no idea what they are doing! They refused to give me my refund!\n\nI got a response about an order that wasn’t shipped, yes I did get the refund for that. BUT, Did you check the other orders I placed? That still wasn’t delivered to me? I really wish you guys are very thorough of your process. Check the details next time.","title":"This place is fake and a scam","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-10-31","author":"Maxine Symonds","text":"Terrible customer service , if u have a problem forget it there not interested \nThey con you with so called codes for money off that don’t work . They don’t care about customer service , worst online designer clothing company I’ve dealt with and I use them all . They don’t care if your a valued customer or not . They also con the charity easyfundraising by not giving the money they say they will when you shop thru easyfundraising app to Vestire , again they come up with all sorts of excuses not to pay what they owe .","title":"Terrible customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-10-31","author":"Claus","text":"Let me start by saying that if everything goes well, then it’s an okay experience, but really VC can’t take any credit for it because the site itself is clumsy and cumbersome and also it’s all down to another honest seller putting in the work, not them.\n\nIf something indeed goes wrong, then you’re stuck with the most incompetent customer service ever who seem to either not speak proper English (maybe due to the fact that they’re offshore in the Philippines, gone are they days when you had Europe-based staff that would speak your local language) or hold you for an imbecile.\nShoes 18420539 came with slightly damaged soles and VC accepts that it’s a defect which wasn’t clear from the listing.\nNow I’d like to keep them and am asking for a partial reduction (of only 15 Euros, something perfectly reasonable in my eyes), but the customer service agent has now for the 5th time confirmed there is no way of issuing this. By now that has probably cost them more than what I’m asking so it’s not even frustrating a customer, but also simply idiotic from a business perspective. Not sure why you’d make a customer go through all this when they’ve already gathered a decent lifetime spend rather than making them consider eBay, RealReal, Rebag and all these other competitors out there due to your incompetent customer service. You could even write it off as retention marketing spend.\nWorst thing is that the communication with the CS rep is more frustrating knowing that there is probably an actual person on the other side who chooses to ignore everything you say and copy-pastes the same thing for five times in a row. It would be easier to accept this from a bot, at least they don’t have the option to think for themselves.\nI’m reaching out here to be able to speak to someone who has their senses together.","title":"Absolutely frustrating customer service experience","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-11-01","author":"Jessie","text":"Seller, don't use this website!! I sold a pair of Prada shoes and sent them out to the buyer. It has delivered a month ago. You guess what, the buyer did not pick up for a month. I believe she just doesn't want them anymore and wanted to return. I don't know what's going on. I don't know why shoes not sending back to me for a month. I contacted Vestiaire many times by their stupid chat, they are just rude and did not solve the problem. The website and the buyer are a fraud because they are not honest. The result is I lost my shoes and cannot get the money back. Never ever use this again!!!","title":"Seller","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-11-01","author":"Danielle","text":"Ref items:\n\n15393798\n16490893\n16215034\n\nI sent out 7 pairs of UGG boots via direct shipping on 3rd October. 3 of the items (referenced above) were not collected by the customer and the tracking information stated on 14th October that the items were being returned to me.\n\nI’ve since been going round in circles on the online chat and eventually asked for a direct email address to avoid explaining myself yet again - this email does not work and there is no telephone number to speak to an actual person. You have to fill in the enquiry form and hope and pray someone replies to you.\n\nAfter getting a response and going back and forth with one of their customer service team - I’m left with no choice but to leave a bad review. It’s been 4 weeks since I sent out my items and I have neither my boots or the payment. \n\nI am repeatedly informed by a copy and paste email of the information provided by Hermes on 14th October - that my items are being returned to me when they are clearly lost and the tracking has not been updated.\n\nI am unable to contact Hermes myself as I no longer have the postcodes for the deliveries - I used Vestiaire’s pre paid shipping labels as they arranged the delivery - I cannot contact Hermes without the postcodes. I have informed customer service of this but they have stopped replying to me.\n\nPrior to this everything was ok with selling on Vestiaire - but once there is a problem - say goodbye to your items and money. Shambolic customer service, it’s a disgrace and such a shame. As a previous reviewer said - it’s daylight robbery. \n\nIt seems it’s a common problem with Hermes not updating the tracking on Vestiaires website and no one at Vestiaire is willing to follow up or open a case with the courier. It also seems odd that 3 items are missing - I did enquire as to whether the items had been sent back to Vestiaire instead of me - but again - no response from customer service.\n\nI don’t enjoy leaving a bad review but it’s more the principle after losing my items, not getting paid and dealing with an incompetent company that refuse to help - if they were based in the UK I would be contacting trading standards and taking it further but sadly there’s nothing I can do other than warn others not to sell with them. I’m only glad that it wasn’t 3 extremely high value items that I sold.\n\n—————————————————-\nEdit - it’s now 14th November and I STILL have neither my boots or my money - I will contact Vestiaire today and see if I get a response.\n\n—————————————————-\nEdit - Credit where credit is due - I finally received the payment for my items today on 17th November which I am very grateful for. It’s just a shame the whole process has been so painful.","title":"When Something Goes Wrong..","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"},{"date":"2021-11-01","author":"youssra baroudy","text":"this application is the worst. I have two orders and I payed a lot of money and they just got lost.\n the customer services never replies. I have lost money and energy through Vestiaire. I dot know what to do.","title":"this application is the worst","stars":1,"location":"EG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=37&stars=1&stars=2&stars=3"}]