[{"date":"2020-10-05","author":"Ashley","text":"Absolute scam! I have sold a jacket from hm x erdem collection, which was in very good condition, with no tags for a low price already, as the website takes almost 20% commission. To think I only made 30£ on the sale. A few days later I got a notification that the buyer marked it as damadged and the sale was cancelled. The item was sent back to me. Mark that the buyer could have worn it and sent back to me in any condition they wanted as it is not checked by Vestiaire collective. If it was a massive difference, ofc I would understand. But I honestly sent an item that was in a very good conditions, having taken pictures of it without any alterations. The picture they sent me was laughable, and showed practically no damage just time passage. This was a horrible experience as a seller and I only hope my jacket will get back to me in the same condition it was sent (which I doubt).","title":"Absolute scam","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-05","author":"Mrs Gabeva","text":"Negative, negative, negative. I am giving ONE star just because there is NO option to give ZERO. And it is not that VC cares, they do not. But as i said earlier, if that can be helpful to other customers, will be nice.\nSo, before was that VC would heavily disappoint once per month. Whatever you do, you expect it to happen and it does. What is more ridiculous is that now they start disappointing in a shorter period of time - in this case 3 days later just a new ridiculous experience. This time - a brand new, never ever worn Chanel dress from 2016 was not accepted by them to post at all. No explanation. Just a short email - it was not selected. VC please do not call your team “experts” or “professionals “ because they clearly are not any of those. I am sure the managers are, but the team is just presenting themselves as a random bunch of people with mood swings and irrational behavior. Because anyone with any kind of basic knowledge of high fashion would not make decisions of the kind. It is simply outrageous. And I understand it is very difficult to find good employees (i myseld have 420, different industry and far more complicated than a trift online shop) but if you want to claim you are professional, be more careful with who you choose to work for you. Customer service is beyong ignorant and rude. I have had only horrible experience with them to the point that i stopped using them - as it is pure waste of time. On top of being unprofessional they are also rude. But what happened today is a completely new level of negative and shocking experience. How and who can possible decide that a brand new chanel dress from a expert seller cannot be selected?!?! And no explanations why - of course, because they have none. Just because somebody felt that way and because if they try to give explanation they know it will be defeated with a factual argument. They just feel good messing with people. But just remember- sellers are not here to make money, it is just kind of ok to make use of the pieces you do not but letting them go for a small amount and make somebody else happy. And VC makes money.  Mostly for coming up with a great idea but the poor performance is defeating the good idea. By pushing away sellers, they make no commission. Simple business logic. But again - the team of “experts” do not care and the managers prefer to keep their eyes closed.","title":"More than Negative","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-06","author":"Shuo Zhang","text":"My sells of shoes and clothes went super well until I started to sell CHANEL jewelries...like the other sellers mentioned, they are rejected for authentity check but without specific explanation. I feel super disappointed and I had to pay the delivery fee to get my jewelries back. Personally I feel humiliated in front of my buyers. I doubt if anyone succeed to sell CHANEL jewelries on VC???","title":"CHANEL jewelries are not accepted by VC?","stars":2,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-07","author":"Rev","text":"A bloody effort to put an item on the site for sale as their useless 'experts' want ridiculous amount of photos and information, you can never speak to the 'experts' or the curation team so you will never know what they really wanted. When the item is finally sold they are taking crazy amount of time to pay me, the chat staff NEVER emailed me back or follow it up as if you no longer exist on their system.\n\nFor the people who are reading these bad reviews about VC on this site, they are all real because I have been through it and cannot wait to get away from them as soon as I get my money!","title":"Beyond the worst","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-07","author":"Yazuma","text":"Appalling company, the website is full of junk and fakes. I raised a complaint with the company regarding their creation team via chat but never had any replies, cannot believe this is the service you get from paying a hefty 25% commission on the items sold through them!","title":"Appalling company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-07","author":"Abbie.rose","text":"Absolutely terrible, paid for my item (burgundy D&G sunglasses)  3 weeks ago. It still hasn't been shipped. Tried to contact customer service multiple times no response. \nPer the guidelines of vestaire collective I should have been refunded if the seller still hasn't sent the package after 14 days. \nI have contacted vestaire about this, no response, still no refund.\n\nUpdate: \nVestaire contacted me a day after writing this review. \nOrder was refunded and given a voucher. \nConsidering all of this I would now rate 3 out of 5.","title":"Item never sent","stars":3,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-08","author":"Jelle Jacques","text":"HORRIBLE APP\n\nSold 1 designer item on this app.\n\nFirst of all:\nThe profit they take out of a transaction is WAAAAAY to much. I sold some Ann demeulemeester boots on here for €350, the total profit I eventually got out of it was €262, which is almost €100 profit they made out of it!!! This is only an app, so please calm down Karen.\n\nSecond of all:\nKnowing the profit they make out of people selling their goods, at least you would expect excellent service and liability, right??Unfortunately this is everything but the case.\nI've seen several counterfeit items for sale on this app, so if you'd think you get a guaranteed authenticity here, think again.\n\nAlso their costumer service is absolutely horrible. Couldn't contact someone who was able to help me properly, because they even barely speak English lol. \n\nThe status on the tracking did not update, so my costumer thought I still didn't send it, which led to frustration etc. The app censored every information I tried to give him etc.\n\nCan't say a single positive thing about this app. \n\nWill NEVER use this again. The only thing I can say is be careful because they are money  sharks and thieves","title":"HORRIBLE APP","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-09","author":"Catherine","text":"Before using this site read the bad reviews before the good as this is a shoddy run company.\n\nFirstly, it is full of serial timewasters who make offers on items then never proceed to purchase them once you have accepted their offer. There is no recourse i.e. an ability to leave feedback to warn others so if this is how they get their kicks there is no deterrent to stop them doing it.\n\nI then got my first sale I posted the item straight away but it took them almost a week to acknowledge it. I then received a message telling me the bag that had never been used and removed from its packaging was covered in scratches; it was in perfect condition when I handed it over. A price drop was offered which I agreed to as I just wanted the long drawn out process over. It turns out after just receiving an email telling me the bag was on its way back to me via DHL the buyer refused the item. I contacted customer service and they tell me I should have received a message telling me this but when I asked when the message was sent they could not answer. I have just received my Tory Burch bag back and I am furious; it was not returned in the original packaging instead placed in some random plastic bag. Also the plastic protection covering the clasp had been removed and randomly stuck to the leather at the front of the bag. The part I am most annoyed about is the huge scratch down the back of the bag which was not there when I handed it over and I have photographic evidence to prove this. I am now raising a formal complaint and have asked for a full explanation as I will be taking this matter further.  I will never use this company again and based on my experience advise all others to avoid it. I will stick to local buying and selling sites at least they don’t cream a fortune off the proceeds and you can liase with the buyer yourself.","title":"Avoid!","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-09","author":"Tara","text":"The worst customer service EVER. The Vestiaire system doesn't work, when you order they give you a waybill number to call a courier and they are meant to register it but they don't so you have to spend a half an hour onto customer service every time you make a sale trying to sort it out.","title":"The worst customer service EVER","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-09","author":"JS","text":"Re-Posting because VC's response made it sound as if there wasn't a problem. \n\n*** VC tried to bill a different (higher) price than I'd bid. Sharp practice or technical 'bug'? ***\n\nThey say in their response, '... I did pay £66... . True, because the seller and I communicated - VC chat said they couldn't do anything about the higher price in the checkout and didn't want to admit there was an issue. Hey? Accepted bid of £66 turns into a 3% higher amount at checkout - sharp practice. Without my consent - illegal? Small amounts add up....\n\nWe waited until the offer expired then I put in another bid. This second time the bid amount wasn't changed. \n\nVestiaire's denying there was a serious 'technical issue' is typical and shows they won't investigate and correct it. Their technical people are sloppy, not 'expert' and if the 'bug' doesn't happen a lot they'll just hope people won't notice: if one bought a number of things one might not. Appalling for any business, not just an e-platform. \n\n*** Original Issue:\n\nOffered £66, get a message saying offer accepted, then on checkout notice the amount is £67.65. Go back to check: I see my offer, also the message that the buyer accepted - but with the different amount.\n\nChanging the offer price without the buyer's consent is illegal. Buyer truly beware!!","title":"Sharp practice or technical 'bug'","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-09","author":"Malinka Omaïma","text":"Very bad, it will be the last time I ordered something at Vestaire Collective. I ordered Louis Vuitton bags and wallet previously. But now I ordered a gucci lunnetes\/sunglasses. They seem fake in my opinion. And very very small. The distances of the end of the feathers is 7 cm. I don’t know on which head that fits but certainly not an adult one. I told this to vestaire and they told me to send the item back to check the authenticity. They say it’s a real Gucci.which I still disagree on. So that put to side it’s still a sunglasses that’s totally out of shape.\n \n\nNow the package is again on his way to me. Very disappointed in vestaire and will not order there again.","title":"Very bad","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-11","author":"JS","text":"Vestiaire goes both ways: When it works well, it's a great idea.\nSadly, when it goes wrong, Vestiaire falls apart. Review procedures always fall back on 'experts' who really aren't. The technical team is sloppy, often introducing changes and fixes without proper testing. Customer Service can actually do very little. Must be frustrating. \n\nI wrote two negative reviews recently about a serious technical bug. Today I get a message my seller status has been downgraded. \n\nHuh?\n\nMy last four items (the relevant 6 month period) have all conformed 100%. Customer service chap can't explain it. \"Sell more, ship on time, don't cancel\" was all he could offer.\n\nIs this just another random technical 'bug' or is there a link to my negative review? Such a coincidence..","title":"Coincidence? Complaint and Status Downgrade","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-11","author":"Penelope","text":"The second review as I have never heard back from the staff after logging a complaint via the link VC have sent, the only way they want me to do this is to avoid showing their incompetence on here for people to see! \n\nWake up people, this site is a completely fraud and only care about making money off your luxury items and don't care about you when you have issues! SHAMEFUL!","title":"The second review as I have never heard…","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-11","author":"Amy Carland","text":"Purchased a pair of 'Vestiare Collective professionally authenticated' 'Zimmermann' pants. Pants arrived and are so clearly inauthentic it's unbelievable. The care label even says things like 'farment' instead of 'garment' (and that's one of many typos on both the garment care AND fabric composition labels). This team absolutely CANNOT BE TRUSTED WITH AUTHENTICATION and also have not responded to my concerns at all (but have sent an automated 'how was our response to your complaint' survey email to me, even though they haven't actually responded to it... What on earth??). I have launched a buyer protection process through PayPal. DO NOT BUY FROM VESTIARE COLLECTIVE. Even if eBay has lots of fakes at least they respond to and resolve buyer complaints. I'll be going to back buying on eBay.","title":"Fake item, no response from VC","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-11","author":"Connie","text":"Very poor service and do not have any attempt to purchase anything on here! \nI recently purchased a Chanel bracelet with box, however it only came with a “cloth” like bag holding it. So I sent email to asked and complained about this, as I made this purchase and it’s for my own collection which I just want the box to come with. What the customer service replied was that they “think” the box is missing and only offering 15 euro voucher for next time purchase. Which is ridiculous as I am not making any attempt to make purchase with them at all! \nAvoid!","title":"Very poor service. Avoid!","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-12","author":"s s","text":"DO NOT SELL HERE! Sellers have no support in VC and the portion they take from sale is huge & Buyers can cancel sale on any given fake reason.","title":"DO NOT SELL HERE","stars":2,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-12","author":"DontUseVestiaire","text":"This website is absolute trash. Their “carefully curated” selections and “team of experts” wouldn’t know a real luxury product if it hit them over the head with a baguette. They refused to sell my 2020 Canada Goose Black Label jacket frankly because their team is misinformed, uneducated, and dull. Despite showing them proof of the tags, labels, and a link to the jacket online, they refused to sell it. However, after reading almost all negative reviews, I’m glad that I didn’t. Additionally, they refused my jacket because the photos were too professional and they thought I took the photos from a different site. Meanwhile, the photos of Canada Goose on their website are tired, stale, and look as if they were taken on a 2000 Nokia. If you read this, don’t ever use Vestiaire Collective.","title":"Misguided “Experts,” Stale Collection","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-12","author":"GS","text":"Selling an item with them that i BOUGHT from vestiaire and it was declared nonconform and counterfeit?? And then I had to bank wire them €12 or something to get it back and they told me they’d ship it after 2 weeks. Well a month has passed, and i’ve emailed them multiple times, and nobody has sent the item back to me. The service sucks, the people suck, the app UX sucks, everything about it sucks. I have literally never had a worse experience. I’m missing a $4000 item that may or may not be counterfeit, but either way I got scammed out of $4000 by these people. If i could give 0 stars I would.","title":"They suck.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-12","author":"Al-Noor Home Fragrances","text":"Scam scam scam!!! They pre collect customs and duties but fail to forward the money to DHL, so when DHL is trying to deliver your package, they want duties and taxes. I called DHL and told them I had already paid them to VC when I made the original purchase, but they confirmed it wasn’t paid. So in order to have my package delivered, I had to pay Duties and taxes again! Clearly, they are scamming people. I contacted VC to explain this situation and they told me to email the paid DHL charges and would reimburse me up to $61. That the heck??? So far, I am out $98 and waiting for a refund on the double charge. I hate this\nCompany and I will delete the app once I have my refund!","title":"Bad bad bad!!!!!!!!!","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"},{"date":"2020-10-14","author":"Pearl","text":"As others may have previously mentioned on here about the site showing favouritism on certain sellers, I can confirm it is TRUE as the same thing happened to me! Disgusting! \n\nI put a wallet up for sale and was rejected even though they have the same items on the site and my quality was way better than some. The rejected reason was - did not fit in our catalogue?! What about other same items they have?\n\nSo I asked a friend to submit the same product and it was successfully passed! I wrote to them to query this but they only reply with the generic messages where I don't know if it was by human or machine! My rating also dropped after complain, absolutely outrageous!\n\nNever heard anything back so I am here to tell the truth, STOP USING THIS SITE! FRUAD! READ OTHER REVIEWS AND YOU WILL KNOW","title":"So all the bad reviews are true","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=94&stars=1&stars=2&stars=3"}]