[{"date":"2022-03-15","author":"Agnė Šukytė","text":"I sold item, with any clear explanation the order was cancelled, I got letter that my item is being returned to me. When I didn't get my item back, I started looking where is it, why I am not getting any information, they wrote that I have to pay 12 euros fee in order my item would be sent to me. About that there isn't mentioned anywhere.","title":"I sold item","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Tess-Barbara","text":"I am new to the platform oof Vestiaire. I just purchased $3005.26usd worth of clothing and shoes. I know crazy. But I wanted to give them a chance. Today I saw there was a complaint made from Vestiaire Quality control. I went to their “Help” area to ask why they were shipping something that has a ligitiment, in writing, complaint on it. They were expensive Isabel Marant shoes. I spent about 5mins with Leo their BOT, questioning what I wanted and I finally said Agent. So I got someone maybe human?(A.S initials of her mane)She was speaking English I did not understand so I asked for a fluent English speaking person. She refused to transfer me. I asked for a manager 3-4x’s because I was getting anywhere with her. She said a couple times there is no complaint. I said “a complaint in English means something is wrong. What does it mean in French!? She told me to look up the definition up in Google.She then ended the chat which it felt like I was hung up on. Not only did I throw a bunch of cash into Vestiaire’s Bank including $650 more with of fees, again crazy me!, I have been in the fashion business for 30 years. I found Aiza Actions so unconscionable. Oh well, at least I found out in 2weeks instead of months down the road","title":"Vestiaire Custom Bad Service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Natalie Egmore","text":"Hello, Thank you for your response,  if you could please let me know what has happened to order number 53451284 Ref:21670482. \n\nI originally ordered this item, order number 52846457 Ref:21321705 but ask to cancel the order as I couldn't get an answer as to when I would receive my order or if they had been lost. \n\nUPS 1Z72609E9150413230  delivered this item on the 4th March to your hub for authentication, since then there has been no update. \n\nAfter my order was cancelled,  someone from Versatile collective in France called me and said the item had been re listed and I could re order it, so I did as I assumed they had been found. New order number 53451284 Ref:21670482. I have been chasing since the 4th of March, where this item is and when I should expect it but I still have no answer to my question, it seems to me that the item is still lost as there is still no movement on them from the authentication hub. \n\nI have been communicating with the seller and understandably she is also confused and concerned where her item has gone and why I have not received them, she has also tried to chase this up but to no avail. If the item has been lost can you please just do the right thing and let us know rather than putting us both through unnecessary worry and concern. It is also quite time consuming trying to chase this up, especially when your not getting anywhere. \n\nPlease could you keep us updated and let us know what is happening? If they are lost can you please refund me and compensation the seller for her lost of her goods. Thank you.","title":"Update from response","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Anna Katharina Strandgaard","text":"I bought a coat on Vestiaire. Everything went as it should, until my package was out for delivery, but wasn’t for some unknown reason. I tracked it through their app, but the status of the package stayed unchanged. After about two weeks I contacted Vestiaire to ask about the package, but I didn’t get an answer. I then contacted the courier, and was told my package was lost, and they couldn’t find it. After I talked to the courier my package status on the Vestiaire app updated and said it was delivered. I then contacted them again, saying the courier told me the package was lost, so how was it possible that they could change the status. Instead of looking into it they wanted me to send a handwritten letter confirming I never received it. They even wanted my neighbors to write one. And this is in spite off the delivery address wasn’t even my address but a courier parcel box. After sending the mail with all the requested information I never heard anything back from them. A couple of weeks went by, and I received a text from the courier saying they found my package. When picking it up the package was soaked and ruined, and the coat I ordered was sticking out. I then, again, contacted Vestiaire with pictures of the package. Again, they informed that I had to send them a handwritten letter confirming this statement. I did as asked, and haven’t heard a word back since, except from their automated email saying “We’ve not forgotten you - we’ll be in touch in the next 24(or 72) hours.” I’ve since contacted them again and again, but still - and as expected - no answer. This is absolutely the worst customer service! Don’t use their site. If anything happens, you won’t ever hear a word back from them.","title":"Worst customer service!","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Joanna Czura","text":"NIGHTMARE. UNRELIABLE. UNQUALIFIED. INCOMPETENT. This is the platform that is supposed to be trustworthy with the luxury goods. It supposedly has experts but they are not able to authenticate the bag that is authentic. Customer service is a joke - not helpful at all. I would never buy anything there. They do not know anything about changing designs or changing safety measures taken by high fashion brands my overall a joke.","title":"NIGHTMARE","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"HB","text":"The worst ever customer service - avoid at all costs. I received an item that was sizes smaller than advertised but they refused to refund the item. The dispute is still continuing weeks later and they refuse to provide any details of their complaints department. An example of their emails - ‘ if there’s no size label then how do you know it’s not as advertised’. Literally! Shocking customer service.\nThe reply to this review says ‘we remain available’ and yet 26 emails in, when I’ve tried to resolve the issue with yet another email (still desperately trying) I get ‘Oops this email no longer exists’ not surprising! Very frustrating.","title":"The worst ever customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"Jerri Roberts","text":"If I could rate a 1\/4 of a Star, that would sum up my feelings about the incomplete, magical rules, and Nazi like behavior, I would!!\nLet’s just start with “Banning” These ppl monitor their site with some keyword platform that will auto ban you for a minimum of 24 hours!  Don’t even think about calling Customer Service, because they can’t or won’t help you. \nYou will get the usual VC Lies! IE; “This will be reviewed immediately by our upper management”, etc. \nComplaint #2 If your order stated that it’s delivered, but it’s really not; you’re screwed. If you get sent something that looks and feels fake, you have 3 days from day of delivery to get any piece in question authenticated by a jeweler, PLUS, Have their findings in an official report! (Yeah Right; like we have the time?” Aren’t WE THE BUYERS? Why aren’t the Seller’s Responsible for this?\nComplaint #3\nI ordered 5 really discounted Bvlgari BZero1 Womens watches before December 2021. Some had plain colored faces, and others had Mother of Pearl faces. \nPlease note that I previously bought a MOP face on this site, and there were Zero Issues.\nThis time, they stated that “Pearls” were being banned from import, so I wasn’t allowed to purchase the Mother of Pearl watches! I was livid!!! I explain to everyone under the sun that a Pearl and Mother of Pearl were two completely different items. They did the usual, “I’ll be more than happy to fix this for you” LIE!!!\nThey canceled my orders that contains Mother of Pearl watches that were supposed to be Christmas Gifts. \nI have so many more complaints, and very little nice things to say about VC. I ended up getting so pissed off that I deleted my account and my husbands account. DELETING MINE AND HUBBY’S ACCOUNTS ONLY EASY PART OF DEALING WITH VC. \nThey Are Incompetent on Every Level, and IF you delete your account, don’t expect them to reopen it for you. That’s another lie I’ve been told. They are “Working on reopening my account. After it goes up the Chain of Command”.\nI’ve been waiting for WEEKS! Don’t Bother!","title":"If I could rate a 1\/4 of a Star","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"Tee","text":"You are better off selling your items on ebay or hardlyeverwornit.\n\nI sold a dress recently, downloaded the prepaid label and posted it. When I tracked it, it was delivered and Vestaire said it was not on their network. I sent proof of postage, my ID card and every information requested, but I was told they couldn't find it.\n\nIt's frustrating because I have be passed around, asked to send the same proof multiple time and still they do not want to hold themselves or their partnering courier company (Evri) responsible.\n\nI have read horrible reports here, but still went ahead using them. For the commissions they charge, you would expect a better process and better courier company process. Please sell off your items elsewhere, use PayPal and document proof. Because, you would be out off pocket if there is any problem\n\nThank God I have not bought any item here, because the buyers review here is horrible. Use farfetch, I had a better experience there.","title":"Avoid, Because if your Parcel is Lost or Has Any Issues Using Their Prepaid Label, they will not Refund Neither will Their Partner Courier Company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"Andrea","text":"I have been using VC for years. The quality of the application and\/or website has never been high, but now it's unbearable. The interface is not fluent, the uploading of the images is cumbersome, the Customer Service is useless and pedantic. I have had problems multiple times as a seller. The last episode: an item I sold has been rejected by the buyer direcly - the product was shipped back to me and it was RIPPED by the buyer itself. Other times the items were just disappearing thanks to the carrier's poor services - and VC claimed they couldn't do anything. Awful, I have decided to use it never again.","title":"Indecent, lacking and useless","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"Natalie Egmore","text":"The worst worst worst shopping experience I've ever had, I've been left in tears today just from pure frustration and stress, this has been going on the two weeks now. There is litterly no proper customer service provider if anything goes wrong, I would not recommend anyone buying from this company, it litterly is pot luck if you get your goods. I'm now being ignored and cannot after two weeks of chasing find out what on earth has happened to my order, one minute they do have it, then they don't then they do, then their saying I've already got it, it's unbelievable the amount of time I've wasted on trying to chase this up. I just want them to cancel this now but can't get a response from anyone.","title":"The worst worst worst shopping…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"Mehr","text":"False marketing , misleading marketing , claiming buyer ready to drop the price but buyer rejects offer. Contact the customer service and its rubbish. They just indirectly tell you to go to hell we are not bothered. DONT WASTE TIME ON THIS APP OR WEBSITE\n\nReply to comments:\n\nI have already contacted your support and its useless. No help and only telling you indirectly bug off. so no point that you guys are commenting to show people you care. Reality is you really dont care and mislead people by false marketing.","title":"AVOID AVOID AVOID Big time AVOID","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"Louisa Parkin","text":"Don’t use this dreadful company. I only wish I had read the reviews first. Awful customer service, everything is automated, they don’t know what is going on most of the time, contradicting each other and providing out of date or conflicting information. They also send you fake messages to say the seller is about to reduce the price of the item, even though they have no intention of doing so. My seller didn’t ship the item or respond to any of my private messages and in my opinion had no intention of sending the item. You should be able to rate the seller like on other sites or they can continually get away with bad behaviour. I have deleted the app and I will NEVER use Vestiaire ever again as it causes so much frustration and stress. I bought the bag full price and got it the next day, trying to get an item cheaper is really not worth it for me, not on this site anyway!","title":"Don’t use this dreadful company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"Zara","text":"Ridiculous £15 'authentication' fees and insanely high delivery fees, even for items sold in your own city! \n\nThe high price would be understandable if the delivery service they choose (Evri - Hermes rebrand - enough said!) was not so abysmal. \n\nAdditionally, Evri felt it was appropriate to give me an hour's notice that they would make a delivery between 6-8pm... on a Friday night! Lucky me getting to sit at home waiting for a parcel after a long day's work. They claim that they set the ETAs in the morning and I saw that they had my parcels in their depot last night and at 6 am this morning...Why leave notifying me to the late afternoon??\n\nThey claim to be green and yet they do not let you avoid their ridiculous authentication service when buying goods from abroad. This not only costs you more money (on top of customs and delivery fees), but forces you to have the parcels shipped to more locations! Not very environmentally friendly. \n\nAwful customer service that wastes your time trying to get you off their back rather than actually giving good service. They do not want to claim responsibility. Please, might I suggest that you take a leaf out of Amazon's book - they know a bit about good service.\n\nThere are so many more things I wanted to buy from VC, but you have lost a customer.","title":"Ridiculous £15 'authentication' fees…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"Stephanie Té","text":"I sold a vintage Louis Vuitton that the buyer paid for by the authentication fee. Now we are only allowed to post 10 photos per item. After I sent my item to your hub, my bag was considered a non-compliant item, and when I checked the report, it just said: TEAR. I posted many detailed pictures as I was allowed. The only place that the bag is torn, I posted a clear picture of it. I treat my customers as premium customers. Before selling an item, I always exchange messages giving the customer more detailed information. For a bag that was sold for £460, I PAID 69 POUND OF COMMISSION for this website and for the authentication fee the customer paid £15, TO RECEIVE A POOR REPORT THAT ONLY CONTAINS ONLY ONE WORD?????????!!!!!!!! TEAR CAN MEAN MANY THINGS, IT IS A VAGUE REPORT NOW MY ITEM IS COMING BACK TO MY HOME, AND MY CUSTOMER DIDN'T HAVE ANY FEEDBACK FROM YOU.  After contacting your customer service, I was suggested to ask the buyer to contact you??????!!!! It isn't the first time you have played with my income! You deleted my account by mistake for 4 days, saying that I had a free commission abuse, when I never had the right for free commission. When my account came back online, none of my listings was there anymore! YOU CHARGE A VERY HIGH COMMISSION FOR A POOR SERVICE. Yesterday I was trying to message the buyer all my messages were deleted! I have just received an email saying that I have lost my expert seller badge! To send that Louis Vuitton to your hub, I spent time and fuel. How is it going to cover it?! YOU ARE A SHAME AS A COMPANY!!!!!!!!!!!!!!!! YOU PLAY WITH PEOPLE’S LIFE AND INCOME! NOW I WILL NEED TO WAIT 3 DAYS UNTIL I HAVE A FEEDBACK FROM YOU! SHAME ON YOU!!!!!!!!! Item is 21677122","title":"POOR SERVICE and charges high commission","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"Sam","text":"Time wasters, non-professionals. Very VERY bad customer service. In case of a problem, be prepared to loose loads of time, energy and even money. Bearing in mind what they tax for their services compared to any other platforms, selling and purchasing from them is strongly NOT recommended. It's high time the VC understood that they can't fool so many people all the time. Ridiculous.","title":"Time wasters","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"Not about the scam","text":"I sold an item on VC, did everything I was suppose to do by their terms and conditions. I have yet to get paid for my item. This is beyond frustrating and time consuming. They don’t have customer service for anything. You just get the run around from a bot. I’m giving them a few more days until I file a complaint with FTC. You cannot keep money from me. I will never buy, sell, or waste my time with this company any longer. They are fraudulent!!! BEWARE!!!!I’m having to jump through hoops for MY money. This is criminal. I can’t wait to see their downfall. It’s coming, I promise! You cannot keep funds from people, I could go on and on. This is POOR business practices. Vestiaire Collective will end up in trouble with fraud or completely out of business due to no care or concern for their customers. This is such a shame, they only want your money and don’t want to release it when due to you!","title":"I sold an item on Vestiaire Collective","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"dianeAllegro","text":"I sold an item about 10 days ago. The buyer received the item 5 days ago and I still haven’t received my money.\nFurthermore, why did I have to pay “\nAuthentication and Quality Control” in a item I just bought if the seller will be shipping it directly from her country to me? To me it’s a very an untransparent way to conduct business.","title":"Haven’t received my payment","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Robert Dixon","text":"Been waiting over a month for my payment, Gucci Watch lost by their courier in transit, just keep getting fobbed of with lies, more lies and more lies. Different contact each time telling me different reasons ( excuses). I followed ALL of their procedures and still awaiting my payment after only four weeks. Send proof of posting. Still No Payment.","title":"Awful Customer Service.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Malte","text":"I shipped my hoodie and a balenciaga coathanger to their headquarters and seller cancelled the order afterwards. After this they only returned my hoodie. They refuse to compensate as they claim i have no proof the coathanger was sent. \nI am now forced to sell my item for a way lower price, since this piece is missing. \nI do not feel safe selling my clothes here in the future.\n\nAlso their customer service is awful, i'm unsure if its even possible to speak to a human from their team?","title":"Part of my item was stolen from me","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Cheryl Brown","text":"Email from VC this am.  \"We hate to be the bearer of bad news, but unfortunately this item is no longer available and your order has been cancelled.\n\nWe’re already working on your refund, which will be on its way to you within the next 72 hours. As soon as it’s issued, we’ll let you know.\"\n\n\n__________________________\nThis is the 2nd time this has happened to me w\/VC. Item on website, I order, pay -as in money pulled out of my account-only to get message next day saying \"Oh sorry. Item actually is not available.  And BTW, it might take 3 days for the money to go back into your account. I will not be using VC again. Too risky  When item sells, VC needs to take it off the web site.It can't be that hard.....","title":"We hate to be the bearer of bad news","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=11&stars=1&stars=2&stars=3"}]