[{"date":"2021-02-26","author":"bianca mihaela","text":"I'm a seller since two years in this platform with up of 500 pieces.\nSince December 2020 get worst,from chat support and quality control.\nThey are not capable to fix even a problem with payment that should have priority .\nBefore i use to love this platform and employers were 5 stars ,now even 1 star not deserve!","title":"Terrible change","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-02-26","author":"Sarah Smith","text":"I sold a beautiful very expensive bag. I described the bag perfectly. They then contacted both me and the buyer to tell her that , although I had described it correctly,  they were going against their own terms and conditions and offering her a full refund,  encouraging her not to buy ! Absolutely crazy.  They do not make any sense. Contacted customer non service,  who hung up on me . Got another one who said \" oh no , this is actually very serious,  I'll get someone to contact you.  We will escalate this . They should NEVER have done this \". Alas , no contact from them ever again. The only positive reviews seem to have been \" Invited \". Maybe they're offering them money or something?","title":"I sold a beautiful very expensive bag","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-02-27","author":"Nga","text":"I wonder why there are some good review about the VC, they are fake reviews as you can see most of them are put the same tittle “Very satisfied with the site”.\nI paid an item and DHL shipping fees. The item marked sent by Chronopost, VC uploaded the invalid tracking numbers.  At the same time, DHL sent me the notification on this item will ship by DHL, contacted DHL and they confirmed that the shipper (VC) did not pass the item to them and they just generated the shipping label, DHL said they did same things to others as well, that meant I am not the only person to suffer on this confusion about VC shipping.  Chatted with VC everyday and emailed them for this issue.\n1. Why the shipping is handled by Chronopost \n2. Why the tracking numbers are invalid\n3. The customer service chat representative promised will looking after this case and will transfer to expert team, but never happened, never get any response from them.\nI found the customer service representatives are all lying, i waited for more than one hour to queue, when they pick up my case, they just want the chat to be finish and not doing any follow up, not answering my questions and not care at all.\nI used VC before and it was not like this in the past 5 years, I am living at the apartment and everyday I spent at least one hour to use chat and emails with VC, need to tell them the whole story again and again. To making purchase at VC can bring us this pressure.","title":"Buyers Be aware! Provided invalid tracking numbers, make receiver harder and cannot claim lost item","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-02-27","author":"Maria Elena","text":"sorry but sometimes i received dresses too used and damaged, and i could not wear them","title":"sorry but sometimes i received dresses…","stars":3,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-02-27","author":"n\/a Beauty","text":"Dear Vestiaire. Today marks 1 month since I returned the Chanel dress I bought from you. Till now you have not refunded me.\nI am coming on Wednesday to France and will come personally to your warehouse if my money is not returned by then.\nReference number 11966448 and shipment number 2401929773","title":"Returned item but Vestiaire won’t refund me","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-03-01","author":"Petra Kiuru","text":"I ordered a pair of Fendi Ski pants which were not as good condition as described. There were stains and pulls on the garment. VC agreed to make a second quality check and now after 1 month I don’t hear anything! Ski season is over and I don’t need these anymore, but they are not returning the money. \nThis is the third time in a row I have bad experience (two previous ones were a broken Chanel bag that passed their qc and one fake Moncler). \nBased on this, I’d strongly advise to stay away because you really don’t know if you’ll get bad quality or not authentic goods. \nNot for me anymore.\n\nEdit 15th March:\nStill not receiving any update despite many emails. This company is just totally ignoring customers!","title":"Vestiaire Collective is just one bad experience after another","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-03-01","author":"Catherine","text":"This is the third time I have sold on this site and the second with a dreadful and horrendous experience and I definitely not be using them again and advise all others to avoid. \n\nI received notification from Vestiaire Collective one of my items had been sold but the shipping label they sent me was to ship to Hong Kong even though I lived in Spain I knew this could not been correct but I went online and chatted with their representative name of Yann who told me this was correct and to print the label off and take it to the post office and it would be shipped for free. I did this and I was right I had been sent an incorrect address label and a new one was issued to France and was collected by UPS. The item was received and even though it was brand new with labels and I took photos before sending as I have had a problem before with this company stating brand new items with labels are defective on receipt they claimed there was a fault. I was given the chance to accept the drop in price and as I wanted rid of any dealings with this company any further I accepted via their app and in a further email I received. Their app and link in their email is clearly not working as I have just been told they are waiting to hear from me and not to keep the buyer waiting. I had fortunately screen captured everything and forwarded it to them but what I have found when a representative from Vestiaire Collective cannot answer a query they choose to leave the chat and the customer waiting. I have also resorted to emailing the CEO Maximilian Bittner but him nor a representative has the courtesy or good manners in replying.","title":"Avoid!","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-03-02","author":"Maria","text":"NO PAYMENT AND TERRIBLE CUSTOMER SERVICE\n\nI've sold with Vestiaire for the LAST time. \nMy item sold on February 2nd. It is now March 2nd and still no payment. Their customer support channels are a DISGRACE, and all I got was an email (in reply to my complaint) saying this was an \"exceptional situation, they would look into it and get back to me in 3 days\" - NO ONE has gotten back to me and it's been, oh well, 2 weeks.\nBtw - it is not easy to find a way to get in touch with them as all you get is that annoying chatbot.\n\nNOT OK. Vestiaire PAY WHAT YOU OWE.\nPeople: Sell your stuff somewhere else!!","title":"NO PAYMENT + GHOST CUSTOMER SERVICE","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-03-02","author":"P.W","text":"I've sold with Vestiaire for £2,325.40 still no payment.. This site is a scam don't transfer sellers their money from the sale! \nPayment status says that to be transfer but the date already expired but still haven’t being processed\nI have contacted customer service isn't helpful.","title":"I've sold my item but no payment","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-03-02","author":"nick","text":"Non existing despatch tracking number.\n\nI've bought many items from this site and been fairly happy but now you have let me down with the seller generating a tracking number but not passing the goods to the courrier. I have spent days explaining this to vestiaire and they do not listen and won't refund me .Their answer is to contact DHL where it says clearly on the tracking \"item not passed to them\".Absolute bloody shambles.Luckily I've paid by PayPal so have opened a dispute claim.\n\nLeave this company well alone they have gone down toilet.","title":"Non existing despatch tracking number.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-03-02","author":"Murad Gadzhiev","text":"Hi, I am writing here to get feedback, as no one is going to help me with my problem.\nMy name is Gadzhiev Murad, my username is mur_black\n\nI sold 2 things on this site:\n1. 13498480 White Cotton T-Shirt - Louis Vuitton $331.63\n2. 13694410 Grey Cotton Jersey and Sweatshirt - Louis Vuitton $389.00\n\nAnd I didn't get paid for them. I was told that on 09.02.2021 the payment was transferred, but today it is already 02.03.2021 and I still haven't seen my money, I write every 3 days to the online support chat on the site and I am told that they will contact me within 3 days, in fact there is no feedback. I write here to get feedback, why did I do everything quickly and efficiently, and did not get it from your service? I am very unhappy with this, please transfer my money to me, waiting for your response","title":"I didn't get paid for the items I sold","stars":2,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-03-02","author":"Max","text":"They don’t even bother to reply to any messages here because they are focusing on replying to reviews on App Store, if the an app has really low score it might trigger a review from Apple, just check your App Store reviews for Vestiaire Collective and you’ll see what I mean. \n\nI used to love this company but they continue to allow fake items to be listed and the lack of (almost non existent) customer service has finally put me off from buying and selling with them now, especially heating so many people have issues with payments and refunds, awful.","title":"They don’t even bother to reply to any…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-03-02","author":"Rose Danesh","text":"I sold  3 my items and vestiaire paid me for my items on time, I trusted in this website I sold my 4 items last year December and waiting for the payment until now 2021,2nd March. \n I have contacted customer service and emailed and not got any reply, I keep getting excuses. I want to be paid for the items I sold. Vestiaire Collective is a SCAM - They will give you the run-around! They keep telling me they will “contact the expert team and get back to me in 3 days” it has been WEEKS WITHOUT MY PAYMENT NOW. All 4 items were supposed to be paid in DECEMBER 2020 last year! I can not accept you keep telling me “the expert team is handling this”. I want to be paid for my items and close my account. I have spent over 6 hours and 48 minutes in a total of 50 conversations with the chat support. They just give me the run around. They have stolen my items + money.\nDo not sale you item in this website, do not Trust","title":"I sold  3 my items and vestiaire paid…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-03-02","author":"Alina","text":"I have been a seller for almost a year and all this time there have been no problems with paying for my sold items. But the latest sale 13856707 made me write this review here. I have successfully sold the item last week, VC informed me that payment for it will be transferred to my paypal account on 26\/02. Today is 02\/03 and I still haven't received my money... I contact the support team for the fourth day and I only hear ridiculous excuses, like that it is a bank delay (but I have Paypal account), then they say that the money has been sent and I have to wait. On another day, they say that they have not sent it yet, to my question “why?”, the assistant could not answer and said to wait again. I'm afraid I lost my money. The support service just doesn't know anything and doesn't do anything. On Sunday, the assistant left the chat unceremoniously. Today I have been waiting in line for the chat for 4.5 hours and there are 63 people in the queue. I tried to contact via email, but I got the same stupid answer “wait”. I do not understand what exactly I should wait if they themselves indicated the date of the transfer 26\/02. The rules say that the payment will be processed within 24h or the following working day. So 26\/02 or 01\/03. Ant after that it should appear in my paypal account in 24h. I DID NOT RECEIVE MY MONEY. Dear Vestiare, are you kidding your sellers or now you are the scam company? I definitely will give a course of this story and tell about it also in other sources. I have all the correspondence with your unqualified support service and also print screenshots from my office.\nUpdate: payment received with delay, 04\/03.","title":"I have sold the item but did not get payment","stars":1,"location":"LV","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-03-02","author":"josephine ","text":"Wrong sizing..\nI bought a pair of Celine boots which stated that they were a size 40 but when I got them they were a size 39. Vestiaire has checked them and said it is the correct size which makes no sense seeing as several other people are selling the same shoes - in the same size but saying that it is in fact a size 39.... \n\nI have tried to contact VC several times but without luck... \n\nThis company is a complete hoax","title":"Wrong sizing..","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-03-03","author":"Saif aljbori","text":"I sold my hermes bag for 9000$ and the buyer received the bag since 24 of February and till now I didn’t get my money \nThousands time i chat them and emailed them and they told me will transfer to our expert team!! What i shall do please","title":"I sold my hermes bag for 9000$ and the…","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-03-03","author":"Pathos","text":"I have been waiting for a support chat for 11 !!!!! HOURS, went to bed as it was almost midnight, and guess what, their support didn’t even answer my questions. I requested a transcript of the session and their person did totally NOTHING to resolve a problem. And another issue, they charged me for an authentication (without a possibility to choose or cancel this option) but the seller is sending it directly to my address. So, no authentication but charging money for this service?!","title":"I have been waiting for a support chat…","stars":1,"location":"MY","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-03-03","author":"christine costelli","text":"I've been using the app for years. High commissions, lots of items, no customer service. \n2 weeks ago I tried to buy a bag and discovered that the system does not work. So I tried to reach out the customer service....yes I know, but I am still a dreamer.....No way to get help. After 10 days I tried again with another bag and....again, the system blocked the payment. I called the bank and PayPal and everything is OK from my side. The issue is related to Vestiaire Collective. But after 2 weeks nobody has settled it. Of course I lost the 2 offers I did and discount codes I had. Of course 2 vendors lost their sells. I have tons of chat transcripts and mails. Nobody does anything to solve. Great job VC!","title":"No customer service","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"},{"date":"2021-03-03","author":"Jasmin","text":"My sold article got lost in the system\/warehouse\/post and I had to ask again and again about the whereabouts of it. The ensuing process of claiming my money and waiting for the payment was the most terrible experience in customer support so far. Until now I have not received my payment and I have to consider taking legal action on this.","title":"My sold article got lost in the…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=70&stars=1&stars=2&stars=3"}]