[{"date":"2021-02-19","author":"R. Noman","text":"Awful! They keep the money too long so they can profit with interest!.","title":"Awful","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-20","author":"Ana","text":"Customer service is a joke. The platform is awful. You can’t opt out of direct shipping so sellers are no longer protected from fraudulent buyers. I would never recommend this service to anyone.","title":"Customer service is a joke","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-20","author":"W P","text":"Ordered a chanel dress USD$800 and ship to Hong Kong at VC, paid DHL shipping and they used the normal post by chronopost.  Provided the wrong tracking number. Nightmare started, i need to email and using the live chat with the VC consultant everyday, no response and i need to tell the consultants the whole story again and again.  \nIt is like no Customer service at VC.  \nThe live chat consultant said “because you are the value customer, i will transfer your case to our expert team, you will be contact by expert team”\nI never receive and email from expert team, it has been two weeks.\nI never think of shopping online can bring this much pressure and worrying. No item no money no customer service, I feel like VC is a scam.","title":"Ordered a chanel dress AUD$800 and ship…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-22","author":"Sarah Smith","text":"Keep telling me to stop taking pictures from the internet , totally wasting my time and energy. I'll try another 're seller instead from now on .","title":"Keep telling me to stop taking pictures…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-22","author":"Sarah Smith","text":"Keep telling me they don't accept photos taken from the internet. I've spoken to them about this probably 10 times \n Still the same answer: Sorry we can't list your item.","title":"Keep telling me they don't accept…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-22","author":"Sarah Smith","text":"Won't list a very popular expensive handbag because they think it won't sell. They need to check this because it's their top seller. Doesn't make sense to me .","title":"Won't list a very popular expensive…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-23","author":"SH","text":"As a buyer, I had high expectations of this site from reviews I had seen in the press. However, after having experienced their poor customer service and systems, I am concerned Vestiaire may just be an elaborate scam to filter off a proportion of fees from customers, whose goods are stuck ' in authentication' and neglect to request a refund, and sellers, a proportion of whose goods they seem to hold to ransom as fake at expense of high return shipping fees. I won't be using again.","title":"As a buyer","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-23","author":"terence","text":"Disaster of a company, very little idea of what they are doing, their customer service agents seemed to have been trained by squirrels. Their payment terms change depending on who you are speaking with. Delete your stuff off their app and put it on eBay, you’ll make more!","title":"Disaster of a company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-23","author":"polly","text":"I have tried twice to contact vestiaire through their automated customer service email but had had no response. With regards to my purchase of what now appears to be a fake chanel bag. I am furious! And now coming across this website I am very worried about losing my money and am looking into the possibility of taking this to a small claims court as the original purchase was £655.99. Vestiaire website does not allow me to go back far enough in time to get original order number.","title":"no response from Vestiaire!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-23","author":"bercidagra bercidagra","text":"SELLERS BE AWARE!!! i have been selling in Vestiaire since 6 months and i was given trustful seller and expert seller badges as i sold quite a lot. As i am a trustful\/expert seller at vestiaire, i sold a Luis Vuitton bag and buyer chose direct shipping options.i shipped item next day. Guess what! After 2 days buyer has opened a claim that she received a teddy bear and baby clothes instead of bag.Then she started to harass me by sending messages.One of her messages she said i sent her a joke toy and when i mentioned about teddy bear and baby clothes she has twisted.  i sold a lot of customers through direct shipping. Never had an issue! Vestiaire made their decision in her favour. \nNow i want ask a few questions to you Vestiaire!\n1) why do you give badges to sellers?\n2) You call this badges Trustful badge and Expert seller badge! if so, why dont you trust your sellers?\n3) Why dont you check sellers selling history?\n4) why dont you check buyers buying history? if so, when you make this kind decisions why dont you give proper explanation to sellers?\n5)when we sell in Vestiaire, do we have to record a video beginning of the packaging till to post office? \n\nHow can i sell at your app from now on! You give trustful\/expert seller badges but you dont trust your sellers at all! i lost my bag and £400. SHAME ON YOU VESTIAIRE! SHAME ON YOU!!!","title":"SELLERS BE AWARE!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-23","author":"bercidagra bercidagra","text":"SELLERS BE AWARE!!\nSELLERS BE AWARE!!! i have been selling in Vestiaire since 6 months and i was given trustful seller and expert seller badges as i sold quite a lot. As i am a trustful\/expert seller at vestiaire, i sold a Luis Vuitton bag and buyer chose direct shipping options.i shipped item next day. Guess what! After 2 days buyer has opened a claim that she received a teddy bear and baby clothes instead of bag.Then she started to harass me by sending messages.One of her messages she said i sent her a joke toy and when i mentioned about teddy bear and baby clothes she has twisted. i sold a lot of customers through direct shipping. Never had an issue! Vestiaire made their decision in her favour. \nNow i want ask a few questions to you Vestiaire!\n1) why do you give badges to sellers?\n2) You call this badges Trustful badge and Expert seller badge! if so, why dont you trust your sellers?\n3) Why dont you check sellers selling history?\n4) why dont you check buyers buying history? if so, when you make this kind decisions why dont you give proper explanation to sellers?\n5)when we sell in Vestiaire, do we have to record a video beginning of the packaging till to post office? \n\nHow can i sell at your app from now on! You give trustful\/expert seller badges but you dont trust your sellers at all! i lost my bag and £400. SHAME ON YOU VESTIAIRE! SHAME ON YOU!!!","title":"SELLERS BE AWARE!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-23","author":"JJ plays","text":"They advised me they are not accepting listings for Hermes and Chanel handbags . Quite strange for a supposedly top second hand luxury re selling site in my opinion .","title":"They advised me they are not accepting…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-24","author":"Richard Bao","text":"There’s always something up with Vestiaire Collective that they just can’t seem to get it right. Last week I received an email saying that I needed to update my banking information as per their new payment system which would shorten the time that the sellers need to wait before getting paid, how nice! Well, I did it right away and then sold my bag and was told that my payment would go through today on feb 24th. Well then at literally 3am this morning I got an email saying that “oh no we can’t pay you, you also need to verify your identity and your address by uploading your passport pic and your utility bill” - I did it right away but was feeling extremely annoyed because why couldn’t you ask me to do all of these last week when I was asked to verify my banking information?????? How convenient it is that on the day that I am supposed to get paid I was asked to provide additional documents which could take up to FOUR business days to be verified according to VC??? I’ll remove this review if VC indeed ends up verifying my identity and paying me today! Otherwise it’s just a scam - holding my funds longer than necessary. Honestly I would not use VC if I wasn’t living in Europe. Before I moved to Europe, I was using the RealReal, must faster, much more intuitive and more quality buyers who would not back out on deals. I would switch to another platform as soon as there is a better one coming out in Europe. On VC it’s full of garbage buyers who make offers and don’t go through with the payment after - what ends up happening is as a seller toh are tide up in that offer for more than 24 hours without being able to void the offer or get out. Please also fix that and make buyers put down a deposit before they can start making offers. The user interface also sucks, laggy as hell. If you are in North America, stick to the RealReal, don’t waste your time on VC.","title":"There’s always something wrong in the VC land","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-24","author":"Ashleigh Brown","text":"I sold a scarf on Vestiaire and used their prepaid postage to mail it from my local post office.  They claimed to have never received it, and never informed me\/sent a notification that the sale did not go through because they never received the scarf.  The scarf was never returned to me, so with no notification from Vestiaire, I assumed that the sale went through.  When I realized that I still hadn't received payment months later, I made a formal complaint.  But their customer service representative said they'd only consider a refund if I composed a HANDWRITTEN LETTER OF HONOUR to explain the situation.  Then I had to take a photo of it and forward it to their customer service.  The customer service rep then said they couldn't reimburse me because my request was outside the limitation time, and refused to pay me the value of the scarf.  The scarf was under £200 which is nothing for a company of this size.  Vestiaire, if you're going to create a secure postage system, maybe pay for better class postage or tracking, or be ready to pay your customers when things get lost.  Not to mention for the 20% fee you charge, you should do better.  \n\nOh, and when I tried to explain to a new customer that I was removing my items from Vestiaire as we were in a dispute, they deleted my comment (because they review everything you say so that it only benefits them).  So yeah, I'm done with these people.","title":"Vestiaire lost my item and refuse to reimburse me","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-24","author":"George Giurickovic","text":"It's a scam, don't trust this website!\nRead why and if you need proof just ask me.\nI've purchased a coat from one of their seller, they sold it at a size 50 resulted to be much shorter.\nI paid the extra to have the item checked for quality and it resulted in the coat  being considered a \"great bargain\" and only missing a little button, so I proceeded with the purchase and have it shipped (after an incredibly long wait), then I noticed instantly it was much smaller than its described size, so I asked what could I do and they wrote me that the only way was to sell it again (note that I had to discount it as well). \nI did sell it and sent it back to them in the original black bag they provide. Everything looked fine till I got an email stating that they couldn't proceed with my payment and sale because the item (the same item they sold me) was not considered original and that, not only they would not pay me for the same item they sold me for more, but I'm supposed to send them some money via bank draft in order to have the useless item back.\nIn my country this is called a fraud","title":"It's a scam, don't trust the positive \"reviews\"","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-24","author":"Mette Lund Rasmussen","text":"WARNING, - DO NOT BUY FROM HERE! I have bought a Louis Vuitton bag and the tracking says that it has arrived to Denmark, however the status has now been paused for two weeks and the customer service SUCKS! They answered me that the bag has now arrived to the carrier and they send me an adress in FRANCE, but I live in DENMARK!\nand when I try to underline that for the customer care assistant \"vanessa\" (i really hope this is a computer, since it is not reading my e-mails) they keep referring me to \"go and pick up my parcel\" but it's in FRANCE and not in Denmark! When I tell them my problem I get this generic message pr. mail: I  understand that you wanted to receive your parcel however we don't have control to contact carrier. \nWhat I can do is try to contact them before you pick up your parcel. \n\nbut i can't pick it up since it's in france? So now I am fighting back and waiting for vestiare collective to either send back my money or at least send the bag to a adress where I can pick it up IN DENMARK! \n\nDONT BUY FROM HERE CUSTOMER \"SERVICE\" SUCKS AND THEY CHEAT!","title":"WARNING - DONT BUY FROM HERE!","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-25","author":"Yulia","text":"This review is to beware other sellers of what Vestiaire Collective can do to you.\nAfter my sale I sent them an item which was found to be non-compliant. Fine, these things happen to the best of us sometimes and I was planning to send this item to the original brand for investigation as there are many events described here when authentic items were declared non-compliant, even those which were previously bought through VC.\nI paid the processing and postage fee so that the item could be shipped back to me. After it arrived in my country, I received a message from DHL that my shipment has outstanding tax to be paid. This is clearly nonsense as this was MY ITEM which was returned back to me which meant Vestiaire Collective did a false customs declaration which incurred tax charges which by law I am not obliged to pay as I am receiving an item back which belongs to me.\nI contacted VC support for clarification and fixing of this issue. The responses I received from CS were the following:\n- \"we can't pay shipping for you\" (nonsense, I paid the shipping cost)\n- \"we can't pay the tax as the shipment is not insured\" (no comments on this)\nNo one even tried to understand the actual problem until someone from chat support wrote that yes, this is clearly VC's mistake, asked me to pay the tax and promised to reimburse me.\nI paid the tax (over 50 bucks ON MY OWN ITEM) and sent it to VC.After a few days I received a message saying that reimbursement is not possible and \"they hope I understand\". No, I don't.\nI tried to contact DHL to get a refund for the tax since I've got all the proof that the shipment was a return. DHL representative informed me that I was lucky I paid the tax in time to get my item back because the shipper - Vestiaire Collective - INFORMED THEM TO DESTROY THE SHIPMENT when they tried to contact them to clarify the customs declaration issue. Again, VS kept insisting they did not give such an instruction despite the fact that I showed them a screenshot from that particular email from DHL. When I asked whether they are implying DHL is lying, no one responded to me.\n\nHaving said that, I would like to summarize:\n1) customer support does not even try to understand the issue. They don't even answer the question you are asking, very often their response does not even correspond to what you've asked.\n2) feeding false information, taking back their own promises which were set in writing.\n3) failing to take responsibility for their screw ups.\nShame.","title":"Sell at your own risk.","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-25","author":"Matt","text":"Item got stuck in customs despite being direct shipping and all taxes paid. Contacted VC after waiting an hour in the chat queue. Was told everything was fine, even through it clearly wasn't. Followed up 2 days later when item was returned to sender. Chat agents joined and left immediately. Now waiting to see if I ever get the necklace i paid for. Something is very wrong with this company.","title":"Really bad customer service","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"},{"date":"2021-02-25","author":"Millie Rosen","text":"DO NOT SELL OR BUY WITH THEM. I’m a seller and they lied about stains on some trousers I sent to their head office after paying for this service. There were no stains! They said I had to reduce them so I ended up getting very little money for a designer item in perfect condition.","title":"Scam Company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=71&stars=1&stars=2&stars=3"}]