[{"date":"2021-06-04","author":"Brigette","text":"Do not purchase from this site. Placed an order been waiting nearly 3 weeks still haven’t received. Contacted Vestiaire collective, they keep stating I will receive a refund but still nothing. I have at to contact them on numerous of occasions and they still have not resolved my issue. I have been left with no choice but to open a case with PayPal and my bank. If you do not receive your item you will struggle for a refund.","title":"Do not purchase from this site","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-04","author":"Elen ","text":"I bought a Chanel item from them (and paid to include authentication as I’m aware Chanel has a lot of fakes around). When the item arrived the metal work was not of the quality I’d expect but I trusted it was genuine due to the authentication process. I spoke to a couple of independent luxury resellers about selling the belt on, as it doesn’t fit me, however they were unable to verify it’s genuine and actually implied it was a fake due to the lack of a stamp on it. Stamps were introduced in the 1950s for Chanel items. I spoke to vestiaire via chat and after several attempts where they told me they had added one to my account, but they hadn’t, managed to get a shipping label to send it back. I was told to expect a refund within 48hours. \n\nI chased after 2 business days and four business days, and was basically told to be patient and I’d get an email about it. It took just over a week to get an email telling me they’d looked at it again and it’s genuine so I will not get a refund and they will send the item back to me ‘as soon as possible.’ Absolutely no justification as to how it is genuine or has passed checks when other Authenticator from outside their organisation do not believe it is so. \n\nSo now my two options are to receive back an item I believe is a fake, and attempt to sell it through their website since other preloved luxury sellers won’t accept it, but live with the knowledge I’m passing the problem onto someone else. This was suggested by vestiares, obviously, since it makes them more money again.  Or, keep the item, never use it and know I’ve got hundreds of pounds down the drain due to Vestiare’s incompetence.","title":"Fake item","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-04","author":"Liv","text":"Stay away from them\nStay away from them. The concept they have may be brilliant but everything apart from that is just flawed! The app is full of bugs, their customer service is only reachable via chat within the app and handled by some off-shore team using poor translation services, they used to have a support email that is now deactivated and they hold true to NONE of their promises. Refunded if seller hasn't shipped within 7 days? A joke. Your money is gone and nothing happens. NOTHING. There are no automations, no updates, no anything. Customer care is absolutely zero as you can see from Trustpilot. They aren't even bothered to reply or care, possibly due to lacking a structured CX team... It's just sad but after 1 year of being an active advocate as both a seller and buyer I am now out. The problems simply outweigh the benefits.","title":"Stay away from them","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-05","author":"Gurpreet Preeti Kaur Rehal","text":"I bought a pair of LV boots and payed for authencity check by VC. I received the “leather” boots and starts wearing them, after 14-20 days the coating on the boots with monogram\/“leather” starts coming off and I see clearly I have been scammed - the boots are fake! And it is plastic and not leather! I wrote this to VC and send pictures as well and they will not take any responsibility! They did not do their work and their QA failed big time - the boots cost more than 700€ so I obviously assumed them to be legit! Don’t ever buy anything from Vestiaire- it is one big fraud!","title":"Fake boots!","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-07","author":"saziye yavuz","text":"poshmark is definitely a better platform. you can easily edit your listing there whereas in vc it takes 2 days for them to confirm your additional pictures. a bigger problem is that it is not possible to contact the buyer and update them about something. only buyer can initiate a conversation there. vestiaire collective is like an old and slow program which has one advantage that is its coupons.","title":"poshmark is definitely a better…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-07","author":"Emily","text":"Ordered 3 bags. 2\/3 never made it to me. \n\nOne seller randomly cancelled the order. Vestiaire never bothered to let me know. I had to ask customer service what was going on. \n\nSecond bag--the seller wrote my address wrong. Vestiaire said I need to call a postcal company in another country where they speak a different language to ask? \n\nThis is ridiculous. There is no phone number either. \nTheir website is from 2005 or something. It is so hard to use. I would not recommend buying from them.","title":"The opposite of luxury","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-08","author":"Marissa","text":"I bought a couple of items through the app, which has been a good experience. The selling process is terrible, though. I have sold the product in MARCH and still have not received payment. The item that I've sold wasn't a high ticket item, but I can't imagine that this platform also sells Birkins.","title":"Sold item in March, still not paid","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-08","author":"JH","text":"They have reduced my selling prices without telling me, and it is upsetting. Sellers beware!","title":"They have reduced my selling prices…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-08","author":"Eyequeen","text":"I have been a lurker on Vestiaire Collective for a long time, looking for my ideal bag. Finally it is listed, at £277. I have a coupon alert for £20 off orders over £150. They send one every week. I try to use this coupon, in the app on my tablet, phone. I chat to \"customer service\" online who gives me another coupon code for the EU, not UK, so that doesn't work. They say they have passed the issue on to their team of experts and I will receive an email from them. \n\nWhat is the point of issuing coupon codes that do not work?! These items are time sensitive. The frustration has put me off VC forever.","title":"Coupon Codes do not work","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-08","author":"Llazar Jorganxhi","text":"I am a professional seller with Vestiaire Collective.\n\nI sell on all platforms, and i have never come across such incompetent customer care before. At times i have also found them rude and borderline racist. It is unbelievabe!\n\nHowever, the most worrisome part is that although we have a mutually signed paper contract, vestiaire changes the rules with no warning and won’t own up to their doing. It is always fait accompli. There is nobody to take responsibility, and now with covid nobody to talk to. \n\nI wouldn’t suggest selling on this platform to any professional seller. It is absurd, that they don’t understand that this is the work you do for a living and that they cannot treat people like that.","title":"A nightmare: avoid avoid avoid","stars":1,"location":"AL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-09","author":"JH","text":"They have dropped my prices without informing me. Sellers, beware!","title":"They have dropped my prices without…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-09","author":"Craig Manning","text":"Terrible site don't bother wasting your time. Customer care was good but orders never arrive im waiting on refunds. I ordered 5 items from the site and only received 1 item complete waste of time I'm not even sure if half the things on the site are actually available","title":"Terrible site don't bother wasting your time","stars":1,"location":"JE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-09","author":"Hazeley","text":"If you are British this is not the site for you! If you want to buy and sell designer goods stay with a British based company because otherwise your customers have to pay for your item to go to Europe for checking and then back to the UK so VAT is raised even if the customer wants the Direct Shipping option. It’s ridiculous. If a customer wants an item checked that’s fair enough but to impose it as this site does is a joke!\n\nRegarding Vestiaire's answer below:\nI fully understand that items coming into the country raise VAT but this is NOT the issue.\nOnce again: it is the fact that you have the DIRECT SHIPPING option so if I buy an item in the UK where I live (so the item does not leave the UK) why am I still subject to charges?","title":"If you are British this is not the site…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-10","author":"Pia Ly","text":"I sold a zimmermann dress. I photographed every part of the dress. But the quality control team emailed me saying \"there are marks\". I asked a hundred times what the mark is. I don't understand why they said that even though they have pictures of every part of it. And they told me \"there is a mark that is invisible to the naked eye\". They expected me to see the mark, which is invisible to the naked eye, and write it in the description or take a photo of it. Know that the quality control teamb is never professional. They decide according to their own liking. There is no objective assessment. Sellers! Do not accept any problem you are told. It's probably a lie! Already before that, they called “fake” about my original Chanel shoes. I struggled for it for 10 days. And when they checked it a second time they realized it was genuine! Such a novice team!","title":"UNPROFESSIONAL QUALITY CONTROL TEAM","stars":1,"location":"TR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-11","author":"Rachel B","text":"I recently bought a Chanel handbag on Vestiere. The handbag was described as 'Never Worn', therefore according to Vestiere's own policy, it should have no defects. Upon receiving it,  the CC logo on the front of the bag was clearly tarnished. I showed a customer rep the photos of this via the online chat. They apologised profusely - told me that it didn't meet the item description, and sent me a postage label to send it back for a refund. \nNow, Vestiere are sending the bag back to me again as they think it actually DOES meet the 'Never Worn' policy. Vestiere obviously don't read their own policies, they also don't check their items properly for defects. This has happened to me in the past but I've always got my money back as I've paid via PayPal. This time I paid via credit card. I have now made a chargeback claim to my credit card company to get the thousands back that I paid for good bag. Awful, untrustworthy company. Never again!\n\nUpdate 15th June: on 11th June, I received an email from Laura at Vestiere. She said that the mark was a 'friction mark' and not a stain. Apparently that means that it meets the 'Never worn' description. Then she suggested that I get it professionally cleaned - I had to admit, the email did make me laugh at the ridiculousness of it all. I received the bag back today as Vestiere have sent it straight back to me after I received it. Lo and behold, the 'friction mark' (stain) has been cleaned off by Vestiere's authentication team. What a mess of a company, never again! If you must buy from Vestiere, please use PayPal who will refund you if you don't get the item you expect.","title":"Awful, untrustworthy company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-13","author":"Scarlett","text":"Terrible experience - I purchased an item from Vestiaire, then re-listed it immediately as it was not as expected. I then get told by Vestiaire it is non compliant and I cannot sell it via them, when I bought the item via them in the first place! \nTheir customer service is terrible and it is impossible to resolve the issue. Very frustrating and disappointing situation","title":"Scam - Do not use","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-13","author":"Annabel Rochfort","text":"I brought some Gucci shoes that I wore for 5 minutes and the entire sole came off. If I’d been walking down stairs I could of had a terrible accident. VC after many emails refunded me the money but a little worrying the seller is still active.","title":"Gucci shoe disaster put right","stars":3,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-14","author":"Vik","text":"Be careful!! If you’re going to buy from this platform, make sure you know your designer goods. There are some very good fakes being sold via this platform. I bought a pair of christian louboutin shoes. Then I did a bit more research. Realised they were fake. I contacted the seller via the messenger app and called her out on it and also raised a PayPal dispute. The seller then advised the platform that the shoes were “unavailable”. I got my money back, which is great, but at the end of the day the seller is still selling knock off goods without intervention from the platform.","title":"Be careful!","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"},{"date":"2021-06-14","author":"JB","text":"The worst experience of my life. A seller MK8252070 is a scam artist, and VC is no better. I purchased a ring from them and it was never shipped by the seller, VC never refunded my money even though they admit after 20 attempts of contacting them that it was never shipped. Do not buy from this company.","title":"The worst experience of my life","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=56&stars=1&stars=2&stars=3"}]