[{"date":"2021-09-03","author":"R BP","text":"THE WORST ONLINE SERVICE EVER. I have been trying to get my items back from their consignment service for 2 weeks now and no one is helping me!!! If you’re happy for £10’000 of your clothing to be missing then by all means use them, otherwise AVOID.","title":"THE WORST ONLINE SERVICE EVER","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-04","author":"brooke gibson","text":"Dingy app and customer service is poor. Dont bother. \nWish i read reviews before wasting my time.","title":"Dingy app and customer service is poor","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-05","author":"Gen Hammond","text":"Horrendous. They charge thousands of 'import duties and taxes' for items that are shipping  within the same country.  There is no way to reach a service representative. It's all robotic and  the standard answer is 'I apologize' no matter what you write to them. I was so excited to find this site. Very disappointed. Stay away !","title":"Horrendous","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-06","author":"Dee Ha","text":"This company used to be good when they started and I could talk to a real person for support. Now there is not a single person you can even chat to.\n\nThey switched to couriersplease for direct shipping in Australia which is a nightmare because:\n\n1 - To organize pick up, you need to provide an account number and and VESTIAIRE WILL NOT PROVIDE YOU WITH AN ACCOUNT NUMBER, no matter how many times I tried to explain to them. \n\n2 - If you bring your item to a drop off location , most locations will no longer accept parcel from them, and if they do, couriersplease will never pick them up so you as a seller WILL NEVER GET PAID!\n\nAfter selling almost 30 items on Vestiaire I have completely lost faith in the company who refuses to listen with zero human customer service.","title":"Do not sell on here you will never get your money!!","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-06","author":"\/\/","text":"A buyer bought my item. It was described as worn. It was £145 originally and I sold for £30. \n\nThey receive it and claim it’s stained (it was not stained when I sent it) so this site says they’ll refund the buyer and I’ll have my blouse returned as I should\n\nThe buyer is now refusing to send the blouse or pay - aka theft!\n\nCustomer service is shocking they do not help at all and have let someone steal from me!","title":"Theft taking place on this site","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-06","author":"Nico","text":"Same item, the commission rate jumps from 10% to 25%.\n\nThe email I received about how much I can receive is around 88% of the selling price. However the actual final amount I can receive is quite different from what they say in email \n\n1) the same item, the amount I can receive is different from what I can receive a few days before. Not sure if they raise up the commission rate since there's no notifications nor explaination.\n2) why it is different from what they send to me in email? No explanation.\n\nThe website is very intransparent and messy. Not recommended at all.","title":"The commission rate for the Same item jumps from 10% to 25%.","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-07","author":"nguyen linh","text":"I had purchased a Prada Hair clip in 17th June, however, there was something wrong and the order was canceled. I had emailed the customer service and asked about this situation about the refund. They promised that the money will back in my bank account for MAXIMUM 14 working days. But you can see that, now is September already and I did not get any refund. I also called the bank's customer service for this situation as I thought the problem was them not Vestiaire Collective. But the bank confirmed that there was no money on hold or money in process of a refund. I think I got scammed from the Vestiaire Collective. Please do not purchase anything from them.\nUpdated: Today is 22nd September and they did not respond my email about the evidence I showed them to prove I had been charged for the Prada hair clip LOL. Besides, they also locked my account without notice me haha","title":"I had purchased a Prada Hair clip in…","stars":1,"location":"VN","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-07","author":"Miracles Follow me","text":"9\/7\/21\n8:03am EST\nVestiaire are you in the business of allowing sellers to take buyers money and then the buyer receive NOTHING? Because if so, then its fraudulent and theft. I do not think that is a good way to run your company. I regularly shop with this company, and never had a problem until now. I had confidence that they will be more than willing to resolve the issues but as of late, the customer service at this company has provided little to no help protecting and helping me as a buyer. I purchased an item over 3 weeks ago and according to its tracking number there is a delay in Vestiaire receiving the item from the seller through UPS. I am not the seller and therefore it is not my responsibility to ensure package arrival or delivery to Vestiaire. If the package does not make it to you by the way of the seller in an appropriate length of time, then an immediate action should be taken to ensure that the buyer either gets credit OR a refund; but neither has happen and that is considered THEFT. Vestiaire has my money and i STILL HAVE NO ITEM. Vestiaire, cancel this order and return to me my money! I will provide an update on this matter.\n\nUpdate: 10\/6\/21\n12:41EST\nSomeone reached out to me and fully resolved the issue. I was refunded my money in full. This company is not a bad company,  but some of their customer service practices need a little improvement.","title":"Vestiaire are you in the thieving business","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-07","author":"Suzanne M","text":"Order ref for Jimmy Choo shoes 17540459\n\nI am having a complete nightmare with a purchase on Vestiaire. The goods have been sent four days after the seven day promise and I needed them to take abroad plus they were sent to a store for collection which is nearly an hour from my home.\nYou can now only ‘chat’ with them and it’s absolutely USELESS. Four times I have been told my issue will be resolved and not one ‘customer service’ agent has done a thing.\nVestiaire is high end retail and it’s customer service should match but this is just awful. They are using the pandemic as a complete excuse for turning to chat as everyone can work from home on their phones and the agents are just messing customers about and especially as there is no quality control on the service the agents are delivering. \n\nVestiaire this is not good and I am personally feeling like I do not want to ever use you again as this is wayyy too stressful and it’s just not worth it plus the buyer seller communication on the website is IMPOSSIBLE as there are no clear links on how to contact your seller and even the link they sent me do it does not work. Plus who is going to drive nearly an hour (well two if you count the return journey) to collect a parcel-its beyond ridiculous. \nMy last conversation yesterday was with Evangeline H and she promised me a response by Customer Services but now the next day and still nothing. If I don’t hear anything by end of day today I will post on here again as it’s absolutely pointless trying to deal with Vestiaire themselves as they appear to have completely given up on any form trustworthy Customer Service.","title":"Used to be reliable but not any more.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-07","author":"Doreen Kasim","text":"Sold an authentic item purchased from Nordstrom Last Chance, the item was accepted upon uploading the receipt, I sold the item, posted it, then weeks later Vestiaire sent me an email saying the items been inspected by \"experts\" and it is not authentic. I included the receipt inside the box. The listing I uploaded notified the buyer that the prada boots do not come with a box or pouch. Now they are charging me 12 euros for Vestiaire to ship the items back to me and I have to refund them VIA Bacs when I was paid in Paypal.\n\nAlso their representatives on the chat don't speak English properly and have very poor customer service skills. The representative was not understanding what I was asking for, I asked why it was deemed not authentic when it was purchased from an outlet like nordstrom, he couldn't understand because his English was poor so I asked to speak to a supervisor and the rep stated that the supervisor was off and I asked for an email address to the complaints department several times and he did not provide me with one. I ended up submitting my complaint via the online form. \n\nJust an extremely painful experience. This is after the item sold several times and the process of which the buyer doesn't have to checkout immediately so I lost like 10 sales before the item actually sold and the buyer bought the item. \n\nDo not base a business based on vestiaire - you will go broke waiting.","title":"POOR selling experience - stick to other sites.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-08","author":"Violette","text":"This is bizzare. I found out vestiaire dropped the prices of my items significantly without my permission. In saying like €80 to €60, €150 to €130. One of my items have dropped below the minimum 14€ rate to 13€.....so I earn negative 1€ for that??! I have no idea how they've done that. I have never dropped the prices myself someone or the system has done it. I contacted the customer service, they said they'll reach out to the experts, and the next day I got a reply saying they can't do anything about it I have to cancel and relist everything.  How frustrating. I listed many of my items with free commission and they are now gone.","title":"Bizzare-Prices drop by themselves","stars":2,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-08","author":"Suzanne M","text":"Used to be reliable but not any more.\nOrder ref for Jimmy Choo shoes 17540459\n\nI am having a complete nightmare with a purchase on Vestiaire. The goods have been sent four days after the seven day promise and I needed them to take abroad plus they were sent to a store for collection which is nearly an hour from my home.\nYou can now only ‘chat’ with them and it’s absolutely USELESS. Four times I have been told my issue will be resolved and not one ‘customer service’ agent has done a thing.\nVestiaire is high end retail and it’s customer service should match but this is just awful. They are using the pandemic as a complete excuse for turning to chat as everyone can work from home on their phones and the agents are just messing customers about and especially as there is no quality control on the service the agents are delivering. \n\nVestiaire this is not good and I am personally feeling like I do not want to ever use you again as this is wayyy too stressful and it’s just not worth it plus the buyer seller communication on the website is IMPOSSIBLE as there are no clear links on how to contact your seller and even the link they sent me do it does not work. Plus who is going to drive nearly an hour (well two if you count the return journey) to collect a parcel-its beyond ridiculous. \nMy last conversation yesterday was with Evangeline H and she promised me a response by Customer Services but now the next day and still nothing. If I don’t hear anything by end of day today I will post on here again as it’s absolutely pointless trying to deal with Vestiaire themselves as they appear to have completely given up on any form trustworthy Customer Service.","title":"Used to be reliable but not any more.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-08","author":"Vanessa Lewis-Charles","text":"I am kicking myself for buying another item from VC after my last issues with import duty. The item I've bought has been confirmed as genuine and compliant. Shipping lead time is supposed to 0-1 days from compliance. 6 days later still no shipping info and customer service via chat can not tell me what the hold up is or even when the item will be shipped. This will be last time ordering from VC because as the company has grown and turns over millions, the service has got worse. Clearly no investment is going into offering decent customer service. There are many other platforms that sell similar designer items and so I'll take my business elsewhere.\n\nEdit. I see the only way to get a quick response from VC is to leave a review on TP. Seems pointless having a chat function on their platform. Customer Service now claims it’s the billing address why there’s hold up with shipping my item. However they’ve charged my credit card with the same billing address they claim is problematic. I placed an order in July and there were no issues with the address. It’s the same address that’s been on my account since I first joined in 2013. I have not moved home. Just a bare faced lie to cover appalling customer service.","title":"Lack of Customer Service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-08","author":"Sarah","text":"Totally unbelievable!\n\nI have sold an item and the buyer wanted to cancel, I didn't agree to it as it would impact my account and make me lose my rating. So I contacted VC:\n\n\"16834429 I sold this item, then the buyer changed the mind and wants me to cancel it, which would impact my account, buyer indicated she would find something wrong with it, or claim it is a perfume bag if I don't cancel.\nI tried to reach out in chat and ask how I can safeguard myself but only got platitudes and no real answers, all I was told that \"only sellers can cancel\"\n\nSo I get one reply (the person aka Roddy for VC, customer service) sends me an autoreply about a screenshot needed for an attempt to finish the transfer outside of VC. NO, I WAS ASKING HOW I CAN PROTECT MYSELF AND GOT NO ANSWER!\n\nI tried again, sent another email, apparently same person now wants a screenshot of the insult I received. THIS IS ABOUT HOW I CAN SAFEGUARD MYSELF IF THE BUYER TRIES TO DAMAGE THE ITEM OR CLAIMS THEY RECEIVED SOMETHING ELSE!\n\nNo reply, they do not even read the email when you contact them, I am very worried how they will protect me and my item if they can't even be bothered to read your mail and just spam you with autoreplies. I am not even sure that they have support staff, it is possibly a bot sending out automated emails.","title":"Totally unbelievable!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-08","author":"Veritas A.M","text":"I have sold 2 items and it's about a month. First off they get fixed 15 euros off what I sell and second they can't pay you what u deserve. I received a message that payment has been made directly to my account. Its about a month. No payment no way to contact them. I have sent emails all to no avail. Any platform that doesn't have a genuine number to call when things go south is not worth it. What do u make of it. \nI count it as loss and happy I realised its not worth it. Pulling out the rest of my sales. Don't want the headache. Wishing luck to those who have made it here","title":"No payment no sales no contact 🤦🏿‍♀️","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-08","author":"Violette","text":"This is bizzare. I found out vestiaire dropped the prices of my items significantly without my permission. Im saying like HKD820 to 620, 1500to 1250. One of my item is now HKD120 - below the minimum hkd130 .....so am I suppose to sell that item for free??! I have no idea how they've done that. I have never dropped the prices myself someone or the system has done it. I contacted the customer service, they said they'll reach out to the experts, and the next day I got a reply saying they can't do anything about it I have to cancel and relist everything.  How frustrating. I listed many of my items with free commission and they are now gone.","title":"Prices drop by themselves","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-09","author":"A X X R","text":"I placed an order 4 days ago but the seller still has not shipped it yet till this day I can’t email Vestiaire collective my email always bounces back . I paid €556 I better get my refund","title":"I placed an order 4 days ago but the…","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-10","author":"Isabelle -","text":"Bought something on this website. Seller claims the product is \"brand new, not worn\" and the condition is 10\/10 but the condition is OLD AF. Item looked preloved and abused and at least been used for a long time. Wanted to get a return but because I'm in Singapore, the return shipping fees is so expensive. Do not bother to buy there!!","title":"Do not buy!!!","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-10","author":"Alexandra Alwen","text":"They sell fakes and claim it to be real brands. I bought what I thought was a leather bag but  it turned out to be synthetic. It had a little tear and you could see the threads, leather does not have threads like that. I sent the bag back but they still claimed it to be authentic. They also sprayed the bag full of perfume to hide the fact that it did not smell leather. I would call it a great scam operation.","title":"They sell fakes and claim it to be real…","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"},{"date":"2021-09-10","author":"Katy","text":"After my experience with my completely New Dior Shoes i wish to not give even one star.  I sold my Dior snickers , which i purchased by my Personal Shopper on Dior on-line butique (Germany Website),becouse They don’t do delivery to my country. Anyway i sent them to “expert team “ lol “ And later on They sent me a e-mail, that shoes are not authentic and if want my shoes back i must pay for a delivery 12 euros . How is it not authentic?I have emails from Dior about a order  , i have a receipt,box,dust case ....everything is just absolutely official and so clear . They are not Ok and i will fight for my rights. Becouse They really put me down. How am i looking like for a buyer ????They promised me , they will check my Shoes one more time, but i dont believe They will take a care about it. It is happened to me even with Hermes belt ,which i purchased in Hermes store in Dubai and They said it is not authentic ,omg i bought in Hermes store how is not authentic?But unfurtunately i didnt find that receipt from 2017 so i paid 12 euros and They sent my item back. And also Many times i posted some items and they refused it ,then i see another user he posts the same item ,similar way of photos and They accepted. I feel like They are in good mood : accepted ,They are not in good mood :not accepted.And what Makes me sad : i never purchased items ,which are not authentic. And now I am even more worry ,becouse i sent my bag LV to “expert team “ with a box ,dust case ,receipt from LV store . Maybe They will do for me the same way and in this case i will do my best that all people They will know it. It is not Ok what They are doing.","title":"After my experience with my completely…","stars":1,"location":"CZ","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=46&stars=1&stars=2&stars=3"}]