[{"date":"2021-03-03","author":"Mihaela Calin","text":"I sell in January an item 1300€ and till naw l didn’t get paid. I write them several emails and promise that l will be paid . Same thing is happening. All the persons have this situation we have to report them to Europol and European consumer . Please let’s do same thing!!!","title":"I sell in January an item 1300€ and…","stars":1,"location":"CY","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-03","author":"Ulkar Alakbarova","text":"My sale was cancelled, while the item was on the way to VC. I have sent the item outside of Europe therefore it took more time to be delivered. Through the tracking number I have send via chat twice to their representative. Each time they said “no worries” we made note of that. In fact they didn’t care to make notes and make sure it doesn’t get cancelled. I have asked how to write complain, they have answered via us we will transfer to logistic team. Very disappointed with such service!","title":"Terrible customer service","stars":1,"location":"AZ","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-04","author":"Jet","text":"What the hell happened? Vestiaire Collective used to be legit and I used to be able make purchases and sell items on their site with confidence. My last transaction with them though has been a NIGHTMARE. I bought a bag on 2\/5 and was charged for it and I haven’t gotten any update since. On their website, it says they have received the item and accepted it but that was 3 weeks ago. I have reached out to them multiple times to ask about the status of my order, and have gotten the standard “we’ll investigate and get back to you in 72hrs” but after 72 hrs, NADA! I’m currently in the process in disputing the charge with my bank but what a NIGHTMARE! Never again!","title":"What the hell happened","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-04","author":"Emma","text":"Shipping labels never work\nHave sold quite a few items now and am pleased with that (obviously). the problem is that the shipping system is not seamless. the waybill numbers that they provide me with never work and for every sale i have to go through the online chat to rectify this. Quite a flaw in their business model. i have asked for this to be raised higher up the chain of command but nothing is ever done. their customer service is very poor - woudl be much easier if you could speak to someone. \nAlso, their new payment system has been slower for me - i am still awaiting payment for a sale 3 weeks ago. \nGreat business idea, poor execution.","title":"Shipping labels never work","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-04","author":"Pj","text":"The worst company I have ever shopped with. They are sneaky and unreliable. They do not care for customer service, when issues arise you can only deal with bots and not humans. I would never ever ever use this company - they should be ashamed of themselves and how much hassle they cause for their shoppers. I have had 4 items never actually end up being delivered to me and am yet to receive any human contact. Avoid at all cost!!!!!","title":"The worst company I have ever shopped…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-04","author":"pinto","text":"............","title":"i have luxury clothes and shoes \"…","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-04","author":"Claire Uibh Eachach","text":"They have double charged me and won’t refund my money or respond to me. On my second Only order with Vestiaire they charged me twice (€299x2) has been taken from my account. \n\nI’ve followed up several times and they simply refuse to do anything. \n\nThey just say they will come back to me. I’m now going to have to try chase my money legally which is an incredibly stressful thing to have to do over buying some clothes. Avoid at all costs.","title":"They have double charged me and won’t…","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-04","author":"louise kavanagh","text":"So bad customer service is a joke \nAs a seller always left short on pay \nThey also lost a pair of Chanel trainers on me months ago and still are “keeping at their warehouse”\nOn chat they fob you off to join email and then no one gets back to you \nUnless your selling tat I wouldn’t touch it with any luxury goods because they’re not in good hands and neither is your money","title":"So bad customer service is a joke","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-05","author":"Rebecca Emily Mary Shaw","text":"I have been waiting for my item to be shipped for almost a month, with no contact from Vestiaire: no agent available on the phone or online.\nTerrible service","title":"I have been waiting for my item to be…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-05","author":"KHK","text":"If I could give them zero it would be zero. Absolutely useless. No phone number to call, live chat is a robot and nobody replies to inquiry about an item which can't be shipped by chronopost. Chronopost just told me they can't ship due to logistics problems and I don't even speak French. Nobody at Vestiaire has even bothered to reply. Also no email to contact them. Why do they use chronopost from Europe to Asia, just stick to DHL. Will be lodging a PayPal claim for non delivery. Buyer beware.","title":"If I could give them zero it would be…","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-06","author":"Elaine O'Connell","text":"Let me start by saying that as a buyer I’ve had only good experiences, as a seller, however, it’s absolutely shocking. I sold a bag early February, the buyer received it on the 16th and my payment still hasn’t been transferred. This new “get paid” feature doesn’t appear to be functioning properly as it doesn’t capture the information I submit. I’ve sent dozens of emails, spent hours on live chats and nobody has solved my problem. They are flat out ignoring me now; and I don’t have any idea if I will ever get paid the 770 euro owed to me:(","title":"Sellers steer clear","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-06","author":"Customers abet pye","text":"I would give them no stars if it was an option. \nNearly 3 months I have been waiting on 2 payments . Tried everything to sort it but they’ve just made promises that have not been kept .","title":"I would give them no stars if it was an…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-06","author":"Daisy Davidson","text":"poor customer service, bought a top, it never arrived and there was no one to discuss the issue with, eventually had to open a paypal case. Great items for sale but awful customer service and watch out for fakes, especially with dior.","title":"poor customer service","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-07","author":"LM","text":"I am convinced their customer service is run by robots or 3 year old children. I’ve never, ever seen anything so poorly run. I ordered a dress and when it arrived it looked like someone wore it 3000 times then ran it over with a bulldozer and additional 10 times. Completely unwearable! I sent obvious pics and their response “this fits the description of good condition.” Really?!!!","title":"customer service is the worst of the worst","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-08","author":"Csaba Virág","text":"Bought two items, none of them were shipped or delivered. When questioned the seller in a private message I was blocked for 24 hrs whilst Vestiaire is holding my money for two items. It cannot be like this and Vestiaire cannot always refer to their T&C. Or, yes you refer to it, but do your damn job first!","title":"Very bad customer service and overall the concept doesn't really seem to work","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-08","author":"Titi","text":"If you buy, it is OK, but NEVER sell on the site. \nItems get lost or never paid. No phone number to call, n o answers to mails, not item gets back\nBasically they keep your item and you have no way to get it back or been paid even if you have the proof they received it.....\nBe aware of that you risk !","title":"never sell one the site !","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-08","author":"Sarah Hicks","text":"Purchased two items from Vestiaire and both items had significant issues despite going through “authentication and quality control” by so called “experts”. One was the wrong colour and the other missing a strap. VC and I could not come to a mutually agreeable solution to the second issue. I have decided to take my business elsewhere. The promise of VC is that their items are quality controlled but this did not match my experience. I have had a much easier time dealing with trusted resellers on eBay and will not continue to shop with VC.","title":"Quality control and issue resolution lacking","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-08","author":"Anna","text":"Had one of my items refused for a reason I really can't figure out. Having had many irritating listing experiences by VC, I decided to ask their chat advisors the reason why. The weirdest answer ever: \n(05:39:37)\tme: this item refused.\n(05:39:51)\tme: I am wondering why\n(05:40:07)\tVC: Let me check its history.\n(05:40:45)\tme: thanks\n(05:44:52)\tVC: Thanks for waiting.\n(05:46:43)\tme: go on.\n(05:47:15)\tVC: From the records the decision of refusal was such that the photo does not allow VC properly control your part and does not meet the criteria.\n(05:48:01)\tVC: Therefore, we invite you to renew your deposit by selecting photos that highlight your item and provide buyers with maximum details.\n(05:48:28)\tme: properly control my part?\n(05:48:44)\tme: I sent at least 10 pictures\n(05:49:00)\tme: is that not enough for vc to \"control\"?\n(05:51:05)\tme: I would be happy if curation team to check one more time\n(05:51:55)\tVC: It is the curation's call which they have an algorithm and criteria for allowing or refusing an item.\n(05:52:07)\tme: because prefer this item sells on other platform , so I don't need to waste any more time being refused by vc\n\nI listed a men's denim jacket with a detachable wool shawl. It's authentic. It's by a hip Japanese street brand. There were at least 10-12 photos submitted, all taken in broad daylight, up close and personal AF. \nYou cannot possibly convince me you cannot work with 10-12 pictures for a jacket! What exactly does VC need to 'control' ? And what sort of algorithm does a denim jacket need to pass? I've had items refused before from other platforms and the reasons were REALLY REALLY CLEAR eg. INCLUDE THE OTHER PAGE OF THE WASHING LABEL <-- that's what I consider clear instructions, I'm not here to crack programming riddles and waste time posting items that can rejected with vague, cryptic 'reasons'! Sort yourselves out!","title":"Giving another bad review","stars":2,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-08","author":"Louisa Vincini","text":"Ordered a coat 5 weeks ago. Literally been in conversations with customer service every few days - totally useless.Tracking not updated for weeks at a time. Filed for lost item a week ago - not heard a word. Customer service say they will chase it up - its been at the UK depot now 4 weeks - literally a joke. Coat was a gift and obviously the birthday has been and gone - had to find an alternative. A coat won't be needed by the time it arrives. Definitely would not order from them again - and wouldn't have ordered in the first place if I'd have known I would need to wait so long.","title":"Ordered 5 weeks ago and still no delivery","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"},{"date":"2021-03-09","author":"leon wang","text":"The quality control team cannot read English even though they sell in Australia. I have a listing that stated in CAPITAL LETTERS NOTE THERES A STAIN. \n\nYet the quality control team were too lazy to read my description and deem that I didn’t list it. There’s no way to contact the team to address this issue. The buyer already bought the item knowing about the defect since it’s listed in the description with capital letters and a lot of pictures of the defect.\n\nThis is just laziness, they’re getting $400 from this Chanel piece yet they cannot spend 10 sec to read the product description from the seller. \n\nThis is pure laziness and someone in the company trying their best to deny any profitability. The item is in Hong Kong, most likely due to some Hong Kong vs Australia issue.\n\nPlease do not list any second hand item on this site as they will try to reduce price without reading description during quality control. Why bother opening a second hand resell service if the quality control cannot read description about defects and stains or look at images of the listing.","title":"The quality control team cannot read…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=69&stars=1&stars=2&stars=3"}]