[{"date":"2020-11-23","author":"Hase Kleines","text":"Great concept that has worked well for me in the past.\nOne thing that really upsets me is their slow and incompetent 'Customer Support'.\nAs a seller: Whenever I contacted them with queries about shipping my items (The courier is supposed to come and collect from your place\/ so not true. Post Corona DHL requires the account info of the sender, it's been 3 days I am still waiting to hear back from the 'Expert team' :)\nAs a buyer I wanted to buy a pair of heels that I saw 3 days prior to contacting them. I attached images, description, spoke to two of the lovely 'Fafafashion' agents, still waiting to hear back from them, it's been two months, no follow up no nothing. At least tell me they are sold??\nSo, this is how i feel about VC, let's see what happens in the near future. \nChallenging especially if they don't even try a bit to keep us happy. A lot of similar platforms out there.","title":"ZERO Customer Support","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-23","author":"isabel","text":"Vestiaire Collective are trying to sell a pair of Balenciaga Triple S as genuine that you can easily see are fake from literally comparing photos to the Balenciaga website. There are lots of comments on their post with them saying to people that their ‘expert team’ have verified the product. I would completely stay away from this website. If an expert team can call very bad stitch work and dodgy font of the logo genuine then this is completely not right!!!","title":"Claims fake products are genuine!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-23","author":"Andreea Simion","text":"Gave up using it since after ordering 7 items only 3 were sent. I don't think it's okay to pay a certain amount of money only to receive an email after a week saying that the item is no longer available and a refund will be processed . I understand that the seller's stats are affected by that, however it is still extremely frustrating.","title":"Gave up using it since after ordering 7…","stars":2,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-23","author":"N B","text":"I've said before and will say it again. The worst website ever. Only using it cuz there's no alternative","title":"I've said before and will say it again","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-24","author":"Dionne Castillo","text":"I purchased a jacket from VC last month and it was shipped out from their warehouse on Oct. 19. I still have not received it. I reached out to customer service several times and only got two responses from their team on Nov. 1 (Daniel P responded) and Nov. 12 (Victoria P responded) who kept telling me everything I already knew; my tracking information.  The last time my package moved was on Nov 4. I imagine it’s lost. VC has provided extremely poor customer service. I have reached out for the last time requesting for a refund (as per their company policy). Let’s see if they actually abide by their policy and give me my money back.\n\nUpdate: I spoke to a pleasant man named Mark from customer service. Adding an extra star to my rating because my issue was resolved, although I am still quite dissatisfied that my package was lost (--I understand that is out of VC's control) and how long it took to get the support I needed, but fortunately, I got my money back. Mark was nice enough to offer a free shipping promo code but I will never use it because I am not willing to go through an excruciating experience like this again.","title":"The worst customer service you'll ever experience... until you file a complaint on Trust Pilot","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-24","author":"Lisa","text":"Purchased a Noors Fares bracelet on 10th November  2020 from VC concierge service, this was supposed to be a quick delivery series with shipping in 2 days.\nThe Noor Fares - Yellow gold bracelet - Ref : 12227581 has still not been shipped, no one has answered me regarding why it has not been shipped and I have tried both emails and posting comments on item.\nThey have pretty much failed their own standards of trusted and expert seller.\nSadly I have no option but to contact my payment company to start a charge back process. I feel like I have been conned, and am quite upset about it.\nI would really appreciate a response, but I won't hold my breath.\nIt is really a mixed bag with this site, when it works its great, but when things go wrong, its a nightmare to resolve, they just simply ignore you.\nCome on VC sort it out, and don't ignore all the reviews.......","title":"Bit like  Russian Roulette on VC for good service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-24","author":"Fleur en sol","text":"I had a terrible experience. VC tried to sell me a fake designer handbag and forced me into buying it. In the end I had no choice but putting it back on sale. I will never purchase from this website. \n\nThey claimed that the bag was real while it was obviously fake (not a leather bag more a plastic leather, Serial number missing, tricked receipt etc). I have asked to not buy it but they forced me into the buy and only gave me the choice to put it back on sale.\n\nThis give me a bitter taste","title":"I had a terrible experience","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-24","author":"Isabel Sousa","text":"I think Vestiaire Collective is a great marketplace, but I am constantly seeing my pieces rejected by Vestiaire Curation team. I am writing this review regarding that issue. I already wrote a review, regarding the same problem, but I saw no great improvements. \nAs I explained before, the pieces I try to sell, and are rejected, are for sale on VC in several accounts. \nI am an Expert Seller, never had an issue with any piece.\nI just would like to have the same opportunities that others Vestiaire members have. Thank you","title":"Selling Issues","stars":2,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-24","author":"Emma Beckwith","text":"Terrible company to deal with I ordered something and it took me 4 weeks to find out it was no longer available and virtually impossible to get a refund , do not use them .\nIt seems very fraudulent they basically had my money for over 4 weeks","title":"Terrible company to deal with I ordered…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-25","author":"Mathilde Holmblad","text":"It’s too hard to even get a chance to get helped. The people who serves the chat aren’t answering you or ask you the same questions over and over again. Like you are to solve the problem and not the customer service. I have now chatted with 3 different persons, about issue with VC spamming my email with mails - 20 a day, and they just tell me to turn off email subscriptions in the app, despite I told all 3 people\nSeveral times that I already did that. Now it seems like I have been given up on and the 3rd person is leaving the chat.","title":"It’s too hard to even get a chance to…","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-25","author":"Mariam Faroughy","text":"This is the most frustrating experience I had: I tried to post an item online and in the middle of posting the item for sale, the page would stop loading and I had to restart 5 times and it still doesn't work. Now when i tried to login to their website an error page appears.  They seem to have a terrible server and I cannot imagine how weak their software must be. Their system remind me of the websites of the beginning of the internet in 1998. It's not a software of 2020","title":"This is the most frustrating experience…","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-26","author":"Lorraine Palmier","text":"If I could give zero stars (I would).\n\nI purchased a pair of Chanel earrings on 28 October - the seller did not send the earrings. I am still awaiting a refund.\n\nNo one at Vestiaire Collective has bothered to reply back to my messages. The website is useless and they make it so hard to even contact the seller direct.\n\nCase opened with PayPal.\n\nAs you can gather I will not shop here again.","title":"Where is my refund????","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-26","author":"ligia gonzalez","text":"I received a beautiful handbag and the product was true to the description and pictures on the website.\nI was appalled at the extra costs, delivery and dogana charges that were added to the price. It nearly doubled it. Accepting this, I expected the delicate handbag to arrive with stuffing inside and tissue protecting  this vintage bag leather. Instead no protection whatsoever, the only bag provided was the Vestiaire thin bag to make sure that the company brand was visible. The bag then stuffed into a soft plastic DHL delivery bag. It's kind of shameful and I don't understand this petty neglect on details. Very disappointed even the most affordable online items take better care of their products and how they are packed for delivery.","title":"Disappointed in packing\/ delivery and extra costs","stars":2,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-26","author":"Christine M","text":"They don’t even deserve this 1 star.\nNever ever sell here!\nI’ve sold a few products here before and last week I sold a Louis Vuitton handbag. \nAs a seller you don’t have the option to opt out of their direct shipping program.\nThe buyer selected direct shipping so I wasn’t given the option of sending it to VC for authentication.\nUpon receiving the bag the buyer claims it’s fake.\nI know for a fact that my bag isn’t fake because I purchased it at the Louis Vuitton store! So I look into the buyer and look at the receipt from the shipping label that DHL gave me and this name doesn’t exist.\nThen I look at the tracking and someone with a completely different last name (some guy in Poland) signed for it.\nSELLERS BEWARE VC HAS NO CUSTOMER SUPPORT! No phone number, no email address and no mailing address. Only a chat which lets you speak to the same two people who are greatly unqualified.\nI told customer support about this and said the buyer can send them my bag and they’ll investigate. I asked them since this person is some guy and claims that my bag is fake how on earth they can guarantee that this person is sending them my bag and not some fake bag after selling mine and trying to get a refund from them.\nThe response : “we can’t guarantee that. We base our trust in the honesty of the buyer”.\nI’ve been on the chat for an hour , sent them tweets, filled out a complaint form on their website... NOTHING! No response, no investigation.\nI’ve lost a handbag \/ 700€!\nJudging by the many bad reviews they receive and don’t respond to regarding payment I assume I’ll never see that money again.\nZERO BUYER PROTECTION & ABSOLUTE FRAUD!\nSince I have the multiple names of this alleged “buyer” \/ scammer I will report this to the police and also mention VCs name.\nNever ever have I experienced such a fraudulent company!","title":"SCAMMERS! Stolen handbag!","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-26","author":"Lorraine Palmier","text":"If I could give zero stars (I would).\n\nI purchased a pair of Chanel earrings on 28 October - the seller did not send the earrings.  I am still awaiting a refund.  \n\nNo one at Vestiaire Collective has bothered to reply back to my messages.  The website is useless and they make it so hard to even contact the seller direct.\n\nCase opened with PayPal.\n\nAs you can gather I will not shop here again.","title":"Where is my refund Vestiaire Collective","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-27","author":"Tiffany Michou","text":"Worst website ever! Please don’t use it! I purchased a $300+ wallet a month ago and haven’t receive it. There is NO customer service whatsoever. They don’t CARE about customers. Please use another website but not them. Terrible experience.","title":"Worst website ever! No customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-27","author":"Joanna Aitken","text":"Ordered a Gucci Jacket on 13th November…\nOrdered a Gucci Jacket on 13th November 2020 order number 31457627 item reference 12165883, it was being sold by a seller in Switzerland and the seller sent the item to Vestiaire on Monday 16th November. On the Vestiaire website under the order it states\n\n'Waiting to be shipped by the seller to Vestiaire Collective. We reminded your seller on 20\/11\/2020. Feel free to do the same and leave a comment under the item!'\n\nSo I contacted the seller via Vestiaires private messaging system and asked her if she could give me any further information and she informed me that the jacket is sat in French Customs and that Vestiaire will just leave it there due to the fact that because it is coming from Switzerland there are customs fees to pay and they will not deal with this. She stated she had also sold another item in October and the same thing has happened and to date she has still had not received that item back. What is the point of purchasing items from this website if they do not have procedures in place to deal with their own Countries customs authorities!! It is total a lack of care and consideration not only to their buyers but also to their sellers. What is written against the order is completely untrue because the seller has sent the item but Vestiaire are doing nothing to retrieve it from their countries customs authorities. I have been in touch with Vestiaire Collective to ask why they are not retrieving this item from their customs and they sent me a generic email reply stating their delivery times and if the item does not reach them within their stated delivery time they will cancel the order and refund me. All the while they are holding this situation up themselves. What sort of service is this? Totally inadequate and a waste of everyones time. Do not advertise items on your website Vestiaire if you cannot deliver them or sort out some sort of arrangement with your Customs authorities - Vestiaire are totally unprofessional!!!","title":"Ordered a Gucci Jacket on 13th…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-27","author":"Mira","text":"I have a similar problem to one of the reviewers below Simona. \n\nI've been using Vestiaire Collective sporadically for over 6 years now. I've had some minor issues before but the company seems to have really gone downhill these days. \n\nI sold an item via direct shipping and the parcel went missing, I contacted their chat multiple times, was told a different story each time so ended up having to contact UPS and the buyer directly myself. I had to figure out on my own what happened, let them know, and they still refused to pay me out even though it was a system error and the buyer actually received the package a long time ago and was happy with the item.\n\nLuckily the item wasn't so expensive but I will be deleting my account for good as their customer service is non existent and it caused me too much lost time and annoyance.  \n\nIt's been over a month and I'm still waiting to be paid. \n\nFor people considering selling items on VC - if everything goes right you will be fine. But if something goes wrong you're on your own and you will lose lots of time and maybe also some money.\n\nUpdate: after a few weeks I was able to get in touch with a helpful support chat agent and got my money back. Glad this finally got solved, but still unhappy about the time and effort it took to get this resolved, and the unhelpful agents I chatted with along the way.","title":"Haven't gotten paid for my sale, poor support","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-28","author":"Loredana Constantin","text":"worst experience ever!!!! don't trust them! their customer service does't exist: all the representative are poor prepared to answer or resolve your problem! I bought a bag and because had some problems I sent it for a double check and they without notice, put it on sale! I tried to make an offer  for my bag and even iI i was the first one to make an offer and I refreshed the page all day long, they sold my bag to someone else with a significant lower amount. They are the most unprofessional application I ever seen in my life. Only by luck you can buy something good from them. If God forbid you have a problem they are UNPROFESSIONAL and they don't fix you problem. Avoid them as much as you can!","title":"worst experience ever!!!","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"},{"date":"2020-11-29","author":"Marija","text":"I am without any words for Vestiaire. They are so fake and full of some lame expressions pretending to be some experts. After 100 sales I made, they refused my item as fake. I provided them with numerous photos of the same item and they just ignored it. When I told them they actually accepted THE SAME item in another color they said to re-check it. After a re-check they said they stick to their opinion this time but offer me Premium membership free for a month haha?! So what is it? Are you wrong or right? Firstly, they dont know the difference between original and fake, that is A MASSIVE problem, it really worries me not only as a seller but as a buyer since not that I have just sold 100 items there and they took my badge but I also bought a lot of things which scares me now. Secondly, they formulate it in the way “they could not be sure its authentic”, so if you are not sure, why are you taking money and badges like you are sure? If you are not sure, I doesnt mean you are right nor are you entitled to make moves like this. Thirdly, it is such a famous model, I even sent them screenshots of the same model, same color all around the web, including their own page, but their agents are just like bla bla bla bla, always the same, same sentences, like they have no ideas, no brain, very useless. Very bad behaviour, in the end, they live out of provision they take from sellers and they are acting like they are doing you a favour. Although its not a big amount of money, I have decided to go with it on another lever since they even want me to pay money to recieve it back and say it will be destroyed otherwise. They accepted the same item before, it just tells you about their criteria. AVOID AT ALL COST.","title":"AVOID AVOID AVOID","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=87&stars=1&stars=2&stars=3"}]