[{"date":"2022-05-02","author":"Claire Delaforce","text":"My welcomeuk one off voucher did not work even though it said registered on payment page. So I did not get the 20 pounds off I should have for my first purchase! Not a great start. Let's hope the bag arrives OK. No way of contacting seller to ask for money off ! Contacted company and the assistant \" robot\" advised its a non refundable code ( THAT DOES NT WORK!) and I can't have a refund on my card but another promo code!! Escalated to management for the promo 20 pounds refund back. Not holding much hope though.","title":"My welcomeuk one off voucher did not…","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Ebenezer","text":"Very good I’m very satisfied","title":"Very good","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Oliver S.","text":"No delivery of a 3000€ bag\n\nI ordered a Chanel Bag and waited and waited. The item has been shipped by the seller and was in paris since 20th of April. But from there on no movement anymore. Only after my asking, the VC team is looking into what is going on there. \n\nSub-level customer service, not reliable.","title":"No delivery of a 3000€ bag","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"cherry","text":"They shouldn't take so much commission. It makes me earn too little and I don't even wanna sell it here anymore","title":"They shouldn't take so much commission","stars":3,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"danielleÅkander","text":"Twice I bought an item and “ suddenly “ it was cancelled, after I payed. No one to talk to or email. So outrageous","title":"Twice I bought an item and “ suddenly “…","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"jan assheton","text":"I feel that the extra charges you apply are a bit e crossover, it would discourage me from buying from you again \nYou should also display these charges alongside the item rather than at checkout for clarity","title":"Fees","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Elisa Motterle","text":"I seldom leave negative reviews, but in this case i feel I need to WARN potential buyers.\n.\nMy husband bought an expensive watch for me on site (upon my suggestion, i regret).  The watch came with a certification stating that it was original and in pristine working condition.\n.\nCirca 20 days passed from the moment he received the watch to the moment I was given it, unpacked it and realized it was NOT working.\n.\nI claimed with Client Service only to hear that since than longer than 14 had passed, they were not willing to take any responsibility.\nAnd, I was dismissed quite rudely.\n.\nSo, I wonder: what is the certification the watch came with for? Certifications provided by VC clearly hold NO VALUE to Vestiaire in the first place, and this speaks volumes about their trustworthiness.\n.\nOn top of this, client service itself is really sloppy; you never get to speak with anybody, just emails that are clearly pre-written...AND scammy messages \"reply withing xx hours or we'll archive your case\".\n.\nI had the WORST experience, I usually don't like to speak ill but in this case I feel I need to warn you to to steer clear of vestiaire. \n.\nAll they have is good marketing, but service is inexistent... Which came just as a surprise, as having been a seller in the past, I am painfully aware of the high commission they command.\n.\nThey'll never see any of me or my family again and I will discourage all the people I know.\nI'm a big fan of second hand and I never had such a negative experience so far.","title":"WORST experience - AVOID for your own good","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Laura Buadas","text":"A terrible experience!. I am still waiting for my payment.\nI sold a CDior saddle bag, limited edition, for 1.800E. When it came to payment they sent me an email saying that for security reasons they had blocked my account and that they wanted proof of my address.\nI have been receiving payments from them before, I actually have sold 5 items and I have been labelled by them as an expert seller.\nI cannot provide them with the documents they are asking from since I temporarily live in a new country and the address on my commodity bills doesnt coincide with the address in my passport. In this case their automatic system where you have to upload the docs doesnt accept a purchase bill. I did sent one from Decathlon, proving where I am staying right now. My mobile bill is from my previous country and obviously doesnt coincide with my passport either. They have no right to ask me that my address coincides with my passport or my bills, I move around a do change my address quite often. In fact I am going to live off-grid next month and I wont have gas or tel bills no more.\nSo they have built a security system that fails and it is illegit but I have to pay the price for it because when it comes to complains they make everything really difficult, a labyrith, so you give up. They redirect also every complain to a help center and in my case its been a month and they have not even answer, on top they dont give you a case reference number when you put the complain.\nThey keep on sending me an automatic email, with a non-reply, asking for these documents, as it is my fault and the ball is on my roof.\nI have asked to at least get my handbag back with no success.\n\nLaura B. Rotger\nGreece","title":"A terrible experience!. They owe me 1.500E","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Mimi H","text":"Absolutely rude staff when there’s an issue with purchase. Live chat is useless and they are arrogant don’t want to help.argue with you if you rate the chat as bad. Sent item back but they don’t even know I received it. Just avoid on luxury purchases as it’s a big investment.","title":"Absolutely rude staff when there’s an…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Kate Evans","text":"51 days and counting....... can't really do much but let everyone know that this is how they treat the sellers that they receive commission from. Unless, they keep the whole amount and your buyer doesn't get the item, and you don't get paid.","title":"51 days and counting......","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Amanda","text":"I cannot understand why the sale was for 70 euro and in fact I was told it was 63 for me and now you are only sending 58!!! I can’t am explanation!","title":"I cannot understand why the sale was…","stars":1,"location":"MT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"Michelle Viola","text":"Worst staff, worst app. I sold a Prada leather jacket that had a loose stitch problem that was specified in the description, when the buyer received the item within the time she reported a problem and sent it back to me, when I received the jacket back, it had a big rip and smelt also very bad! As I am guessing it was worn for a night out!! Obviously the staff never cares for this. \n\nOn another experience I sold a bag that passed through “quality control” and got reported as “wrong measurements” \nAs the bag was brand new, with dust bag and tags, the same “”wrong measurements”” we’re also on the tag the producer wrote!!! How strange! \nIt then took the very unrealistic staff over one month to send my bag back to me. #1 worst app. You have no guarantee in how your item will come back to u if it is not liked. Would not advice to sell ANY high end on here.","title":"Do not use!","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"Mgmirko","text":"To boycott Vestiaire, I’m aware that over 260 profiles have been created with the purpose of selling FAKE items and the products have passed and been accepted by their quality and authenticity team, not that makes a big difference because Vestiaire itself sells already fake items. So think how many fake items are out there on this app if over 260 profiles are selling fakes, the gravity of this is that their quality team actually accepted these items only with the purpose to get the high commissions.\nI wouldn’t trust this app anymore as it’s used to sell counterfeit items.","title":"Over 260 profiles selling fake items","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"Chantelle","text":"I used to love this website a lot until I met my trouble:\nMy sold item 21967186 was shipped on the 28 of March, which was exactly 35 days ago. The buyer never picked up, I contacted the VC and reported this issue again and again but they never really helps. They refused to open an investigation or return my item because they said the item is waiting to pick up.\nPointless, the buyer already told VC she would never pick up.\nHow about my payment? No way, payment does not exist in this case.\nTHIS IS ILLEGAL!\nAccording to the Terms and Conditions of Service of the courier: VC would return the item to the seller after 14days, without the buyer’s permission. But VC is obviously against their terms, and VC doesn’t care. All of those CS agents email me every day, and tell me they will help, soon they will have a solution, but so far I never heard any solution, yes, after 14 days haven't figured out any solution.\nI wish you guys good luck, if nothing happens, this site is perfect, if you are unlucky meet trouble? Help yourself then, because they never gonna help.","title":"Love it until I got trouble - lost item and money","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"Ella","text":"One more story from Vestiaire:)))\nMy Almost new Manolo Blahnik flats were refused to be put to the website for sale. As the authenticity team decided they are not authentic through the photo:))))) Nice joke! I bought them in FARFETCH, Harrods addition.I even enclose the order and payment screenshot. :))))) \nI wonder if I contact FARFETCH and tell the Vestiaire decision what reaction the shop will have:))","title":"One more story from Vestiaire:)))","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"Vasso","text":"Shipping fees to be applied is one thing. But there should be some transparency here. There is a whole section in customer service that displays the shipping fees at each case, depending on the buyer's and seller's location or the type of shipping you chose. What's the point of these tables if the fees you really have to pay have nothing to do with them. I purchased 2 items over the last 2 weeks. One from an EU country to Greece and one from Greece to Greece. At both times I was asked to pay the exact same amount of 11€ for shipping fees while at the relative link mentions 10€ for shipping in the EU and 6€ for local shipping. That's not right. There is a \"from\" next to the shipping rate. Does this justify it all? I searched for anything that could explain such an amount and the only thing I could find was customs which of course don't apply within the same country. 11€ is too expensive for local shipping. There should be clarity and there should be some sort of customer service. I contacted customer service and they told me sorry nothing I can do. It's not about the amount of money you have to pay. It's about trust and consistency. I was a big fan of Vestiaire but I don't think I'll ever buy from there again.","title":"Shipping fees to be applied is one thing","stars":2,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"Gillian","text":"HORRIFIC EXPERIENCE!!! EXTREMELY RUDE AND UNHELPFUL “STAFF”  FIRST TIME USER AND WILL NEVER USE AGAIN! AVOID AT ALL COSTS!!! BEWARE…","title":"HORRIFIC EXPERIENCE!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"Jean Grabisch","text":"the customs fees should be precise well in advance before putting the item in the basket in order to avoid bad surprises regarding to the final price.","title":"the customs fees should be precise well…","stars":3,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"Sarah A","text":"**UPDATE** I am officially $600 out of pocket and no attempt by VC to resolve. Just a stock standard reply from a customer care agent.\n\nAs a long time eBay customer and professional seller, I have to express my utter disappointment with the service received from Vestiaire. \n\nI purchased a Chanel handbag on the proviso that Vestiaire would take care of me should anything go wrong with the transaction. The bag was listed in the ‘very good condition’ category which I soon realised is not at the grading standards one would expect when buying Chanel. \n\nThe bag arrived with visible oxidisation on the chain strap which was NOT declared by the seller. The bag also arrived without a serial number (!!) which too was NOT declared by the seller. \n\nI reported both issues to Vestiaire and sent supporting photos to which they agreed to reassess the bag a second time.\n\nAfter I had to follow up 3 times to get an update, I was informed the bag was fine and that I wouldn’t be refunded. Vestiaire’s explanation was that it is a very old bag and was produced before serial numbers existed. Wouldn’t one think that this vital piece of information should be declared on the listing? Even the quality of the photos that Vestiaire approved left much to be desired.\n\nVestiaire then proceeded to relist the bag on my account without informing me first and it was sold for hundreds of dollars less than what I had paid. So the poor customer who is now buying this bag (and may not care about the issues I’ve highlighted), may end up with a cancelled sale because of poor communication on VC’s end. Either that or VC will proceed with the sale against my wishes and I am left hundreds of dollars out of pocket.\n\nI had to go through the exhausting task of contacting their customer service team for the umpteenth time via chat (which if you have done this before, you will know requires much patience and effort as you never get to chat to the same person twice and have to explain the entire situation over), only to have them pass on my message to another member of the team, to then get back to me via email. No opportunity to have a two way dialogue because of a very poor customer service platform.\n\nSo here I am, trying to figure out how on earth to move forward after spending many hours without a resolution. I’ve had to escalate my issue to PayPal.\n\nMy honest opinion is not to waste your time and energy, the service is sub par and you are treated like a number.\n\nDo better Vestiaire, your customers deserve better.","title":"Disappointing to say the least","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"Zharkyn Ermekovna","text":"I have been an experienced seller on Vestiaire for many years and never had any issues with this platform until I had sold my Alexander McQueen trainers Ref: 22178605, which the authentication team checked them and stated that they are not authentic, I thought that the people who work for the authentication made a mistake and asked for the second review and again same result, I am absolutely shocked how they can state that the shoes which I bought in Harvey Nichols can be fake? Even though I was able to provide with the email and transaction screenshot from Harvey Nichols… another thing I have lost all my badges which I were an Expert seller and because of their mistake they had cancelled all of my badges… i was trying to contact them but different operators keep replying different answers and I don’t think there is somebody who will sort it out…  Customer service is rubbish, feels they don’t care about anything, that’s why they keep messing up with people’s belongings, not trustworthy company, avoid!","title":"Authentication team is rubbish!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=2&stars=1&stars=2&stars=3"}]