[{"date":"2022-03-03","author":"Jane Smith","text":"I wouldn’t give even one star if I didn’t have to. The whole company is a joke. Do yourself a favour and do not get involved with these law breakers. Firstly they don’t have a clue about how to make sure clothing is authentic or about the prices. Secondly, their staff are appalling! I closed my account with them and unsubscribed to emails. I continued to be harassed with marketing emails. No matter how many times I clicked ‘unsubscribe’ I kept getting emails (this goes against the GDPR law by the way). So I contacted their ‘help’ section, at which I received a message that I could not reply to - to tell me I need to unsubscribe through my account. I DONT have an account because I came to my senses and deleted it! So how can I cancel my subscription through that - stupid staff. Anyway, I turned to social media to POLITELY ask someone to help me.. and they deleted my comment because they’re obviously hiding behind how they treat people! Don’t delete comments, deal with the problems. This company is an unbelievable joke. How anyone shops or sells on there is beyond me. I managed to contact their data law department (yep, this is how far you have to go to something simple sorted) and they emailed me and said they are unsubscribing me and it might take 70 days. No one at VC has a clue how to manage anything.. do not waste your time unless you have a team behind you to help you solve all the problems that you’re going to have with them. You have been warned!","title":"Do not deal with this awful company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"Jas Min","text":"Awful customer service!!!  Awful scams in the US. This app is of a much higher caliber in Europe!\n\nThis app screws over the seller as well as the buyer. \n\nOne of my parcels was never even delivered and I won't even get a reply from customer service! I'm starting to get afraid that I will never see a refund. \n\nVestiaire in the US delivers with FedEx and with UPS. Fedex just leaves your parcels outside the apartment building door, and vestiaire won't give me a refund for a parcel that never even saw my building!\n\nSCAM SCAM SCAMMY VESTIAIRE! Their customer service has been sending me 'well get back to you in 24hrs' emails for over a month now!\n\nPlease give me my refund and acknowledge your partnerships are creating your losses not your customers.","title":"Scam in the US! Only legit in Europe!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"A K","text":"I’m scared to buy anything expensive on VC! It’s now the 2nd time my very high value order that was sent by a seller in France to Vestiaire for control just went missing! Both orders just vanished from ups shops and never turned up, been missing for weeks! Weeks of me chasing Vestiaire for cancelling the order and begging them to refund me! First time it took a month to get back a large sum of money, we’re speaking almost €12000 here (order #45086247) Now it’s over €2000 and the same scenario repeating again, is it a coincidence? I don’t think so\n\nIt is obvious to me that the packages heading to Vestiaire in France are targeted for theft. But why the buyer should feel the pain and chase them up for weeks to get back the funds??? I just don’t get it, I’ve contacted them five times via live chat option (which is huge a pain itself because of the bot Leo) and also by filling the form on their website. It always ends with a promise to pass my inquiry on to the “experts” and up until today I received no response, no resolution, I’m totally in the dark and the package is not moving for exactly two weeks. VESTIAIRE STOP HOLDING MY MONEY HOSTAGE! Cancel my order #52402647 and refund me my €€€€! Take it up with UPS if needed, put some security measures in place with UPS, switch to DHL if this problem is not resolved with UPS, I don’t know! There’s clearly something fishy going on, a scam..a theft..whatever it is I’m not sure but I’m really scared to buy anything high value because this is now second shocking incident of loss\/theft and I’m tired of chasing you up and jumping through hoops to get back my money","title":"Another high value order disappeared! Vestiaire STOP HOLDING MY MONEY HOSTAGE","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"Elin Ydmark","text":"I will never purchase from Vestiaire collective again. I was originally sold a fake that did go through their “expert evaluation”. Upon realization and having a real life expert have a second evaluation, it was undoubtedly a fake and so I tried returning it. And I mean the whole process of trying to return it is absolutely ridiculous. I’ve spent countless hours on their support chat, sending emails and having technical difficulties with their site which truly needs an upgrade. Finally had got it sent after 2 months, only to have them write that it “matches the sellers description” making it eligible to sell again and be relisted on my account. Yes it might match the sellers blurry and vague description, but in no way was that bag authentic. I felt very bad for the next buyer of my bag, and for their sake, I’m hoping that it truly is real. On top of that, the email I got had said that I would receive “the full proceeds of the sale, minus our usual commission”, I mean how misleading can that sentence be? I understood that I would receive FULL payment, but after just having a long chat with a Vestiaire Employee, I was told that was not the case and that they’re sorry that I got confused. I never thought that I would be gaslit by a company until now. Not only did I waste an incredible amount of time with this site, but I’m not getting all my money back. I will never recommend this site to anyone. Now I just hope to receive the payment (that’s minus the ‘usual commission’) and move on. So much unnecessary stress. One last thing, there were times when the support chat were helpful, efficient and reassuring, but there were times when i was absolutely in awe in how absurd they were. I mean once, I couldn’t hold a conversation with one guy, who wrote complete gibberish and another time, I asked an employee a simple question and she obviously did not know the answer so then she just left the chat, without saying anything. I was in disbelief.","title":"I will never purchase from Vestiaire again…","stars":1,"location":"TH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"SM","text":"TERRIBLE SERVICE. WOW!\nWhatever happened to this website, I don't know. It used to be great, great customer service. Now it's just bots, you can't speak to anyone and on chat they just give you standard messages. They are one of the worst customer services out there. I have been trying to deal with an issue (caused by them!)  for the past month and it's still nit solved. Shame on you Vestiaire!","title":"TERRIBLE SERVICE","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"Ra","text":"They are very fast to send news on Vestiaire Collective but the customer care is very very slow and inefficient. \nI bought a Chanel bag from MyTheresa(professional seller) after 4 days I wanted to return it and they said no. First by chat they said that was sending me a return  label  and after the email did come I contact them by email and they said no. Simply like this.They lied to me.   On their website is clear the message saying that you can return the items from a professional seller in 14 days. Disappointed. I do not advise this store.","title":"Customer care who lies to the client?","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"Ivs1 T","text":"Very bad and stressful experience. They lied to me that there will not be customs tax charged (from UK seller to UK buyer). The item went for checking to their office in France, after which they have not submitted correct paperwork, and the courier invoiced me with enormous customs charges. The customer care is useless, just promises and doing nothing to help. I lost my trust completely. The site looks awful as well.","title":"Very bad and stressful experience","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"Katie","text":"I’ve reached the end of my tether with Vestiaire Collective. I placed an order for an All Saints leather biker jacket on 3\/02 from a seller in the UK (order 16921985). Since VC were promoting eco and getting direct delivery, I thought that would be the best option. \n\nWhen my order arrived I opened the box and it was a child’s Zara jacket, completely different item with a note saying ‘enjoy my leather jacket’ to that effect. It was absolutely evident to me I had been scammed by the seller, as I didn’t opt for the verification stage and got direct delivery. Contacted VC right away on 9\/02. As I am writing this now, I am still waiting for a resolution almost a MONTH later - I have paid a lot of money for an item I have not even received!\n\nCouldn’t have been more thorough with my photos and information. The tone of their messages? Disgraceful. Most recently a message read “I’m pleased to inform that the seller sent the correct item and the courier delivered the item correctly” ??? Obviously the seller wouldn’t own up to being a scammer. \n\nThey do not respect their customers, customer service is an absolute farce, and I’ve lost every shred of trust in the company. All I want is my money back at this point.","title":"Prepare to be scammed, customer service a disgrace","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-06","author":"nailya _.","text":"I have sold an item and its been like 6 days already and i still see no money on my bank account! This is very disappointing since i’ve seen other people with similar experiences. Ive tried chatting but the only response i get is from some bot with automatic replies.\n\n\nEdit : It’s already fixed and I got my money.","title":"Help!","stars":3,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-06","author":"Ms K ","text":"Awful customer service. I've purchased lots of low value items and everything has been fine with the sellers. The only issues arise if I need to contact VC customer services, which are absolutely awful. Buyer beware. Essentially, only spend what you're prepared to lose on the website.","title":"Awful customer service","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-06","author":"RP","text":"Sold one Louis Vuitton pochette brand new, the ones that comes with the Neverfull bag. After some days I received one email saying that I need to pay 12 € to get my bag back because didnt pass the quality process. I was suprised and contacted 7 times Vestiaire Chat team and also by email. They told that the teams said that is fake item, and then I provide the receipt to them, imagine what? Silence and no answer from them. I also asked to send me the evidences that proof that is a fake item, off course no answer at all. Amazing team and is a proof that they have a big gap on the authentication process","title":"Authentication Team are worst than my kids","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"Allison","text":"I have purchased 3 items from them and 2 of the 3 sellers cancelled the sale after l paid.\nI no longer bother buying off the site as it’s a headache, the money takes so long to be returned it’s ridiculous.\nUntrustworthy, what is the point listing items for sale with no intention of selling them.","title":"Untrustworthy","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"Shengtzu Nicole Yu","text":"I bought an item on Vestiaire, it was sent to you for the authentic control and then I made a mistake to send it to a pick up point in Italy. I contacted your customer services immediately, they all told me \"Once the item is back to the warehouse you can change the address and the delivery option by updating the address.\" I followed their instructions and surprisingly the item was sent to the pick up point again! (Btw I don't live in Italy so there's no way for me to pick the item up.)\n\nLater I contacted the support team, the girl who's in charge doesn't even read my email, always sending me something irreverent, however, we still kept in touch. Yesterday she informed me the item is back to the warehouse again, so I gave her the delivery information and I even emphasized that *Please help to select Direct Delivery to the providing address*. Guess what? The item is STILL sending to the location for pick up only.\n\nI made the order on January 3rd. It's been more than TWO MONTHS and they keep making the same mistake… I've wasted too much of my time and energy on this. And actually now I just want the refund and delete my vestiaire account, promise not to use and not to recommend it to anyone!","title":"Minus five stars","stars":1,"location":"TW","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"Taja","text":"My order hasn't been collected from the pick up shop for well over 2 weeks now, and I haven't received a refund. I have tried to get in touch with VC customer services a number of times (email, chat, Instagram), but it seems to be non existent. I would like to get my money back for the item that I never received. Very disappointed.","title":"No refund and impossible to reach customer services","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"Intrinsic Values","text":"Avoid - NO seller protection against scams \nListed a pair of new Yeezy Trainers purchased via Adidas Confirmed App, had a buyer purchase them so sent out same day, by raised an issue saying they had a dodgy smell (none of my other sold items had this)\nVestiaire allowed them a return, I get the tracking number only to have multiple missed delivery as wrong address from buyer but when called courier, they said item was damaged however no box or trainers as it was an open envelope so have been scammed. Vestiaire not taking seriously and 3 weeks later still no trainers or money (£410) \nSo if you want to return something just say it smells and send back back an envelope to a different address so as soon as it received Vestiaire triggers the refund.....nice one Vestiaire, I'm going back to ebay as they offer protection. Item 19613669","title":"Avoid - NO seller protection from Fraudulent buyers","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"N74","text":"Appalling service. Sent some brand new Sezane earrings still in original packaging which they claim were scratched. They were posted back to me 3 weeks ago with my hermes, but went missing in the post. I\"ve chased them 4 times and no one gets back. I have no earrings and no money. Very unprofessional customer care.\n\n**************************************\nI have not received any email about taking 30 days, all I have been told through contacting Vestiare on live chat is that someone will looks into it and get back to me within 3 days, which never happens.","title":"Out of pocket","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"Teri Anvid","text":"Sold a limited edition item via direct shipping, Sale reference #20487632 sale number #52483725 that was delivered but due to the shipping label Vestiaire provided (USPS) vs. FedEx vestiaire did not track the purchase and then canceled the item even after sending me a get ready for payment email.  USPS tracking 9261290274810820112605 delivered on 3\/1\/2022 Now the buyer has their money back and my item.  vestiaire said they will contact the buyer and then get back to me!  Completely unacceptable.  I have zero faith I will ever see my my payment.\n\nUpdate..I was guaranteed by the representative looking into my issue and was told I would receive a follow up from her regarding my payment within 24\/48 hours Of course that has not happened.  Vestiaire should have paid me immediately and then went after the person they returned their money to for my item.  I should not have to wait to be paid.  Nor, give Vestiaire any commission.  My chat transcript number is 96124735 the representatives name is Lady Ann A.\n\n\nNope.  I was told I still need to wait an additional 24 hours for the buyer to respond.  We both know that will not happen.  Vestiaire is responsible for immediate payment with no deduction for a commission.","title":"Sold a limited edition item, never was paid","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"Jana-Marie","text":"I sold BV bag more than 2000 euro a few days ago. The sales was cancelled by authentic team becouse  by their opinion was not matching with a rules.  So I was asked to pay 12 euro for transfering the item back to me. I did it. Still waiting for sending back! But in some reason was found the client who made purchase of the same peace of BV bag on 4\/2020 on their VC website. Of course we bought of us were contact VC teams about this serious situation. I can t understand how is possible to sell the  item which in almost 2 years ago padded authentitacion and now is not  authentic anymore. This needs a lot of explanations. Unfortunatelly it is not working at all. Still the answears  without any results.  Every day an explanation on the chats with somebody who doesn t know what is going on... Of course this  issue came to the loyar allready becouse this cannot happen never again to anybody. You pay a lot of money with a trust and then you find it as a fake. Hope they will resolve it clever and soon. This is absolutelly unaceptable situation. The wirst is nobody is not communicate with you from.their side to explain what is going on...","title":"I sold BV bag more than 2000 euro a des…","stars":1,"location":"CZ","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"Fiona Ringer","text":"I have been a seller on VC for many years,  as a seller your conduct is rewarded with Trusted Seller badges.  Why then does VC not uphold the same code of conduct for themselves?  I purchased a Lanvin Dress a month ago and received an empty box!  No dress, just the box!\nI immediately told VC and 16 generic emails later, I am non the wiser.  This is incredibly dishonest conduct, which other company takes payment and doesn’t refund immediately when the product isn’t delivered? The seller is also a ‘trusted’ seller so it must be an issue VC need to raise with Hermes, the courier. \n\nI would like my refund from VC, simple as that!","title":"I have been a seller on VC for many…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"Tom Clintworth","text":"Avoid Vestiaire if you can - there are much better reseller brand to buy from. The customer service is the worst i've ever experienced and they genuinely have no idea what they're doing. The company is run by cowboys.","title":"*AVOID!!! TERRIBLE CUSTOMER SERVICE*","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=13&stars=1&stars=2&stars=3"}]