[{"date":"2021-01-21","author":"ttp .n1","text":"i recently had to pay for my item to be shipped back because VC cant authenticate by themselfs and needs receipt for everything, even when i provided the receipt they still havent even look at it and my bag came in absolute disbelief!! bag for $16k came back all over the place, dustbags were completely smushed, strap for the bag just laying all over the place, wrapping paper totally wrinkled and the bag itself just laying there open on the smushed dustbags!!!! absolutely terrible dont recommend to shop or sell here!!!","title":"my item came back horrible!","stars":1,"location":"CZ","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-21","author":"Yasmin Dey","text":"Sent me the wrong size as advertised and somehow it passed authentication by the \"experts\".\nThe item took nearly a month to be delivered and upon opening they are not the described size. Advertised on their site as an IT 38, UK 6 but arrived as an EU 38, UK 5 as per the Louis Vuitton website. The seller also confirmed this in the comments. \n\nI have sent them back to be looked at again and hopefully Vestiaire do the right thing and give me a refund.","title":"Sent me the wrong size as advertised…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-21","author":"RS","text":"I am at the end with this site!\n\nThe quality control is a complete joke.\n\nI have had a brand new bag rejected as 'good condition' because there was a wipeable (transit created) mark on it and now had a mens large coat rejected as 'uniform' - I am a 5'5\" female.\n\nTerrible, terrible service.\n\nSorry VC, I have been loyal for over a decade but enough is enough","title":"I am at the end with this site!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-21","author":"kowsar Ali","text":"ON 2019 I bought a bag from Vestiaire, it arrived after couple days . I never suspected any , it was my first Louis Vuitton bag . Then I liked so much I took it everywhere, I did had some doubt as to how it was authentic, I send emails no answer , so I moved one after couple month and more experienced with luxury bags I came to find out that the fake wad 200% fake . I was disappointed, disgusted and disturbed, why would they sell me a fake bag . I couldn’t believe I took it to Louis Vuitton and they told me it was fake . I have tried to contact Vestiaire so many times . Until one of the lady at customer service after one year of chasing them to send the bag for second inspection, with no clear indication where to send it or how I tried after to find out how I can send it for them to check and maybe get my money bag . She never send me any links and no emails are being responded. How awful is that . Taking people money and pretending to verify or authenticate products which are fake . Now I am so hopeless and just feel like I got ripped off and then ignored. That’s what hurts the most . 7264281 Is my reference. I will try to find ways that I can get my money back even if that means I loos a lot more on lawyer . I’m upset","title":"ON 2019 I bought a bag from Vestiaire","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-21","author":"Catherine Kean","text":"I sold a pair of shoes on Vestaire and followed the instructions on how to ship, downloaded the waybill and went to the parcel locked to deliver the item. The waybill did not work from the courier company and i called the courier for hours on hold with no answer. I also went onto their website and the website wasn't working properly. Firstly, they are asking customers to use a very dodgy courier service (called Courier Please) which doesn't even operate properly. They are also one star on google.\nI then thought i would just use my own money to deliver the item so the buyer is able to receive it on time. I asked Vestaire over chat if they are able to compensate for the money i had to spend sending this item, even though they had charged the buyer for delivery, they said no.\nI gave up fighting that battle as i already spent 1.5hrs on Vestiare's chat box, so i then sent the item and the item tracking has confirmed the packaged now arrived with the customer. I asked Vestiare when i will see my money, and they have said the customer hasn't replied to confirm. So now I'm just waiting and waiting ... for all i know i will never see my money. I honestly am at a loss and just don't know what to do.\nThe customer service has been aweful, and adds more stress to your worries than help with anything. Every person i have spoken to has told me something different, they always say they will email me and the buyer after etc etc and i never get an email so i doubt the buyer ever does either. I've sent the link with the postage tracking to show them it has arrived yet they just won't give me my money.","title":"A very stressful process and i can't get my money for selling an item","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-21","author":"Suz","text":"If I could give this company 0 stars I would!\n\nI have used Vestiaire Collective a few times I’ve the years, all bar one of my transactions have gone particularly smoothly but were always resolved.\n\nHowever, my most recent experience has been just awful - resulting in me having to claim my money back from my bank.\n\nI purchased a handbag for a large amount of money back in early December using 3 month split payment option. I received the item no problems, but it wasn’t quite what I expected so had it returned.\n\nI waited 3 weeks (as this had happened over the Christmas period) and when I still had no refund or information on my account from\nVestiaire Collective I contacted them on their chat facility.\n\nI was told they had acknowledge the receipt of my retuned item and had authorised a refund on the 4th December (it was now the 5th). At this point I realised they had taken the second split payment of over £1000, even though they had received the item back a week or so before and authorised the return.\n\nThey apologised and told me my refund would hit my account within 5 working days. I can’t say I was surprised when it didn’t.\n\nI contacted Vestiaire Collective a second time round and explained I still hadn’t received my refund. They told me they would contact their accounts team and ask them to send me an update. This was on the 13th January.\n\nIt is now the 21st January and after a number of phone calls to my bank, I have been advised no refund has been issued by Vestiaire Collective. \n\nI have been trying to contact Vestiaire Collective since the 14th January (the last reply I received telling me they had no further updates, although by now I considered this issue to be a rather high priority) and have received nothing! Not even an acknowledgment of my email.\n\nTo say I am disappointed is an understatement. Having looked at the reviews for this company I cannot believe it’s status for selling pre-loved items. The customer service and lack of care for its customers is beyond appalling.\n\nI can only assume it was one less task for them to deal with when I advised they would be hearing from my bank if the money hadn’t hit my account by the 21st. \n\nThis won’t be the last review I leave for this company.\n\nDo yourself a favour and don’t use this company. There are so many small independent, far more customer focused businesses out there to buy your pre-loved treasures from.\n\nAvoid, avoid, avoid!!\n\nUpdate: Its amazing what a negative review does for a company to actually deal with an issue quickly! It materialised that the company DIDN’T issue the refund when they originally stated and it took me to leave a negative review on this site for them to take action - despite me sending a number of emails prior to this review. I would never use this company again!","title":"If I could give this company 0 stars I…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-22","author":"Lara","text":"Awful! Don't use them as they are pretty useless. Genuine items! as they know - handbag was fake and when it came to getting my refund the money was lost 3.5k gone missing. Daily chasing with a stupid response of it will be in your account at the end of the day lol - 3 weeks later still no money.","title":"Awful and 3.5k refund lost","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-22","author":"Dana Sumait","text":"I am completely appalled by the unprofessionalism of this company! After a month of messages between myself and a representative, it was agreed that the shoes I had purchased did not match the sellers description and the category that it was put on. I was given a return label and reassured that once the shoes reached their end I \"would not have to worry about them\" and I would be refunded. After the shoes arrived there, I sent another email just to check. ANOTHER representative apologised for the ordeal and assured me the refund would be reflected in my bank within 5 workings days. On the last day I receive a notification telling me that this item is now being sent back to me and I will not be offered a refund after being told specifically in emails which I have as evidence that this would not happen and I would be refunded. They told me this would be sent to the expert team, which it was not. It was just sent back. Completely unprofessional and illegal. I am not even surprised now after seeing all of these comments and I have no doubt about their validity. If anyone would like to see this evidence for themselves they are welcome to contact me. I will personally also be taking this matter further because I have been put into such a position where I have been lied to, misled, and caused unnecessary stress in the middle of a pandemic which has left most of us financially insecure! REF: 12458674\nUPDATED ON 25.1: I am still waiting to hear from your email. The representative who was handling my case was also Chin-Chin Paule.","title":"Completely unprofessional!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-22","author":"aoife ","text":"I am a long time fan and user of VC, have had thoroughly enjoyable experiences with it up until Brexit.\nI am in Ireland and shopping from other EU sellers - having unfortunately had to decide not to shop from UK sellers due to high fees for shipping and import duties HOWEVER it seems to me that someone in VC may have mistakenly included Ireland in the UK as I am now being charged Import Duty and Customs on everything I seek to buy from the EU. Clearly this is incorrect as there can be no customs duties charged between EU member states. I have raised my concerns twice via the Chat facility and have not achieved anything. it is a shame because I had moved over to doing the bulk of my clothes and accessory shopping on VC and I will no longer be doing so as I find it outrageous to be expected to pay 20% extra on everything because someone hasn't gotten their geography correct. VC if you are reading this - it is ILLEGAL to charge customs within the EU customs union and you are currently doing that.\n\nUPDATE: AS A REPLY TO YOUR COMMENTS BELOW..... IRELAND IS STILL IN THE EUROPEAN UNION AND THE CUSTOMS UNION, WE ARE NOT A PART OF THE UNITED KINGDOM, OR GREAT BRITAIN. WE ARE THE REPUBLIC OF IRELAND AND YOU ARE IN BREACH OF EUROPEAN CUSTOMS LAWS IN NOT RECOGNIZING IRELANS STATUS AS AN EU MEMBER STATE. IT IS SO EMBARRASSING THAT NO ONE IN THE ENTIRE VESTIARE ORGANISATION HAS A CLUE ABOUT THE MEMBER STATES OF THE EU OR THE SENSE TO INVESTIGATE WHAT I AM SAYING. IT WOULD TAKE UNDER 5 SECONDS RESEARCH TO CHECK IF IRELAND LEFT THE EU WITH BRITAIN. SPOILER: WE DID NOT. WE ARE A SEPARATE COUNTRY. NORTHERN IRELAND IS PART OF THE UK AND IS A DIFFERENT COUNTRY TO THE REPUBLIC OF IRELAND.","title":"Customs and Duty being charge EU-EU shoppers!","stars":3,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-22","author":"Dana Yousifi","text":"I ordered a necklace and the seller shipped it to them for authentication.. a day later I received an email that the necklace is not as described by the seller and they had to cancel my order. I didn’t mind that the necklace got canceled, but my concern was that the exchange rate and bank transfer fees which is a very high percentage will be deducted from me when they issue the refund. So i quickly emailed them and went on the online chat to tell them about the transfer\/exchange rates in order to avoid this problem before they send the money back. I went on an online chat with “Chin-Chin Paule“ and told her about the exchange rates, she said “i just talked to the experts, they said they will refund more than the amount you paid to avoid this exchange rate deduction”. Ofcourse I was sooo happy with what she said.... until a few hours later, I received a message from my bank notifying me that a refund of 4515 euros has been deposited and will be in my account within 48 hours! This means i cant see how much exactly in my local currency it is, but i can see that they refunded me exactly what i paid for, 4515 euros, not more, so Chin-Chin Paule literally lied and said they transferred more than what i paid to avoid this issue!!!! \n\nthe necklace is 4515 Euros, they took from my account 1,748 Kuwaiti dinars exactly, guess how much they refunded me? 1,641 Kuwaiti dinars! do you know how much euros 108 Kuwaiti Dinars is? According to the GlobeConvert app, its 295 EUROS \/\/ 356 USD!!!!!!! WHO IN EARTH IS OK WITH LOSING 356 USD ON SOMETHING THEY DIDNT EVEN CANCEL THEMSELVES!!!!\n\nUghhhh! So I quickly emailed Chin chin telling her that they refunded me exactly what i paid for, not more as she mentioned earlier! she said im sorry for the misinformation, but don’t worry ull receive exactly what you paid for... I couldn’t go on and explain that i wont be receiving what i paid, so i waited for my bank to officially deposit the money back in order to take screenshots of the amount that was debited and deposited & show the difference and the loss.\n\nThat’s exactly what i did, I emailed chinchin that there’s 108 KD less than what i paid & i sent every single evidence!! Guess what? She ignores, a day goes by, another day goes by, NO RESPONSE! \n\nI go back to the online chat and i talk to one man he was very kind but obviously unhelpful, I explained everything and he said I understand how frustrating it is & that he would feel the same way blah blah blah... he then says that he’ll notify MS CHINCHIN. I said okk thanks and i waited..\n\nAnother day goes by, NO RESPONSE! i go on the chat again, i talk to another person.. explain everything & they say chinchin is the one who is in charge, we will notify her. I told them she wont respond!! They tell me we will mark it as urgent and said a bunch of things to shut me up! i said i want my money back and they keep saying the same thing! I just ended another chat a few minutes ago with someone names joline! Il see if she can help me cause i just wrote her a paragraph with all caps!\n\nI don’t understand why they are not taking the responsibility of this!!!, when VESTIAIRE cancels my order for whatever reason, they are the ones who should be responsible for it!!! What do I, as a buyer and as a customer have anything to do with it??? The seller didn’t sell an item she described,, soooo??? Let her pay the price of that!! Not me!! \n\nWhat a scam website!!! Don’t order from them, ull just waste money like i did!\n\n\n\nEDIT:\n\nno they’re not looking into it, i keep contacting ur representatives, i kept emailing, still no response!! Nor refund!!","title":"Never order from them!! What a waste of money","stars":1,"location":"KW","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-23","author":"Roxanne McCormick","text":"I bought a prada re edition 2005 nylon bag recently. A day after I bought it I saw the seller had listed another bag using THE SAME pictures as the bag I purchased. I contacted Vestiaire collective immediately as I had concerns that I had now bought a fake bag but was assured it has passed it authenticity checks and the lady was probably just selling another bag (using the same pictures to sell another bag means to me this is false advertising anyway) anyway I waited for shipping and it since hasn’t moved in a few days so I feared it lost. I contacted and was told if I didn’t receive it the next day then I would be 100% entitled to request a refund. So today I contacted again and was told to refuse the item if it turned up and I would be given a refund... so I asked what if it doesn’t turn up how can I refuse something that doesn’t turn up to get a refund and was advised they would have to investigate with the carrier as they are experiencing delays so I said what is the time frame for this, upon investigation if nothing arrives how long do I have to wait until it’s investigated and a refund will be processed and was told that he has no idea to be honest.. I am absolutely shocked at how this company is allowed to trade and wish I saw these reviews before I purchased. Most transactions would be high value and they are taking peoples hard earned money how can this be legal I do not understand as people aren’t receiving items or refunds or payments for sales!!! I paid by credit card, does anyone know if there is an option to call my credit card provider to do a charge back on this as I refuse to pay for something I will never receive? People on chat are nice enough but it is obvious you are fobbed off and just told what you want to hear. I am so upset and annoyed at myself for buying from here!!","title":"Please do NOT buy from here","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-23","author":"US Resident Needs Help","text":"VC is incorrectly assessing customs fees for US residents.  I’ve spent past week+ (including today) attempting to pay for an item after the seller accepted my offer, but erroneous customs fees are continuously calculated for me during checkout process, despite the  fact that US residents don’t pay customs fees for garments under $800 from EU member countries. I’ve been a longtime customer of VC, but they currently seem incapable or unwilling to examine and solve this problem, thus resulting in my failure to buy the item and the seller is without the proceeds from a sale.\n\n I’ve emailed VC staff and used their very time consuming “chat” system, but all I get is boilerplate language and any subsequent messages sent are ignored. VC, would you please assign someone to assist me until the problem is resolved? Thank you.","title":"VC is incorrectly assessing customs fees for US residents…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-23","author":"MARIUS","text":"I have bought three products, new with tags. The products (with quality control included\/ paid) were all in horrible condition: one tshirt had the stains of the deodorant on the sides, as someone tried it; a coat was smelling and definitely needs professional cleaning; a second tshirt that supposed to be size S is with 12cm broader at sholders that any of the S tshirts I have (no is not the tshirt model to be large). I contacted VC for the second tshirt to be returned\/ refunded and of course this is not an option. I was suggested to list the product :)). VC, I am not on your website to do business, but as a consumer; I dont want to wait months for that tshirt to be sold; you claim that the EU legislation doesn’t apply as is an individual sale- but hey I bought this from you and you charged my credit card and made all the comms (so you are my seller). \n\nI now guess that all the products\/ sellers on your website are basically people that were scammed in your process:))) and trying now to get their money back.\n\nAnyway, promise you that i will get my money back!\n\nHorrible service!!!","title":"Scammers; Fake; Thieves","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-23","author":"Hannah","text":"I have sold 8 items on VC in the past 6 months. 2 items were shipped and delivered in November and December 2020. I have never received confirmation of receipt or payment for these items despite numerous chats and messages through the app and website. VC seems totally unable to cope with any queries or enquiries and today I’m owed over 100€ for items shipped and which VC has lost track of, after pocketing their commission of course.  To be avoided at all costs, unless you simply want to donate high value items to strangers and provide VC a commission in the process.","title":"Totally unresponsive","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-23","author":"gee lee","text":"Terrible communications due to different customer service personnel dealing with  your case providing mixed messages. This has caused wasting so much time explaining the same thing yet resulted wasting more time having to repurchase all my items because they have a policy not to return the item you have purchased in the first place.\n\nVery inefficient process and communication.\n\nBe careful when you purchase direct shipping item as fake items are sold through this platform and when returning items to VC for the authentication check. The company does not send your item back and they may not tell you about this even after sending 10 messages of the same to VC that you wish to have your items back if the items are authentic. I was informed of this policy after my items were relisted. Now I have to repurchase items with taxes. What a waste of time! I really don't understand why they would not tell me this earlier one in out correspondences.\nThe customer support Matt L was very blunt and clearly did not care or willing to help! Please train your staff with the commissions you receive from us to communicate efficient and consistent policies and procedures.","title":"Terrible communications due to…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-24","author":"David Henk","text":"I see the comments now and i totally agree, i have problems without selling anything, they don’t have experts to validate things. They need from me a label that in the Avenue Loewe leather bags; and that type doesn’t have one. Imagine what if i sell or buy something, omg. Seriously i will photograph everything before the process, Because i do not believe in them, for all this things that i read.","title":"Disappointed from the begging, totally","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-24","author":"kel","text":"My item keeps being rejected because \"the image qualities are maybe too high\"— exact wording by the CS. They give no reasons when the listing is not as they want. The CS just keeps copying and pasting the same default answer, saying the same things over and over. Why don't you just give clear instructions instead of generic unhelpful message?","title":"My item keeps being rejected for no reasons.","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-24","author":"Twice","text":"My item listing on my profile was marked as “sold” on the 23 Jan 2021. However, on the backend, i did not receive the usual “congratulations, your item is sold” and further instructions to prepare it for shipping. In fact, it is under “my items” as still for sale. \n\nI contacted Justine from customer service first on the 23 Jan 2021 when i first found my listing page marked as sold. I was told it was the system that has yet to update my account, and I should receive details of the sales within 24 hours. \n\nMore than 24 hours went by and nothing has changed.\n\nI reached out to a Chin-Chin Paule, and like other reviews I have seen on her, I did not have a good experience. \n\nI provided her with all relevant details required. The buyer’s user id (@julie) the listing id, previous transcript I had with customer service.\n\nI reached out to to customer service to ascertain one of two scenarios: \n\nAs it can only be two simple possibilities,\n1. Is it sold? If so, can the system be rectified so that I can prepare the item and have it shipped. \n2. Is it NOT sold? If so, have the listing rectified to show that it is on sale for others to purchase.\n\nHowever she was not able to give me an answer and advised me to basically do her job. \n\nShe questioned me to confirm if the buyer has bought the item. [As a platform user and not a backend admin, how am i to ascertain this?]\n\nShe further questions me to confirm this with the buyer and to communicate with the buyer directly. \n\n(by the way my buyer-seller chat is banned, i asked her to have it unbanned then - which she avoided to answer)\n\nShe wasnt able to answer which of the 2 possible scenarios was true, NEITHER was she willing to any leg work. \n\nShe proceed to instruct me to communicate with the buyer via the COMMENTS section on my listing. To confirm her purchase for them to either proceed with having my listing back on sale or for the confirmation deal email and process to appear. \n\nI shouldnt be investigating and trying to resolve this. Else I think Vestiaire can pay me her salary. It shouldn’t be a hard issue to solve to be able to check backend IF IT IS INDEED SOLD OR NOT. \n\nThere is a reason why vestiaire is a PLATFORM and acting as third party intermediary and charging a fee of 25%~ to profit. \n\nUtterly disappointed, and especially so with chin chin paule.","title":"Unable to confirm with me if my item has been sold or not - Horrible service from Customer Service Officer (Chin chin Paule)","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-24","author":"geronimo","text":"I purcahsed 2 items today and was all stoked about the services, even when the promo code didn't work, I went ahead, thinking that customer service will fix it later on, to my surprise they didn't. The promo code said: a 20€ discount on your first purchase over 150€. Maybe my English is poor or theirs, you can choose, but to me it says exactly what it says, the first purchase that goes over 150€ I get 20€ off. The conversation with the customer service rep was not helpful, rather annoying and passive aggressive.To my surprise they are right and I'm wrong, that's life, it is very well possible that they have it written somewhere in small print or maybe I'm not well enough aquatinted in today's promo code jargon to be able to spot the true meaning of the wording or my English is just lacking of the finesse to spot the proper meaning. Regardless it saddens me to say, but today I was a promoter of the app and going to rave about it to all my friends, 4 hours later I'm a detractor and everytime a person will ask about my cool new jackets, I will rant about the poor experience I had buying them. Was it really worth it Vestiaire? Had to ask, but based on your CS rep probably it won't.","title":"Poor customer experience :(","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"},{"date":"2021-01-25","author":"SY","text":"Second review, posting 4 years later.\n\nPure pot luck what service you get with VC, whether as a buyer or seller. Its either bad or good, never an inbetween. This review is for an outdated shipping system requires you to print a label, unlike most UK retailers which don't require you to print your own label. This means if you don't have access to a printer you cannot post your item.\n\nWe are currently in a nationwide lockdown, the library is closed and I don't have access to a printer. I contacted VC for assistance and was given two solutions, go to a friends house to have it printed (unfortunately no one I know has a printer at home, but the agent didn't seem to understand the rules of a lockdown), or to ask someone I know overseas to print the shipping label and send it to me. Should have agents based in UK to understand the current situation.\n\nFortunately, although the agent wasn't able to assist, at least she was polite and responded quickly. In previous chats I have wait 15 minutes for a response which didn't even answer my query.","title":"Operations outdated - pure gamble if you get good\/bad service","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=78&stars=1&stars=2&stars=3"}]