[{"date":"2022-04-23","author":"Tania","text":"I have had two articles - which I know to be genuine with id marks etc - only to have the \"experts\" say they are not original with no evidence to back them up.\nDelisting all my articles for sale and going to a more reliable option\nBuyers beware as their authentication process could be similarly flawed","title":"Poor authentification","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Emilia","text":"I've had a nightmare with a bag I ordered from Vestiaire Collective. I initially ordered it on the 2nd of March and the seller sent it in a day late, which automatically cancelled the order. I was still interested so after the item was finally re-listed (customer support sent me multiple faulty links before I was able to see it listed again), I bought the item again on the 31st of March.\n\nSince then, I've contacted customer support several times to receive an update on my order, as it's not progressed since ordering it again at the end of March. Most conversations via chat were deferred to email but then never followed up on. I've never experienced such terrible service and there's no one to speak to to resolve it.\n\nThe seller has also confirmed over the Vestiaire chat that they sent the item in and the item is held at a Vestiaire Warehouse and that they are also not receiving any updates on its whereabouts almost 4 weeks later.","title":"Order nightmare","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Weronika Oszajca","text":"Unfortunately, I am forced to add this rating, despite the fact that I have been selling regularly on Vestiaire Collective since 2020, I have several hundred transactions behind me and I am satisfied with the vast majority of them. Despite the described situation, I still use this app and I generally like it, but this situation is bothering me, so I go as far as possible to finally solve it. I hope this is some kind of misunderstanding. Unfortunately, there has been a certain situation in which I am forced to react in this way, because despite numerous e-mails sent to Vestiaire Collective, I have not received a reply to any of them. In January, I sold two vintage Dior tops that I believe were genuine. However, people verifying their authenticity found that they were not able to confirm it, which I understand and wanted my items back. For this purpose, I made two transfers for the amount of EUR 12, with the reference numbers of these items in the title. The transfers were made on February 12, until today I have not received parcels with the return of my items. These were items worth a total of $ 473 (this is the amount I was supposed to get for the items sold). Since then, I have sent several e-mails to VC by Send a request, from my own experience I know that in case of more serious problems it is better to contact VC directly via the e-mail address. I wanted to know what was happening with these shipments, but received no reply and my belongings never returned to me. I am very sad and disappointed with this behavior, especially with regard to the regular user of the portal. I hope that thanks to this post someone will pay attention to my problem and it will be solved, the amount I mention is significant for me and I would like to get this money or my items back.","title":"Never received my items back","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":" Viki Jones","text":"I ordered a designer item which never arrived.\n\nThe tracking was stuck on \"sent to Vestiaire\" so after two weeks I contacted Vestiaire via webchat. They said they will need to open an investigation which will take a further 15 - 30 days. They then said I have to write a handwritten statement confirming that I, my neighbours or any member of my family have received the item. I then have to give all my details, a copy of my ID and an invoice.\n\nI don't see why I have to do all this when Vestiaire lost my item!! I want a refund or the item sending. I asked the webchat if somebody would call me and the person on the other end \"Jack\" said he would. I gave him my number. He asked could he help me with anything else, so I said yes, ring me. He said he would. Still waiting for a call - it hasn't come!\n\nSomeone from Vestiaire needs to contact me ASAP.","title":"I ordered a designer item which never…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Sari","text":"The parcel is lost and Vestiaire does nothing to resolve the issue. The parcel is ”delivered” in their system (erroneously) and the case is closed from their side. However, the ups system reliably shows that it is not delivered. Explanation by Vestiaire is that their system shows that it is delivered and that`s it.\n\nI have sent many emails and chatted but they cannot resolve the issue even if it is their responsibility. (The seller has been helpful and IF the parcel will return to him, he will possibly send it to me). Because the case is closed in Vestiaire system he has received the money.\n\nLuckily this item was only 80+ euros (800 SEK) and the damage isn’t that big. I would avoid buying more expensive things because there is an obvious risk with their processes.","title":"Lost parcel and lost money","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Kate","text":"Never have I ever encountered such incompetent customer service. They cancelled an order that didn’t even include a promotional code, and then when I went to make a new order I got an error message that I can only use the promotional code on a first order. Since they cancelled my first order, this was going to be my first order. Customer service took a week to respond to my , and when they did, all they said was that I had already made an order (which again, they had cancelled and it never had a promo code on it). In short I’ve decided to only use Fashionphile or buy new goods directly from trusted stores. This experience combined with how many counterfeit goods are being sold on Vestiaire makes me confident it’s best to stay away from them.","title":"Poor customer service and counterfeit goods","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"email addy","text":"The fact there is no acknowledgement to VC errors or complaints tells you all you need to know about how Sellers are treated( see 5 other reviews 30 combines email, chats not any responses “Super”\nNear 2 weeks of asking for account to be reactivates after I deactivated due to the errors, unbelievable seller experience when they make mistakes!!!","title":"The fact there is no acknowledgement to…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"DIANA ","text":"2 weeks for the buyer to receive a Chronopost. I hate direct shipping","title":"2 weeks for the buyer to receive a…","stars":3,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Kate Evans","text":"44 days and counting.... No refund, no contact, ..... no surprise.\nI notice the one star ratings are climbing..... I wonder why.......NOT","title":"44 days and counting...","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Grace Nielsen","text":"Extra and no visible currency exchange.\nI bought a lot of items and I realized that they are thieves.\nThey charge you a terribly high amount in currency exchange if you payment is not in EUR. \nan item that costs 270 EUR they will charge you 30 EUR more without informing you or giving you any explanation about the case, Note: this 30 EUR does not include shipping or authentication payment, this will come later at the final payment. \nI contacted them and the answer was that they cannot do nothing about it, it is the the financial department the responsible for this fees.-  PLEASE.. of course you know!… The bad thing about it is that this information does not appear in the FAQ. totally illegal.","title":"Extra and no visible currency exchange.","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Chiara Ceci Glynn","text":"VC is a company with an incompetent costumer service. The representatives have a script and do not address questions effectively and efficiently. \nThe company do not have in place a secure payment system as claimed from their website. In fact they ask you to make a direct wire transfer to a French bank.\nI can’t believed that such a large on line platform can’t figure it out a system to pay via their web site or PayPal.\nThe costumer service couldn’t provide the current address requested from my bank to make a safe transaction. I had to have many email exchange and than talk to someone else to simply have an address to link to that  bank account.\n\nA very bed experience that will lead to me to cancel my account.\n\nAVOID to BUY from them, they can’t solve issue when they occur!","title":"A company that ask you to complite your transaction via direct wire transfer! Ridiculous!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Ruth M","text":"Very good to buy from, but customer services are terrible with the sellers, they never listen to what they have to say, never answers any questions in a right away.","title":"Very good to buy from","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Mrs","text":"LOL when they have to write fake reviews you know service is BAD believe the bad reviews had a terrible service and will continue to tell the TRUTH about my poor experience","title":"LOL when they have to write fake…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Fanny Ann","text":"BLOCK SELLERS ACCOUNTS FOR ABSOLUTELY  NO REASON , WHILST NOT PAYING THEM AND HAVING THERE ITEMS THEN REFUSE TO COMMUNICATE, VERY DODGEY. THEY DINT RESPONSE TO COMPLAINTS AND BY REVIEWS TREAT SELLERS DISGUSTINGLY.","title":"BLOCK SELLERS ACCOUNTS FOR ABSOLUTELY …","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Kate Evans","text":"45 days and counting. So we can be clear Vestiaire have no problem with their sellers sending a high value item to a buyer 45 days ago, the item going ‘missing’ and the seller being completely ignored whilst Vestiaire  hang onto the money….. These are the sellers that they make their money from…..","title":"45 days and counting","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"eva zhang","text":"Vestiaire where is my payment??! I’m a seller and have sold a pair of sunglasses 4 months ago. The item was apparently rejected by the buyer and sent back to Vestiaire collective to authenticate. I’ve received a message from the team to tell me it’s passed authentication stage but I have never received my payment! This is daylight robbery! I have written to complain several times and have never heard back from them. Hugely disappointing. I will never sell another item on this platform again!","title":"Vestiaire where is my payment??","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Lisa Ames","text":"Vestiaire canceled a purchase I made without my consent. I understood the item was not brand new and in used condition. Without consulting me , Vestiaire went ahead and canceled my order. Unacceptable. They also told the seller that they had contacted me to see what I wanted to do which was untrue. So disappointing","title":"Cancels without buyers consent …","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Thomas odum","text":"Vestiairecollective.com has had my shoes for over a month. This is theft as far as I'm concerned.","title":"Theft!!!! None returned items","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Arman Lahijani","text":"Really shady company. I keep trying to purchase this one pair of shoes and Vestiaire kept canceling my order but wouldn’t tell me why. The worst part is I really want these shoes and there is no other way to get to them.","title":"Really shady company","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Ashley Gregory","text":"I’ve never bought anything from there that wasn’t a complete disappointment.  Most things don’t get shipped and cancelled after 2 weeks, the things that do turn up have been damaged so badly I’m not sure how their “quality control” missed it.  Holes in dresses, and now an ink stain on the outside of a leather bag that was conveniently cropped out of all the photos.  It’s taken me far too many orders to properly learn my lesson but I’m finally deleting the app.  A really nice website makes them seem reputable, but they are far from it.  AVOID.","title":"Avoid at all cost","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=4&stars=1&stars=2&stars=3"}]