[{"date":"2021-12-07","author":"Luke M","text":"Order: 18013766\nAfter purchasing item from UK seller and selecting additional verification check option. Item was then shipped to verification centre in France - passed and then was delayed being shipped.\nAfter speaking to customer services over live chat lots, received notification from DHL courier to pay a further £45 in customs charges to release item!\n\nThis should have been included and for paying extra is a shocking service. Very disappointed as what turned out to be a good price for my item become really expensive!\n\nI would like a refund for this customs fee as this was not made clear at all whilst ordering.","title":"Order","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-07","author":"Emma","text":"I’m very disappointed with my experience as seller on Vestiaire Collective. The item I sold has been delivered and accepted and I have been waiting for my payment for more than 2 weeks. I have been in contact with customer service several times, but nothing happens. Since the 23rd of November I have been told that the payment is scheduled and “will be processed on the 23rd of November or the following day”. Today it’s the 8th of December and I still haven’t received my payment. I wouldn’t recommend this site to anyone who wants to sell items.","title":"Didn’t get my payment","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-07","author":"Tania Chilin","text":"Most of the sellers on the website are not legit. \n\nI've purchased several times from them, simply because they were selling items that were no longer available elsewhere. I would say about 2 in 5 orders are not fulfilled, because VC does not vet the sellers in any way, they do not weed out bad sellers even after customers submit complaints; I've had 5 orders that ended up being cancelled by the sellers (12213693, 16298391, 18477332, 14089082 and most probably item 12067402 will be cancelled, since I sent the seller four messages and got ghosted), for various reasons (either the seller simply ignored me until the time to ship the item had expired, or they said the item was no longer available although the listing was still active on the website). \n\nI've had absolutely no support from VC in these cases, they simply shrug and tell me I will eventually get refunded. The refund takes quite some time to process, and because they charge in Euros I lose some money with each transaction back and forth (my bank refunds me a lower amount than what VC charges). Their customer support team are absolutely useless, so do not even bother getting in touch with them. They copy and paste some standard replies, sometimes completely irrelevant to your question or complaint. I've never even gotten so much as a lousy 10 Euros voucher for all the fees I lost in these transactions.\n\nI plan on submitting a formal complaint to the customer protection authorities because it is getting absolutely ridiculous. I would strongly advise anyone reading this  to stay away from this website, it's a gamble if your order will get fulfilled or not, or what sort of items you'll get. Not worth it.\n\nUPDATE: Of course I never got item 12067402, no reason provided. All these sellers that do not fulfil orders are still active on the platform, absolutely no sanction applied. Just don't bother ordering from here.","title":"Horrible customer service","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-08","author":"Zenja Stanic","text":"Warning!!!! I bought a pair of boots that seem colored and I do not understand how it could go through their control, not a word about it from Vestiaire. They promise control but really do nothing, a false security that only they profit from. You should be ashamed!!!","title":"Warning!!!","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-09","author":"Sk","text":"Ref: 17416142\n\nNot my first attempt to resolve this. I purchased the item, it was shipped to Vestiaire for authentication, but the item has “a lot of damages” and VESTIAIRE’S AUTHENTICATION STAFF DID NOTHING. The chain on the bag is broken and the suede leather is damaged with stains. I don’t known how you can break a heavy chain from a YSL bag and don’t notice it. I couldn’t return the bag, I don’t know why and Vc don’t help me either. I have requested Vestiaire for the refund of 200 euro for the parts and labor cost to fix and clean the leather, that I can wear it. Vestiaire did not approve any of my ä  request about it and didn’t make things right. I am really dissapointed at this point and out of money VC made me pay extra.\n\nAnswer: however thank you for the reply. It’s not really true. I waited from abreply by a customer service member and never got one. So i didn’t send the bag back, I wanted to have it but it was not the described condition.","title":"Received damage Bag \/ no response","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-09","author":"Wendy Paige","text":"A buyer could not buy my item and Vestiaire were citing import issues - that sunglasses could not be imported into Australia. The buyer was in Australia and I am in Australia so there was no import required. Trying to communicate this with their non-existent customer service chatbot was useless. You cannot chat to a real person and you get automated answers that aren’t even related to the issue. It’s pointless.\nI sold this item on eBay so Vestiaire ended up losing the sale because of their crap platform. \nI don’t find any of the luxury sites good and Vestiaire is definitely no stand out.\nDon’t bother. 👎\n…. You can see by their reply to me (below) they do not understand what I’m saying - that there is no import required. We both live in the same country. This is the type of useless response you get from them, constantly.","title":"THE worst platform and service","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-09","author":"Kate","text":"Vestiaire wrongly cancelled my purchase order 19716664 and stated that the item was non-complaint because it was deemed by their “expert team” as “VIP gift prohibited for sale”. \n\nVestiaire Collective team made a mistake. \n\nThis item was for sale in Chanel boutiques worldwide in 2004 and was subsequently also found in the Chanel Woodbury Commons Outlet in New York. I can even provide the exact tag code with model number. Vestiaire expert team, if you are not familiar or experienced enough to authenticate it a Chanel Minaudière, I am happy to share with you how to authenticate this particular vintage item. It is extremely disappointing that you just cancelled the order due to a misjudgement. Based on the seller photos there was no issue at all, the item is Authentic AND compliant. \n\nNormally if an item does not match the description during quality control, they will first ask if the customer will accept it. In this case the sale of this rare vintage Chanel item was cancelled instantly quoting a rubbish untrue reason, this really make me doubt the team’s intention and professionalism.\n\nThey have charged my credit card and I requested for the customer service to proceed with the sale and I will accept the item. \n\nAll I got was generic response from chat assistants saying “noted”, they will inform the “expert” team while also claiming to have returned the item to the seller?\n\nI spent so many years finding this item yet when I finally found it from a lovely seller, you blocked the sale after taking my money? I subscribed to premium membership just to purchase this item without missing it. Please resolve it and ship the item soon!! \n\nI am still hopefully this can be rectified at the soonest and I will receive it. THANK YOU! 🙏🏻","title":"Cancelled my Order due to their mistake in product assessment!","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-09","author":"Jayte","text":"Re: the response from VC - I contacted them no less than 4 times regarding this issue, with no response. Had I received a private response, offering flexibility, this review wouldn't have been necessary.\n\nI'm an expert seller on VC (or was, rather) and have just sold another item. Unfortunately, due to a family emergency\/caring responsibilities, I won't be able leave my home for some weeks - hence I cannot utilise the HERMES *drop off* label. I can't help but notice that whilst VC has started to use \"bargain\" postal services, fees haven't been reduced commensurately. \n\nAfter much ado I finally got through to CS and kindly requested a collection (which they have the ability to arrange via either DHL or UPS) and I was advised \"no but you can do that at your own expense\". Really?! On top of the fees already applicable?! Appalling response in the circumstances (and I did describe the circumstances in full to CS). \n\nFurther, VC was, strangely enough, able to arrange alternative couriers during lockdown - because it suited them to do so. \n\nUnyielding, unhelpful yet sellers pay a whacking premium for this level of \"service\". \n\nAfter days of holding for a response, I've had no choice other than to cancel the sale -consequently the buyer will be disappointed and I will lose my expert seller status.\n\nI've now deactivated all my listings for the foreseeable future.","title":"Have deactivated listings due to consistently poor service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-09","author":"Alexandra Chivikova","text":"Totally unacceptable. \n\nBad quality platform, had to navigate inside. \n\nI sold a brand-new item with a an original TAG from the store that was ranked “as not authentic“ by their Quality Team which totally unacceptable since the item presented a tag. After long email communication with no clear reasoning i had to pay 12£ to ship my item back. So i even lost money on top of losing time, effort in selling. Avoid this app, go Vinted !","title":"Totally unacceptable","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-09","author":"Sorin","text":"Worst experience ever. I wanted to post a pair of Orginal Versace high trainers and after days they tell me that cannot confirm the authenticity of the product in the pictures and got refused. They could not justify their decision. I find the approach completely unprofessional. Trying to clarify over chat with them had no success either. How are they doing business when the customer is so badly handled?","title":"Worst experience ever","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-10","author":"Tony leaman","text":"Purchased a jacket in late October.  After having it authenticated I waited and waited for notification that it had been sent.  Took over two weeks for it to finally be sent.  All the automated chats told me it was waiting …\nbut not the reason why it had not been sent out.  Eventually I received it only to find a problem with the zip.  Vestiaire tell me to return it and they will “examine”  it, but I do not trust this company.  Will not buy from them again.  I have learnt my lesson.","title":"Not Happy","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-10","author":"Rébecca S-n","text":"Shambolic. I’m a seller and recently had a sale. My buyer is based in France and I was told to send directly to them. However the Vestiaire collective website itself says that since brexit, direct buying isn’t available from Uk and France and vice versa. It says that all items have to go through the authentification centre. I’m worried that my parcel will be stuck at customs because the label I was given doesn’t mention the value of the item and therefore there is no way customs would know how much tax needs to be paid. I’m not sure the buyer is aware they might have to pay tax. Tried to speak to the customer service and no one was able to help or even understand the question. If you want to be a premium service you need to invest urgently into your customer service. In addition as this is my first sale I’m supposed to benefit from the free commission offer on first item sold, however it shows as if I will be charged a commission. Again no one was able to help, this is such a poor customer service (I’m assuming it’s the same for buyers). Compared to other platforms such as Vinted it’s quite shocking.","title":"Shambolic!!! Useless customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-10","author":"Jade Bicks","text":"I am extremely sad to have to write this as I am both a buyer and a seller on Vestiaire and have not experienced an issue up until now. I am getting absolutely nowhere with support having spoken over 10 times to multiple colleagues and receiving no further information over the last 10 days.\nI have a current outstanding Order Ref #17080621, of a Chanel bag. There have been multiple issues with the purchase - Firstly the seller was refused collection due to Vestiaire having not provided the correct sales information for expedition out of the UK to Vestiaire authentication warehouse. This took 4 days to rectify and ended up with the seller and I having to bombard them to sort the issue. When the carrier eventually accepted, they then were further delayed and vestiaire had to be in contact again to get it processed to leave the UK.\nOnce it was finally delivered to Vestiaire, I received multiple notifications one on 03\/12 saying it was in authentication, Another on 06\/12 stating it was again back in authentication. I contacted to try & understand why It was going back through authentication. I did not receive any feedback on this, just that they would raise with the \"relevant team\". The following day 07\/12 it was deemed compliant and I was told it would be shipped that day and they were sorry for the inconvenience. Here I am today... still the item has not been shipped. I have contacted multiple times via their appalling chat service and was told I would receive a call about an issue. No Call and have provided multiple numbers for their contact. I am being told nothing more than they do not know why it's not been shipped.\nThe item was a gift and you have a process time of 14 days from seller sending to buyer receiving and I'm at 15 days since purchase with nothing having been shipped. The item is a gift and therefor I would really appreciate this being looked at. \nAt current I cannot provide positive feedback as I am still waiting and no updates. I would not look to buy again through them after this experience.\n\n- Vestiaire please feel free to reach out to me on this to rectify and ensure my parcel is sent out. I appreciate you're busy but I purchased this in November and I really would like the item.\n\nUPDATE: So I finally heard back of Vestiaire with a tracking number on Friday and my order was dispatched. Sadly recieved today and the item was missing from the parcel. The parcel has been opened on the underneath and I have been left with a box of tissues and some metal screws in replacement of what is meant to be a Chanel bag. I am utterly horrified at the whole situation and that now I have had to re-engage with Vestiaire to get this sorted and try and get my money back. I have an open investigation with them and the courier… so will update when this has been completed. I am sad and so angry, but cannot make any further remark on Vestiaire until the investigation into the stolen item has been completed and hopefully they refund my money :(\n\nFURTHER UPDATE 30 days later:\nStill no resolution from Vestiaire on my missing bag. It’s now been 7 weeks since I ordered and a month since the parcel was delivered damaged. I keep being told investigation is ongoing but they originally advised 7-15 days for resolution with the carrier. It’s been 30 and I’m still nowhere near. I have opened up a dispute with my credit card due to them not providing a resolution and will continue through that to try and get my money back. I have used direct shipping through them since without issue but I definitely will NOT be purchasing anything over £1000 with them again, that has to be shipped through their French authentication centre. I also will not be selling anything I am unable to direct send. \nTruly horrendous to deal with and I wish I could give 0 stars.","title":"I am extremely sad to have to write…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-10","author":"Connie Elle Fraley","text":"It’s always one step forward, two steps backwards with VC customer service. I’m an “expert seller” and originally thought they were improving but no. The customer service is just as frustratingly incompetent as ever. The endless stress from VC is relentless.","title":"It’s always one step forward","stars":2,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-10","author":"Anya","text":"It's not my first review of Vestiaire. I've always tried to find something positive about them,but recently they've become simply horrible. Their commission increased again. Technical problems are many and seemingly never ending. Authentication process can be a joke if an obvious fake is accepted and sold via concierge service. But the final straw for me is the removal without any warning of my items. Now second item has been removed and nothing can be done about it. Just for fun, I assume. Their solution? Oh, sorry, list it again. All the pictures, styling the item, putting it on, then all the steps to list it - again?? So that it gets removed again? \nReally, all potential sellers and buyers, it's not worth it. Read the reviews before you're tempted to buy from that platform. Remember that good experience is almost 100% thanks to individual sellers and buyers, NOT in any way to customer service or organization or capabilities of the people behind Vestiare. So many bad reviews are not a coincidence so buy or sell with them at your own risk. In my opinion, not worth it.","title":"Simply terrible","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-10","author":"MW","text":"Buyer cancelled the sale (ref. 17230918) so I opted to have my item re-listed and kept at the VC warehouse in NY for convenience (I even have proof of this decision). We are now in the middle of re-negotiating another price. However, after three days with no update on the renewal of the listing, I contacted chat support, only to find out today that they had initiated a return and that my bag is being shipped back to me. I did not give them permission to send it back to me, nor did I receive a single email or update stating they initiated a return. I believe the buyer is also unaware of this. I do not want the bag back; I am trying to sell it. Because the value of the bag is quite high, I am worried now about the customs and brokerage fees on MY bag, which I heard VC does not pay for, and I will potentially lose this sale because of VC’s mistake. Another issue has also surfaced, however: the tracking number has stopped updating since 4 days ago, and VC has not been able to explain to me why. Where is my bag now? Your chat support is unhelpful and the employees promise me with emails that they NEVER send. \"Cherry-Anne C.\", the agent who promised to update me, takes 2-3 days to get back to me with the same, generic response. Is there any REAL way you guys can solve this baffling situation? You misled me, and this whole time, made me believe my bag was with you. Instead, you made a horrible mistake. I've already posted to BBB and will be posting to another site soon. Please fix your mistakes before I decide to contact a lawyer for possible options regarding financial fraud, dishonest business practices and misleading information. This is completely unbelievable and unacceptable.\n\nUpdate: situation has been resolved.","title":"VC, please solve your mistake!","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-11","author":"Arthur Thomas","text":"Do not buy from here. They cancelled and ‘refunded’ my order but it has been two weeks and still have not received my money. They are impossible to contact and chase up, have to wait a few more days then will have to open a retail dispute with my bank and hopefully I get my money back. Do not buy from here- pretty sure they scam you but if they don’t they are just the slowest, trickiest retailer I’ve ever experienced.\n\nReceived my reply and spoke to the customer care the response is that they couldn’t help me and I will receive an email within 24 hours from their ‘expert’ team. This is a complete joke I’m genuinely not sure if this is the worst customer service ever or I have been scammed this is the most frustrating thing I’ve ever experienced, hoping I get my money back will have to open a retailer dispute. Please do not order from here","title":"Do not buy from here","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-11","author":"Praz K","text":"One word- Rubbish!\nRubbish Website, Rubbish Customer Service. Website's filters don't work. Go back to the listing and it will take you right back to the first page. Select the filter again and again and again and again and again..... Customer service is useless and also mindless. Ask anything, response you'll get is that \"CEO is looking into it\"","title":"One word- Rubbish!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-11","author":"Hristina","text":"Hereby is one of my last attempts to get Vestiare Collective's attention and get the competent help. Being an active buyer and a seller for over an year, I rarely had any serious issues with the platform. However, a month ago two of my parcels I have sold and shipped (worth 1300 EUR including a Gucci bag and fox fur)  have gone missing, which I reported immediately after I saw the DHL tracking codes show no movement for few days. \nSince then I have reached VC numerous times in trying to figure what is the procedure in those case scenario. Their  customer support even though appearing helpful and concerned did over and over again over the course of 3 weeks, asked me for the same information as my scanned ID and proofs of delivery to \"initiate\" investigation. \nI have also been in contact with DHL which actually were way more responsive and let me know that the items that went missing are officially declared dissapeared and VC should handle the insurance and reimbursement process.\nIn the meantime, I am still waiting for them to respond to emails over 2 week old. \nFor the record, I have not  sold those items on incredible low prices, because I hated them or could not store them for lack of space - lets face it - I needed the money and I wanted them fast. Now I am left with empty hands and not even a single clue how this will develop in time, because they failed to pass me any bit of useful information.\nFor a company that makes most of its profit on selling and handling fees , your business model relies on people's trust for letting you handle their possessions.\nIf I had a Birkin for sale I would think twice before selling it there.","title":"Customer Support - Wake up call","stars":2,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"},{"date":"2021-12-12","author":"Connie Elle Fraley","text":"In an effort to expose all the lazy incompetent customer service agents, I will start to post their handles ( names) and I encourage all of you to do the same. The first one up is “Harjay Y” \n\nFirst of all, I am an expert seller and buyer who has a 100% accuracy rate. Yet, I must go through a tedious and often arduous process to post an item. Normally it’s harmless, I just give invoice information or provide additional photos. But not this time, “Harjay Y” refused to help me, instead citing the same lazy scripts that they have and when we finally agreed to have me send additional photos, ( after I told him I just needed 1 minute to take the photos), he completely changed his tune then eventually ended the conversation, ( of course doing it so fast as to avoid a negative review). I’m so tired of these lazy and often clueless customer service agents!","title":"In an effort to expose all the lazy…","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=30&stars=1&stars=2&stars=3"}]