[{"date":"2021-02-06","author":"boutique_lv fashion","text":"Awfull !!!\n\nI Have sent an item Max Mara coat , more than week ago , and been told 100 different information about its passed already authentication but needs to past quality , the day later another one about its passed quality but need to pass authentication! \nThen 3 days they told everything is good they are packing it ! At the end yesterday I get info it didnt passed ! Because of logo and and etc ! \nBut I know everything about my coat ! And its 100% authentic! \n\n\nAnother thing is SOLD ITEMS AND PAYMENTS 🤬\n\nI HAVE SOLD 2 items with DIRECT SHIPPING !\nREF \n13671506\n13682743 \n\nBuyers received items on 16th FEBRUARY AND THEY ALREADY CONTACTED ME THAT THEY HAPPY WITH ITEM ! \nOn 19th after their 72 hours left they “sent me money” \nBut nothing received yet ! They always promised to do something about it but nothing at the end ! \nAsk 100 different info and telling that they will contact their EXPERT TEAM , AND NO ONE GET YOU BACK EVER !!!!! \nIM WAITING FOR MY MONEY ! \nAnd I KNOW WHERE DO YOU LOCATED ! IF YOU WANT SOME TROUBLE I CAN MAKE SOME FOR YOU !","title":"Awfull !!! STAY AWAY !","stars":1,"location":"LV","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-06","author":"Sophie","text":"Last Wednesday received an email that a small non described flaw was discovered on my jacket. I was asked to click on a link to validate or reject the proposed price by VC. Nothing happened. Long story short...I ve contacted customerservice 5 (!) times via chat. I was given a promotional code for the inconvenience ( reduction of 20 euro s), guess what? Didn t work either! Contacted customerservice 3 times for this, every time I was told, it should be fixed... So no access to the quality report, no working promotional code. Have sent 3 e-mails ( different subjects) via e-mail, it has been a week now, no reply...there are so many complaints about your cudtomerservice, I guess you are hearing us, but obviously you do not listen!","title":"Quality report","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-07","author":"June","text":"I am a seller with Vestiaire, I love the community and the concept. However their customer service is horrible! I have recently updated my address, but on my selling page it still shows the old address and therefore, none of my items are eligible for direct shipping and my buyer complained to me they are forced to pay fees for authentication. Give the reference number : 13406929. That’s completely doesn’t make sense. My buyer wanted to buy and I’m completely a qualified seller for direct shipping. Tried million times contacting their customer service to fix the issue, however only chat bot was sent to me and couldn’t respond to any of my questions. Pls contact me and help. Thank you so much!","title":"seller with Vestiaire bad customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-07","author":"Barbara ","text":"Terrible experience!!\nWasn’t paid in the item sold\nTotal scam","title":"Terrible experience!!","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-07","author":"Grace Prosser","text":"I would give 0 stars if I could!! I sent an item before Christmas two days after I sold the item, over Christmas and after I have tracked the item and even received an email by Vestiaire Collective saying my item was with the courier. On Monday, I tracked the item again and it said it had been received (after 7 weeks of waiting) and then two days later my item was cancelled. I have received no communication from Vestiaire Collective to say why the item was cancelled, nor have I received any update on where my dress is or when I will receive the money that is rightfully mine. I am so disappointed with this service and would never recommend to anyone!!","title":"I would give 0 stars if I could!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-07","author":"Tim","text":"Vestiaire, why do you persist in illegal activities?? You take money in \"duties\/taxes\" randomly but you do not provide a breakdown of exactly what is duties and what is tax.....and you do not have the resources of people to answer simple questions......YOU MUST PROVIDE A CLEAR BREAKDOWN OF WHAT YOU ARE TAKING PEOPLES MONEY FOR??? I will be contacting the French government and laywers.\nVAT is one thing, but certain items do not have 'duties' by you are stealing peoples money by adding 30% when someone purchases.","title":"Illegally takes money without clear advice prior to taking","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-07","author":"Mehall Murray","text":"I really love using Vestiaire Collective and have been buying and selling.\nHowever I am most frustrated at the inexplicably I am not allowed to send sunglasses within Ireland and to Poland and perhaps other countries too. This has meant that I have lost two sales in as many days. There is no information given about this and communication is poor to non existant with the Collective its self.\nI will continur to use the site but am dissapointed.","title":"I really love using Vestiaire…","stars":2,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-07","author":"Raman Am","text":"-The website is just god awful and so buggy and it even lacks some of the basic functions that are available in the app (sending messages to people u purchased from, etc. \n\n-They determine the shipping courier and seller or buyer have no say in choosing a shipping courier that can cause problems sometimes.\n\n-customer service is totally useless and won't help  you regarding shipped items even tho it is VC that books and sends the shipping labels,\n\nawful company, horrendous fees for more expensive items.","title":"-The website is just god awful and so…","stars":2,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-08","author":"Giovanni Barba","text":"After 80 sales I'm having the worst possible experience. \nI sold 2 Versace Palazzo \n14076030\n14058886\nBoth new with tags and CLG ( Certilogo ), I sold in Vestiaire around 10 belts.\nThe \" quality controllers \" said that both belts are not compliant and asks 12€ each to send them back.\nSo I contacted Customer service, them said that my belts are totally not compliant for brand, metallic, form, exc exc.\nSo I asked pics of them, but them didn't make it, strange 😅\nI'm waiting that them will contact me with pics, I'm curious to know the result. \nMeanwhile I'm waiting my money!!!\nI'm pretty sure I will not sell anything else here.\n10\/02\/2021 News\nThem don't want to provide pictures of the belts and continue to ask money to send them back.\nThis mean everything.","title":"Embarrassing","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-08","author":"Mrs Gabeva","text":"It is a waste of time to write but if somebody finds it helpful to avoid dreadful experience with VC is still worthy. Submitting an item bought from VC and receiving this 30 min after submission.\nHello Sophia,\nThank you for your submission.\nCHANEL \nDresses \nReference: 14306426 \nVery good condition \nOn the site: 680 € \nFor you: 510 €\nUnfortunately, your listing could not be published because the photos are not original (photos taken from the internet are not accepted), do not sufficiently enable us to verify the item, or do not meet our criteria. \nPlease try listing your item again with photos that accurately represent it, and give potential buyers as much detail as they need!\n\nFirst - there is NO picture from the internet. Only pictures of the real item taken as always.\nSecond - full and detailed description, even too many details.\nThird - item is bought from VC (i even attached their invoice) so if they are questioning eligibility, they are questioning themselves. Totally idiotic 😂\nFourth- the item is in absolutely excellent condition and it is very obvious.\nIt is a waste time to deal with them. It is a fraud company. It does not matter at the end. But watching the total crash and downfall of a good concept due to idiotic execution is a little weird. Their bad. Not even frustrating anymore because you just expect s...t from them. But i am being extremely amused leaving negative (unfortunately true ) comments just to annoy them. Nothing will change and nothing will be improved, but people be aware of them. Really. \nNow expecting their next punishment 😂😂😂","title":"Fraud","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-08","author":"Martine Lawley","text":"Here is one of the best .. so far.. regarding Vestiaire Collective!    I am posting my comments here as if I do this directly with the company,  their customer service employees have such a limited knowledge and limited powers (in brief : lip service par excellence!).\n\nVestiaire Collective have been really quick to respond to Brexit...   Oh yes!    Being a 'Trusted Seller' I was able to buy and sell some items directly..   No longer the case and if I buy something, taxes + item check + postage are all added making a bargain..   no longer a bargain!\nIn addition, I can no longer buy glasses and small leather goods from outside the UK..    \n\nBut now for the really funny bit (😂😂😂😂😂😂😂) - yesterday, I was looking at a pair of Tiffany sunglasses ..  and there was a note in red stating that due to 'Brexit restrictions' I could not access these glasses...    BUT MAN!   THE SELLER WAS FROM ENGLAND!!    \n\nI think VC are taking Brexit much too seriously and are not helping their customers...\n\nI can feel a 'Vestxit Collecxit' coming.....","title":"Here is one of the best .","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-08","author":"Yee","text":"Third time bought from VC \n\nFirst time: the authentication took more than 1 week. So I spent my time and effort to chase after VC, finally it mentioned that the bag did not pass the authentication process.. luckily the money was refunded quickly \n\nSecond time: they sent my parcel from France to Hong Kong using Chronopost. You can google Chronopost and you will definitely understand my thought. When the parcel arrived HK, it mentioned that my phone number was not provided so the parcel was on hold... Finally, thanks to google, I checked the company handling the parcel in HK (myself) and called them so I finally got my bag \n\nThird time: VC sent the parcel quickly BUT the wrong tracking number was provided by them.. even after a whole week, chonopost said that no shipment could be found. I kept chasing after them again, using live chat! Luckily, one of the customer service representatives decided to escalate my issue (which is very rare from the review here) and she even called me once to assure that VC would treat the issue seriously. She also sent me email and always replied in a few hours (so I didnt have to wait for another ‘expert’ and reply in 2-3days..) \n\nAfter a few days, a correct hyperlink to track my parcel was provided. But...... once the parcel arrived HK, the same problem as my second purchase appeared again! And this time even the tracking number provided was incorrect! Luckily, I tried to tell the company handling the parcel in Hk the number found in the link so finally I successfully got the parcel \n\nIn short, i do thanks the representative who escalates my issue! Otherwise, I dont think that I could receive the parcel! However, shopping should never be that tiring! I am writing the review here to remind myself the troublesome, time consuming and frustrating process of getting my parcels! WAIT! I have paid for them and I should not have experienced all these..","title":"Frustrating shopping experience","stars":2,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-08","author":"Crotti Designs","text":"If I could give zero stars I would. I made a listing for an authentic Celine bag which had been dyed black. I highlighted this in the description and on the photos that show the serial number tag as still being pink leather. The listing was verified and approved. The bag sold on the 17\/01\/21 and the buyer chose to get the bag authenticated, which is fair. The bag arrived at the vestiare headquarters on the 22\/01\/21, so four days later (Dublin - Paris with DHL). On the 26\/01\/21 it was marked non-compliant, and that was the last I heard. The following week I had to get in touch with them to find out what the story was. They claimed it didn't match the description (very untrue) and they also marked it as a failed sale and docked my seller rating to 62%. To add to that I then again (!!!)  had to get in touch to ask when will I get my bag back - The vague response (on the 3\/02\/21) after the chat was 'Thank you for letting us know you'd like your bag back (seriously??)and that the bag would be shipped back 'in a few days' and that tracking will follow. On the 8\/02\/21 the bag still hadn't been shipped back. I once again got in touch and was told it would take 3 working days to post the bag back. At this point they have had my item (after it was marked non-compliant) for a solid two weeks and if I hadn't got in touch they wouldn't even have bothered to send me my Celine trio back. I cannot believe the have such awful protocols to deal with non-compliant items given the whole platform only exists because sellers and willing to list item son there (I personally will continue to stick with DEPOP where the service is good and the commission isn't as ridiculously high as Vestiare). This review is from a sellers point of view but I can say that the buying process isn't particularly smooth sailing either - a direct result of the zero communication possible between sellers and buyers. Hopefully by next week (week 3) I will have my item back!\n\nEdit: Week 4 and my item still hasn't been posted back! Maybe by week 5? Who knows!","title":"If I could give zero stars I would","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-09","author":"MissN","text":"Do not recommend! Not as a seller and not like a buyer. Taking comissions for not doing their job. Very disappointed and will never buy or sell with them again.","title":"Do not recommend","stars":1,"location":"SI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-09","author":"lucy judge","text":"THE WORST APP I HAVE EVERRRRR SOLD ON. There no help and it’s too confusing. i’ve had way to many problems with this app ‼️DO NOT USE VESTIAIRE COLLECTIVE‼️","title":"THE WORST APP I HAVE EVERRRRR SOLD ON","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-09","author":"Samantha Jane Lane","text":"Bought a chanel belt, which went through the \"authentication\" process and was eventually delivered to me...... with a broken clasp. The belt is defunct and completely useless. Money down the drain. Won't be buying from Versitiaire again!","title":"Avoid!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-10","author":"Susan Stevenson","text":"I sold an ethnic pendant which came with a silk necklace. This was the original necklace. During a chat the customer asked me to post some photos of chains I have because she would like a chain instead of the silk necklace. So I packed the one she wanted second from the left as requested. \nI got a message this morning to say my item is not comlpliant because I didnt send ALL THE CHAINS IN THE PHOTOGRAPH. I mean I sent a FREE CHAIN and now my item is not compliant. What are they on!!\nApparently they contacted the customer and she didnt want it because I didnt send all the chains. She doesnt know why she didnt get her necklace","title":"I sold an ethnic pendant which came…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-10","author":"LISA","text":"I bought an expensive coat, shipping from Europe in January. I paid the required import tax\/VAT at time of buying it, full amount taken from my account. Courier then contacted me saying they would not deliver until the outstanding import tax (already paid in full to Vestiaire) was paid. Contacted Vestiaire, who said they couldn’t deal with courier, only way to deal with it was to pay the second, duplicate charge, send receipt and they would immediately refund. So I paid again, sent proof of payment. Nothing. Have requested the money is repaid, with supporting proof of payment, multiple times, now asked for a phone call to explain. Nothing. And there is no phone number to contact anyone. Feels very dishonest, and I’m still chasing and waiting for a large sum of money to be repaid into my account. Be very careful of this- I feel like I was duped.","title":"Import Double charge","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"},{"date":"2021-02-10","author":"Fanny Bøgelund","text":"Very disappointed and frustrated. \nI sold following item: Celine luggage purse, Olympia Le Tan clutch and a pair of Nicholas Kirkwood heels. I tried to contact Vestiaire by mail (they closed their support mail!) by chat and by phone. Turned out that after 14 days + of waiting for my money from 3 sold items, they had made a mistake. I asked for confirmation that someone would look into it and never got any. I tried chatting with the robot \"Leo\" several times, but no luck. Still waiting for my money. Costumer service is non existing. I just wan't to get paid for the items I sold, nothing else.","title":"Very disappointed and frustrated","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=74&stars=1&stars=2&stars=3"}]