[{"date":"2022-01-04","author":"Alexandra","text":"Their service is awful. I am trying one month now to receive a reply from them and they keep sending the same automatic email that they look into my problem and will coma back to me in 24h. Guess what? I am waiting one month now not 24h. I have not receive the item and they have disappear. Be careful when you buy anything from them! They are not trustworthy and there is not after sale customer service. They never reply to the emails. All this behavior is unacceptable if you imagine that you pay for 500£ or more. RIDICULOUS!!!!!","title":"Their service is awful","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-05","author":"Georgina Malisianou","text":"I have to say that i used to love love love Vestiaire, BUT i think the new changes made on shipping are unacceptable! They stopped offering the choice of free shipping, now it’s 8 euros for direct shipping and just yesterday that it became 13 euros!! Are you serious?? \nIf i want to buy a beenie that cost 30 euros i have to pay 13eu for shipping???? GET A GRIP PEOPLE! i used to buy many small items from you now i will not pay 13 euros for shipping, this is nuts.","title":"I have to say that i used to love love…","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-05","author":"Yasmin","text":"I was very satisfied with my first and second purchase from VC ( both were YSL bags), until I noticed that the authenticity certificate from the second purchase was from another Bag ( I bought a Loulou M and the certificate says Loulou S with a different number ).\nThe quality control was done by someone named Louisa on 22nd Dez 2021 who obviously didn’t know how to do her job correctly. I’m still waiting for a response from VC and hoping to get the right certificate for my bag.","title":"Wrong YSL authenticity certificate received","stars":2,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-05","author":"faidra giannopoulou","text":"I have ordered a Balenciaga city bag from Vestiaire collective on 16.12.21  , while the Seller's photos and description of the bag clearly shown that the bag comes with a shoulder strap nevertheless i have never received it. Immediately i addressed the problem to VS team through their application and i never heard back from them! This is so disappointing i will never order again!","title":"Stay away after sales customer support is non existing!","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-05","author":"JC S","text":"( Minus 1 star!) I was looking at buying from this site but after a little checking I realised I should stay away from it and not risk losing my money on \"risky' transactions and unregulated descriptions of goods.\nI saw that their was 2 identical jackets for sale from 'apparently 2 'different sellers' (£320 and the other £480??) but both sellers listed in same country.\n\nCheaper price jacket described has 'excellent condition' other has 'never worn??). When I asked the seller why was the jacket listed under different sellers and prices 'although same photos' I received no replies from 'either' sellers - (how strange!).\n\nNext when I asked for more photos I was sent the same photos from the 'supposedly other  listing of the same item \/higher price).\n\nLater in the week I noticed the seller was being asked from another buyer (not me)  the same requests to authenticate the photos and item (this is a service that is supposed to cover the buyers by the site itself which they charge you for - but obviously not happening to protect the buyers and their cash!.\n\nAfter many days and the other seller asking for more product authentication the seller and (both items disappeared from the site!).\n\nFurther into the week the jacket appeared again!....under another seller and with a £580 price tag!!. \n\nI would advise to stay away from this site if you value your hard earned cash because the site and some of it's sellers are obviously flawed!","title":"STAY AWAY!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-05","author":"Consumer minded","text":"After my experience of purchasing an item that was never sent to me, and having to report them to AmEx before they agreed to refund me, I then wanted to be removed from their mailing list.  It's impossible.  If you click on the unsubscribe button on their emails it simply takes you to their website.  Despite emailing their customer service to request that they remove me from their list it hasn't been done.  They say they need three days to 'find a suitable solution' but don't do anything.\n\nREPLY: I asked to be removed from the mailing list on  22\/11\/21.  It is a very simple matter which your company continues to avoid doing.  Messages such as your reply below say nothing at all and is the same as the earlier messages I have received from your company.  Just unsubscribe me!","title":"Avoid","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-05","author":"Hristina","text":"Dear Vestiare Collective according to what was written by you in your latest reply  \"Litigations are closed with a declaration of loss or the shipment of the parcel to its original destination\nRest assured that we will update you by email as soon as we have received carrier's investigatin results\" , by this point it should be closed !\n\n\nApparently, information travels in different speed to you, since DHL has personally informed me on 10th of December, that investigation is closed , items are officially declared dissapeared and the investigation results are available for you.  Quote :\n\nHello Hristina,\n\n\n\nThese shipmenta are now delared as lost.\n\nPayer can send claim to local DHL. Thank you.\n\n\n\nYstävällisin terveisin,\n\n--\n\nAnne Mari\n\nCustomer Service Advisor, Backline\n\n\n\nDHL Express (Finland) Oy\nTullimiehentie 10\n01530 Vantaa\nFinland\n\n\n\nEnd of quote.\n\nThis was further confirmed by them in another email dated 29th of December.\nQuote:\n\nHello Hristina,\n\n\n\nThank you for your message. Our investication is closed and \n\nwe have declared these 2 shipments as lost.\n\nPlease ask Vestiare Collective contact their local DHL, they can see \n\nwhat all we have investicated and results too.\n\nThank you.\n\n\n\nBest regards\n\n\n\n\n\nYstävällisin terveisin,\n\n--\n\nAnne Mari\n\nCustomer Service Advisor, Backline\n\n\n\nDHL Express (Finland) Oy\nTullimiehentie 10\n01530 Vantaa\nFinland\n\nEnd of quote.\n\nYou are welcome!\nPlease, let's stop throwing the hot potato around and finally let me know the deadlines for reimbursement.","title":"Nearly 1 month since they are declared lost","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-06","author":"Mrs Gabeva","text":"Update 3: Actually, although it took months,  Finally VC just fixed the badge issue. I hope this is a step to overall improvement. A real  Thank you this time.\nUpdate2:\nVC, “thank you” for the polite answer below.\nHave you ever thought that following on your promises is actually better than writing polished answers to fool users at trustpilot that you actually take accountability? I guess not.\nIt is all sand in the eyes of customers. Promises that are never kept. Not surprised because the email was never expected, but better stay silent rather than pretending that the matter will be “taken care of” … so typical of VC…anyway.\nUpdate:\nVC, “thanks” for your answer. But maybe if you ever bothered to read my comment carefully you would have understood that the complaint is not about the said item (btw, ref. 17131379; previously bought from you with ref. 5670063) as this matter was resolved - i got the refund for the initial purchase. The problem is the situation with the badge. You can see my comments from august. And also, AGAIN, i am copy\/pasting a reply from your agent on aug. 25th\n>>“Dear , \nMy name is Mariel and I am here to help with this matter. \nAlthough we are not able to reinstate the badge manually and I do understand the disappointment that losing it has caused, I would like to let you know that the badge will be automatically awarded based on the next few sales. \nI know that the loss of the badge was not your fault and we are truly sorry about the inconvenience this technical issue has caused. \nAs soon as you have fulfilled the shipping criteria again, your badge will be automatically reinstated.\nPlease let me know if you have any questions and thank you for your understanding.”\n>>\n\nSo, if you manually could not restore my badge back then even though it was your mistake and you “encouraged” me to sell more, why your “computer” system does not follow its own rules for granting badges as i have sold 50+ since then?!?!?!?!\nI hope this time you actually UNDERSTAND right what i am talking about and stop giving ROBOTIC answers here.\nI have shared the most shoking bad experiences with VC here, most of them staggered last year, so i am not going to waste time to list and summerize them again. It is just obvious that the service of this company has gone from ok to ridiculously bad. Of course, truth to be told, a lot of the transactions do go smoothly, which should be normal pattern, not an exception. But when things mess up, there is no power that can make VC own up their own wrongdoings or fix their mistakes, there is no legitimate or adequate customer service, there is nothing. This is obvious and repeating pattern which is of course resulting in their overall ratings (as seen here) for which they seem not to care.\nAnyway, i wanted to share about another malfunction of their robotic website, which contradicts the rules they claim to follow.\nI have been selling since 2017. I was an expert seller. Till august, 2021 i have sold 414 items, all of them found compliant, shipped on time, etc. till they decided to declare one sold item “fake” although it was bought from them at first place and had once passed their “quality control”. After a dreadful back and forth communication at least the item was refunded to me, so that part was ok. But they wrongfully stripped me of my “expert” seller badge. They admitted that mistake, they promised to restore it (i have many emails as proofs of their un-kept promises), till one day someone decidee to admit   - “yes, our mistake, BUT there is nothing we can do, we just encourage you to sell more to gain it back”  Whatever. Fine.  But what is contradictive to their own “rules” is the fact that since that “incident”, created by them, occured, i have sold additionally more than 50 items in 4 months. All shipped on time and all found compliant. By their own “regulations” you need to sell at least 2 items in period of six months which need to be shipped on time and found compliant to get a “trusted seller” badge and at least 5 items in six months to get an “expert seller badge” (or in my case the badge that was wrongfully taken away to be restored). So, i did actually sell more than 50 + items in 4 months, but my badge status is still “in progress” and shows that zero items have been found compliant, although actually ALL the items have been found compliant.\nIt is not a big deal, with the time you learn not to sweat over their bulshit and just to expect it, but it is just an observation of another malpractice and another self-contradictory “strict”  rule that they so “proudly “ claim that they follow, but actually just misinform, mis-follow and just do not stand behind by their own “regulations “. Another reason to consider them untrustworthy and always to walk on eggshells when working with them.","title":"Contradicting their own policies- fixed","stars":3,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-06","author":"Jessica Deare","text":"Vestiaire Collective's customer service is TOTAL GARBAGE as they blithely claimed they did not get the complaint I made within the 72 hrs policy of receiving a defective item (ref # 18736636) on 23 Dec 2021. The item I received did not match the description of \"never worn.\" The item seemed shrunken from washing and the inner material composition label looked rubbed and worn. Now that the 72 hrs complaint window has elapsed I am AUTOMATICALLY FORCED TO ACCEPT A DEFECTIVE ITEM which I actually never approved of nor accepted -- all without any recourse. \n\nI took a screenshot as proof of the \"We have received your message\" screen pop-up I got on Dec 24 2021 (when I sent my complaint) and they were supposed to send me a confirmation e-mail and a reply to my complaint within 72 hrs. Nothing happened. I then contacted customer service and the agent claimed they never received my complaint. HOW CONVENIENT. Fortunately I have the screenshot as proof that I sent my complaint within the time limit. \n\nI have contacted customer service two separate times in the two weeks since I sent my complaint for updates and each time the agent has a assured me that \"the team is now checking on this and you will be receiving an update.\" What is going on? WHERE IS THIS UPDATE?  I have used VC many times to buy and sell items and their services are steadily getting worse. Vestiaire Collective's customer service is so spotty, disorganised and dismissive lately. Vestiaire also conveniently lose your messages of complaint -- probably so they don't have to deal with you. The only thing that they seem to be good at is collecting their commissions and leaving their customers in limbo by eternally promising updates that never come. Now I am stuck with a defective item that absolutely did not match the description while Vestiaire Collective happily collects their commission and goes on their merry way.","title":"Vestiaire Collective's customer service is total garbage","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-07","author":"Wendy","text":"I’m honestly at a loss\n\nI did not expect Vestiaire to be so unprofessional.\n\nI sold an item on 23rd December. It said I would be due my payment on 28th December. I’ve been checking my accounts daily ever since and still no payment. You can’t actually speak to anyone. There is a ‘chat’ function on their website but it’s some stupid robot.\n\nI ended up emailing them to chase. On Friday 31st I got an email from Christelle who said she had escalated to their ‘Expert team’.\n\nI get another email on Monday 3rd January saying they ‘haven’t forgotten about me’ and will be in touch within 24 hours. It’s now 7th January and still nothing.\n\nI sent them a tweet on Twitter on 5th January. No reply and yet they reply to other messages. I sent another tweet yesterday 6th January and still nothing and yet they are still replying to other people.\n\nWhat the hell is going on? Had I known it was THIS DIFFICULT to get payment, I would never have listed an item to sell. Never again will I use Vestiaire to sell anything.\n\nThis is extremely poor. GIVE ME MY MONEY\n\nRef #19039322","title":"I’m honestly at a loss","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-07","author":"Alastair Smith","text":"No star really. Do not use they are con artists. Paid for an item then they say its not available and say the refund is on.....but minus about £50. No way to to talk to a human in customer services. Luckily I paid using a visa card and will get it back from them. Avoid at all costs I suspect they do this alot and people dont chase it. Easy money for crooks","title":"No star really","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-07","author":"Kate A.","text":"The mark of a decent organisation is how it responds when there are issues. I've bought before from VC and had no problems but my most recent experience has put me off ever buying from the again.\nI purchased a coat, which, on arrival (having swallowed the extortionate shipping and duty costs) had clearly been taken in at the sides.\nI raised a complaint and sent it back, only to be told that, in their opinion, the item met the description. It didn't but I have no further recourse so now I either accept them selling it, minus the duty charge, the shipping AND their fee (which means I'll be lucky to see half of what I paid), or have it returned to me.\nIn order to get it returned you have to make the request within 24 hours. And that requires that there's someone their end to speak to. I've been on their Chat for the last hour, being promised that \"waiting time is less than a minute\" so who knows if I'll ever see the garment again\nMy impression is that they've grown beyond their capacity to manage their inventory and are taking their customers hugely for granted. I'd rather take my chances with eBay in future - at least buyers have some protections there!","title":"Avoid, avoid, avoid. I'd give minus stars if I could","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-07","author":"JS","text":"Cross-border purchases of fur items not allowed: as a UK-based person, I can't buy outside the UK. EU- based people can't buy fur items from the UK.\n\nAll Vestiaire's competitors - ebay, Rebelle, Joli Closet, etc. - have no trouble with this, nor do manufacturers and retailers. \n\nVestiaire's response is \n\"Upon coordinating this case to our Expert team. I regret to inform you that we cannot remove the restriction to ensure that the item once sold won't be lost or be hold by customs. \n\nBe advised that the restriction is based on the custom and courier's policy and safety measure for the item.\"\n\nThis isn't a new issue. A year on from Brexit - which is what Vestiaire used to blame -  has a new excuse, which is to blame the couriers and customs officials. \n\nThis is such an incompetent company, an e-tailer unable - or unwilling - to adapt their platform to market changes and treating their customers disrespectfully. The last time I raised this issue, the response was that they were creating a UK hub that would solve the problem. The hub is there - I've sent items there - but the problem isn't solved.\n\nIf they don't want fur-content sales on their site, they should say so rather than blaming others.","title":"Incompetent and Blame Others","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-08","author":"Jenna Smith","text":"No stars. Awful customer service. Asked about 20 times to unsubscribe from their endless awful emails.","title":"Terrible customer service and endless emails you can't unsubscribe from","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-08","author":"Darlene Gonzales","text":"I've been a loyal customer for both buying and selling and i just had the WORST experience ever with Vestiaire Collective.\n\nRecently i sold a bag. My local post office deals with dhl packages as well. I've been reaching out to them about it since the day I've sent it. They just randomly decided to \"cancel\" my order when it was already delivered! I reached out and there's still no damn solution to getting paid for my bag thatbwas sold. I even broke a little bit of the rules to get the buyer to pay me if VC wasn't planning on doing it, and I'd come directly to tell that it was handled another way. But these s.o.bs LITERALLY keep sending me bs emails saying \"we haven't forgotten about you\" but don't make a solution out of it. They even said they'd \"ask\" the buyer if they'd like to keep the item but does not say if they'll be paying me or not. What the actual f? I have to get paid and apparently they are awful at this. Might be my last time ever with them. I've spent a lot of good money and time to deal with this bs.\n\nI get more help on Vinted than on Vestiaire Collective.","title":"VC and it's irresponsible customer service","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-08","author":"Lauren Tolula Welford","text":"I sold a significantly expensive jacket on this website, still have not received payment 3 months after it was sold. Emailed Vestiarire several times, with absolutely no response. Essentially, they robbed me. DO NOT USE!","title":"DO NOT USE - NO PAYMENT","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-08","author":"Maerie Kieran","text":"I absolutely loved vestiaire and quite literally bought all my clothes on the site (having made over 20 purchases in the past year alone). Great way to shop sustainably, bag a bargain and find great unique pieces. I told all my friends and family about it and so many of them use it frequently too. BUT I have just noticed that you dramatically increased your direct shipping fees. It used to be FREE but I just tried to buy a jumper, at the checkout, I realized I was being charged €13.70 for Direct Shipping from France to Ireland. This is a crazy increase and, at 25% the cost of the jumper, made me abandon the sale. \n\nFor me, free shipping was something which really set Vestiaire apart from Depop and other similar sites. It made shopping sustainably feel affordable and provided certainty as to the ultimate price of an item while browsing. \n\nI understand that the company must have made a financial decision to abandon free shipping but I really think that, in the long run, they will lose a huge amount of custom over this decision. I know personally that I will no longer be using the site and many of my friends have said the same. \n\nI'm not writing this review as a 'complaint' per se, but more as a disappointed loyal customer who is gutted to have lost their favorite place to shop sustainably. \n\nI expect that you will be forced to reevaluate this decision following a likely dramatic loss of custom.\n\nI hope that the company continues to experience success, as I really do believe that it is a brilliant initiative, but I unfortunately cannot justify shopping with you anymore.","title":"Dramatic increase in shipping costs","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-09","author":"kertis patterson","text":"I sold my first bag, a vintage YSL authenticated by entrupy. The buyer got it on December 20th. Today is January 9th and I haven’t been payed.\nThe girl claimed it was fake without any reason. For all I know she still has it! Vestaire avoids me, I can’t get anyone on the phone. I just chat with useless agents half of which blatantly lie as to where my merchandise actually is.\nAvoid them, they are a scam.","title":"Sellers beware","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-09","author":"Ha Nguyen","text":"Whenever you plan to make a purchase at VC, remember that they are always on the seller side, who they earn commission from. They will do everything possible to protect the buyer and dodge the responsibilities on their side too so you, the buyer will have to bear the cost.\n\nI purchased an item that was listed as size 14 y\/o. When I received it it was 8y\/o. \nVC’s response on the issue was: “Please be advise that the size of the item it is depends on the brand of the item and the origin of the item”, and that it is the buyer’s responsibility to make sure all the listed details are correct (??!!!!). So according to VC, I should have zoomed into one photo where the tiny size tag was half-blocked by the photographer’s finger, to notice to actual size. So in short it was my fault that I received an item in a different size than listed and no return allowed.\n\nHonestly VC ran a terribly poor show of customer service. Starting from a good idea for a product\/platform, now they are just losing trust from the community that they’ve built. Please get your house in order or soon a competitor with the same idea but more graceful execution will take your place.","title":"Horrible customer service for buyer","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"},{"date":"2022-01-09","author":"Denise Gough","text":"I have had so many issues with Vestiaire recently. I buy from the app a little and recently a Dior T-shirt was not delivered despite it saying it was. I keep getting messages to change my address for redelivery but it doesn’t allow me to on the app when I go to the item. Now a recent message says it will donate the T-shirt to charity. Bots are the only thing available to chat to and no person answering any emails. So frustrating. Has happened before that I’m chasing human response. Really bad customer service and now set to lose 300 quid. Still no response to emails.","title":"I have had so many issues with…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=25&stars=1&stars=2&stars=3"}]