[{"date":"2021-09-16","author":"Vickxyxx","text":"-Unable to verify and authentic item and asks for processing fee-\nRidiculous company. I have recently sold an authentic Dior item on Vestaire and sent it to them, after ‘verification’ then they sent me the following email: \n\nTell us more about Bracelets Dior\no help us check your item’s authenticity, we’d like you to send us the following:\n- Proof of purchase\n- Details of where and when you bought it\nYou’ll need to send these details to \nexpertise-vestairecollective.com \nwithin 7 days.\n\nThese are criteria’s that they didn’t ask for when I listed my item for approval\/ before I post the item. I don’t know the exact details as the bracelet is a gift from my ex-boyfriend but it is for sure an authentic Dior. So didn’t reply to the email and days after I got another email asking me to pay them to get my item back:\n\n\nWe would be happy to return the item to you. If you’d like to have it shipped to you, we just ask that you pay a fee of 12 £\/€\/$, which covers our processing costs per item. This 12 £\/€\/$ payment can easily be made via bank transfer using the following details:\n\nBank: Crédit du Nord\nIBAN: FR76 3007 6020 2017 1439 0020 058\nAccount Number: 17143900200\nBIC Code: (Bank Identifier Code) NORDFRPP\n\nIMPORTANT: Please ensure that the bank transfer description includes the item reference number and your surname and first name, as indicated on your Vestiaire Collective account.\n\nOnce you have made the payment, please send us proof of the transaction. To do that, click below and complete the contact form using the following responses to the prompts:\n\nTopic: Seller\nI need some help with: Quality Control & Authenticity\nI have a question about: I’d like my item shipped back to me\n\n\nHow ridiculous. They are literally charging sellers for their inability to verify the items by the so- called authentication team. \nSo I contacted them with chat and the agent just replied with sorry I will let the team know about this but for now we will still need the processing fee to return the item. \n\nWHAT A SCAM.","title":"SELLERS: AVOID AVOID AVOID.","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-16","author":"Amanda Capaci","text":"Edit:\nAfter a very difficult communication process, I was provided a full refund. The process required me to repeatedly engage in chat bot conversations, followed by an exchange of emails where it was insisted that a full refund had already been paid. It took a threat of formal action to finally bring the process to an end. I am saddened as I had such great expectations and hopes for my relationship with this company.\n\nI purchased and paid for two items within a single order. Vestiaire cancelled both items, refunded only one item, yet claim to have refunded the entire amount. The customer service is appaling. I do not reccomend this company.","title":"Money stolen.","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-17","author":"S R","text":"I sold an item that was delivered to correct ups pick up spot but buyer hasn’t collected for 7 days nor has Vestiaire responded to my queries - just an online chat saying will look into and then nothing - feels like theft !! Going round and round in circles and just want to be paid or dress back ! We pay a lot of commission but get a rubbish service -DONT TRUST THIS CO - you have no recourse if anything goes wrong !!","title":"Sold dress but not received any money \/ help from vestiare","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-17","author":"customer","text":"I was a buyer. My seller was a bit of scammer and sent something that was different from what was described from the pictures and description.\n\nI filed a complaint to Vestiare but so far has not got a response.\n\nI think the problem with Vestiare is that there is no system or process in place to claim against scammer sellers (unless you use their paid authentication service which makes no sense to pay for if you are buying a clothes less than 100£, also they only do this in France and don't have offices elsewhere, so the seller must ship it to France then ship it back to UK etc etc super complicated and I pay the shipping)\n\nReally needs improvement with customer service, I chatted with two representatives and also submitted online claim as there was a form, but no response...","title":"I was a buyer and no process in Vestiare to tackle scammer sellers","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-17","author":"Grace Hoo-Quartey","text":"I joined Vestiaire in August last year.  To this point I had found it a very pleasant experience both buying and selling.  The platform was easy to use and Vestiaire reliable and easy to contact when needed. It saddens me to say that this has all changed and left me totally frustrated.  I no longer have confidence to either buy or sell on Vestiaire. I am on the verge of removing all my items if this isn't suitably resolved soon.\nI had a sale of two items to the same person on 30 July.  I sent the two items in two separate packages (as we are told to do) on the same day to the same drop off point. This is the first time I have had experience with Hermes and this is where the problem started.\nOne item arrived on 3 August.  The other item arrived on 21 August.  Meanwhile, the buyer and I were both unsuccessfully trying to track down the missing parcel. Hermes are impossible to get in contact with a human being and by phone, it's a useless (bot) or online, the same message kept coming up saying the \"item is in progress - we are sorry your parcel has been delayed, we'll have it on the move in the next 24 hours).  To this day, the message is the same.\nHowever, the buyer messaged me on 21 August to say it had just been delivered.  I think because Hermes didn't sign it off, I have NOT been paid.  \nDuring all this time, the buyer and myself were trying to get in touch with Vestiaire for advice, support and to let them know my experience with Hermes and I have only been able to get a bot with takes my name and email address and NEVER gets back to me.  \nI have spent so much time on this it isn't worth my time and effort for not much money either on the sale.  I can't go through this for every future sale.  It leaves me feeling really let down and frustrated, lacking confidence in the process and needless to say, out of pocket.  Vestiaire are paid, the buyer had her item and I am left with nothing. I would like to be paid.\nI am interested to see whether and how this will be resolved and what's for the future. This was an unpleasant experience for both myself and the buyer. Why is it now impossible to have contact with Vestiaire.  It is a pity that I am reduced to having to deal with this, here. I am hoping that I can write on here that all has been resolved and back to normal.","title":"WHAT HAS HAPPENED TO VESTIAIRE?","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-18","author":"EM","text":"Stay away as SELLER !! and Buyer! Thats all I can say.\n\nI have been a professional seller for almost a year now, at the same time VC has been spiraling down. I used to be a private seller with no issues in 2020 with expert status and everything. But when 2021 started things became a disaster. I don't even know where to start and what to tell. I keep it short - their verification process in the beginning failed to get me a huge sum of sale payments for several weeks. Two expensive handbags were mysteriously lost in their warehouse or on the way. Half of my products, that are authentic (as a reseller we check carefully beforehand) are declared as counterfeit and at the same time I see plenty of fakes on the platform, even confirmed sales. Items returned to me - as apparently \"fake\" - did not arrive in the state I shipped them in - they looked used, thrown into the box. Also their 12 Euro fee to receive returns is a joke - especially as they are the ones who seem not to be able to authenticate. \nThe customer services is awful, they write an essay before they get to the actual topic! Problem solving should be fast- with them it takes ages.\nRecently I sold a pair of brand new designer earrings- 10 days after the buyer receives these earrings they open a return quest- earrings!!!- these cant be tagged and protected- so the buyer can totally wear, clean and return them. the same goes with their great idea of direct shipping - buyer receives items and could potentially wear the item for 14 days before the return deadline is over. I had to buy my own tags to add to my items so buyers cannot fraud me. Even the flimsy tags Vestiaire attaches to their sold products can easily be re-attached. \nWhere is the seller protection??\n\nAlso, I sold a bag the item was shipped on the last day of their period. I informed them and buyer. they cancelled the sale the next day saying item is not shipped. Buyer was ok with receiving a bit later as they were on holiday. Now my sale is cancelled, item is with VC and buyer can't buy anymore as the payment is stuck!!","title":"Stay away as SELLER ! And buyer!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-20","author":"Josh","text":"Supposed to be experts at authenticating items, refused my items multiple times for not being able to authenticate it even though I took images of the labels and everything.","title":"Hopeless at authentication","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-20","author":"Astrid Vroemen","text":"I sold a Hermes bag via Vestiaire Collective and shipped it using their DHL label. Unfortunately they now claim that they received an empty box!\n\nI have told Vestiaire countless times to start an investigation with DHL and to reimburse me for my lost bag. Please do NOT sell with them as they will not help you if the carrier loses or steals your valuable item!","title":"I sold a Hermes bag via Vestiaire…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-20","author":"Wannabe ","text":"Horrible support! 1 support but three different answer! The provide discount codes but none is working. If you ask why, the one say there’s an issue with there system, the other say its not eligible for your country and the third tells you already used it! Okay and what’s the result?! Nope you can’t use it and only wasting your time. Too bad and they earn a badge of a good company? Hmmm 🤔 how they get it?!? Stinks a bit","title":"Horrible support and smell a bit fishy","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-21","author":"EM","text":"I need to write an update to what happened: \nI sold a pair of perfectly fine new Chanel studs. Inspected by VC and then sent to the buyer on 27.8.2021. The buyer requests a return on 18.09. Today I receive back the earrings directly from the buyer - thrown into the box- not even in the little plastic bag it came with. The item has clearly been worn by the buyer and returned- I wish I could upload photos here to show! \nVestiaire did not even request to inspect it","title":"Buyer damaged item and returned!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-21","author":"Caro Thomassen","text":"Never buying again from this store. \nI bought a designer item which was then cancelled because I didn’t reply to the quality check?! Of which NO ONE EVER EMAILED ME OR ANYTHING. I immediately contacted customer service and they assured me they would relist the item and send it to me. \nI never heard anything so a few days later I contacted them again and they told me it was relisted and someone else bought it?! ABSOLUTELY WORST CUSTOMER SERVICE EVER!!\nAnd their reply: sorry, I will note this concern.","title":"The worst!! Absolutely furious. Worst site EVER!","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-21","author":"LG","text":"Almost 2 weeks ago, I sold Valentino Garavani trench coat (Ref 9881281), after receiving it the buyer cancelled the purchase (size mistake) and return it back to Vestiaire Collective hub in France. \nOn 18 September Vestiaire Collective emailed me “We will now relist the item for sale on your account and store it safely at our hub until it sells.” \nNow, let me remind you Vestiaire Collective that with your action you are in breach of contract, a binding contract. \nI suggest you return my trench coat ASAP  and in the same condition as before, meaning, Brand New with Tags in pristine condition, no smells, perfume etc\n\nKind regards \nFashionista Bazaar","title":"Unprofessional and Unacceptable behaviour","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-23","author":"Elise Augarde","text":"I am really disappointed by Vestiaire. I have made some nice finds in the past. But when things go bad and your need their customer service, well then you are on your own... I recently bought a shirt that was described as 'never worn'. The shirt arrived with dozens of stains. I raised the issue within 24 hours of receiving it, following VC processes (you have 72h to do it). A couple of days after, the shirt appeared as approved on the app and the buyer had been paid in full. \nWhen contacting VC they told me they couldn't find a trace of me raising the issue and therefore the item was approved and the buyer paid. When I told them that I did raise the issue on time even showing proof of it, they would just deny it and say that they couldn't refund me. I am furious that I have to pay the price for their tech not working!\nMy advice to all of you is 1) avoid buying on VC and 2) if you do, make sure to screenshot or record your screen when you raise an issue to keep proof you did. \nThey are breaking the Consumer Rights Act 2015 and they just don't care about it. Scandalous!","title":"I am really disappointed by Vestiaire","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-23","author":"client","text":"The parcel ( Gucci bag was inside) is lost and client service ( contacted via e mail and chat) do not reply to the message.\nI contacted Chronopost via phone (they were much more reactive that VC). They said that they cannot do anything since they have separate contract with VC…\nI have an impression that the person that ordered the idem is a fake profile. No response from them (while connecting online). \n\nIf someone have tip how I can solve the issue, please help !","title":"The parcel ( Gucci bag was inside) is…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-25","author":"Magnolia Rooms Split","text":"They offer you 20 Euro welcome discount when using their app for buying something for first time. I tried to buy shoes from seller after we negotiated the price and after I've tried to complete the purchase the system kept notifying me that \"something went wrong\". I reported this to their customer service and they told me I should make the purchase via website because they have some technical problems. FYI, when buying via website, you cannot use 20 euros discount, because it is only valid for buying via app. What a scam and unprofessional behavior toward your customer. The end result: bought an item for the first time and never again! Also I recommended to all of my friends to avoid them completely.","title":"Unprofessional, try to avoid","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-25","author":"Margarita F.F","text":"If i could give 0 starts i would.\nI have been selling with vestiaire for 3-4 years now and the last year has ruined everything.\nOne time has been lost, took me 3 months to get the money back. Poor buyer did not get hers.\nHowever, the worst has happened almost a month ago. I sold an item (16532814) and the buyer has reported a problem. It immediately caused suspicions as he shipped it to vestiaire hub from a completely different city. Here i am, for the past 3 weeks talking to customer service chat who 'apologize and don't have any updates'. It shows the item is at the hub, but for the past 3 weeks no movement\/no communication\/absolutely nothing. This is a theft. You take sellers items an god knows what you do with them.\nCustomer service is absolutely useless, they tell you as much as you can see yourself on the app and keep apologizing instead of solving a problem.\nThe app itself is crap. Full of bugs, errors.\nThey keep sending you useless emails even if you have unsubscribed.d\n'expert team' is not competent at all. Refuse authentic items and have no clue how to autentificate it.\nTo sum up - avoid this platform at any cost. It will give you headache, you will loose your designer stock and money.\nI have decided to remove my items and stop selling it there.","title":"avoid avoid avoid","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-26","author":"JS","text":"Negotiating with a seller in Australia so VC is presenting offers and counteroffers using their exchange rate calculator. This appears to be different than the public ones, which is a problem in any case, but here we have an unlawful act as my agent.\nThe buyer proposed approx. £126, I counter-offered £135. However, this was presented to the buyer as approx. £128 and they accepted. I'm now asking that VC make up the difference and compensate me for the aggravation - but they've got a Big problem on their hands besides mine: \nIt's unlawful for Vestiaire to try to create a sales contract where - as my agent - they've changed the amount of my offer.\nThey are charging an hitherto undisclosed and unagreed fee - leaving the buyer and seller to suffer from their sharp business practice. What a shame, when this works, it works well.","title":"Undisclosed and unagreed fee","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-26","author":"Luis Buxeres","text":"The fee policy is ridiculous. \nI received a mail from VC, if I sell my item for 15€, 15€ goes to VC , and 0€ to me. Excuse me ?!\nVinted is the best","title":"The fee policy is ridiculous","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-26","author":"Carmen Mahtab","text":"Reported to ICO. They keep sending me emails even though I've unsubscribed. They use your contact details against your consent have no understanding of data protection or gdpr. I also emailed their data protection team several weeks ago and did not get a response.","title":"Reported to ICO","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"},{"date":"2021-09-27","author":"Miss Dawn Williamson","text":"Absolute useless platform for selling and the customer service is equally useless. I sold an item (which on this low-traffic platform is quite rare) and I was unable to download the shipping label to send to the buyer, I just keep getting an ‘oops error message’ I sent over 20 emails asking for help and every time got some unhelpful response that they were working on it and to keep trying - it’s been a frustrating waste of time. \nThe buyer must be wondering what the hell is going on and as you are not able to contact them directly I couldn’t even advise. \n\nAvoid this platform for buying and selling unless you enjoy having your time wasted for no good reason.\n\nAs an update - they send you emails saying another member has made an offer on an item you like and that the seller will accept an offer of say $108 however when you go via their link to make the offer it will tell you the offer is too low and has to be more than 70% of the sale price so why exactly are Vestiaire sending an email which is basically total lies based on zero fact??\n\nThey also have a ton of extra frees so expect to pay at least $40 on top of the sale price - for their crazy shipping charge, item evaluation charge and taxes.","title":"Absolute useless platform for selling…and so many hidden fees","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=44&stars=1&stars=2&stars=3"}]