[{"date":"2021-12-12","author":"Talia","text":"They have reduced the prices\nOf my items without my permission. I never got an answer whether they had the right to do that. And of course I am not talking about 10€. I am talking about €400!!!","title":"They have reduced the prices","stars":1,"location":"CY","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-12","author":"Sophie","text":"AVOID, AVOID, AVOID. I used their website to search for a Bottega Venetta Handbag. The search produced a number of results for \"Handbags\". I bought one from a seller named Amina. She listed it as a bag and in the subcategory \"bags\". Naturally, as it is listed in the bag section, I'd assume that what I was buying was actually a bag. But upon my purchase I discovered from looking into the product online it was actually a purse that can't even be used as a bag. I complained to Vestiaire and I had a Charmane Salazar reply. She didn't even bother looking into the details or have any regard to the fact the item was listed misleadingly as a bag. She just copied and pasted the item description and said that was enough to inform me that what I was buying was not actually a bag. When I replied to explain the item had been listed incorrectly, she simply responded with the same email and didn't bother acknowledging or replying to the points I raised. Probably a bot, as VC aren't interested in customer service they're solely for profit and the commission on sales. So will dismiss any concerns you put to them if it gets in the way of making a sale. So this is a great website for fraudulent and poor quality items. As a seller you'll get away with a whole host of issues, it's as good as selling on the black market - no questions asked by VC. So if you want, as a seller you can mislead buyers, Vestiaire will take no responsibility or even cancel the sale for you.They just want the commission and give absolutely no damn about whether you're being conned or not. I would strongly advise taking your money elsewhere, this company will not protect you from being defrauded on your money. Once I receive my purse, I will cancel my account and will never again use this website.\n\nThe reference\/order number is as follows:Bottega Veneta - Pouch leather mini bag - Ref : 18758472\n\n17.12.21\nSo I received the item today. It's beyond belief that VC would even allow the seller to list it as a handbag. It's a purse that is even smaller than my own purse!! I've also just received an email from VC stating the following:\n\n\"I’m pleased to say our team has agreed to check your item again. If we find that the item does match the description provided, we will relist the item for sale on your account, minus our usual commission, and store it safely at our hub until it sells. Alternatively, we can ship it back to you at your request\". \n\nSo in other words, if you've been mis-sold an item, they won't give you a refund, they'll just do you the favour of relisting it. Problem solved as far as VC is concerned. I think I might just make a mockery of the whole thing and relist it myself. Lets see what happens if I use their platform to con someone else like they conned me then.","title":"SCAM company AVOID","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-12","author":"el","text":"would give 0 stars if i could. bought a cartier vintage bag from there but i didn’t like it when it came, went back in the box and resold it in vestiaire. when it came to shipping that was a nightmare, the courier didn’t turn up day after day and it took me talking to 3 separate agents to get the courier to actually turn up. then the buyer contested the item, which was strange as it has been in the box since i bought it? then i received an email from the courier telling me the item was being returned! vestiaire hasn’t even contacted me with any kind of details about why!! for days!!! i had to go through an agent on the chat feature to confirm. This website is absolutely horrendous, please try other avenues to buy and sell designer items.","title":"would give 0 stars if i could","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-12","author":"Dee","text":"I sold and posted pair of Louboutin heels worn once but we’re a size too small) mint contusion, using the label and courier provided by Vestiaire. The shoes were sold to a Vestiaire buyer for £300 and were delivered  to a collection point given to\/by Vestiaire (it’s provided on their courier label). once sent I received emails stating that the shoes had arrived at the collection point and the buyer had been notified to collect them. After 2 weeks the buyer still had not collected them so I contacted Vestiaire via an online chat “bot” but eventually chatted online to someone whom I think was a real person! I was informed in that chat exchange that my shoes would automatically be returned if the buyer did not pick them up after 2 weeks. I’ve made contact via chat and email with Vestiaire several time as it’s now been 5 weeks and my shoes haven’t been returned and they have not been collected from the collection point. It would now seem that for some reason the shoes cannot be located???? Vestiaire does not allow you to speak with them directly and everything is done through regular generic automated emails stating simply they are looking into the situation! I have emailed re a refund for my shoes or returning my shoes but they will not repairs to my request for a refund or shoes in return! Please be very aware of using this site as the security and insurance regarding the loss of your items may not be in place and you may be left out of pocket. I am still awaiting the return of my shoes or a refund but through this process have had no contact directly with a member of staff to ensure that I will get them back or a refund of the £300! They put pressure on you via emails to quickly get your goods sent out as the buyer is waiting etc but when it comes to taking care of customers and loss of expensive items they aren’t helpful or supportive and send generic emails to placate you. There are other sites out there where you can speak directly with customer service and care so my advice would be choose one of those before this company.","title":"Beware no payment and no refund for goods","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-14","author":"XYANG","text":"If I can I’ll give it no star! It’s not bad, it’s awfully bad. To high commission for the service they provide. I sold several things under 1k and they’ll pay you, but when I sold my Chanel Bag of 4K they wining about my ID doesn’t match and let me wait for weeks with the most bullshi* and still waiting for my money. I delete all my stuff from selling at this 💩  site.","title":"They don’t deserve any stars","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-14","author":"Jane","text":"No payment?\n\nToday the 21\/12\nStill no payment received or transfered from Vestiare Collective.\nI hVe ko outstanding orders with them.\nI even said ost week that they could transfer the amount now minis What they thought I owed them until they had time to look into the case and then transfer that small amount later on.\nBut no reply even if I tried to reach oit to them more them 3 times since last week.\n\nI made a sale of my Chanel bag.\nSaid on my profile that payment would be processed on the 9\/12 or next working day.\nBut the system still just says payment processing here today it’s the 14\/12\nI have over the years sold 94 items","title":"No payment?","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-14","author":"Valeria Valebu","text":"Minus 5 stars would be the right rating. we will sue them. we sold a valentino monicker down coat through them. they sent a shipping label and that it’s good for ups, dhl etc. we could choose. shipping label was not accepted. so we got a new one. not accepted anywhere. then we paid the shipping ourselves to get the coat from Germany to vestiaire in USA and informed vestiaire about it. sent them the actual shipping label and informed them that the item has been shipped and is on the way. . they never answered, the coat arrived at vestiaire and yestrrday I received a message my sale was cancelled because item has not arrived. the item was not returned to me.  at this point my lawyer is taking over and we will sue them for the loss. this is fraud!! we are talking about a 2200 USD coat! plus shipping expenses of EUR 90.","title":"after receiving my item sale was canceled. item  not returned, no payout.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-15","author":"Silvia Martin","text":"Update: Vestiaire claims that the more local you buy the less you pay, but I'm being charged the same even if buying from my own country or from across Europe.\n\nI have had mixed experiences with VC and their customer support, but what prompted me to leave a negative review is the latest changes in commissions and shipping fees, which are just chaotic and in complete disregard of their customers' trust. An increase of the Direct Shipping fee from 0 to 8 EUR and then to 13 EUR, in a matter of days, is simply astounding and it has made me want to drop all of my wishlist.","title":"Reckless changes in fees","stars":2,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-15","author":"JS","text":"I'm the seller, the buyer informs me that the package - sent 5 December - hasn't arrived.\n\nOne would assume solving this was straightforward but one would be wrong: Vestiaire is refusing to perform their legal obligation, invoking senseless bureaucracy before they even 'open an investigation':\n* Photo id from me - the seller - Why? Hermes only requires the Buyer's photo id to collect the package. \n* photo or screenshot of the text message confirming I sent the package. Why? Hermes shows the package in transit - there's no question that it was sent - and Hermes do not require the text message, they only need the tracking number created at receipt - which Vestiaire already has and which shows up with my item.\n* paper receipt as proof of sending - why? Hermes shows the package in transit, Vestiaire is Hermes' customer, they have all the tracking details showing the parcel is delayed and they have the buyer's details. What on earth do they need the paper receipt for (although I provided it, it's meaningless).\n\nIt is truly pathetic that Vestiaire is unwilling, unable or both to resolve a lost parcel issue that they are responsible for. It is a complete and utter waste of time dealing with them: roadblocks, bureaucracy and customer reps that takes 24 hours to respond only to demonstrate they haven't understood the issue nor Vestiaire's contractual obligations.","title":"Bureaucracy instead of Tracking Lost Package","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-15","author":"larisa parjol","text":"I have several issues with Vestiaire, I keep getting emails to confirm the availability of my items, when I try to do so, as instructed logging into my account and then clicking on the link, I get sent to buyer seller chat, there is no way to confirm the availability. The replies from customer service are ridiculous, like I need to clear my cache (the link points to the wrong direction) and clearly the customer support has no idea what they are doing or how the website works, nor do they want to deal with it. So the items disappear, I can't even tell the item numbers because they have vanished without a trace, hours of work undone. Apart from this being a gross violation of GDPR as on the app I hand over all my personal data and can't opt out of tracking!\n\nThen direct shipping, when it started I was worried about buyers with buyer remorse damaging items and reached out to customer service (at that point in time it still was there, rudimentary) I got told I need to take a picture of the item with the shipping label, I have done this, back and front, yet twice I got a damaged item back \"customer service\" has not even asked me, the last time the item (the one I sent out was new with tags and undamaged and I have pictures with the label) came back stinking of perfume and body odour, clearly worn then deliberately damaged to return. I contacted \"customer service\" and only get replies back that the buyer reported a problem and supplied pictures, well the buyer damaged it, I have pictures how I sent it out and they were not ever requested or looked at. To get a new item back that has been damaged is horrific, to then suffer from an asthma attack because the \"buyer\" or \"person who borrows\" doused it in perfume is actually endangering my health and safety!","title":"I have several issues with Vestiaire","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-15","author":"Eva Sakellaridi","text":"VC sucks !!! Increasing the shipping fee from 0 to 8 and then 13 euros??? Outrageous !!!! I deleted all my wishlist. And their customer support sucks !!!! They dont even know how to respond !!!","title":"VC sucks !!","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-16","author":"Chloe","text":"Shocking! I am in the UK and purchased a bag from a UK Seller. At the time of purchase I opted for verification - what they don't tell you at any point is that verification is in France! Come shipping time I have a call from DHL telling me I need to pay £24 customs fee. \n\nI contacted Vestiaire and their customer service repeated line is atrocious - 'as you did not pay it at the time of purchase you need to pay it now' completely ignoring the fact that at no time in checkout do they tell you that opting for verification results in an additional customs fee. At no point when I purchased this item did they say that it would be shipped to France from the UK and then shipped back to me in the UK and so I would have to pay taxes to receive it. Even when selecting authentication it does not say that this authentication is in France. This is very misleading and fraudulent selling.\n\nOn contacting customer services it is clear they do not actually read what you are saying, simply rote repeat back to you a script. It's shocking that they don't care to actually read what you are saying and just repeat the same line over and over again.\n\nSo I have been left with an additional cost that at no point did they tell me about, despite on other trustpilot reviews saying they are refunding the customs fee as it was an error on their part.","title":"Shocking","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-16","author":"Chloe","text":"Shocking! I am in the UK and purchased a bag from a UK Seller. At the time of purchase I opted for verification - what they don't tell you at any point is that verification is in France! Come shipping time I have a call from DHL telling me I need to pay £24 customs fee. \n\nI contacted Vestiaire and their customer service repeated line is atrocious - 'as you did not pay it at the time of purchase you need to pay it now' completely ignoring the fact that at no time in checkout do they tell you that opting for verification results in an additional customs fee. At no point when I purchased this item did they say that it would be shipped to France from the UK and then shipped back to me in the UK and so I would have to pay taxes to receive it. Even when selecting authentication it does not say that this authentication is in France. This is very misleading and fraudulent selling.\n\nOn contacting customer services it is clear they do not actually read what you are saying, simply rote repeat back to you a script. It's shocking that they don't care to actually read what you are saying and just repeat the same line over and over again.\n\nSo I have been left with an additional cost that at no point did they tell me about, despite on other trustpilot reviews saying they are refunding the customs fee as it was an error on their part.\n\nEdit: as you can see from their response, they are ignoring the issue here which is that they don’t notify you that verification means sending the item to France","title":"Shocking","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-16","author":"Carl Whittaker","text":"Bought 2 items from this website one of the items never shipped waiting for refund and the customer service is appalling you can't speak to anyone purchased another item been 8 days still not received the item that's down to Hermes also dreadful service can't contact anyone there either won't be purchasing anything from vestaire collective again and certainly won't be using Hermes","title":"Bought 2 items from this website one of…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-17","author":"Marianna Molchanova","text":"Horrible selling experience! It used to be good but now it is a waste of time. This website turned into a nightmare. communication is so poor. takes ages to discuss the issue, all promises to solve the problem dissolve in the air, chat can disappear on its own. they cancel sales and never ask buyers if they still want it, they do not relist the item they cancel event if you ask. you ship the item and it still in a week time tells you to ship it. Technically it is the worst.... customer care is horrible as well. They also delisted my item without letting me know - YSL broche","title":"Horrible selling experience","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-17","author":"happyness","text":"Do not trust this company! I brought a designer watch that \"had some wear\". The leather strap was very worn but I thought ok i can sort that. I tried it on and it was lovely and put it away for a christmas party (today). The watch strap split in two when i put it on! I've never worn the bl00dy thing. I have sent them pictures but its been over 72hours since i received it so basically tough! I'm fuming. the watch strap is split in two and i have worn it once. the chat option is useless and they refuse to refund me despite a authenticity test and making sure its in good condition absolute con artists","title":"Do not trust this company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-17","author":"Liisa","text":"I am very very worried because because Vestiaire C. is now wanting photo of ID card even when they should pay you. Everybody knows that ID card has information which gives opportunity to fraud.","title":"I am very very worried because because…","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-17","author":"JS","text":"See my previous report and their reply: Vestiaire is refusing to investigate a lost parcel, hiding behind bureaucracy and in their Trust Pilot reply making claims that aren't supported by the facts. \n\nThey claim the information they request is required by Hermes but this is incorrect: both the buyer and I have initiated cases with Hermes to find the package - NONE of the things Vestiaire asks for have been requested.\n\nVestiaire Collective refuses to deal with the problem rather does everything to avoid finding a solution. The customer's goodwill is continually abused, case workers don't familiarise themselves with previous correspondence, emails contain gobbledygook mish-mash sentences.\n\nA truly horrific company to have to deal with when things go wrong.","title":"Lost Parcel, Vestiaire Blatently Refuses to Act","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-17","author":"Studio Rozengracht","text":"First of all: let me introduce myself, I've been a pre-loved fashion fan for at least 2 decades. I've been buying pre loved (designers) fashion everywhere I went: Milan, Paris, Berlin, London, Amsterdam. I've been a client of Vestiaire Collective since 2014 and bought many of my favourite items there. Just a few weeks ago I decided to start selling myself and tried to list 5 items. Only 1 got accepted. The other 4 got refused several times, even though I have made clear images, close ups of the labels, described every inch and measured everything that needs measuring etc. I wrote to the customer service and got instructions to list my items again, but they get refused every time again, due to so called: 'not being able to verify the items'. Believe me, all the items I tried to list are genuine and I have a very strong impression the Vestiaire verifying team is either computerised or completely ignorant\/clueless of what they're dealing with. Vestiaire claims to stimulate 'fashion recycling' but instead they make it impossible to do. I will never buy again from Vestiaire and after reading dozens of 1 star reviews I'm finally convinced I'm not the only one who experienced this problem. Bye bye Vestiaire,","title":"Clueless verification team","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"},{"date":"2021-12-18","author":"Anne McRae","text":"I am in the UK and my jacket was sold to a buyer in France. I received aDHL shipping label from VC and sent it. A week later the buyer wrote to say that DHL had contacted her to come and get the jacket in a depot miles from her home. She couldn’t go. I told VC via their help chat line but nothing has happened. Almost 3 months have gone by but I have not been paid nor has the jacket been returned. I have written 3 emails to VC, all accepted by them and promising a reply, but I have no reply. I sold another item recently but cancelled the sale. How can you trust them.","title":"I haven’t been paid!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=29&stars=1&stars=2&stars=3"}]