[{"date":"2021-04-20","author":"Tina","text":"Do NOT send your item via direct shipping!!! I have sold my item via direct shipping and after 72 hours received an email saying that the buyer has not flagged any problems and that is happy with my item. I went to check on the app where it said “item accepted”, “payment scheduled for 20th of April”. I was happy everything went well and waited for my payment. BUT, TODAY 96 hours AFTER the delivery and 24 hours after yesterdays email in which says the buyer is HAPPY with my item and did not flag ANY PROBLEMS, I received an email saying the item is NOT COMPLIANT AND THE SALE IS CANCELED!!!!! TODAY, 96 HOURS after the delivery and after saying the item has been accepted and after I was waiting for the payment. This is absolutely insane and shocking!!!!! I contacted support via chat but again NO HELP AT ALL. How in the world can a buyer flag problems AFTER 72 hours and how can they cancel the sale without ANY EXPLANATION?!??\nThis is ridiculous. I want my money RIGHT AWAY!!!","title":"HORRIBLE!! PLEASE READ!!! DO NOT SEND ANYTHING VIA DIRECT SHIPPING!!!!","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-21","author":"Livs","text":"NO EXISTENCE customer service!!! I received a faulty items wanted a refund, thousands of reasons not to give my refund money back!! I even pay for quality control check, unfortunately the expert team is not competent to check!!! Remember VC customers when taking high commissions they are very good at it! When sellers or buters have trouble the will just ignore us even block my email than I have to send to their other emails. Terrible experience!!!","title":"NO EXISTENCE customer service!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-21","author":"Customer","text":"Customer services have no idea what’s going on with UK customers post Brexit. If you are in the UK buyer, purchasing from a UK seller, you have to pay for your items to be sent to France and return to UK. If you can shop elsewhere I’d strongly advise you do","title":"UK customers Beware!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-21","author":"Martine Lawley","text":"Sandales spartiates en cuir Valentino Garavani (11497533)\n\nVC have done it....   again!\n\nI bought a pair of sandals, BRAND NEW but sadly it was a size 39IT and I needed a size 39FR.\n\nSo evidently, as they were much too big for me I put them up for sale on Vestiaire Collective.\n\nI did sell them and I have now received a notification from VC to say that :\n- the leather is marked\n- Worn out material\n\nThe joke of it!    unless someone at VC has actually worn them.    Which happened to a Vivienne Westwood dress I sold via VC - it was also unworn and brand new and a size too small for me..  so evidently I had not worn it.\nIt was returned to be smelling of perfume, cigarette smoke and the inside of the white cotton lined bodice had rusty brown smears...   \n\nWho are they kidding!\n\nI have not even bothered (this time) to open a 'chat' or email them as I have done in the past as you just cannot get a fair and impartial hearing.\n\nWith VC, you are never ever right and never vindicated..\n\nI am leaving the items I have already uploaded to the site but I need to do upload more..  it will be on another site.\n\nI am really sad and disappointed as this site COULD be amazing..\n🙄😢","title":"Sandales spartiates en cuir Valentino…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-21","author":"Simon Schnieders","text":"I ordered a leather jacket which took two months sat in shipping and then to discover it was returned to the sender (I assume they hadn't paid enough postage). Further I was told in order to receive my jacket I'd need to update my address (to exactly the same address I had originally). They then followed up and said the jacket was being resold and I'd be refunded but could purchase the item again... what a complete joke. Stay well away.","title":"Stay well away","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-21","author":"Del Thomas","text":"Just been notified that my shoes are 'No longer available', after three weeks of waiting and questioning where are they.  I had a gut feeling this would happen and it did.  All the reviews here that question the dodgy practices of this website are true and valid.  The staff are rude and unhelpful and they lie like helI.  I suspect that in cases like these, the items come in, staff take a liking to it and offer a counter price to the seller, or say it never arrived as in my case.  I've instructed them to delete my account.   Never again will I shop there.  Take my advice, shop on The RealReal.  It's faster, half the price, (even with added customs charges), it's top quality and, the staff are wonderful.  Now let's see if I do get my refund.","title":"DODGY AF!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-22","author":"Anna Backman","text":"My first order has been a giant mishap. It was not delivered and returned to sender (this has been tracked through the different postal services used). I was not notified of this at all, by anyone. \nAs I had already paid, my money and the item ordered is now GONE. I call this theft. Vestiaire Collective is not trustworthy. I honestly will not dare use it again. \nWhich is sad as there aren’t any other equally good alternatives, yet...","title":"My first order has been a giant mishap","stars":2,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-22","author":"Vin_t","text":"It was nice at the start, but when I have sold Ralph Lauren boots in time of Brexit in January all went wrong. They said they did not received it , but I have sent them proof of postage and in end of April I still wait my refund which was promised in February. Unhelpful customer service and pain to deal with all extra fees\/taxes after Brexit. Also very high commission. But I had problem only with one item out of 9 that was sold.I have also bought some items there, but last item was a bit crap, but I was only offered to relist this item with no commission.Also If someone someone sent you offer and you accept it, it's not binding.Customer service is pain to deal with,\nthat takes ages and you need to raise issue again, even if it was not solved.Still waiting refund on shoes lost in transit after 4 month! Last reply today was thank you for your patience we working as much we can, such a virtual bubble. Agree with other reviews about customer service and that items are being lost and you can't get your money back and that commissions are so high that some items not worth reselling.","title":"It was nice at the start","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-22","author":"Lucca Waes","text":"I sent a dress (this month) according with all of Vestiare Collectives terms&conditions . I have proof of sending, everything! I followed all steps to drop the package off at the DHL point. However, the sending confirmation was never even registered by VC. Therefore, VC cancelled the sale after 7 days saying i didn't send it. It resulted in the buyer getting the item and at the same time not paying for it! I have lost my item, time and money. According to VC's terms, an 'individual seller' does not have to accept returns. I will not accept a return, because I will not be held responsible for this mistake by VC and their courier. I request a full refund. I am not happy with the customer service putting all the blame on me, when i have followed all VC's procedures with care. Do not ever shop or sell with this company.","title":"NEVER AGAIN","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-23","author":"Mateusz Woch","text":"Worst experience ever! I ordered shoes in January, Vesiaire in France didn't put my full address and the parcel could not be delivered and went back to the sender.\nThe worst thing is that after the first delivery attempt I contacted Vestiaire to update my address with the courier as they will try again tomorrow. Vestiaire did not do it and the parcel went back to them (sender).\n\nAfter emailing back and forth with them for 3 MONTHS, asking to re-send the parcel with the correct address, which was confirmed by me immediately after the first delivery attempt, they never took action to re-send the parcel.\n\nOffered me a refund, which I declined, as the shoes were a gift and I really wanted them, regardless of when they will come.\n\nYesterday (4,5 month after the purchase!) they advised me they will need open an investigation with the courier of where the parcel is. I confirmed I want the item and don't want a refund multiple times. \n\nToday I received a refund to my PayPal out of nowhere.\n\nWorst company ever. You deal with people in the Philippines who just use copy & paste email scripts. No human interaction at all! Not mentioning the lack of solving simplest delivery problems.\n\nNever had such a bad experience with a company.\nAnd this company re-sells luxurious goods.\n\nIncomprehensible! I'm disgusted.\n\nThanks for ruining my Mrs B-Day gift.","title":"Worst experience ever!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-24","author":"Tammy Huynh","text":"I recently sold an item through Vestiare. They provided the prepaid postage label and used Courier Please provider. The drop-off point was 60 minutes walk away back and forth from where I live; I decided to walk my dog there while the weather is good. I carried a big parcel to the drop-off point, which is the nearest 7-Eleven.\n\nI dropped the item off the drop-point they suggested and scanned the barcode on the prepaid label they provided, but it wouldn't recognise it. I asked for assistance from the 7-Eleven worker, and I did what he said, but the barcode is invalid. I scanned it again and again, more than ten times, still no good.\n\nIt suddenly rained when I got back, and luckily I always have a small umbrella with me, but it wasn't big enough for me, my dog, and the parcel. We both got wet because I don't want to wet the parcel with the item in it. I got home, wrote to Vestiare about what happened, and asked them to use a different postage service like Australia Post or DHL.\n\nThis is what they wrote to me \"I hope you're having a nice day.\n\nI am coming back to you on behalf of my colleague whom you have spoken to earlier today on chat. I am pleased to know that you have recently sold your Burberry cashmere scarf under reference n. 15556752. Please allow me to assist you with your concern regarding the shipping label.\n\nI regretfully inform you that we are unable to provide a different shipping label, as these are automatically generated in the system. You can, however, use your own preferred courier at your own expense. Please make sure to include the reference number of your item on the package should you decide to do this. Upon checking, you still have 6 days to send this article to our warehouse in Hong Kong.\n\nI would like to apologize for the inconveniences and disappointment this may cause, and we thank you for your kind patience and understanding.\n\nPlease have a lovely weekend and stay safe.\n\nKind Regards,\nKat for Vestiaire Collective\"\n\n\n The assistant couldn't assist me, so she sent an email to the expert team, and they pretty much told me there's nothing they can do about it. The buyer was lovely, so I didn't want her to wait, so I considered posting the item at my own cost, but how would Vestiare track that it is delivered and make payment to me? They already took the payment from the buyer, and if the item is not marked as delivered with the prepaid label they sent, I will be out of pocket.\n\nI also bought an item, and after the 8th day, the seller still didn't send the item, so I escalated to Paypal. I am so glad that I used Paypal to buy this item on Vestiare because Vestiare doesn't know why they can't issue the refund. I purchased two other items and waiting to be received, so hopefully, there is no issue with these ones.\n\nIt was a terrible experience buying and selling with Vestiare so far; I regretted paying for a 3-month subscription.","title":"A terrible experience buying and selling with Vestiare as an Australian","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-24","author":"Sam","text":"VC gives Trusted Seller badge to sellers which is really good. HOWEVER what’s not good is that any items you sell under 1000 Euros will now be sent directly to the buyer. \n\nThe only reason I used VC despite their EXTREMELY HIGH commission fee is because when you used to sell an item it will go directly to their head office. Their team will authenticate the item THEN they will post to the seller. This protects sellers because it means the buyer can’t lie and say they received a fake item, damaged item or incorrect item etc. \n\nWith Direct Buyer sellers still pay 35% commission but VC don’t want to authenticate items before sending to buyers. They are lazy because they want to cut their costs and work. \n\nWhat’s worse is that I raised my concerns to VC and asked what would happen if the buyer lied. I was told the ‘Expert Team’ would investigate the matter?!? What does that even mean lol! You as a seller have already sent your item. But you’re not going to get paid for weeks whilst the team investigates. Think of the stress and anxiety they are putting you through. \n\nI was also told the buyer can send the item back to VC for authentication?!! What good is authentication AFTER the buyer has already touched it? They can replace with a fake item, they can damage it on purpose to get their money back, they can say they received something else.\n\nVC has lost its customer service for sellers and I won’t be taking the risks for hundreds of pounds. Shame.","title":"Deleted my account because of Direct Buyer shipping","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-26","author":"NT","text":"I have been an expert seller here for some years. It has become unbearable to sell on this platform- once I finally receive payments for my sold items (if I ever do!) I will delete my account. It’s decent if you are a buyer. However as a seller it’s awful. Platforms like the Real Real and Vinted are far superior because they take accountability when things go wrong, they issue buyer protection, and customer service is prompt and accessible- plus there is no fee to list!\nHere are the problems with VC:\n#1. The worst part is getting paid or getting a refund. 8\/10 times, the shipping carrier they provide is incompetent: the package is ‘lost’ in transit or cannot be delivered after contacting UPS numerous times! This often goes on for several months. During that time you have to wait. VC takes no responsibility for the loss of a shipped item. They do not update you or notify you if your package is delivered. VC customer service is nonexistent. You are forced to use a “chat” service to ask for help or claim a problem has arisen, and they often will claim that they “don’t have the necessary clearance to give additional information”. Then you must wait within 48 hrs for an email. This email ‘update’ will never arrive. \n#2. If you are lucky enough to have your package delivered to a buyer (and have remained patient during a 2+ week limbo period where the buyer forgets to pick it up + 72 hrs where the buyer can claim there’s a ‘problem’), you may or may not receive your money! You are lucky if you receive an email! In that case you have to go back to a chat room and ask them what’s going on! And most of the time they don’t know!\n\n#3 As a Seller, you are penalized and your ranking\/visibility on the site is deducted if you don’t ship within 1-2 days. Sometimes life happens- but if you send just one package later than 48hrs, you are penalized. But if the buyer takes 3 weeks to pick up said package, there are no repercussions.\n#4 Commission: Some items are not worth listing. If the item is 20€ , you make less than 5€. They take huge cuts, and you can’t communicate that with buyers. And you basically get no customer service for that commission rate. So you feel perpetually scammed.\n#5 Listing: They want all the photos on a white backdrop. Fine. But often it depends on the day or the person reviewing your submission that allows something to be uploaded. I have submitted the same item with the same photos only days apart after having it rejected the first time, and the second time it is accepted and put on the site. They can arbitrarily reject your submission for a million different reasons: they claim the price you set is too high, the photos are not good enough, or they give no explanation at all. In the meantime all the work you put into that submission is erased and lost, and you must start again. \n\nOverall it’s a frustrating, unjust and honestly an incompetent platform. I have sold on Poshmark, Depop, Mercari, Vinted, etc and this platform is enormously more flawed than the rest. They are making bundles doing nothing and treating secondhand sellers like trash. I have even heard many people who have purchased designer items for thousands of dollars finding out (after taking the item into the designer headquarters for review) that they have been scammed and the items are not authentic - this is after the item was “reviewed” and “verified by our ‘team’” as VC loves to claim with unwarranted authority. Would like to know who their ‘Team’ is comprised of. They seem to be as unreliable and ditzy as they come. \n\nMy advice would be to only buy here if you are looking for something very specific and are already familiar with a brand so that you know what is real. The RealReal should be your first stop before VC. Even so, don’t hold expectations that you will receive your package! Otherwise beware!","title":"I am an ‘Expert Seller’-BEWARE: No Customer Service, No Accountability","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-26","author":"Spring Lo","text":"Me and my friend are uploading like 20 items the recent 1 week but 100% of them got refused even:\n\n1. with purchase proof uploaded (I swear the items are all authentic)\n2. with very high res and clear photos\n3. many others are selling the same thing on VC\n\nWhen you ask their CS no matter live chat or email, \"what else I should provide\", they only say your product did not meet their criteria.  Me and my friend's items are mainly Chanel's and we are doing great in selling Chanel in other channels, just VC seeming wants to stop us from using their channel by refusing to communicate.  It's so frustrating that their CS always refused to find out the true answer for you.\n\nFor example when I have already uploaded an invoice, their CS still answered me \"you need to upload an invoice\".  When I said I have already included invoice, is that a joke you said I have not upload?  They said: oh then your item did not meet our requirement.  I asked what requirement, then forwarded me some robotic model answer.  Feeling like I was talking to the air.\n\nI believe mutual understanding and communication is needed for working out things efficiently.  However VC is just refusing to communicate and only send over robotic replies.","title":"Uploaded Listings got 100% refused","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-26","author":"Gina Mcmahon","text":"KEEP AWAY, this site is unprofessional and one to be wary of for lying and subverting. \n\nThree times I tried to buy something and three times the item I am buying has some issue at their end and I have had to fight for my money back.\n\nThe first time I bought something I waited and waited and finally texted - you cannot speak to anyone only text... it was apparently a fraud so they did not send it. After me chasing my refund I finally got it.\n\nThe second time I bought something (a dress) and not cheap Vestiare told me that the dress had been taken back by the owner even though the negotiations were done with the owner and myself. I am still fighting for all my money back. Vestiare has been wasting my time with endless back and fro messages telling me there was something not right in my personal details so that is why all my money has not been returned. Vestiare then informed me - I have to delete the app and then reinstate and fill in all my details again - they had my details for only part payment??? I did this and still nothing... Then my messages were escalated to who knows where and I have to explain the story again and I get a \"sorry for the inconvenience\" - I still have NOT got all my money back. \n\nThe third time and will be the very last, I bought another dress - while the \"second time dress debacle\" was going on. Why? I am not sure I still believed they were a reputable company??? They had sent me a 20$ voucher for my trouble but it did not work and I could not use it anyway. After negotiating with the owner of the number 2 item I was buying, a dress we came to an agreeable price. The owner was an \"expert seller\" and had sold quite a few items so I trusted the seller but the message I got from Vestiare after 2 weeks of waiting and inquiring as to why my dress was not sent, I was informed by Vestiare that, I had not accepted the negotiations and that is why they have not sent me the dress and after I explained this was NOT the case (many text messages taking place)  they said to me that there was an issue with the item and I will get a refund. I am still waiting for my total refund. Hopefully, PayPal will sort this out.\nMy advice - Keep away from the site!!!","title":"KEEP AWAY","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-26","author":"chickda","text":"My opinion  from here was removed!!!!!! I was complaining about VS not paying me for my 3 sold items. And about poor customer service. And that EU has to have some kind of regulations for customer protections in case of not completing agreements. \nI have sent MY items to people from VS site directly. So what ever is left after paying VS's commissions I expect to get on my account, even if it's 1 euro!\nHow strange is that , so what now ...??\nWhy it was removed ? It says : the possibility it was very suspicious or I did not have enough evidences??? \nI posted all tree ref's numbers of my sold items which were not paid, I have everything as I took pictures of my conversations online with customer service and stored all emails to them and what ever few I have got from them . \nAs a result, today I have received email from customer service with some \"copy past\" pictures of \"screen shuts\" or something of \"prove\" saying that we were trying to pay but your bank bounce the check. :))) since December ? and the other two times? And you don't have to come to me saying that? \nAnd why then my bank did not bounce other two checks in between , where the payment was maid???\n The \"prove\" they sent to me is only for two sold items and does not look to me as a bank transaction. \nFor the third sold item they just write a comment that the bank bounce the check ... Where is the copy of transaction or number or anything I can take to my bank? But I am going to the bank with that e-mail, and hopefully that \"prove\" will mean something to my bank and I will happily update this post . IF they don't remove it again\nMy ref numbers are 130698565,13610605,13074226","title":"My opinion  from here was removed!!!!!","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-26","author":"Brooke Carnes","text":"Under Spring Deals all of my prices were changed automatically without my permission. 5 of my items were sold for prices I haven’t approved of. I couldn’t sell for those prices as they were too low and it was a great hassle to relist all my items again and was very annoying to loose sales because of the high commission that VC takes. I asked for a higher commission for these 5 sales as it wasn’t my fault that the prices were changed, no one got back to me. I lost sales of a total 20.000DKK After I spoke to a woman Laura D she offered me a extra 150€ for selling the item 14943864. She said I would automatically get the amount for the bag, but needed to ask for the 150€ extra after sales, which I did. Many different people from VC have said that the money would be in my bank after 5 working days. That I had to wait, be patient ect. So annoying when I really knew it would never be transferred. I been talking back and forth to many different people and now I am told I can’t get that money, which I have no idea why? So it was never transferred as promised. Laura D promised me a higher commission for that item and I am still waiting for it. \n\nThen there was a promo code that was offered weekend30 I went to use that some weeks ago, when that was on and it didn’t work. I asked customer service and they couldn’t help me. They said it was for the first 1000 people that used it, but it was 10am and the promo code just came on so I KNOW 10000 people haven’t used it yet. I kept getting a message saying it didn’t work for my country. Which means that the code had come into my push messages by mistake. This code was to use when you spent the amount of 250€ and then you would get 30€ off your order. So it wasn’t like a free offer, I was buying something for a good amount. How can this happen?\n\nBack when they promised money to list 5 items and you would get a promo code, that too was a hassle to get. Even though it was promised to go directly into my VC account after listing 5 items I had to write back and forth for days to get that. \n\nWhy is there so many mistakes? It seems like scam after scam. \n\nI really want my 150€ that was promised!","title":"VC owe me 150€","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-27","author":"Alex ","text":"Unfortunately, the site has so much potential but fails on two main points - authentication and customer service. After reporting a seller for selling counterfeit shirts (these are evidently counterfeit by the product images) - the same shirt multiple times even, I’ve fallen down a customer service rabbit hole where something is always promised to be done, but realistically nothing is. The items remain on sale and continue to get sold to unsuspecting customers. It’s such a shame because I’ve loved buying items on there, but am worried their authentication service just isn’t up to scratch.","title":"Counterfeit goods","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-27","author":"Eetu Pasanen","text":"Bought a Burberry jacket and got a one-layer shirt that you wear under a suit\/blazer. I can barely fit a long-slevee t-shirt under it. Never buying again, after spending 1000€+ in the past year.","title":"Bought a Burberry jacket and got a shirt","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"},{"date":"2021-04-27","author":"D.","text":"I feel scammed.\nI bought a sweater on this website that turned out to be to small and I used the option of putting it up for sale again. A buyer received my items 3 weeks ago, but although the item was in a good condition (I literally held it for 5 minutes and then put in the bag), the buyer opened a claim because of some alleged dirty spot. 3 weeks the website claims to have been investigating this claim and the customer support refuses to give me a deadline for receiving my payment. Seems like I just send someone a free item for 60 euros.\n\nNEVER will buy or sell anything on there ever again.","title":"I feel scammed.","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=62&stars=1&stars=2&stars=3"}]