[{"date":"2021-07-29","author":"James Flaherty","text":"My experience with Vestiaire was nothing but frustrating from the very beginning. I ordered an item, and the seller never shipped it. It’s unclear to me why a second hand business doesn’t get the item first before selling it (like The Real Real does) and instead relies on a random person to send it AFTER I’ve already paid my money. \n\nAfter the seller never shipped the item, I requested a refund. During this process I was told varying time periods that it would take to get my refund. Also during this process Vestiaire STOPPED using their customer support email address! I followed up because I STILL don’t have my money back and was surprised to get a reply that the email was no longer valid and I had to use a chat feature. \n\nSo I use the chat feature, and of course, it’s a robot that offers nothing helpful at all. Eventually a real person does join the chat but does not understand that I’m asking for a refund and instead tells me to submit my bank information for payments as if I was a seller. \n\nI bought my item 3 weeks ago, and I have no item and no refund, still. \n\nThe level of unprofessionalism and incompetence from this company is staggering. They can enjoy speaking to the fraud department at my bank.","title":"Worst experience in years","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-07-29","author":"Monica Jimenez","text":"Same issue that other reviewers had. Sold my LV bag and despite app saying that I would get paid on the 24th July. Still haven’t received any money ( escalate it through an expert). I’ve received a reply saying that the payment didn’t go through and they will schedule for the 5th August. Why do I have to wait for a PayPal payment? This is a joke. Not to mention how frustrated is talking through an automated service first every single time I try to speak to a representative.","title":"Payment not received after a sell","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-07-30","author":"Eva","text":"My experience couldn't be worse. I registered on VC, bought an item and wrote the seller from France a polite thank you note for selling the item, in French, by the way, and after that VC banned me from chatting with the seller. I found another piece I wanted to buy but they didn't ship anything to Estonia. I wanted to write that maybe they could ship the item to another EU country where my friends live and they could send me the parcel but I fund out that I had been banned FOR NOTHIG fro chatting with ANYBODY on VC. Then I sent VC two messages asking I was banned although I hadn't violated their terms and conditions and got an email just saying that if I was banned from the chat I had violated their terms and  conditions, \nHow? By registering on the site, buying an article and writing the buyer a thank you note? \nI've bought things from multiple websites and never experienced anything like that... \nVC should not be trusted at all. Buy from Farfetch, Net-a-Porter, from anywhere but not from VC.","title":"My experience couldn't be worse","stars":1,"location":"EE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-07-30","author":"E","text":"When listing my item I was told that I was going to receive a certain amount of money from my sale, after my sale they payed me less than what I should have had. They blamed it all on my bank, saying that they took fees and stuff but my bank did not receive the full amount in the first place. Selling a bag for almost 2000€ euros you should not have to expect to get a smaller payout than what they said from the beginning. Total joke. What a crappy way to earn money huh.","title":"Payed me less than what they were supposed to!!!","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-07-30","author":"SerenLee","text":"I liked so much Vestaire Collective , but lately a quality of workers is sooo bad! I sold item , took picture with nice paper and bag and WROTE VERY CLEAR IN DESCRIPTION DELIVERED WITH BOX AND DUSTBAG! and not with the paper bag and paper. They checked my item and cancelled my sale because missing accessories ( paper and paper bag!!!) No LOGICA ANYMORE THERE.\nAlso my friend sold a lv pouch bought from LV boutique and they senden it back because the couldn’t authenticated it and she was aked to pay 12€! for workers that couldn’t do they job!","title":"Very disappointed  with Vestaire Collective lately","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-07-30","author":"Stacey","text":"I sold an item. Vestiaire sent me a DHL shipping label that is not valid. I have been trying to reach Vestiaire customer service for the last 3 days and have wasted hours of my time.  Vestiaire no longer have any telephone numbers where a representative can be reached. I chatted with a representative who lied to me yesterday and said they were going to sort out my problem.  They did nothing.  I am shocked at the level of customer service.  I have asked them for compensation for my time wasted.  I want people to know how unreliable they are.   They also did not send me any of the customs forms I need to send the item from the UK to France.  I do not recommend selling with Vestiaire.","title":"Terrible Customer Service - Do not sell with them","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-07-31","author":"Mrs Gabeva","text":"It not even worth the time that is being wasted on dealing with VC. I am just hoping that by sharing experiences- unfortunately negative - I can help other users not be scammed as well.\nAnd as it is an EU company finally some measures will be taken against their continuous malpractices , that thankfully can be easily proven. Throughout  the years i have had some negative experiences with them, shared some of them and read a lot of “horror” stories from other users (things that should not be happening in 21st. Century in europe) . I was thinking - OMG, thanks God  things did not get that bad with me. The truth is that sooner or later their plague catches you. Now i can say that i have experienced every single ridiculousness that this company has to offer. From misplaced items, items showing not shipped on time despite of being shipped completely on time, perfect high fashion items being rejected to list (while at the same time some users are selling Birkins at 500 eur each and direct shipping, and these same users are granted expert sellers badges, what a joke; numerous comments from users and not a sign from VC taking care of the issue), games with the status bars, games with the badges - illogically given or taken, differnece in announced commissions, differences in amounts that have to be paid and are actually paid, countless attempts to actually have a conversation with bots, numerous attempts to get resolutions turning to the so called Customer service, not being paid, not  getting refunds. Tons of wasted time and money lost. Mistakes after mistakes. Nobody is perfect but in my case every single mistake was done by them. Which actually makes me super mad. Because i am ready to pay for my own mistakes if any but not ready to be mistreated and take losses for mistakes’s of others. The worst is that none of those mistakes have been fixed. Always in business something unexpected can happen. Important thing is to handle it and fix it. Unfortunately the pattern of VC is just the opposite- they just never own up to their own wrong-doings or handle them. Almost looks that all this is done intentionally, like an internal company policy or something. They just ignore and make fun of you.  And the more they mess up, the more they deflect. And this is totally degrading. One cannot feel safe selling or buying because the whole process simply depends on the current mood of some unskilled employee, the possibility of an “unfixable” glitch in their computer system and total unwillingness and abscence of desire on behalf of the CS to take care of a wrongful situation. Which screams only one thing - this is a pattern and they simply do not care. There is no consistency in the whole process, the only sure thing is that sooner or later you will get scammed, and then again and again. These are not isolated incidents. These are repeatable patterns.  They can give as many polite copy\/paste answers here but the truth is that actually nothing is ever handled. They would give their “sincere apologies” and declare promises, but in reality problems are not being taken care of. They just deepen. They have been ignored and swiped under the carpet. And VC relies on the fact that being the biggest platform for such services in Europe people will turn a blind eye and will keep doing business with them. And i have done the same in the past, so many times. But by doing this, I realized that i was only helping them develop that endless spiderwebs of lies and scams masked behind that brilliant idea of creating and maintaining such a platform. The idea is genious, i totally admire it. The execution - super close to zero. More and more people are sharing negative repeatable experience and this should be raising red flags. If that was the feedback i was getting for my own company, despite the profits rocketing, i would be slapping my face and rolling my sleeves to really dig deep and fine the roots of all Problems and fix them. But this is only if you care about your customers. Otherwise - you just remain tone deaf and keep piling up your profits. Well, it is what it is. I only know that no scam can continue forever, i just hope\nIn the meantime not too many people get hurt by this notorious company.\nUpdate to the latest reply: VC please stop! I know how the system works, obviously. I have sold more than 420 items. What are you exactly explaing? This inadequate answer below shows only that you do not even read the comments which explain the exact issues. Looks like your bots just randomly pick and use one of your templates for answers and publishes it. Just to imitate some concern and activity.Really very low from your side. You do not fix issues and you do not want to be aware of them. All the negative comments are unfortunately real problems, you do not offer solutions and it only shows how pathetic you are.really","title":"A summary of the pattern of continuous malpractices","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-08-02","author":"Maz","text":"I purchased a Gucci bag from them about a month ago. It was in the \"we love\" section, I have used them multiple times, I thought I was safe. They have a team that supposedly checks the items, in fact you pay extra for it. \nI received the bag, its fake. And not questionably so, the leather isn't real, the hardware isn't silver or gold its some sort of in-between. I have a few Gucci bags, I know for a fact its not real. \nI contacted them and what began was an entire debacle that has ended with them completely ignoring me. \nI pushed back and said I would like this bag to be reviewed again, as is their policy. They initially said no you will just have to relist it for a low commission then another agent got back to me and said ok its fine send it back. I mailed it in, wrapped up in a particulate way so I would know if its even opened. \nI hear nothing for over a week, when I inquire I heard back \"The item matched the sellers' description, the bag is being mailed back\"\nThis is very telling, they aren't confirming that its real, just that the seller described it properly....all users of VC, BEWARE OF THIS FINE PRINT. \nI was angry, and said no its fake. He said well we are sorry its coming back to you. Then I got another email...actually no we can relist it for you, please use the code in the order to relist it. I said huh? Ok how? \nThen I get ANOTHER email-oh ok actually sorry its on the way back to you. But don't worry! You can send it back to us again and we will review it a third time. \nBy this point its pretty clear they are disorganised. \nI receive it back to my house again and its still wrapped, exactly as I had it, it has not been looked at again, but they said it was checked and a team member decided it was in fact real. \nHow could they know? They didn't even look at it before shipping it back to me. \nMy last comm was we will let you know about releasing your funds for a refund. \nI emailed AGAIN and asked to speak to a manager and was told by Ashley that she would get back to me in 24 hours. That was 3 days ago. I have emailed twice since to ask about shipping it back and for a general update. I am being ignored.\nI paid for the verification, I am a premium member, doesn't matter. You will get what you get and they are in the business of turning a blind eye to fake items., \n\nDON'T SHOP WITH VESTIAIRE.","title":"Horrific Experience -FAKE bag","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-08-02","author":"Ws Yap","text":"So I've sold an item 17237725 which I had sent in to VC head quarters for authentication. It is not a common brand and of course VC so-called experts are not competent enough to do their job so they had asked me to send in proof invoice. \n\nLuckily I did have the online invoice which I emailed through. Lo and behold, 2 days later they requested for an invoice AGAIN. What a joke. \n\nI used to be able to chat with an online agent. However their customer service team are now nothing but bots to cut costs. So essentially they can contact you if they can't do what customers are paying them commission to do. But if you want to get in touch with them regarding a sale, good luck!!!!","title":"Absolutely baffling and take your commission but don't do their jobs!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-08-02","author":"Anon","text":"Non-existent customer service. The staff is only promising and assuring to no avail. It's bizarre that a company that takes such a huge commission is not there for you when you need help. What is that big commission for then? It's unbelievable that a company like this is operating. Trying to get a label for 2 weeks, being promised that in 24 hours it's going to be working. If you can, look elsewhere. This is not worth your time, effort and money.","title":"Non-existent customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-08-02","author":"Daniela Bogoeva","text":"Don’t sell and buy there! They said that they will give me answer within 3 days , cause I wanted second checks for my item , cause is authentic and they said that is not. It s passed more days and nothing  , they stop to answer in the chat also. People, be careful! They will cheat you!!!","title":"Don’t sell and buy there","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-08-02","author":"..","text":"I bought a bag through them and payed for the quality check. The bag was listed as never used, however, when I received it it had marks on all four corners, a small dent in the front and a dent in one of the corners. The dent on the one corner was visible in one photo, but was way worse in person.\nAfter contacting them repeatedly with photos and descriptions I ended to being able to send it back twice for a “extra check” however their quality team just replied that all marks were shows in the listing. This was simply untrue, but after using a large amount of hours (10+) and realizing they were never going to accept a return or give me a discount I gave up.\n\nI was also disappointed with the authentication process. I was expecting some sort of card with the name and model + guaranty that it was authentic, however all you receive is a tag (like the one you get on new clothes) saying that it is quality checked and a stamp with name of the person and date.\nRef: 15372461","title":"Not quality checked","stars":1,"location":"NO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-08-02","author":"Talia","text":"Bought an item on vestiaire purposely choosing a UK seller to avoid the customs that comes with overseas orders post-Brexit. There was no option to have direct shipping and no option to pay any duties. The website merely states an item goes to the nearest authentication centre and there is no mention where this is or that all UK orders are shipped to France!!!\n\nI've ended up with almost £200 in fees, due to a conscious lack of transparency. How come when you purchase a lower price item from the same UK seller it shows UK duties but a more expensive item, it isn't show. I believe this is a clear method to be dubious and will not be purchasing from Vestiaire again. \n\nAlso the first time I bought, the dress had been 'checked' but was covered in very obvious black stains. Horrendous all round.","title":"Bought an item on vestiaire purposely…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-08-02","author":"Abi Rose","text":"I have now raised my issue with SIX customer support assistants who have been zero help.\n\nDespite providing proof that the item is fake (after the team “authenticated” the item) I carried on receiving emails lying to me saying they have been checked and they are real.\n\nAll you have to do is type the barcode into google that is on the side of the box and a fake Chinese resale site comes up. The dust bags provided in the box are two different sizes and the packaging isn’t branded. The shoes are obviously very good fakes but the fact the “authentication” team failed to notice the details I picked up on straight away is worrying. I have lost complete faith and trust in your company.\n\nI will be reporting to trading standards AND the action fraud police here in the U.K. It is ILLEGAL to sell fake goods and pass them off as real.\n\nAs stated in the U.K. law “If you buy something that isn’t as described, or isn’t satisfactory quality, you have statutory rights. This means you should be entitled to a refund or an exchange of goods”\n\nSo I suggest a full refund is processed for my order.\n\nThe fact I have proof they are fake and yet you are still trying to tell me they are real is disgusting. I will never be shopping with you again.\n\nNot to mention your customer support staff are rude and unhelpful.","title":"DO NOT BUY - THEY SELL FAKES","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-08-02","author":"Marie Bigorie","text":"I received a message from Vestiaire Collective quality control saying the hanger for the Hugo Boss suit I sold was missing. In the message there's a photo of a hanger that is not the hanger that I put in the box.\nI shipped the original Hugo Boss hanger that came with the suit and is seen in the photos. The hanger does not have anything that can be detached like the one in the QC photo, you can compare and see the texture and curves are different, and the original doesn't have a \"tip\" where the metal meets the plastic like the one in the QC photo.\nI'd like to know why Vestiaire Collective Quality Control is saying the hanger is missing and adding photos of a completely different hanger.\nI've sold many things on Vestiaire Collective with no issues, and I'm worried that Quality Controle can make something up like this.\n\nI never received an answer to my emails and questions. The item was flagged for a bogus reason, the hanger from the photos was included in the box and quality control flagged it with a photo from a different hanger that I’ve never seen before and couldn’t have been in the box, with no further explanation. After asking support for clarification I never received an answer. And I lost this sale because of Vestiaire. The buyer told me he didn’t mind if there was any issue with the hanger, and I submitted the conversation to support as well, but for some reason I was notified today the item is being sent back to me still with no further explanation. I don’t know if the buyer was contacted, if they rejected the purchase because Vestiaire took so long. This has completely damaged my trust in Vestiaire, what happened to my hanger? I still don’t know. I don’t trust anymore that I can ship high quality items without quality control making it up that the item wasn’t there or something. This is really worrisome.","title":"This is really worrisome","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-08-02","author":"Ben Lamy","text":"Terrible experience. First of all I bought a silk tie only to be told that the seller had already sold this. I received a refund but you cannot sell products online which you don't have.\n\nThen, even worse, I bought two pair of shorts - one of which is in a worse condition than agreed - and afterwards realised that I have been charged a fixed customs duties fee even though these items individually are below the customs duty threshold (and are being shipped separately and directly). At the same time, they don't want to provide a refund even though the UK consumer regulations gives 14 days for online purchases (and this includes second hand when bought through a private business). They can't have it both ways. \n\nThis is the worst company to deal with. The customer service is extremely poor, and they just want to make their money and make your life miserable. \n\nI look forward to going back to Ebay.","title":"Worst experience - avoid at all cost","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-08-02","author":"Helen Sloan","text":"I was mis-sold an item. I purchase a pair of Hermes Oran sandals brand new with original box. What arrived was a dirty inauthentic box with a pair of real sandals in. I wanted to return them because it didn’t come with original packaging and they deemed because the sandals were real then it was complaint and my job to now resell them. I will never get back the money I paid because it was never what I bought. No packaging = lower sale = a huge loss in money for me. No respect for buyers at all. I will never ever buy from this sham company again.","title":"Fake packaging seems to be acceptable","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-08-03","author":"Daniela Bogoeva","text":"Hello, Can somebody can give me adress to some french institution, where to make a report to Vestiare Collective\n\nAbout Vestiare answer- this is absolutely big lie , i asked hundred times for second checked and first you lied about the days answering, then somebody said is not ready another said that again the check is providing that is not authentic and the end i paid money to return my item back and i lost money and it is interesting how you will make second check when the item has to travelling to me?\n\nIf somebody wants to contact with me my viber phone is 00359898262999","title":"Hello","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-08-03","author":"Nour","text":"Awful experience, they claimed they issued me a refund , and i haven't received my money . Bought a bag that was falsely advertised , the authentication team said it doesn't match description and I can cancel the order and get a full refund . I chose to cancel and get my money back . It has a been a week since and I have been chasing my money as I haven't received my refund in the time frame they gave me , the support team are useless and come back with different answers claiming they made the refund and I should check with my bank . I checked with my bank and the payment has not been made .\nIf I Don't receive my money I will have to report them to the europol , the eurpean consumer center the police and esclate the matter,  It is clearly a fraud and the same bag  has since been relisted and sold to someone else and I haven't received my refund yet.","title":"Awful experience not refunding my money","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"},{"date":"2021-08-03","author":"Audrey","text":"I have asked Vestiaire to unsubscribe me from the bombardment of emails numerous times. They don’t and the spam keeps coming. I’ve deleted the app and still they come. I’ve never hated a company more, an absolute shambles to sell with and buying isn’t much better. Vestiaire do me a favour and please leave me alone!!!!","title":"I have asked Vestiaire to unsubscribe…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=51&stars=1&stars=2&stars=3"}]