[{"date":"2021-12-30","author":"Anonymous","text":"I sold an expensive bag on December 11th.  Shipped to VC on the 12th.  FedEx delivered the 13th (even tho their system claims the 14th).  It has been well over the 6 days VC is supposed to clear and send the item to buyer.  I even emailed the purchase receipt for the item I sold, in the hope it would expedite the process.  I've been very patient considering holidays\/COVID.  NO ONE from VC has contacted me about any delays.  I have no product, nor money to show for the sale.  I've contacted \"customer service\" multiple times, with no answers and instead the run-around.  If I am not paid soon, I will be escalating this issue to the proper authorities.\n\nUPDATE: It was only after this post that I got my sold item processed and finally received payment.  It took over 3 weeks, with no updates or communication from VC.  This is unacceptable.  Sellers are held to a standard to ship their items within a specified time frame.  In theory, so is VC, until they don't and you have no way to follow-up because they have horrible customer service.","title":"Sold Item, No Payment","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2021-12-31","author":"Ays","text":"I have sold balenciaga triple s sneakers at VC. I have sold more than 10 triple s sneakers so I know their authenticity criterias and I know my shoes that they are bought from their own stores. My last balenciaga sneakers were found non compliant. I wrote to VC because at the same week I sold balenciaga track sneakers that are found authentic. I wrote them 2 sneakers were bought from same store, how this can be happen. It is really weird. They told me to send them the receipt. I found my receipt and sent them by email. But the sneakers are found non authentic again. It is really difficult to understand, I don't know how I can prove it. Please VC, I want them to be checked by an expert.","title":"My balenciaga triple s found non authentic although I have receipt","stars":1,"location":"TR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2021-12-31","author":"Julia","text":"Bought a Saint Laurent Lou bag which was pictured with an authenticity card. \n\nPaid for it to have an authenticity check at Vestiaire, and it passed, super.\n\nThe item arrives and the authenticity card has a COMPLETELY DIFFERENT BAG LISTED ON IT!\n\nI contact Vestiaire and they request I send the item back for a second authenticity check. I do.\n\nToday I receive an email to say it has passed once more and has been relisted on my account, what? Even though the authenticity card is completely incorrect?! \n\nThis makes no sense to me.\n\nUpdate, 4th January: I've received an email offering me a 10% voucher off a max. purchase of 300 GBP. I don't want a voucher, I want a REFUND. I don't want the bag relisted on my account for somebody else to be essentially scammed and for Vestiaire to profit off the ADDED COMMISSION!, and I don't want it shipped back to me, it's DODGY. I want my hard-earned money back!\n\nUpdate, 27th January: Earlier in the month Vestiaire eventually agreed to refund me after much back-and-fourth with a customer service department that could be compared to conversing with a broken robot, but by that point I had already disputed the charge with American Express, and had my money rightfully returned to me. \n\nThey say in their email the item will be “exceptionally relisted under Vestiaire Collective”… right, so somebody else will have the exact same problem. \n\nHaving £600 stuck in limbo has caused me so much stress. I’m happy this is over and would never advise anybody ever purchases from this company.","title":"Never Again!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2021-12-31","author":"Marina Milojkovic","text":"The customer service is a joke. I have spoken to at least 6 different people, everyone says different things, some leave in the middle of the chat. Everyone promises to get back to me, no one is.\nIts horrible and you get 0 help. Why even bother with customer service.","title":"Worst customer service on earth","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2021-12-31","author":"RX","text":"DO NOT BUY\/SELL on Vestiaire Collective.  I sold my item Ref. 18871106 on 10\/30\/21. VC emailed me and I sent the item to the Buyer 11\/1\/21 using the address provided to me from VC. On VCs website I notified them that the package had been sent and provided the USPS Tracking No. I contacted the Buyer on 11\/9\/21 to let them know their package was on it's way. For some unknown reason from the date the package was picked up at the P.O. 11\/1\/21 it was held in NJ for 8 days.  I received another email that the item had been Authenticated. The buyer did not receive the package until 11\/10\/21. I asked VC when would I receive payment.  They told me after they rec'd confirmation from the Buyer, I would receive payment, but I should wait to hear from them. They contacted the Buyer who said they had no problems with the item. The next email said that payment had been triggered and to expect any day. After waiting several days, I contacted VC again to find out the status of payment. They said the Buyer had cancelled the order and had been refunded the money owed to me. I have sent attachments of my usps tracking receipts, copies of emails from Customer Service, chats conversations. They have not sent me back my Balenciaga Boots worth $400 to me. Nor paid me because the Buyer decided to keep the boots.  All I've gotten from VC is they are working on returning the item to me or getting back the refund they sent to the Buyer. I don't care what they do, all I want is either payment for my sale; or return my merchandise to me.\nI wish I had known there were so many complaints against this consignment site. I will NEVER use them again, and I advise you to go elsewhere. You'll never be compensated!!!!","title":"DO NOT BUY\/SELL on Vestiaire…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2021-12-31","author":"Tatiana Neves","text":"Bought an dior addict bag on march 2021. On december when trying to re-sell it because i don’t use it, discover that it’s fake. I’ve paid 1200€!!!!! VC is playing with people money. Totally unacceptable. \nVC doesn’t even care about it, the customer service is so bad that I can’t even describe. \nI was a good costumer, until now. \nDon’t buy on VC.","title":"Fake bag on VC and lost 1200€","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-01-03","author":"Gerry Pantz","text":"I have had the worst experience in this site 3 times and I am done!!! The REAL REAL, The Luxury Closet are far more better, cheaper and nicer to deal with. On vestiaire vestiaire I made 3 attempts to purchase shoes they took my money 3 times and after 2 weeks just when I thought I was getting them delivered (same shoes) they would cancel the order and refund me but made money on the actual checking of item 3 times and will not refund even though they say it was a technical fault. Terrible!!! TERRIBLE!!! They deduct also over $100 in fees on each item. I have never dealt with such crooks! Please be careful!!!! They give you a tracking number and then cancel the order! Absolute waste of time. The staff was extremely unhelpful and rude! Check out the orders below. It has happened with everything I have ordered! Time to move on.","title":"PLEASE DONT THINK ABOUT PURCHASING FROM THIS SITE!","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-01-03","author":"Hristina","text":"Dear Vestiare Collective,\nBoth parcels discussed in the previous review are missing since 10th of November and I have informed both you and the carrier immediately. \nHow come the second parcel \"litigation\" whatever you imply with that is started first on 28th of December?\nDHL has came to conclusion, they are dissapeared, so no further investigation on the items location is performed by them since 10th of December. \nHave you started an insurance claim and is this what you imply with \"litigation\"?Normally, as insurance goes, you must first reimburse me and then seek DHL compensation for your losses.\nI want to know a deadline by which this will happen. Please, include this in your next reply, because anything else of your internal affairs is of a little interest to me.","title":"I need answers","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-01-03","author":"Camilla Nivaro","text":"The service is the worst I’ve ever experienced. I could get a valid number for pick up at the post Office for my Christmas gift from my husband. I’ve been in contact, on chat only with Vestiaire close to ten times without any helpful information. Was as the post Office four times because they insisted on a wrong identifikation number. I even tried calling their french courrier Chronopost who only spoke french and could help either. It’s was a Chanel Cap for a thoussand euro. They should sell highend when they have so low end service. They are just not worthy handling brands like that.","title":"The service is the worst I’ve ever…be","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-01-03","author":"Kai","text":"they constantly want you to lower your prices, write you mails that they will not display your clothes, unless you put a high discount on it – just to cut 30% from your sale. exactly my humour.","title":"they constantly want you to lower your…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-01-03","author":"angela kankam","text":"Bought a bag 5th of December  ,still awaiting delivery , now I have been asked to write a letter to say neither myself nor my neighbours did not receive the parcel, I have asked for my money back they are still claiming I need to send in all sorts of things to prove I have not received the item.Dont buy from them, a bunch of scammers.","title":"Bought a bag 5th of December  ,still…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-01-03","author":"Sophia","text":"Do not purchase!! Selling fake as authenticated items! I wasted £1000 on a fake bag","title":"Selling fake items","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-01-04","author":"Yuzhen Wang","text":"I have been a loyal customer of this website but I have found out that they're recently selling fake items. I have bought a Chanel brooch, which has the wrong mark on the back - G19K compared to A19A, I have emailed them for return but they went through the process and told me that the items were authentic. I would like some explanations of their authentication process and I want my money back.","title":"Recent disappointments of purchase experiences","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-01-04","author":"Boglárka Pataki","text":"Increasing the shipping that much will totally kill my selling as I'm not selling so expensive product and none will buy them if the shipping is 50% of the price... even when I'm selling within my country the shipping fee is same as in Europe.\nDoes anyone know similar platforms to sell where shipping is organized?","title":"Shipping fees","stars":1,"location":"HU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-01-04","author":"Kattis Axelsson","text":"Here VC answered me - but you cant answer them ANYWHERE - cant be reached- no email,phonenumer or anything!!\nMy itemnuber is 18206515 and i want you to send it back to me! Give med here your email!! \nYou have all my information on the salenumber!\nThis Will be a policerapport in few days -","title":"I want you to send my CHANEL timeless back to me!! I send it for two weeks ago- you Said it was sold - but No","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-01-04","author":"Sophia Lee","text":"Here are my 2 items number.\n19410263,18943187\nPlease send me back as soon as possible!","title":"Here are my 2 items number.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-01-04","author":"Felix Cane","text":"They expect their customers to make screenshots of the email communication, since the exchanged emails with the customer service are not saved anywhere, not even for registered users.\nThe cs agents unprofessional tone on my question how to prove I contacted them within the timeframe for complaints, having even received a green \"sent notification\", if their website does not give evidence of the email communication, was: \"By making a screenshot for example\". What a joke.","title":"Not trustworthy","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-01-04","author":"Cathryn ","text":"Worst customer service I have EVER received - customer support staff are predominantly incompetent and do not understand anything that is being asked. I recently purchased an item that arrived and was a totally different colour to the photographs. Despite 'checking' the item twice they refused a refund and have relisted the item for sale. I will loose my original (extortionate) shipping and authentication costs along with the cost that they are charging me for the re sale. Money making con artists..! I have been buying from them for nearly 10 years and will never buy from their site again. Please avoid.","title":"Worst customer service I have EVER…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-01-04","author":"Slv90","text":"I received a obvious counterfeit (No RFID in a modern Fendi bag) despite paying for authenticity checks. Turns out their authenticity checks don’t actually check authenticity and just check the product quality.\n\nI explained how the item was counterfiet, including taking photos. I was asked to return the item within 7 days, and they’d get back to me within 5 days. It took them 2 weeks to get back to me.\n\nInstead of providing a refund,they’ve relisted the counterfeit item for sale on my account. If\/when the item sells they will give me the sale price minus their 15% of fees and postage. So I won’t get the full amount back, or potentially anything back if it doesn’t sell.\n\nThis means they make 2 sets of fees, one from my purchase and anither from the resale. While I loose my authenticity check money, the bag, plus a minimum of 15% of the product value in fees. I am also being forced into selling a counterfeit item under my account (which is illegal).\n\nI’ve asked for a full report from their authenticity check but all I get told is: ‘They have concluded that the item meets the standards of the brand‘ and they checked ‘Leather, stitching and finishes, metal parts.’ These checks mean absolutely nothing, checking the ‘standard of the bag’ is very different from checking its authenticity. Many counterfeits are made to a high standard, with real leather, good stitching and high quality trims. So the only way to check their authenticity is to check the RFID, serial numbers, or labels— which they don’t do. \n\nAlso worth noting that at no point have they told me that they found the item to be genuine. Despite selling it as an ‘authenticity check’ they’ll only confirm the ‘quality’ of the item to me and refuse to provide details on any checks related to labels, serial number, and receipts.","title":"Fake item— Refused refund but they’ve kept the item","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-01-04","author":"Jane","text":"Should have received money almost a month ago.\nI have contacted VCs customer service more that 12 times now but they only reply when I make a post here on trustpilot and they only reply ones but with no resolution at all only that they will look into it. \nNow I made a sale over 1 month ago and still no money or any help or solution from VC.\nI an low loosing my home because the VC will not pay out my money?\nI have made 94 sale trough VC","title":"No payment, no help or solution from VC","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=26&stars=1&stars=2&stars=3"}]