[{"date":"2021-01-03","author":"MRS LENA RHODES","text":"I have sold successfully from within the UK & just sold another item but was unable to download the shipping label. I was told that this was an external problem....\n\nUpon further ‘communications’ with a buyer for my item I have just been informed that they will not deal with anyone from the UK due to ‘Brexit’ ......I have a screen shot of the message for evidence. \n\nWhat a shame that this company has made this decision.... yet they will continue business with many countries outside of the EU!","title":"I have sold successfully from within…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-04","author":"Lat","text":"Such a shame I have to write a negative review.\nBought an item on 26th November. Seller shipped the item, but it appears to be lost in the post. Not necessarily VC's fault, but they spent weeks lying to me about it, blaming it on COVID delivery, saying it was on its way when they could see it wasn't. Now they've stopped responding to my emails. Had to message the seller for the tracking number of the parcel to see that it should have been delivered on 3rd December and for her to confirm it was lost. VC should have just accepted it was lost, communicated that to me and issued a refund. Will have to go through my bank for a refund now. Was so looking forward to receiving the bag. Poor customer service.","title":"Such a shame I have to write a negative…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-04","author":"Juliet","text":"I made my first purchase on Vestiaire in mid Novemer (Celine Tote £200+) with high hopes for a positive experience. Firstly, I received no notification that the carrier had attempted to deliver my order. Vestiaire then failed to follow-up with the carrier, so the bag was returned and on its way back to Vestiaire has allegedly has 'gone missing'. I have repeatedly asked Vestiaire for help. Three weeks later on I have been refused a refund and they are being unaccountable. Apparently I should start litigation with the carrier. Vestiaire gave me a very short deadline to complete the necessary forms - even though it was their lack of follow up that created a three week delay - and have since not acknowledged receipt of the forms or any follow up in time with the carrier. So as things stand, they have taken my money and delivered me nothing except stress. I feel robbed.","title":"Took my money and have delivered nothing except stress","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-04","author":"F Abo","text":"Vestiaire are not sending the correct documentation for UK  sellers, so when an item is sold and you try to send it to a DHL Collection Point, you get told Proforma forms are necessary. Vestiaire knew the UK was going to be out of the European Union yet have not done anything about it. \n\nVestiaire is still providing DHL labels to UK sellers, but not the necessary documentation i.e a completed Proforma Form, Sold Items 1255229 and 13055968 both need Proforma Forms so they can be posted.\n\nUpdate your system to ensure that UK Sellers get the DHL Label or UPS Label plus the necessary Proforma Forms. \n\nI have had to spend over 1 hour  on their Chat System as they do not have a phone line, a complete waste of my time. They also do not respond to Twitter or emails so sold items are impossible to post!\n\nI will be updating this review. In the meantime send the 2 proforma forms for the items sold! It should not take weeks!\n\nUPDATE - Customer Services have  sent  a Proforma Form that has Consignee as Vestiaire Collective HK Ltd & Hong Kong Address. Is this the correct form for items being sent from the UK to FRANCE?. Can you send the correct Proforma Forms so  12552293 & 13055968 can be sent.\n\nI have spent so much of my time trying to get the correct Proforma Forms, for goodness sake can you be more organised, you knew UK would be leaving the EU, the correct Proforma form should automatically be sent out with labels for any items sold in the UK being sent to you in France. \n\nYour Customer Services are not proactive they are just sending out forms, they do not even check to see if they are the correct ones!!!!","title":"Provide Proforma Forms with you Labels for Sold Items!!!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-04","author":"Calypso Cragg","text":"DO NOT USE THIS APP!! Everything is controlled, from the comments you are allowed to leave, to the items you are able to list. Above that, the actual way the app works is really weird, and insufficient. You can only send things off using UPS, and the way everything is laid out is very unhelpful and unclear. Overall a rubbish app that needs to go!!","title":"DO NOT USE THIS APP!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-05","author":"Natasha walker","text":"I bought 2 items , the money has been out of my account for 9 days, then Im told one is not as described, the other no longer available , how can it be no longer available when you’ve bought it ? \nMassively disappointed and a lot of time wasted .\nThis was my first time using this site, I won’t be going back, it’s a scam . Also don’t reply to e mails","title":"A huge waste of time","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-05","author":"Emily Barry","text":"20pc import \"tariff\" on items being shipped into the UK?  Vestiaire clearly don't watch the news.  I also have not been paid for a sold item, despite chasing (and they cleverly change their \"support\" email address frequently to make it almost impossible to get a response).  Brilliant selection of products, but appalling customer service in what is becoming a crowded market place.  They were the only ones offering this service, but no longer.","title":"Just dreadful.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-05","author":"VR","text":"My order 31904238 has been missing since end November and VC still makes excuses to avoid refunding me . After closing their phone lines they have now closed their chat so you can only wait and hope for email replies . After confirming an investigation was open they are now asking for a written declaration from me that I have not received the order , before they can open an investigation! They have a tracking that proves the order is not delivered, they don’t need a copy of my ID , the tracking number and my order number , they have all that already. These are illegal practices!","title":"My order 31904238 has been missing…","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-05","author":"Bruno Velloso","text":"I have sent a jacket to VC and they have returned stating that there were no buttons. I have placed the buttons together with the jacket just like in the photos and they lost it!!! My jacket cannot be worn or sold again bc of their mistake. I had to talk more than 6 times with their support team over the chat function. They told me I should send the jacket back and they would transfer me the money once they have received the jacket. I complied and sent the item. Now they have my item on their warehouse and they do not want to pay me like they said they would on their email! They state that they will put it online to sell and only after it is sold they will transfer me the money. They have tricked me into sending the item to them and now they want to try to sell a jacket WITHOUT BUTTONS due to their mistake. They have lied and I’m still waiting for my money!!! They have shown me pictures of the jacket being reviewed. However you cannot see the buttons box there and they state I haven’t sent it. Who on earth wouldn’t send it?! Anyways. When they returned me my item they also returned the beautiful letter I write to all my buyers. And guess what, that letter is also not on the pictures although it was delivered and sent back. If their pictures couldn’t photograph a DIN A5 letter (with neon corners) they also could have left the buttons out. When their returned me the item, they just put it on a paper bag, no silk paper like I did, not sturdy package like I did. They put my expensive item in a simple paper envelope that got squished during shipment and squeezed into my mailbox. My piece could have been damaged!!!\nThey tell you to wait 3 days all the time and that they will transfer the case to their “experts”. Everyone is called experts but they don’t seem to do their job!","title":"They don’t pay! DON’T TRUST THEM!","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-05","author":"christian ","text":"WILL NEVER USE AGAIN !! i purchased a prada jacket from vestiaire on 18th december and wanted to make sure it was real so paid the extra to have it authenticated , the seller sent the jacket on 20\/12 but to this date it has still not arrived at Vestiaires warehouse , i used the chat function to find out where my item was and was told that if it  hadnt arrived in their warehouse 15 days after my order had been mad i would be refunded ...THAT WAS 19 DAYS AGO !!! when i have then tried to find out where my refund is ive been told in order for them to look into it i have to send a handwritten letter with ID stating that ive not received the jacket but its not me who has not received it its them !! I have screenshots of them saying that refunds are automatically given after 15 days but this is obviously a lie!! i wish id seen all the bad reviews on here before id bought because i wouldnt have ,ive now paid for a jacket that hasnt arrived with them and they wont refund me ABSOLUTE CUSTOMER SERVICE NIGHTMARE","title":"WILL NEVER USE AGAIN !","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-05","author":"KG","text":"The majority of my experiences here have been awful. I was sold a counterfeit bag. I had it authenticated by a third party within 24 hrs of receiving the item who agreed it was fake. Because their “authenticators” think it’s real, they will not give me a refund. However, there are telltale signs of a fake bag with this bag that were not photographed. I also had an order where the checkout screen said one cost when I entered my credit card info but a different, much higher cost was charged to my card. I emailed (no phone number) and was told it could not be canceled even though i noticed less than 1 minute after checking out. The seller didn’t ship until 5 days later. Not good. Stay away.!","title":"Terrible experiences.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-05","author":"irekwest","text":"Don't buy items from Yulia@ylesiya. She states that her items are as good as new, but they are not. They are damaged. She is listed as a trusted seller and is protected by VC... I have made many complaints and have said that I want my money back. I will not pay for a damaged item that i cannot even resell cause I have to tell that it is damaged. Thank you Vestiaire for protecting thieves ...apparently you guys are too!!","title":"selling damaged items by seller and VC protects them","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-06","author":"I.A.","text":"Horrible for buyers and sellers-- they don't allow direct communication (as I guess they don't want sales on other platforms), but this makes it incredibly hard to get the information you need from the seller. Not only this, there commissions are huge--often more than 20%.\n\nThey also cancel sales for no reason.\n\nCustomer service is horrible-- no answers and long waiting times.","title":"Horrible for buyers and sellers-- Greedy and bad service","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-06","author":"JS","text":"I charged over £10 Customs on a £45 purchase, as well as VAT. \nThe UK's guideline is that no Customs is payable on purchases under £135.\nI'm told 'it's because of Brexit' but reading the Government guidelines, this appears to be untrue.\nVAT, yes, but not Customs. \n\nSharp practice again, Vestiaire?","title":"Sharp practice with Customs charges?","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-06","author":"Francis","text":"Very dodgy company that does not respect consumers rights, bullies people to death and does not respect privacy data. Also, everything that you write here goes to the bin, as they right police answers, saying that they will get back to you, but that never happens. I have bought and sold a lot with them over the years, and I can tell that you can list a lot of fakes and they do not spot them. They are available on direct shipping. Besides, a lot of items get lost; client support is rubbish. Finally, today I understood that if you want to get details about your status as trusted, expert seller or activist, you have to download their app, which means that you handle them all your private data for free, as a cake. This is a very dodgy practice, which I will report to UE. Knowing your stats is primary information, which they need to give to you unconditionally, because that is part of their service\/program. It cannot depend on downloading apps and loosing your privacy. Shame on you, VC. This is a way of getting around the protection data policies of EU, which are strict on that. One may choose what cookies to allow. They force you to give it all and more.","title":"Very dodgy company that does not…","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-07","author":"R S","text":"I sold a pair of earrings - VC confirmed reception of my earrings - later said that 'authentication' is a little late because of Christmas\/holidays seasons - BUT a month later, now telling me that they NEVER received the earrings!! REFUSE to pay me!\nI understand now that I am not the only person that this is happened to!!\nI am now contacting a lawyer to sue VC - I am calling for anyone else to come forwards - \nWe will do a class-action lawsuit against them!\nand everybody, please listen, DON'T SELL with them - especially les bijoux!! jewelery!!","title":"I sold a pair of earrings","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-07","author":"D Currie","text":"It's not the first time I have been swindled by VC - today they have claimed that a box was not included and cancelled a sale of hundreds of pounds.  I actually watched as DHL put the whole package and box into a posting bag - and sent off.  Previously, they have returned itmes with suspicious 'stains' on them, that were never there when I sent the item.  DO NOT use this company to sell things, they are fraudulent.","title":"DO NOT USE them, they are fraudulent in claims","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-07","author":"D Currie","text":"This is a terrible, fraudulent company that makes up things that are 'wrong' with your items - stains that appear that were never there, missing boxes that were posted - all ends up being a TERRIBLE experience.  My advice?  DO NOT use these charlatans","title":"Fraudulent and greedy","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-08","author":"Lasairiona Mulligan","text":"I have bought a lot of items recently and was happy enough with the service - cheaper items I would not bother to get authenticated if I liked it fine, but expensive items is another story. I bought what I thought was a designer puffer coat and it was late...  the inspection date for “very good condition” was Dec 8th it arrived at 10pm on the night of the 22nd, I took it out and at first glance it looked great but then I put my hand in the pocket as I tried it in and the whole pocket lining was ripped and the seams on the other was starting  to come away so I thought I’d take a closer look, it was full of water stains (the coat was cream) and lots and lots of pulls\/tear\/rip marks like a cat had clawed at it all over the place (I don’t have a cat). Within 20 mins of getting it I emailed VC to report a problem regarding quality. No reply that night or the next day. \nIn the 24th Christmas Eve I get a reply asking for photos which I sent. Then after Christmas I got a reply saying yes it should be returned- I said how, this is all back and forth emails that takes a day or so to respond. Was told to print off a label they had sent I said I had no printer the post office was closed and I was sick. I was in isolation, they then said to call a coirier and it would be picked up so again as I was in isolation I was t going to be in contact with anyone so I let them know and David said this was ok, contacted them again in January 4th to say I was better and would be posting it back that day, despite multiple emails with David a new person Annette then said sorry too late we won’t accept it and it will automatically be returned to you as it has passed the 7 days from the 22nd.  Multiple emails and online chats have ensued and despite pointing out their delays and the fact it was Christmas and all delivery being delayed and weekends and bank holidays and not being told about the courier till after the data and getting it at night and a pandemic she said tough luck it’s too late do what you want and relist It. I asked her to explain how I pay for a service to get an item checked and they don’t do it and I am left with damaged goods that then I can’t sell as in very good condition how is that fair? \nNo reply just keeps saying you missed the 6 days it’s in the T&Cs.\nI will be contacting my bank to get this refunded and NEVER EVER will I use these people or company again. STAY AWAY","title":"Avoid VC they are cheats and scam artists and abuse both buyer and sellers","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"},{"date":"2021-01-08","author":"lisa forsberg","text":"Used to be good, not anymore\n\nI used to really like buying and selling on VC, but not anymore. It used to be a relaxed place where likeminded people could gather and exchange clothes to good prices, but recently VC has become just a less good version of generic market places like Ebay. \n\nFrom a buyer's perspective, they have added loads of extra very high fees like customs, delivery charges, etc. They also have a fee for curation, but their so-called curation has become a joke: there is no quality control, just a way for them to charge more. It used to be great and quite reliable. \n\nFrom a seller's perspective, they have shortened the time you have to send the item and they penalise you if you don't sell things all the time. For those of us who work and cannot devote ourselves to listing items and responding to questions and price offers full time, this makes VC a much less attractive venue for selling luxury items than other available alternatives. \n\nI used to do a lot of both buying and selling on VC (and did not use other sites like Ebay at all), and I really miss the old, more friendly and personal VC, but have had enough of the new VC and will be buying and selling elsewhere from now on.","title":"Used to be good, now terrible","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=81&stars=1&stars=2&stars=3"}]