[{"date":"2020-11-19","author":"Kamal","text":"The payment of sold items i didnt receive ..","title":"The payment of sold items i didnt…","stars":1,"location":"MY","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-20","author":"J. B. ","text":"I still have not received my order although it says 3-5 days. It is more than a week now and no information has been sent to me.","title":"I still have not received my order…","stars":1,"location":"SI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-20","author":"Luisa","text":"I was away and couldn't respond on the quality of the item I received within the 5 days , direct shipping.\nThe item was washed and shrank a lot reducing very much its Large label size , especially the sleeves.\nSo I am left with a purchase not worthy the description and the price","title":"I was away and couldn't respond on the…","stars":3,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-20","author":"mateusz","text":"The idea is great!\n! You should fix cohesion between app and website.\n! You should add more popular category (eg. we don't have backpacks in category). When I just use search window I had different number of search result depends on \"back pack men\" (2144), \"backpack men\" (2004), \"mens backpack\" (2024) etc. Ridiculous..\n\n! You should give more information for users.\nTried selling a Burberry scarf. The advertisement was rejected without explaining the reason. Then again refuse, this time pointing to too few photos. After my contact (I waited a few days for an answer), the advertisement was simply accepted without confirming whether I still have the item. So it was wrong but you accepted it or you were wrong and refuse without reason? Both ways are wrong.\n\nThat's off the top of my head.","title":"The idea is great! But..","stars":3,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-20","author":"carlotta","text":"I don’t understand if you write in French language... As you sell\/buy all over the world you have to use English language to be understood from all over the world...!!!!","title":"I don’t understand if you write in…","stars":3,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-20","author":"Petra T.","text":"Update: last week I received a dress (Order Ref: 45237017) that went to the VC authentication process and came with a tear on the shoulder and also a detached tag. This is the 3rd time in 2 years that the \"expert authentication\" sent me something clearly faulty. I am starting to doubt if they treat purchases under a certain amount (dress was 100 EUR) nor seriously? Or how come do obvious tears get through this quality check, and then what am I paying for?\n\nOriginal review:\nI have been buying and selling with VC since almost 1 year. So far I have predominantly good experience with the VC team.\nThe customer service (German language one) is extremely fast and very helpful.\n\nIt has happened that I purchased some articles that did not meet the condition the seller advertised online but I could always make a complaint with the VC Team and so far I was always given right amd refund for such purchases.\n\nAs a seller it’s a bit of a bugger that the items must be shipped within 7 days regardless if there is a long weekend or bank holiday included. I do love the direct shipping option as it helps reduce shipping costs, packaging and it thus more environmentally friendly.","title":"Still a satisfied Seller but reliability of Authentication Process got worse","stars":3,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-20","author":"iva","text":"I waited for the delivery too long time and wrote couple of reminders","title":"I waited for the delivery too long time…","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-20","author":"danuta","text":"Last time it was really very bad service,the shoes was very bad condition,i am very sad that this hapen by VC,","title":"Last time it was really very bad…","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-20","author":"Lavinia ","text":"My purchase went smootly and I’m very happy about my new bag. However, when I tried to buy other bags, it wasn’t so nice. Rude seller (i’m being nice), costumer service not very helpfull, and the prices vary everyday and became everyday more expensive or the seller didn’t want to sell for the price advertised with reduction.","title":"My purchase went smootly but..","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-20","author":"AA","text":"More than a month ago I sold my item on Vestiaire Collective, and still today, after so much time passed, i still haven’t received my payment. The customer service is awful and irrelevant to customer’s problems, and all i hear is that the payment was transferred, and it should reach my account soon. But the problem is, that the information in their system changes every week by itself. They send money every Tuesday after the sale is complete. So now I don’t have my bag, and still dont have MY money! They don’t have an e-mail, they don’t have a phone, only chat in their app which is not effective at all! The price for a bag was 1’000 euros, and they keep my money and 0 interest in my problem from their side. So now, you can decide if you want to use this irresponsible service, or is it better to look for something better?","title":"No payment for more than a month","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-20","author":"Mohammed","text":"As a very valued customer that regardless of small issues here and there I still went back because of the collections today is definitely my last day. I negotiated and bought an LV bag from a seller on their web and was super excited. Got charged little over $1800. Within minutes received a confirmation email. I was thrilled, then within a minute received a cancellation email. I tried to contact the seller and customer no answer. Within literally 5 minutes the item was sold to someone else that paid 30 bucks more. Contacted custome serv and said why would you allow the seller to sale me an item charge me \/ pend my payment now and give the item to somone else that offered more after my sale was over. Customer serv said sorry and the seller got away with it and until now my money is pending.. I am beyond pissed at this point. Not fair !","title":"Horrible service never buy from them !!","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-20","author":"KF","text":"My item (which was labelled as an XL) arrived as a size small. Made attempts to contact both the seller and Vestiaire with no apology or success. Will not be purchasing clothes from this site again. Very disappointing.","title":"My item (which was labelled as an XL)…","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-21","author":"Tj","text":"Not happy, my order has been being “prepared” for postage for more than 18 days now, I’m begging to feel like it’s just never going to come. I have contacted them various times just for them to say sorry for the delay and not tell me a predicted postage time or when it’s going to come, beyond mad at this point. I just want my bag to come !!","title":"Not happy","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-21","author":"Ms WINNIE","text":"Updated on 4 Dec 2020\nReceived the refund finally after second check😊 So I revised the rating to  2 stars!\n\nUpdated on 26 Nov 2020\nI received the hoodie today and send it back for second check immediately.  This hoodie was a poor quality replica, not only the crocodile shape, font ‘P’alm Angels and quality were different from the authentic Palm Angels one.  And I found 3 more mismatched area.\n\nI’m now waiting for VC second check.  Hope it will not let their loyal customers disappointed 😔 \n\n\nUpdated on 23 Nov 2020\nI was so surprised that VC had passed the authenticity check in 6 hours and has arranged to send the item to me via DHL.  \n\n20 Nov 2020\nI bought a Palm Angels Hoodies from VC on 17 Nov, Order no 32235032 at HKD1540.89. After a few hour,  I found the bought hoodie pictures have some problems, like poor sewing and shape of the crocodile, the font of the brand name under the crocodile on the hoodie, the tag style.   So I messaged the seller to cancel the trade on the same day, but he replied that the hoodie has sent out already. But he can buy it back.  \n\nThen I contacted VC to cancel the trade and send it back to him, but VC replied that they need to receive the hoodie and check it. I confused that this seller had sold a lot of Palm Angels products on VC and all had passed the authenticity check.  Why VC expert can pass them, they are so fake obviously.   \n\nNOW I hope that VC can make a fair judgement, as the buyer couldn’t see the actual goods before they purchase it , the buyer can only trust VC.  This VC has an authenticity charge to the buyer, they should check the item very carefully before they sent it out!!!  My sister had a bad experience with VC before, she bought a Goyard bag from VC but It has little difference between the actual bag and the posting’s picture after the bag arrived.  She wants to refund but VC said that she can re-post the bag only and she needs to bear the delivery charge and authenticity.\n\nSO I don’t want to waste HK$2xx for the delivery & authenticity.  Please send it back to buyer and DO THE REFUND to me ASAP!\n\n\nLastly, VC still have many suspicious Palm Angels Hoodie post which all come from Italy.  Hope VC can look at them and cancel them.  Honestly, VC claimed that they have authenticity check already, but it’s really waste buyer time! The buyer needs to pay in advance and wait for a 7-10 days for receiving the goods, authenticity check but finally it’s not compliance and wait 5 more days to refund for a obvious fake item.  Hope VC can handle it seriously 😐","title":"FAKE palm angels hoodie","stars":2,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-21","author":"AA","text":"If you want to loose your designer items and not to receive your money- welcome to Vestiaire Collective! All positive reviews are 100% fake! Vestiaire Collective is a trash company of liars who don’t pay sellers for the sold items and lie to buyers!","title":"Trash company","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-21","author":"AA","text":"All reviews have the same issues- sellers haven’t received payments, buyers receive fake stuff, customers service behaves irrelevant. If you are still thinking to become a part of Vestiaire Collective, I recommend you not to risk your time, nervous and money! All good reviews are certainly fake","title":"Don’t deal with them","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-22","author":"Winnifred Antoinette","text":"I have mixed feelings about Vestiare. \nPros: Access to a very wide range of luxury, fashion products from around the world. \nCons: Quality control can be hit\/miss. I have received several items that don't reflect the listing condition (e.g. big scratches on metal hardware not visible in photos, when item is classed as 'VERY GOOD CONIDITION'). VC tries to resolve issues with promo codes (similar to site credit).","title":"I have mixed feelings about Vestiare","stars":3,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-22","author":"Alice Ophelia Annecy Faulkner","text":"App is really poor once you have sold something - multiple functionality flaws","title":"App is really poor once you have sold…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-22","author":"AA","text":"Horrible company! Awful experience! \nLost so much time and nervous on getting my money from the sale, and still waiting! Hopefully i finally get my own money, and will delete my profile forever! Never using this service again and recommend everyone to search for something better! If i only could read reviews before I decided to sell something on Vestiaire Collective! But may it be my biggest mistake in my life! If they earn money in this illegal way, they will never be successful! Shame on these cheap people and their cheap business trash","title":"Horrible company","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"},{"date":"2020-11-23","author":"Gabrielle Bow","text":"THEY WILL CONTACT YOU ONLY TO GIVE YOU FALSE HOPE. Don’t make this mistake as I’m still regretting this a year later. I can’t express this enough. Do not use this company. They’re extremely fraudulent, and have so much money in their pockets because they’re refusing to pay their customers. I sold an item on May 26th 2020, and have never been paid. Not only that, they’ve blamed the transfer on me because they ‘have no access to financial issues”. They’ll continue to send you an email every two weeks, only to say they’re unable to process the payment. So if you’re wanting to give your designer items away for free, this is the company for you!","title":"I can’t express this enough, do not use this company.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=88&stars=1&stars=2&stars=3"}]