[{"date":"2021-10-08","author":"Natalie Ziegler ","text":"No one responds! \n\nI have sold a Cartier watch with Vestiaire and received a message to verify my i.d.\nBecause my passport is in my married name and my bank account in my maiden name they won’t verify me and are holding the money that is owed to me.\n\nI have now sent emails (and messages via Instagram) with proof of my two different names with bank account details, passport and a marriage certificate. Please can someone get back to me ASAP as it’s my money after all! \n\nReference - 18303490\n\nNatalie Bawarchi (Ziegler) London, UK","title":"No one responds and withholding money owed!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-08","author":"Aleksandra Dubrovska","text":"Gucci bag stolen!\nContacted vestiaire collective 2 months already, no help from their side. Chronopost cannot help me  directly since they have “ special contract” with vestiaire collective!\n\nNever ever..","title":"Gucci bag stolen!","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-09","author":"Giogio Zhang","text":"Haven't been paid and it's been a week. It usually happens right away for my past sales. Contacted customer services twice and they claimed to have issued the money for me but still, no update is being shown on the system. Would appreciate if the issue can be solved right away since the team is usually very helpful and efficient.","title":"Haven't been paid and it's been a week","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-09","author":"Michella Malin Petersen","text":"Their customer service team is hopeless. I truly wonder if they all are bots. They struggle to answer the simplest questions, it’s like pulling teeth. I wanted to list a Louis Vuitton bag strap, but couldn’t find a fitting sub-category. I asked in the chat and ended up spending an hour trying to explain my very simple problem to the most obtuse customer service worker I have ever encountered. It’s embarrasing for such a large luxury site to have such an incompetent customer service team, especially with the insane fees they charge for using their site.\n\nEdit: the answer provided here was literally all that I needed and couldn’t get from your customer service representative. And bear in mind that this was far from the only time I have experienced issues!","title":"The worst customer service of all time","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-09","author":"Mrs Gabeva","text":"When you stay in VC long enough, it is inevitable to experience all of their irrational and illogical practices that they have in stock for you. Unfortunately. When you pass the point of being disappointed it is just funny. As i have said previously- expect the worst and VC will not disappoint. So for that reason they do not do so anymore. But it funny and yet another explicit example how completely ignorant the team behind the company is.\nAt the beginning of the summer I listed a pair of brand new Chanel jeans. Being actually slightly thick and from a winter collection (pre-fall 2016) , i decided to take them off as i had a pile of summer pre-loved items which were more logical to sell during summer. So i did so. Now being already fall season, i decided to list the item again as they are much more appropriate to be worn in the upcoming months so the chances of selling increase. Guess what - this time VC refused my listing because from the pictures they “could not verify the authenticity of the item”. Funny😂. First - i used the same pictures that i took in the summer and the same exact description, but now obviously their “expert “ team lost the little expertise that they have left in them and they decided to refuse the listing. \nWhat can i say more - the list of obscenties that VC has to offer is long and broad, and it is just to be expected to get worse, although their constant templates of  “reassurances “ that they are constantly “working on improving “. Guess what - if you are really working on something, you can actually eventually manage. The case with VC is just the opposite. So, guys, buckle up, the worst is yet to come when it comes to VC.\nRef. 18433667","title":"Another illogical pratice","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-10","author":"Nelia Bobko","text":"TERRIBELE service and more terrible customer support. Their people don't do their jobs at all. They ignore, block, dont answer questions, and even if you are lucky to get a reply - you will get a standart phrase that dont give you any info. They dont know how to do authentication of designer items, dont even communicate. \nAs a Seller I would NEVER recommend working with this marketplace. They make you pay money to get your item back through the wire transfer (not PayPal or other NORMAL way of payment). For already a second month I can not get back 4 of my items with total cost for over 1k (!!!) (even though I had to pay $98(!!!) for 4 returns). \nThat is THE WORST platform I worked with and can not wait to get my returns back and END this one way communication with Vestiaire Collective. \nAgain, NEVER WORK with this marketplace.","title":"WORSE than a zero","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-10","author":"ng Miranda","text":"I bought a brand-new item on 9\/9 and received it on 13\/9. I found it has SEVERAL CRACKS even the expert team said all the items will be sent out before checking ! I asked for refund and they said the refund has been proceeded successfully on 28\/9 and will be reflected on my credit card statement within 5 working days. BUT I STILL NOT RECEIVE MY REFUND AFTER NEARLY TWO WEEKS!!!! I contacted the customer service and what they do is told me to wait, wait and wait !!! TOTALLY IRRESPONSIBLE !!!!","title":"IRRESPONSIBLE COMPANY!!","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-10","author":"Vera  Bratanova","text":"Scammers!!! \n\nI listed and item with the description that was literally written on the receipt of the item when I was purchasing it ( I got couple of presents for my family and as I couldn’t go see them and the holiday was over  , I decided to the items) .\nCouple of days after the sale of Vestiare gone through I got a message that the sale was cancelled and they send the item back because “the item do not match the description” . I immediately contacted the support with the photo of the receipt. Of course nobody bothered even to look at it.  They are just a bunch of scammers , who do not know how to authentificate the items and do the job .","title":"Never again. They will scam you","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-11","author":"CS","text":"If I could give 0 I would !!!! They have some really good product on the site but the app is terrible so glitchy I made an offer that was accepted at a different price to the seller than had been made by me and even though it had direct shipping on the ad wouldn’t let me do direct !!! When I tried to get it sorted on their abysmal chat function they kept asking me the same questions over and over and then said someone would email me to sort it out this happened on 3 separate occasions and when I tried to complain again they blocked me from the chat !!!!!!! It’s a shame because their are some good sellers on there and I have spent a lot of money and bought some great stuff but I am deleting my account as the app is terrible to use and the customer service is a joke !!!","title":"If I could give 0 I would !!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-11","author":"AF","text":"Like everyone says, this company has the worst customer service on planet earth. I have had so many issues with them, which really seems that you are speaking to robots. On September 11, I sold Balenciaga belt, direct shipping, item 15817043, posted the item with DHL using the label provided. Two days later, I noticed that the shipping details were not updated on their website and emaild them to say that I had already sent the item, but it was shown as not dispatched yet. The operator said that all was fine. One month later, the item still shows as being on transit and of course that I was not paid. I contacted them and the operator said once again that it was still on transit. I insisted that it could not be possible, as it does not take 30 days to deliver the item. Since then, they ask me to send the proof of postage, which I sent, plus my ID to start the claim process. I did not buy myself the label, it was VC, and even if I had, I am not going to send copy of my ID by email to VC or DHL. This is an abbusive policy and illegal, because commercial companies cannot demand copy of passports or IDs from consumers. only governmental agencies or those who perform related services, such as airline companies can ask this, but the information needs to be encripted and they follow specific procedures and the operators that work in these departments have special certificates, by law. Finally, my role with VC obbliges me to disptach the item within a certain deadline, the delivery service is their responsibility.","title":"Abbusive policy","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-11","author":"Zuñiga Medina Geovani","text":"I just bought a Cartier belt and the received product had a lot of damage and scratches at the buckle that wasn't shown at the photographs. \n\nWorst is that at the revision done at Vestiaire (supposedly comparing with the item description and photos) the 'inspector' approves it.\n\nIs incredible that one item is shown and that you receive another damaged that was approved against the listing.\n\nNEVER BUY FROM VESTIAIRE AGAIN, Please take care and avoid you being part of the fraud that Vestiaire Collective is.","title":"I just bought a Cartier belt and the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-11","author":"Jadwiga","text":"Company is pretending to be reliable and trustworthy, only because of website platform. They pretend, NOT  ARE.\n50 % of shipments, including 100 % of shipments to Great Britain are with problems on supply chain because of different reasons, caused by very bad management of international shipments rules, especially the one that needs custom clearance.\nWhen problem show there is no one competent to understand problem, know whom contact and how solve the problem. As result seller is wasting his time writing notifications about problem on chat ( the only way to contact customer service , each time someone else is involved in the topic ), ask about data several times, but... they do not know how to solve it. Results shipment is delayed or returned back to seller. They do not advice buyer about delay, but in case you want to write something \" wrong\" \/ advise buyer, they block your communication on platform and send warning that is it incorrect...in case it will repeat they will exclude you from platform :-)\nThis company is a joke , pretending to be international seller.","title":"Joke company","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-11","author":"Barbara Shaw","text":"Like many others I would give this site no stars.  They lie, they keep your money and don’t get back to you.  I’m going to post bad reviews in as many places as I can.  DO NOT buy through them or sell through them, they’re rubbish.","title":"Lousy site","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-12","author":"Juste Navagrudskaite","text":"I ordered something and received an empty box.\n\nCustomer service been slow and unhelpfull- avoid at all cost as you get scammed by sellers and Vestiaire does not protect the buyer.","title":"AVOID","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-12","author":"Aleksandra Dubrovska","text":"I send the item and it is lost by the carrier. It’s been 3 months now… No actions are taken by VC support team ..\n\nThe vestiaire collective do not reply to my mails and chats. I receive only automatic replies ( at the moment I received 21 automatic replies for my demands).\n\nI contacted few times Chronopost but they can’t help me since they have special contract with Vestaire collective and only they can update the information on the form. Now the status for my parcel is “anomaly in the address update needed”.\n\nThe form that needs to be submitted on the Vestaire Collective DOES NOT WORK. \nI very disappointed since it was a quite precious item, a Gucci bag. \n\nI removed all the items that I was selling on the VC. I will never ever buy \/ sell  anything on this website. \n\nTheir service can can’t be compared to Vinted service for instance. No consumer support at all. It’s so irresponsible and irrespecful to act like this with their consumers and to try to position itself as premium class service..","title":"I send the Gucci bag and it is lost by the…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-12","author":"K S","text":"1. VC takes 30% commission, yet they give you a hermes shipping label. Not only you have to find your hermes pick-up service (40 min away from me!) and deliver it there, wasting time and money, hermes loses two out of three packages sent. I have a suspicion that they are in cahoots with hermes so that they can cheat both sellers and buyers out of their money. \n2. VC can't really be bother to sort it out, so I am left out of money and out of item, quite an expensive mistake. Instead, I get promises from the support service, that the item \"will be delivered to me\" (!!!!!). \n3. They demand a scan of your ID but refuse to confirm how they deal with this sensitive information. I suspect their staff might be stealing identities of their customers, especially as they just ignore my request of their GDPR policies. Something to report to authorities.\n4. I keep receiving price offers, and as soon as I accept, the buyer disappears, but the information is sent out to all potential buyers. Moreover, VC immediately sends me an email suggesting I lower my price even more. I was offered to lower the price of my £150 item (already heavily discounted, as initially bought for 5 times the price) to £13 - so, gift it to them.\nAdvise? AVOID.","title":"disappointing experience again.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-12","author":"Cherie Hill","text":"This company is a scam! They compromised my debit card, opened a paypal account using my debit card, try ordering several times ($220 increments).  I reported my debit card and reported this to Paypal.  Vestiaire sent me a package via USPS out of Lake Forest, Illinois.....EMPTY! BUYERS BEWARE! They are being reported to the FBI, Better Business Bureau and etc.","title":"This company is a scam","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-12","author":"Elizabeth","text":"I bought a bag from VC on 22 Aug 2021. I thought a WHITE Sylvie bag and asked for an assessment because the bag is a beige color.  Of course when you buy an item there is often import taxes which where included in my overall cost, some $290.\nVC advised me that in their opinion the bag was 'white'. I said ok please return the bag, Ill live with beige as I like the design.\nNext thing I know they have put the bag up for sale on my account unbeknownst to me.  I sent number emails again to ask for its return - we are now into October and the bag was finally returned but with a catch I had to pay $290 again to have the bag released by Oz customs!  See below one of the many conversation I have had with VC, there comments are in  \"   \".\nYou are still very much confused about the situation and this is becoming quite frustrating – \n\n“We sincerely apologize for the inconvenience as your item was being relisted under your account after the second check”. What second check, I asked for one assessment only?  Not a second check, this was the first check.\n\n\"Please note that we relisted it for sale in your account according to our return policy and to avoid the VAT. Import costs are not VC responsibility as she returned it when it was compliant.\"  I didn’t return the bag.  I just wanted it checked and sent many emails to asked for the bag to be returned to me, this was ignored by VC and they listed it for sale.\n\nI did the honest thing and paid the import tax when I first purchased the bag and believed your customer service operators when they said pay the tax AGAIN on its arrival to Oz and VC will refund the tax of $290, so that I wast double paying the tax.\n\nI took screen shots of most of the conversions as I now don't trust this company.\nWaiting on the final outcome of this situation, not fair, unethical, just do the right thing and refund $290.","title":"Double payment for import taxes","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-13","author":"natalie de souza","text":"Im absolutely disgusted with this company. Can’t get to speak to anyone in person. And when they do contact you they don’t even know the item you’re talking about.\nThey are breaking the law under the trade description act. Treat you like dirt, but don’t mind taking your money. \nSoooooooooo angry","title":"Absolutely disgusted with this company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"},{"date":"2021-10-14","author":"Emily Berlangieri","text":"Worst buyer experience I feel completely ripped off, I wouldn't recommend shopping on Vestiaire. I purchased a pair of Prada nylon shorts, before purchasing them I asked the seller to provide measurements of the waist to ensure they would fit, well the seller sent me measurements that were hugely inaccurate. I sent them back to Vestiaire expecting a full refund as I was told by \"Vanessa for Vestiaire Collective\" via email that if they didn't match the seller description that \"we will process your refund\" exactly what I was told via her email. When they arrived back to Vestiaire I received an email saying that they matched the description, total bs I even included printed screenshots of my conversation with the seller about the size of the shorts with my return to Vestiaire. \n\nNow they have uploaded the shorts onto my profile without my prior knowledge and its my responsibility to sell them at a huge loss of authentication fees, shipping and customs fees I had to pay and I can't even adjust the price to include my losses on my own profile!!! An absolute joke, Vestiaire is a money making scam benefiting Vestiaire to the detriment of customers.","title":"Worst buyer experience","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=41&stars=1&stars=2&stars=3"}]