[{"date":"2021-11-01","author":"Donna Ambler","text":"So I bought a bag. I live in the U.K.and the seller lives in the U.K., \nIt does not make it clear on the web site that items are checked in France!\nI would never have paid to have it checked had i known,\nIf I have ANY import duties or taxes to pay I will claim these back. \nI will not be purchasing from this company again.","title":"U.K. buyer U.K. seller","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-01","author":"JOHANNA POPE","text":"I've used VC several times without issue, but now, I see why others are concerned about the business model: Vestiaire Collective's quality control is extremely limited. In my most recent order (of five items) I had two items that never shipped, and a third that came as a size EU 42 despite being listed and described as an EU 30. I was able to make contact and resolve the shipping issue, but have had no luck trying to get a customer service response about my mis-sized item. It wasn't a very expensive piece, so it's not a crisis, but I feel a little uncomfortable.\n\nEDIT: Thanks for your reply. Upon revisiting the listing I do see that there is a note in the comments section of the & other stories dress indicating that it is a size EU 42, and one of the several pictures does show the tag -- but it is referred to at several other points, including both 'main' descriptions (i.e. the listing and the item description), as a size EU 30. I appreciate that this is somewhat ambiguous, but still feel the listing was extremely misleading. I am also a bit uncomfortable with the way this was handled and disappointed that I had to make a public post in order to get a customer service response.","title":"Shady order experience","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-02","author":"AB","text":"You guys are B corporated? Inconsistent in curating. You refused my items and stated that is incompetent yet, the same item has been sold??? You rejected what I sell and stated that Item not for sale is incompetent yet, there are plenty listed and some solds even at crazy price for a VIP gift products?? One you refused the item and the next day when is submitted you accept it. What is going on here?!!\n\nTo purchase an item from the same country still has to fly to HOng Kong just for authentication? Doesn’t make sense within same country has to pay import and duties tax???\n\n Terrible customer service. They will never get back to you.","title":"You guys are B corporated","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-02","author":"IC","text":"DON’t buy and DON’t sell anything on this website. I can’t believe I’ve experienced exactly the same as everyone here in this group. This is a scam business, it needs to be addressed legally and needs to be closed because they steal people’s money in the middle of the day pretending to be a legal business. Please people be away and never sell or buy anything on their website!! Also customer service is non existing, it seems they are just making fun of customers, they reply whatever. Also the rules listed on the website doesn’t represent the reality when it’s the real issue. \nI bought a LV bag and it was delivered to me after the authentication check up the same day they received it meaning it was not even checked properly. I received it and I instantly noticed it was not the way it was described. The smell of the bag was horrible, I also was suspicious it was a fake one which was confirmed by one of the LV representatives. I made this claim and sent the items back to Vestiaire requesting my money back. 7 days later they told in the email the bag is authentic and ignored all of my questions about what I said in regards to this. And they posted it online for sale without my confirmation taking nearly 25 percent of commission to themselves. \n\nI’m going to make a legal claim about this company, it has to stop NOW.\n\nEdit: I got back to the customer service like they suggested here and NO ONE replied to my request!","title":"NEVER trust this company - it’s a SCAM","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-02","author":"Konscious Sun","text":"Vestiaire really ought to improve their delivery methods\/courier, because I now have two orders: one of which seems to be misplaced by the courier and it has taken them 3 weeks to locate and still it is yet to be found; the other one is bound to be returned to the seller, because Vestiaire is not flexible at all with generating shipping labels.\n\nI choose to be patient with my displaced order because the staff is very friendly, but for this other order, the staff is very rude and refuses to help - so I will lose another few weeks to wait for the parcel to return to the seller in another country, and it is only until then Vestiaire will generate another shipping label. I am afraid that this inflexibility creates a lot of unwanted waiting time and unnecessary back-and-forth with the courier and Vestiaire, as well as it is a total waste of manpower.","title":"Inflexible delivery and unfriendly customer service","stars":2,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-02","author":"A K","text":"Okay guys this is shocking and appalling! Just like when you think your experience with Vestiaire can not get any worse, here it is! I bought a pretty expensive thing on this site on 9\/10. The amount in question is 11830 EUR! Seller took almost a week to ship it out. Well, on 15\/10 it was marked as shipped. Since then there has not been ANY update according to UPS and zero update from Vestiaire! The package is obviously lost\/stolen! Since October 9 I've been waiting for my order to get cancelled and get refunded while this company hasn't lifted a finger to refund me voluntarily! I get it, they feel pretty comfortable sitting on this amount! Their support fellas based out of India are all a total joke. THREE times I've tried to reach out to them, get my order cancelled and get my funds back (mind you its 12000 EUR we're talking about) and three times all I got was a bunch of baloney!  Since I got nothing so far and it's gonna be a month of waiting soon, I'm opening a paypal claim based on never shipped. Meanwhile, if anyone at this company bothered to answer for me the following:\n1) why after weeks of no tracking status update my order hasn't been cancelled and my funds not refunded automatically???\n2) why do I have to run after you and beg to return 12000 eur???\n3) why your indian support asking me to provide a bunch of my personal data to initiate an investigation with UPS on my behalf if I AM THE BUYER AND HAVE ZERO RELATIONSHIP WITH UPS! The package was going from the seller to Vestiaire warehouse! What does it have to do with me and why should I be sitting here out of 12k and my order??\n4) has anyone at your company lifted a finger to start an investigation with UPS to recover the package in three weeks time?\nCan you put an end to this absurdity and FINALLY REFUND ME THE FUNDS YOU'RE HOLDING FOR NO REASON","title":"BEWARE this company is holding almost €12k of my money for weeks!!! My order lost by UPS and I'm not being refunded","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-03","author":"AD","text":"Absolutely ridiculous and pathetic customer service. I have been trying to sell a Zimmermann dress on this website for DAYS and I keep getting rejected without any reason as to why. Chat service is less than useless and the email that they have set up won't submit my query. \nCompletely frustrating, useless, waste of time. If I could give minus stars I would!!","title":"Absolutely ridiculous and pathetic…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-03","author":"Mel Baimpou","text":"Looks like a scam company to me from they way they communicate with their customer . \nCourier sent notification to collect my order from collection point , but order was never there and the tracking number wrong. Contacted Vestiaire collective though their chat box. \nGetting always the same answers and talking with the same person named Catherina.\n Not able to solve the problem. They sent an email saying that they resolve within 24 hours but this never happened. When I contacted them, they went again through the same conversation, they said that I will get an email  and they closed the chat box.  There is no respect for the customer. I got a screen shot from the last horrible conversation. I am now worried that I lost my money from this order.\n\nThank you for replying below to my message. I had to go through all this situation with chats and emails until my order finally arrived at the collection point.\n I collected my order this evening 7 days after order was placed. \nHope you improve your tracking services in the future to make your customers happy to buy from you again.","title":"Looks like a scam company to me from…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-04","author":"Isabella Rizzo","text":"I paid for the authentication process for a bag. I am living in the UK and the seller was located in the UK too. I contacted Vestiaire to find out whether there would be custom fees to have the bag authenticated (authentication is in France) and they said there wouldn't, so I went ahead with the authentication process. When the bag arrived, I was charged nearly £50 in custom fees (1\/4th of the price of the bag). But the worst part is that the so-called \"authentication process\" didn't even detect that the seller had advertised wrong measures for the bag. Therefore, I received an item which was a different size from the advertised size, even though I spent £50 for the authentication process. I don't know who is in charge of the authentication but I would have expected as a bare minimum that basic features of a bag (size, colour, etc) would be checked thoroughly. Very disappointing considering the price I paid for this and the fact that I was wrongly advised on custom fees. Would not recommend.\n\nEDIT after seeing the reply: The link they sent does not direct to a form. I did not keep the item because I loved it but because I did not want to go through the hassle of returning it, which I would not have had to if the authentication I paid for was done correctly.","title":"I don't recommend the authentication!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-05","author":"Stephanie Ramezan","text":"I am shocked and appalled with the treatment and lack of customer service I am receiving. I have been a VC customer for a while and bought and sold many items. Recently I bought a classic Balmain blazer. However when it arrived it was clear that it had been substantially altered by a tailor. I have multiple of these blazers in the same size so I can compare the cut, fit and the stitching. The seller has had this blazer taken apart and put back together much smaller and the seems and the back and arms clearly prove this. This is easily visible by looking at the stitching on the arms and back of the blazer they are no longer where they should be!!!!! Therefore this is no longer an AUTHENTIC item. The overall size is now 1-2 sizes smaller and the blazer does not sit properly as the shoulders have also been cut and restitched plus the arms are around 8cms shorter. I sent multiple messages and emails with photos attached showing the cut and stitching of the blazer compare to different original balmain blazers so they can see the proof of the major alterations. But I just got a generic email back saying the item matches the sellers description. However surely the seller has a duty of care to say if an item has been severely changed from its original state?! The is false advertising and I have been mis sold an item as “original” and being a certain size. The item was even sent back for authentication but clearly they did not check back against my photos or emails as when I followed up it was like they were getting the information for the first time. I then had someone on instant chat ask to call me I said yes then gave them my phone number then they closed the chat, never called and just sent the same generic email again “the item matches the seller’s description”. That is NOT what I am arguing. Yes the pictures match but the seller has been operating under false pretenses. The seller can not resize and change the cut and fit of an item and say that it is original and very good condition! This is not like a dress has been made a little shorter, the entire shape, size, cut and fit has been changed. This is absolutely disgusting customer service from VC.","title":"Disgraceful and shocking customer service","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-05","author":"Martine Lawley","text":"I recently bought a pair of Celine flat sandals.\nToday, I received an email from Vestiaire asking me to check the 'expert report' on the sandals highlighting the fact that there was a very tiny defect but that they recommended that I buy the sandals.\nUpon checking the report, the defect was that the sandals are a size 38 and I had bought a size 39.\n😂😂😂😂😂😂 - what planet does VC come from?    I need a 39 (I have bought Celine flats before and a 38 WILL NOT DO!   I just hope that they reimburse not only the cost of the shoes, but the taxes, the \"Expert Report\" (😂) and the delivery!   Let us see how they perform.\n------------------------------------\n\nPlease DO see the response below!   As so very frequent with VC.. the response is completely beside the point and ... helps no-one!\n\nVC, it really makes you look so very very silly!","title":"I recently bought a pair of Celine flat…","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-06","author":"A very disgruntled customer","text":"I sent a brand new h&m sweater to Vestiaire’s quality control team before the item was to be sold. It was in perfect condition as I had just purchased it and the only reason I was selling it was because it was too big for me. Vestiaire’s quality control team rejected my item saying there was a hole in it. I was shocked and asked for proof. They sent a photo with a huge hole by the collar line. And that’s where this awful and alarming quality of service issue began.\n\nFollowing news that my brand new item had been rejected due to a hole, I contacted Vestiaire’s customer support team by the app, each time you first get a generic robot and then eventually when the robot can’t answer your questions, a person, but even that option of chatting with a person gives you generic responses, I know this because each time with a seperate person they would make the exact same grammatical mistake to offer to send me an email, so it must be a response they are copy pasting. They were not helpful, each time they would just say they were looking into it with their quality control team and would come back to me, but after over 1 week I still had no news, and had to keep following up via a new chat.\n\nWhat’s also alarming is once the customer support rep is finished chatting with you, Vestiaire removes all records of chats with them in their application, this means not only that each time you speak to a representative you have to start from scratch but also you have no proof of what you have communicated to Vestiaire and what they have sent back to you unless you screenshot the chat. I learned that you can request them to provide you a reference number for your chat for them to look up internally but they will not send you those records.\n\nUltimately while I was appalled that Vestiaire’s quality control team had damaged my brand new item, what was really upsetting me is they were blaming me for it, and I had no way to contest that further even though I sent them photos as proof that the item clearly had no hole when I sent it. I just wanted a refund and my item returned.\n\nVestiaire’s delivery service declared it was not possible to deliver my item back to me (I still don’t understand why) and shipped it back to Vestiaire who are refusing to give it back to me and issue me a refund for the issue. The last email I received from their customer support was that their quality control assures me it was not made by their teams. I asked them if they have cameras and if they could send me the footage as proof. They do have cameras but they do not want to send me the footage. Also who controls and provides the judgement on if their quality control team is correct, well their quality control team, this is basic compliance and risk 101 the team that is carrying out the service should not be the ones responsible for if deciding if that service is good, otherwise obviously they will always say it’s great, and in my case not take responsibility for a mistake they have made.\n\nFinally it’s been more than 2 weeks since I have been writing them, they want to keep the sweater with a hole in it to try to relist the item on their site and provide me 20€ as a gesture but clearly not admitting it was their fault. I’m exhausted and feel like I have no choice but to accept this offer as it’s not worth it for me to waste my time to get the money of that, it’s more a question of trust and the principle of it. I told them I would accept, and since then no news of how this 20€ will be given to me, they have stopped responding…\n\nSellers beware, luckily in my case it’s an inexpensive h&m sweater that was brand new with the tags, but I would be much more weary and nervous for bigger ticket items and if it wasn’t new, because that gives them a lot more margin in their errors or mistreatment of goods. I don’t think they do it intentionally but I imagine they try to do it factory line style and industrialize this process to make it efficient, which means not always treated with care. Also I have heard stories of how their quality control team doesn't always correctly spot fakes, this doesn’t surprise me with the experience that I have had. \n\nSo then that begs the question what are we paying all that extra money to them for. I’m all for second hand but grand, but better use sites like Vinted whose customer service is very good (I had an issue with one article in the past and they resolved it quickly and efficiently finding an amical solution for me and the seller) and who doesn’t charge you exorbitant fees for ‘supposed’ quality control which in the end risks doing more damage than good.\n\nIn this spirit I opted to delete all articles that I was selling from Vestiaire and sell on sites like Vinted and Depop instead as I really dont trust Vestiaire Collective’s quality control from my experience.\n\nUpdate: since posting I recieved a notification saying 20€ was being paid to me by VC.","title":"Vestiare’s quality control damaged my brand new sweater and says it’s my fault","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-06","author":"CS","text":"How stupid of me after already having a terrible customer experience on Vestiaire collective that I would foolishly buy from them again and guess what another absolutely terrible experience!!!!! I bought a coat online with the usual promises of it’s not shipped within 7 days or arrive with you in 14 you will be refunded so on the 7th day the cost is sent but on the day I was told it was meant to arrive I get an email from DHL (not even Vestiaire) that my coat is still in Spain as the seller hasn’t given correct paperwork for it to be shipped !!! I try to contact the seller complete silence !!!! I then go through the whole painful rigmarole of trying to get through Vestiaires awful chat function and finally get to speak to what I think is a real person who promises me they are going to sort it out for me !!!! 14 days later and 7 infuriating generic emails basically saying nothing but how they promise they will sort the situation out for me and are waiting to hear from the courier (I have spoken to DHL who say no one from Vestiaire has contacted them ) the coat is still in Spain I have already paid for it and it won’t go anywhere until they get correct paperwork!!!!!! Another awful experience","title":"How stupid of me after already having a…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-06","author":"PB","text":"I am a seller and having a Kafkaesque situation trying to list an item. It’s a small pin\/brooch. NOTE I have successfully listed and sold similar items with 3 photos. Front, back, and with measuring tape to show the size. \n1st I was told I needed more photos. When I asked what kind of photos they said there was no indication of branding. I said there is the logo on the back, clearly, visible in the photo. They said add a photo zooming in on this which I did. \nThe item was refused. I asked why? They said they could not list my item because “THEY COULD NOT CONTROL MY ROOM PROPERLY” !!???\nI asked what does this mean??? They said relist with new photos. \nI relist with new photos taken carefully to avoid shadows and to show detail. Again I was asked to submit more photos. I ask what photos are required. They said to show brand (even though already provided and visible), and that I need to zoom in more. I add more photos as advised.\nThe item is REFUSED AGAIN!!\nThere is no difference in the way I am listing and presenting this item to other similar successful items. \nThis is all such a waste of time. \nAnyone else?\n\nEDIT: I removed a successfully listed item to change the description. When I tried to RELIST it I am getting exactly the same issue. \n\nEverything is done by AI, BOTs, standardised responses -the customer service, the checking, reviews etc. \n\nI have worked out that my items are refused as the brand logo is placed in such a way that it does not “match” whatever template they are using for verifying the brand. This was a DESIGN CHOICE given the size of the article, and not a crude attempt to copy!!\nAll the investor money has gone into tech, marketing and PR and NOT people with expertise and skills. \n\nI am fed up with my descriptions being changed to inaccurate poor English by the same AI. Asking them to change it back gets you into the bot loop again and sometimes works, sometimes not. \n\nThe amount of scams and fraud reported makes me nervous about selling high value items and the hassle and time involved makes it not worth selling the lower value items.","title":"Kafkaesque ……","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-06","author":"Joesef Bob","text":"This website should be banned. They are the biggest scammers. I bought a fake hermes and other items from their website even when they had authenticity. This is the worst place someone could buy anything.","title":"This website should be banned","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-07","author":"morten jensen","text":"UPDATE based in their weak response..\n\nThey are saying the items are stuck in France due to import and VAT increase shipping the items. I did not send anything to France, I gave this to a UK business who promised me I could get my items back at any time. This is no excuse and even if it is, you have known about Brexit for years now. Please return my items immediately.\n\n\n\nTHEY STOLE MY PRADA SHOES… I listed a load of things on the site which just didn’t sell despite all their promises. Be that as it may, I have tried to get a pair of brand new prada shoes worth £500 back and did not get any response for months just to receive a message saying ‘that they have stopped returning consignments to the UK’ and now I can’t get my shoes back. THIEFS, AVOID AT ALL COSTS. THIS IS AN ABSOLUTE SCAM.","title":"THEY STOLE MY PRADA SHOES… I listed a…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-07","author":"ErinHW","text":"I am more of a Vestiaire Buyer than a seller; and I have spent literally tens of thousands of ££ on the site. I am a loyal customer. \n\nWhile the basic system works well, I am so depressed at my recent experience when a delivery has gone wrong. They just aren’t equipped to deal with ANYTHING that isn’t standard process. \n\nI paid £900 for a D&G Sicily handbag back in mid September. I missed the original delivery due to various reasons resulting in the bag being returned to Vestiaire. And since then I have literally emailed and used the Chat system to chase my bag no less than TEN times to resend it. I have updated the address as requested and validated again and again.\n\nThe chat people are liars (or not real people). They have my £900 and promise it will be sent out again within three days  - it NEVER happens. I don’t believe I will ever see my lovely handbag. \n\nAnd NOW I have an email from the company telling me they are about to send my bag to charity!!!!! I cannot believe this - I can’t trust them with my money or my purchases now. They seem completely unable to send the bag out to me again!","title":"Where is my £900 bag????","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-07","author":"CS","text":"How stupid of me after already having a terrible customer experience on Vestiaire collective that I would foolishly buy from them again and guess what another absolutely terrible experience!!!!! I bought a coat online with the usual promises of it’s not shipped within 7 days or arrive with you in 14 you will be refunded so on the 7th day the cost is sent but on the day I was told it was meant to arrive I get an email from DHL (not even Vestiaire) that my coat is still in Spain as the seller hasn’t given correct paperwork for it to be shipped !!! I try to contact the seller complete silence !!!! I then go through the whole painful rigmarole of trying to get through Vestiaires awful chat function and finally get to speak to what I think is a real person who promises me they are going to sort it out for me !!!! 14 days later and 7 infuriating generic emails basically saying nothing but how they promise they will sort the situation out for me and are waiting to hear from the courier (I have spoken to DHL who say no one from Vestiaire has contacted them ) the coat is still in Spain I have already paid for it and it won’t go anywhere until they get correct paperwork!!!!!! Another awful experience\n\nMy order reference is 46231900 (I’m ready for another round of generic emails telling me they are waiting to hear from the courier when the courier says they have never contacted them or ultimately them telling me I have to go through some ridiculous procedure where I have to send ID and a signed statement saying I haven’t received the package even though they have confirmed it’s not left Spain !!!!! I have paid for this item but it’s up to me to sort it out right !!!!! Not the seller or Vestiaire who work as their agent !!!","title":"How stupid of me after already having a…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"},{"date":"2021-11-08","author":"nguyen linh","text":"I did not recieve my money after the refund process since July. they also deactive my account without notice me so i cannot check if the refund process was done or not. i kept mail them on and on but they always give the same answer with the Same sentences it seems like it is automatic reply. i also show them my bank statement to prove that i did not get the refund back, after all they said notthing they can do. I think they are scamming my money. if u do read this dont buy from them. to vestiaire if you read this please take responsibility and give me my money back!!!","title":"I did not recieve my money after the…","stars":1,"location":"VN","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=36&stars=1&stars=2&stars=3"}]