[{"date":"2021-11-13","author":"Manuela Vasta","text":"I had made a purchase and you as a customer can review it within 72 hours, right? The button to review the purchase did not work so as a seller I am not stuck with a sneaker of 300 euros that is of no use to me!! I've been emailing for days now but they don't understand?? It's not about canceling, it's about reviewing the purchase within 72 hours, I'm entitled to that and the button didn't work! What are you going to do about this?","title":"HELP!","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-14","author":"Bernardo","text":"Such a shameful experience with a seller and the company itself. After days of waiting for the seller to ship my purchase (after confirming that the item is available on hand),  the item suddenly became unavailable and im now being refunded.\n\nSuch a stupid thing to do. Should have trusted my gut not to trust anyone from this app.","title":"Such a shameful experience with a…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-14","author":"Anabel Penela","text":"I bought a Gucci bag, from an UK seller. I live in UK as well but still have to pay another £100 for customs fees. This, AT ANY POINT, was mentioned throughout the purchase process. \nVestiaire, you had 5 years to adapt to Brexit. Having your customer service kindly advising me to pay for the extra £100 for customs fees when I bought from an UK seller is absolutely ridiculous. \n\nAbsolutely awful experience. NEVER AGAIN.","title":"Absolutely awful experience. NEVER AGAIN.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-14","author":"Li N.","text":"I have been buying a lot from VC and everything was fine until last week.  I've bought a Balmain dress.  Seller listed as size 36 FR, \"never worn, new with tag\".  When it came to me the dress does not have any size tag and it's bigger than size 36.  I have contacted VC and requested a return due to \"item not as described\".  VC has denied my request saying the seller is an individual seller so I cannot return.  I was not asking to return because I changed mind or because I did not like the dress.  I wanted to return because it is not the size it was listed as.  VC does not protect buyers from dishonest sellers.\n\nThe reference #18789442.  I wonder why the inspector found the difference in listed fabric contents but she did not see that the dress is missing the size tag?\nThank you so much to VC allowing me to return now.  I appreciate your care for your buyers.  This issue is resolved now. 11-17-2021.  Li.","title":"I have been buying a lot from VC and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-15","author":"az.xx","text":"Bought a “brand new with tags” dress, I paid $27 or so for their so called “authenticity and quality control check”. Received the dress  and the tags are clearly have been tampered with, the tags was cut off and subsequently tie by on by hand. \n\nI raised the issue immediately via chat, and was told the dress passes quality control and I can’t return it. I asked the question, if verstire collective allows item to be pass on as “brand new with tags” when tags clearly being removed and tied back on by hand. They pretty much avoid answer my question directly and insisted passed their qualify control. This is pathetic. \n\nYou want to charge customer $27 for your “quality control” service and you can’t even identify the tags have been removed??? This is a scam! \n\nThey refused to accept any responsibility or provide accept resolution. BUYER BE WARE!! DONT’T BUY FROM THIS WEBSITE!! They are thieves!!","title":"BUYER BE WARE!! Don’t buy!!","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-15","author":"J","text":"I downloaded the app and browsed the website, but checked the Trustpilot reviews before ordering anything and decided to delete the app based on the poor feedback. I uninstalled it and went to unsubscribe from the emails they kept spamming me with- only to find you cannot unsubscribe. Clicking the link to unsubscribe just takes you to their website. If that doesn't indicate a scam merchant! Avoid them.","title":"Impossible to unsubscribe","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-15","author":"Mari Mcelgunn","text":"Have recently become a member and have sold items but have been unable to download label to send. On chat for past few days and no joy.. so frustrating and time consuming as no one to advise..  has anyone else had problems.","title":"Have recently become a member and have…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-15","author":"Ellina Ivanova","text":"Untruthful. Very difficult to communicate. Customer service is useless. Items are not checked properly. \nI received item that’s as listed as new with tiny holes and label that ripped to pieces. They refused to a vey it back. And won’t even communicate after.","title":"Untruthful. Never again!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-16","author":"JS","text":"VC is unable to handle transactions involving fur (and other things) being imported to the UK. They claim it is due to Brexit but all other platforms I know of are able to do this (eg Rebelle in Germany, eBay, Joli Closet in France. \n\nNo UK-UK sales are possible because their system defaults to the item being sent to France for checking - hence needing to be imported back to the UK (although Direct Selling would make the checking unnecessary).\n\n1) Why are Vestiaire claiming it's an issue out of their control when their competitors aren't experiencing it?\n\n2) It appears that discussing on the Chat that fur sales can be made on other platforms gets one banned. Why - what are they afraid of? It's their choice to not support UK-UK fur sales.","title":"Discuss not being able to sell fur in UK and get banned.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-16","author":"G. E.","text":"I sold an item on the 1st of November, shipped the same day, however the item seems to be lost by the carrier, which can happen, however to get Vestiaire to get active was quite a chore. Chat is a waste of time. Finally they concluded that the item was indeed lost, however to pay me, they now want an ID, a passport or a driving license.\nHere is the problem:\nThe UK has no ID cards, I have epilepsy, so I am legally not allowed to drive and since I can't travel much anyway (long journeys can trigger epilepsy) I have no passport.\nI thought it was not a problem, I am married, so I use my husbands driving license and utility bill, now the system doesn't recognize it, despite the fact that we have the same surname, I even changed my account information to his information (looks a bit weird if a man is selling women's clothes, but hey) apparently it is still pending.\nI tried to go to chat and as usual it was a really bad experience, the customer service agent (Jose Jiggo) spammed me with auto replies, obviously didn't read a single thing and told me to empty my chache, which has nothing to do with the fact that Vestiaire claims they can't verify my ID. I tried to ask if they would accept a letter from the National Health Service, a birth certificate, a marriage certificate, I was told to restart my computer.\nTo sum it up, your carrier has lost the item, you now create hurdles to avoid to pay me. I really can't force the UK government to issue ID cards, ordering a passport is quite expensive and since I can't travel no use to me, and since I am not allowed to drive due to health reasons, how could I get a driving license? \nI am not being rude, but you are hardly the most organised company, so you do demand very sensitive documents which I supplied (in the form of my husband's documents due to before mentioned reasons) and I have no idea what happens with them, how securely they are kept....","title":"The UK has no ID cards","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-16","author":"Sophie","text":"I won t stop posting negative reviews until I receive a decent answer about the whereabouts of my order of item18888058. I ve sent numerous emails, and I get different answers all the time, but everyvtime from the same person Miss\/Mrs Trinidad…a complete disaster! She sent me an email with a return request for an item which definitely is not mine! Omg so tiring…feels like talking to the walls…anyway I m fed up and opened a case with PayPal…VC where is my order!!!!","title":"I won t stop posting negative reviews…","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-16","author":"Im._.Dead_","text":"5529914 item stolen by buyer. No help by VC","title":"5529914 item stolen by buyer","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-17","author":"Freddie Paragas","text":"A pre loved bag is affordable but after they include  custom duties and taxes, shipping and authentication its almost half  price of a new bag- just imagine a fair condition bag it cost almost half price of a brand new bag.","title":"A pre loved bag is affordable but after…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-17","author":"Alma","text":"I bought a Louis Vuitton bag on Sunday,seller confirmed  availability.By Wednesday  got an email saying it’s no longer available.Is it the seller or VC.?Im so disappointed.Why advertise it if you have not got the item.","title":"I bought a Louis Vuitton bag on…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-17","author":"Soraia","text":"Sold quite a bit via the platform however, the fees are so high I’m making such a loss with 25% sellers fee. \n\nI have opted to now use eBay and other platforms such as Instagram to provide lower costs due to low commissions \n\nMy Instagram page is: wardrobeliving for those interested in NEW unworn designer products mainly bottega veneta. Message me an item you have seen and I can advise if I have the colour in stock.","title":"Good but high sellers fees","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-18","author":"Sophie","text":"The saga continues…part 3\nStill no refund for my item 18888058 although I was promised ( Jolina Marie) to be refunded! Such a nightmare, it s a real fight to get my money back, so stressful!!!\nAnd customerservice is so useless…\n\nUpdate\n\nFair is fair… received ( finally!) the gloves today, after almost a month. A commercial gesture would have been appropriate…","title":"The saga continues…part 3","stars":3,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-18","author":"Arhelia Mari Luxury","text":"When someone wants something and give you the money its no problem . \nBUT . when you need to pay us out we need to wait 3 weeks or even more . And than writing us that there is a problem and i need to wait 3 more days for a solution . \nAs a professional seller this affects me so much because i can not buy new stuff . 3 weeks waiting for the money not normal this and still nothing … im so dissapointed …","title":"Not worth anymore","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-19","author":"Amy Kilian","text":"Really poor experience. I bought a ‘La Perla’ silk dressing gown (order no: 46698796 ) that after purchase I noticed was not showing the belt, I queried as to why & was told it has been lost,  so I contacted Vestiaire to cancel (as the seller has refused to accept a cancellation) all of this was before it had been dispatched I hasten to add. Vestiaire said that the seller didn’t state it had a belt so therefore it was not missing a belt ! ( despite the gown having loops for one) Then to add insult to injury when the item arrived it was worn looking with a small hole and bobbled worn areas, and a thread pull.  The seller had said she’d only worn it a few times, which was a blatant lie judging by the condition and anyone inspecting could see that. \nI immediately took pictures ( which I am happy to share on here ) and sent them to Vestiare requesting a full refund of all costs incurred by me, the refund was unacceptably denied but they agreed to have it reevaluated and a full refund would be issued upon the findings. I was assured by customer services that they were aware that the item had been sent after I’d cancelled it and that there would be no issue in returning for a full refund, they said they had also made note of the sellers behaviour in this. It was then to my real surprise that they then re-evaluated it ( as in inspected it ) & said that item was acceptable to sell !! Shockingly poor. The response also  stated  that they were now trying to resell it on my behalf ( which is pity for the next poor buyer but out of my hands).  This was all via an email that you could not respond back to: no-reply@emails, which is not at all helpful. \nI would  have expected a full refund in a case like this, together with an absolute apology. I won’t be shopping with them ever again and would say to anyone considering it - buyer beware,  It feels  more like dealing with a dodgy EBay seller only with EBay you have some  recourse as a buyer in a case  like this.\n\nEdit: Fortunately I payed via Klarna who upon hearing of this issue suspended payment and have opened an enquiry into Vestiare Collective","title":"Really poor experience","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-20","author":"yels","text":"If i could give 0 i would. No update on my parcel when it was authenticated on the 15th November! Your 1-3 days response policy is POINTLESS because you tell us we still have to wait. A simple update on my parcel would’ve made me understand but i get the same useless response from customer service. I will be contacting my bank because I don’t trust Vestiaire and the chat and email service as the only form of communication is definitely a scam","title":"DISHONEST COMPANY- STAY AWAY","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"},{"date":"2021-11-20","author":"Jindk","text":"Deleting the app ASAP!! \nSent me a blazer that was altered beyond belief. There was material added to enlarge the width of the sleeves, the lining was replaced and sewn in crookedly and the labels were missing. When I tried to explain this to customer service, they had a very serious comprehension problem and could barely speak English. Out of sheer frustration, I had to send the blazer back to France AT MY EXPENSE and they only ended  up refunding me a portion of my cost and also lost the duties and taxes I had to pay at check out! An absolute waste of time and money. It is beyond me as to why I paid for authentication when clearly the item was not in its original state. I hope to see the same sellers on eBay or Depop because Vestiaire is not the way for me.","title":"Deleting the app ASAP!","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=34&stars=1&stars=2&stars=3"}]