[{"date":"2020-12-24","author":"Guy Verduystert","text":"Still not happy. The saga is ongoing. Notwithstanding the polite and standard answer from V, I am still waiting for my money. \"Good\" (sic) news is that finally after 4 weeks, V-people have realised that they could not transfer the money because I did not give them instructions where to transfer to. One it took them four weeks to realise this? Bad. Second, what about all those V-people telling me  different stories? Bad. \n\nFinally yesterday one V-star gave me the \"right\" instructions (step 1 - give transfer details). \n\nNo problem, I got through step 1. Step 2,   verification code to be sent to my email. Nada, never received an email. After ten attempts I gave up. The numerous subsequent emails were left unanswered. No communication, no assistance. Bad. \n\nExcept one V person contacted me basically telling me that my yahoo account was not the right one. I should change it to gmail. When asked how I should do this, she said to send me the old email (how stupid I was writing from that address), the new one and wait a copy of passport\n\nI duly did this and then received news that it would take THREE working days to rectify. This brings us earlies to Thursday 31\/12. Thus I missed the the 30\/12 going into next year. \n\nI start to believe they are doing this on purpose to pester me and to force me to abandon my effort. They cannot further from the truth. \n\nShame on you V.","title":"Still not happy","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2020-12-24","author":"zhen","text":"I have listed a hoodie, which is brand new with tag and  cover bag. Then I had a sale the following day which is quite impressive, and the buyer sent the item to the Quality Control hub. I just received an email from VC saying that the cover bag is missing....They have reported this to the buyer and the buyer cancelled the deal. I was like...where is the cover bag???  When I posted it, I packaged it exactly the same as I received it with everything, there is no reason why I posted the hoodie, but leaving the cover bag at home!!!! they said they will investigate and contact me in three working days, we will see.....","title":"My original package is missing at the VC hub","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2020-12-25","author":"Peter M","text":"Absolutely terrible if you're a seller. Like so bad I will never sell through there agajn. Let me start off by saying I really liked Vestiare as a buyer. However if you're a seller and the buyer chooses direct shipping it's better to refuse!!\nI sold a pair of yeezy 350 israfils on there To a buyer who then apparently complained the sizing was wrong ... this is despite the fact they weren't wrong and the buyer was given 3 days to respond. It's been 4 weeks and the buyer hasn't responded and instead of vestiare releasing my money to me...there hasn't been a single communication about my money. If I don't chase I don't hear a thing. Twice I have got in touch with them and they have promised to sort it within days...as you can imagine every time nothing has happened. The last one even went as far as to say she guarantees it'll be sorted and guess what 5 days later it still isn't. I will never sell anything through the site again. I'm still without my money or my trainers and not a single word from them. Avoid!!!!!","title":"Absolutely terrible if you're a seller","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2020-12-26","author":"Clara Ong","text":"HORRIBLE SELLING EXPERIENCE.\nI’ve got my items rejected 11 times and have contacted their customer service a few times before writing this. I seriously doubt the competency of the curation team as I often see fake items being listed. I usually list vintage items so I understand if Vestiaire takes a cautious approach and choose to reject my items (though they are 100% authentic). But the last straw came when I listed my item, freshly bought from Chanel, complete with receipt and it still got refused. It’s ridiculous!! Discrimination or what? I’d recommend selling on other platforms. Vestiaire is probably better for buyers as my experience as a buyer has been rather pleasant.","title":"WORST SELLING EXPERIENCE.","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2020-12-26","author":"Annita","text":"I had a terrible experience with a seller-not only she didnt ship she also was rude and unprofessional by not replying to my messages! The website does not allow any reviews or ratings for sellers?? Really? I have the right to express myself and share my experience since I gave you my money and you didnt deliver-sellers name is Isabelle from Romania-please be aware of my very frustrating experience with this untrustworthy and unprofessional seller! Think twice before buying! VC please monitor your sellers-you are getting exposed more than them-trust is the most important value when it comes to buying second hand!","title":"Very risky business","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2020-12-28","author":"Aime Yoshikawa","text":"Dont use vestiere I have to contact them  every week to get my payment I already being waiting for more than 1 month and every week they come up with another excuse!! Such a scam! Please avoid and save yourself such a bad times.","title":"Dont use vestiere I have to contact…","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2020-12-28","author":"Katheryn Madonia","text":"I'm a seller based in Hong Kong and despite a large amount of interest (15+ offers) for an item I'd like to sell, I've lost ALL my potential buyers at the point of sale due to exorbitant shipping & customs costs (200 Euros!!!) that the buyer must incur, increasing their price by 67%. Understandably they lose interest upon seeing this full cost at checkout. I contacted Vestiare's customer service and they said they have no control over this pricing, though I believe to ship it and pay customs myself would be much more inexpensive. You've lost a potential seller until this is sorted out... there isn't much in it for me or for the buyer.","title":"Exorbitant shipping from Hong Kong overseas","stars":2,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2020-12-28","author":"Angela gonzalez de castro","text":"AUWFUL. I feel totally scammed as they sold me a 36 French\/40 Italian size pants. Turned out they were a 40 French size. After a long and tedious series of emails complaining they refused to accept their mistake claiming that the trousers were authentic. Yes they are authentic but the size doesn’t match the description. Still waiting to write a formal complaint... will NEVER buy anything from them after this","title":"AUWFUL","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2020-12-28","author":"Holly Marie","text":"I purchased a bag from the site a couple years back which they authenticated as genuine. I then came to re-sell this a couple years later. \nIt was sold, verified and funds paid to me in a couple of weeks. 4 weeks later they contact me to tell me it’s a fake and have to return it. NONE of their timeframes on their websites suggest these return terms. When confronting them with their own website terms they don’t have an answer for it.","title":"WORST SELLING EXPERIENCE","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2020-12-28","author":"Ashleigh Woolley","text":"Used this site once before and bought a pair of Louboutin Pigalle which were brand new with box and a great price, went to look for another pair of Louboutins and found several fakes listed for sale (lots of which weren't even vaguely convincing), I reported this to Vestiaire Collective to be removed, had no response and the items were still there, ended up having to spam their social media pages with several items numbers which were quite obviously fake and being listed at ridiculously high prices.\n\nI'd be very very careful in future about shopping here as you may just end up wasting your money on fake goods.","title":"Great site, if you want to buy fake items","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2020-12-29","author":"Sonia","text":"I have been using VC for over a year now selling and buying but I found that the web is fine if things goes smoothly but gets very complicated in you case you are a seller and the buyer or their curation team decide that something is wrong with your item. I recently sold a coat in a very good condition at 180 pound where the buyer would have had to pay 750 pound for the same new coat . Their curation team came back saying that there were a tiny hole under the arm and suggested a price of 160 pound to witch I have agreed and I contacted their customer team and asked for the coat to be re listed if the buyer did not agree to the new price of 160 but I received an email yesterday saying that the coat was sent back and I asked them yesterday if they can re list it but they said they can not and that I need to wait until the item is received and when I asked them today  to re list it once received I was told the following : That is longer possible because the quality report was closed after we shipped the item back ..\nI asked the person what that meant but he disappeared. \nIt became a headache that I am thinking to find alternative website to sell.","title":"Can get tricky for sellers","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2020-12-30","author":"Alina Khuda","text":"Owful experience with seller that didn’t ship my item within 8 days through direct shipping, horrible customer service that promised to send a notification to me about a refund and didn’t do anything about it. I left without money and without a jacket. Contacted them 3 times and nobody assisted me in processing a refund. Risky to order with them, don’t have any trust to the company!!\n\nPS. As an apology they offered a 1 month premium membership which doesn’t work. Contacted customer support and they suggested to ignore that msg!!!Have screenshots but can’t attach. Stay far from this fraud","title":"Fraud and continue to lie about their services","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2020-12-30","author":"dana abedi","text":"I sold an item about a mount ago and I have hadn’t written anything about any measurements on the items description, except the size like you usually do, right? It wasn’t a bag, it was a hoodie so I didn’t think I had to. I didn’t last time at least. Later, the customer claims that the measurements doesn’t match the measurements she has red online so she complained to VC, even though the item was cleared and passed the authenticity control. So therefore the item was supposed to be sent back by the customer to VC for a reassessment. After that, silence! No update, no payment, no item returned. Not even a tracking number so I know if the item reached VC?!? I contacted VCs customer’s service and they didn’t do jack! They just said that I need to wait for someone to reassess my item before I get any clarity on if I get a payment or what’s even happing to my item?!?. They didn’t give my any response on my items whereabouts, they didn’t give my an answer on an estimated time table until someone actually reassessed my item or any answer to any of my questions really. They where so unhelpful, inconsiderate, useless and unprofessional. They don’t take responsibility for anything so I am never going to use their so called services again!!! If you even can call that service, which I don’t. Spare yourself the inconvenience and don’t use VC, just makes messes of every possible thing.","title":"Item gone? No payment received, no item returned and useless customer service","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2020-12-30","author":"Tina Cholla","text":"People from the UK cannot send items in the EU and Vestiaire didn’t even know.\n\nI’ve sold an item on Vestiaire, went to DHL this morning... guess what... was informed that Uk cannot ship items in Europe. I didn’t know as I am not shipping items in Europe on a regular basis. Vestiaire is working with DHL!!!! How can they not inform customers ?? \n\n2nd horrible experience with this company","title":"People from the UK cannot send items in…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2020-12-31","author":"Penny","text":"Absolutely horrible, unscrupulous and unethical. Sold items and no payment received.  Different story every time.  I cannot fathom this company doing business without a customer service phone line or email - everything is text.  \nI agree with other reviewers, they hope one will give up out of sheer frustration and disgust at their unprofessional and deceptive practices.  \nI have contacted them upwards of 30 times and still have no resolution - \nWe are talking thousands of dollars, maybe the authorities will be interested\nMy advice is to NEVER patronize this company as either a seller or a buyer","title":"Absolutely horrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2021-01-01","author":"ttp .n1","text":"hi, i have received an email from support about my item to send a receipt. i sent it cropped,but the assistant told me to send it complete so you can see the date, store and more - so i did that and now im waiting almost 2 weeks for a reply. i've been patient because its christmas time but it shouldnt take this long to respond when i see responses here, no more than 2 days old. usually i get response in 2 days not 2 weeks.","title":"no response for 2 weeks","stars":1,"location":"CZ","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2021-01-02","author":"Marlena ","text":"I sold many products via this platform. They charge the seller with enormous commissions and I’m wondering for what?! I was so disappointed when I sold my item (sent directly to the the buyer) and now the month almost past and I don’t have the payment! I was trying to get the info from customer service (asking for proof of payment) but they only assure me the payment has been issued. I used to get the payment from them within 2 days and now it’s almost 2 weeks and I don’t have the payment for my item! Do you guys know who to escalate this issue to the international or French institution for the scammer? In US it works very smoothly but I will not let go to this company.. especially for so horrendous commission I paid!","title":"Sold the product but didn’t get the payment!!","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2021-01-02","author":"Florian","text":"I purchased and received a pair of Saint Laurent boots. Upon my inspection and previous experience with Saint Laurent, I felt the boots were not authentic. Photos were taken and forwarded with my concerns to Vestiaire Collective. They quickly replied with a label to return the boots for their inspection. \n\nThe boots were in their possession for two weeks (10 business days), without any response back to me. I contacted customer service and was told their team would look into the matter. Feeling no progress was made with my issue, I contacted PayPal as well to open a dispute claim. A week later I received a refund from PayPal.\n\nMy advice would be to ALWAYS use a payment processing company if possible (e.g. PayPal, etc) for payment with any online purchase. If necessary, they will arbitrate if you have an issue with your purchase.\n\nI received no response back from Vestiaire Collective regarding their inspection or for my contacting PayPal regarding the dispute claim. My two previous purchases from them were without problem. If it wasn’t for that fact my rating would be lower.","title":"Use PayPal for payment","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2021-01-03","author":"Bricklinng","text":"A buyer shopped my brand new item and shipped it back damaged. VC cancelled my sale and said it’s my problem! I complained and they kept remove and delete anything negative to them!\nWhat a platform!🤩","title":"A buyer shopped my brand new item and…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"},{"date":"2021-01-03","author":"NA","text":"Tried to upload an item and it got refused. I asked why this had been the case and was basically lied to. I was given some poor excuse that there were ‘too many similar items’ even though there are literally no items like it on the site. I asked to make a complaint and was simply told ‘it will be passed onto management’.","title":"Lies to sellers.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=82&stars=1&stars=2&stars=3"}]