[{"date":"2021-03-12","author":"A. Hermansen","text":"Be very careful with VC’s quality check system. It is inconsistent and at a very poor level. Items with clear defects goes through their quality check and the buyer has afterwards poor chances to get help from VC. Their costumer services and chat bot is horrible!!! And on top you pay a huge amount of money to sell and to get VC quality check support. I have closed my account - I was a happy costumer for many years but the last 1-2 years has proven to be a downhill ride in regards to quality and good service! Will not be coming back","title":"Room for improvement","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-12","author":"linda sargent","text":"I am being stalked by this company. Once you subscribe it is impossible to unsubscribe. \nI have contacted them on various occasions, but they still bombard my inbox every day.\nMy latest plea I tried via F\/B but no reply. Just 1 big nuisance, avoid.","title":"I am being stalked by this company","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-12","author":"Lorraine","text":"Don’t buy on this! I bought a necklace that was supposed to be in new condition and went through quality control and it has an obvious fault where it’s missing a Pearl. Can’t get hold of them to get a refund.","title":"Don’t buy on this","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-13","author":"Anonymous","text":"I purchased a pair of Chanel x Pharell Williams women's sneakers that were confirmed authentic by VC.  I sold the sneakers and had the sneakers go through another authentication. which failed and were confirmed FAKE.  Upon closer inspection and lots of internet research, I could then see that they were indeed fake.  I also checked the seller on VC \"kdjluxe\" who apparently operates a bogus business in France and also has an Instagram account \"kdj_luxe\" which states that they are no longer doing on business on PayPal because too many people were complaining about them.  They instead want a direct bank transfer and also do not do returns or provide refunds (fishy).  They also have a bogus website, yet have been in \"business\" for nearly a year.  The fact that VC has been conned by this seller is disturbing and even more disappointing that I have lost trust in them (I am a seller and was a buyer).  I am now in the process of trying to return the sneakers, so I can get a full refund.","title":"VC Confirmed Authenticity for Fake Chanel Sneakers","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-13","author":"Gabrielle","text":"I’ve been waiting almost 3 weeks now for a refund that was supposed to take no longer than 5 days as the seller lied about the dimensions of the item. I’ve had to chase this company over 4 times regarding this as they kept promising me different dates to expect my refund without ever actually giving it to me. As somebody who’s worked in customer service, this company is a joke; they have an “expert” team and I imagine that my dog would be more competent in that job than they are.","title":"If you’re looking to throw away your money then this is the company for you!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-14","author":"SJ","text":"Customer services is non existent.  No phone lines, no replies to emails - and the ‘chat’ service is only supported by AI. \nI have repeatedly asked for assistance with sending to Europe as the labels provided do not have the correct customs information.\nThe automatic system is very good at sending repeated reminders to post sold items: but no response to queries as to how to. \nUnfortunately I will have to stop using Vestiaire as customers are facing unacceptable delays.","title":"Customer services is non existent","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-14","author":"V333","text":"Been selling in VC for years and since mid February they suddenly haven’t paid me for any of my sold items. I can’t get in touch with anyone at all. I literally am now complaining in their instagram. Also the price you sell the item for after fees is not what turns up in your account, it’s always less. \n\nReally worried as they owe me money and seeing that I am not the only one experiencing this problem, I am wondering if VC is in trouble. I am in the U.K. What can I do to get my money?","title":"I haven’t been paid!!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-15","author":"Mother","text":"I ordered 3 products on Vestiaire.\nThe first 2 products were fake products.  After ordering them for about $2000 each, they were never delivered, seller was unresponsive, and eventually I got a refund for 90% of the amount I paid.  So each purchase cost me $200, for nothing.  And they are still listed on the site for sale!  So basically, they list fake products and make $200 for each sale of fake products.\nThe 3rd product I ordered is still waiting for delivery.  And I realized they charge $800 for customs duty.  When I queried them on this, because customs duty should only be $100, they said it was non-negotiable.  So basically, whatever price you see the item for sale on the website, they add an additional 30% markup when you try to buy it, and make it a \"customs fee\".  I am now trying to cancel the 3rd product, but to no reply.\n\nNo, this website is clearly a scam.  Be very careful using it.","title":"Scam - Be very careful","stars":1,"location":"MY","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-15","author":"Yulia","text":"Vestiaire Collective, I think this is really time to reinvent your business. It has been getting worse and worse and by now it got to the point where it is unbearable.\nMy 5 cents to the rest who gave you 1 star: totally perfect authentic items are getting refused for no good reason, and what is funny, some of them had original brand documents. Still CS said \"oh they were found to be fake\".\nReally?! So I am asking a question: is Vestiaire Collective trying to say that Chanel themselves accepted item for repair, fixed it, issued documents and somehow while physically handling the item they did not notice the item is fake? Such incompetent Chanel they are. \nAnd is Vestiaire Collective claiming such an enormous level of expertise which is better than the original brand by spotting a fake in the photo in a glimpse of an eye? Is that right? \nMy 9(!) items were refused within 5 minutes: I even took screenshot from my mailbox. If you try to contact CS, they will send you a disgusting generic response saying \"our experts are working very hard\" and blah blah blah. That really does not look like working very hard. Each listing had 12-13 crisp clear photos together with super close up pics of the brand marks, detailed descriptions, items were in like new condition etc. How anyone could thoroughly check these in this timeframe?\nApparently not, as they did not even bother to check photos of the original documents supplied in the listings, just hit refuse button. And yes, if I could share all the proof here, I would.\nHow you treat your clients, Vestiaire, is atrocious. Sellers are also your clients, BTW, in case you missed that part.\nThe website is so full of obvious fakes while genuine items are getting refused by \"experts\". What. On. Earth.\nSHAME ON YOU.\nWishing someone started a competitor project with the same system which is actually working while Vestiaire can continue to enjoy refusing authentic items and approving and authenticating fakes.","title":"Experts? I really don't think so!","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-15","author":"Aurore","text":"I have been trying to print a shipping label for a week and the app kept saying that I had the wrong postcode. I double checked with the bank, changed my cards even to change the postcode and nada! I have desperately tried to contact customer care through emails and chat, and have repeatedly been told that I was going to be contacted by an expert. Now I lost my sale due to the fact that I couldn't print the label and my Expert Seller Badge. Really sad to be honest!","title":"no shipping label\/ no sale\/ lost badge","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-15","author":"Bella Yan","text":"Hello my parcel is in France and Fedex has been trying to deliver my parcel to you for two days, but you refuse to accept this parcel, why did you go out and today you canceled my sale, I am shocked by your work , urgently contact Fedex and accept my parcel , FedEx track number 773090547483 , ref 14760257 Solitaire white gold ring - Non Signé \/ Unsigned 950,00 € , it is very urgent contact Fedex delivery and accept my parcel it is already 5 days in france","title":"Hello my parcel is in France and Fedex…","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-15","author":"Andreia ","text":"Customer service is by far the worst I’ve encounter . \nThere’s no customer care , respect whatsoever. The waiting time is longer than public services. So sad that I company this big doesn’t value its most valuable resources. Customers .","title":"Customer service is by far the worst…","stars":1,"location":"BR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-15","author":"Angela","text":"if i can find a 0 star, i would use it.  i turely doubtly the company. the bigger vestiaire has become, the worse they are. they are lying, cheating, shameless. they treat both their buyer and seller like the worst ever.... i took extra money me, at the beginning they didn't admit and after a few times chatting with \"client service\" *(\"client service\" they are all robots) i said it's the hyperwallet issue. they sent me an email and promising returning my money within 5 days and now it has been over 10 days. \"client service\" said they don't know when i can receive my money and it is no the issue of vesitaire or it's a question client service, ,robots, don't know how to answer. SHAMELESS! i'm not sure which direction Vestiaire is going,  FRAUDE, probably.","title":"if i can find a 0 star","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-16","author":"Marija","text":"They are telling lies every and each single day. I so sorry I cant put screenshots here for you to see these stupid things they are writing, I am waiting for my money for days and days and days, they just keep saying that experts will contact me in three days, three days more and then three days again... DISASTER \nBreaking contracts every single time.","title":"They are telling lies every and each…","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-16","author":"Sara","text":"I have multiple bad experiences with Vestiaire Collective, mainly as a seller. Last situation was about an item I sold, and which I was unable to ship due to the DHL form missing. VC chat was out of service for a week, there is no telephone number and despite several requests via their online form, didn't receive any help. VC automatically cancels the sale if the item is not shipped within 7 days which is impossible if the shipment details are not sent to the seller. What a waste of time. Better to use Vinted or other platforms","title":"Avoid Vestiaire Collective (seller)","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-16","author":"Buyer","text":"Horrible experience! I bought 5 items and 4 of them are fake! They were confiscated by the customs. I sent all the documents with pictures to VC and 0 results. They promise to come back in 2-3 days and stay silent. And more important the sellers who sells the fake goods are still there. VC does not do anything against them! it looks like the official platform where people can easily sell the fake goods in Europe!","title":"Horrible experience","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-16","author":"Charlotta","text":"I sent my product to a buyer, and then Vestiare Collective cancel the order, the buyer got her money back AND the jacket that I sold (a fur), and the customer service doesn't respond to me. I haven't heard back if the fur is on its way back – or anything! Their customer service has been the worse since a year back... Don't trust Vestiare Collective.","title":"The buyer got my jacket and her money back!!","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-17","author":"Marija","text":"After 15 days of waiting and while the buyer is holding my item, they are telling me they accepted the return of sunglasses (they never saw) because buyer said it smells like smoke). Yes, plastic sunglasses smell like smoke hahahaha. So someone is wearing them for 2 weeks and they accept return of sunglasses (repeat, PLASTIC and METAL sunglasses) because they trust someones word it smells like smoke.\nDisguisted again.","title":"FRAUD","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"},{"date":"2021-03-18","author":"v","text":"The worst customer service ever. Literal BS. Their chat is a nonsense, you have to wait forever to be answered. They ask you stupid questions and ask for screenshot as if they didn’t believe what you are saying. Obviously they invest 0€ in IT. Besides their staff is arrogant, helpless and strongly stupid. Waiting for my issue to be resolved and deactivate my account for once and all. Spare yourself bad time and buy\/sell elsewhere.","title":"The worst customer service ever","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=67&stars=1&stars=2&stars=3"}]