[{"date":"2021-02-10","author":"Jean Louise Finch","text":"Seller did not disclose damage to item and then refused to the negotiated compensation. Also, what are the \"taxes and duties\" the company add after the sale for?  Beware of this company.","title":"Seller did not disclose damage to item…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-10","author":"Julia","text":"Vestiaire Very Poor Customer Service. After purchasing a pair of boots I have probably had to contact this company about 5 times to ask where the parcel is!  I am now on day 15 and today has been the worst... I literally had to wait on their online chat for 2 hours to then speak to a very unhelpful rep who said she couldn’t help! If you are buying from the Uk just be aware that Vestiaire use Chronopost as their courier company who  have chronic reviews. I have moved address too, a few days ago, and neither Vestiaire or the courier company are helpful with updating my account.  Very frustrating and I really won’t be buying from them again !\nUpdate on day 19.... I tried again today but was left speaking with yet another very unhelpful customer services agent who basically said it’s not their problem! What could and should have been a pleasant experience really has turned into a big headache and as I said I will never ever buy for them again!","title":"Vestiaire Collective - Very Very Poor Customer Servic","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-10","author":"Ioana Oltean","text":"Very dissapointing experience. I ordered a product that had defects not shown in the pictures posted or the description provided. I wrote to Vestiar about this and got no reply. After I reached out tl customer service, I was informed that my request for return was denied and even they would feel bad in my situation.\nThis is very very poor business management.","title":"Very dissapointing experience","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-10","author":"Laura C","text":"I've purchased a pair of Stuart Weitzman grey boots from them. After a month and a half and don't have the shoes delivered and more than that even though their T&C are stating that in case of non delivery I can have a refund, the refund is not issued and according to Romeo from customer service(which said to me that has no answers for me) my refund is blocked fromTODAY(so probably the guy did something) this is after 2 agents Marta and Mary Jane advised me that I will have the order cancelled and refunded. Completely disgrace, I will probably take this to Trading Standards and if they don't complete my refund I will get my bank involved :)","title":"Refund not processed customer service unhelpful","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-11","author":"Laura","text":"I have bought and sold through Vestiaire for many years and never understood all the bad reviews, until my most recent transaction!\nI purchased a Khaite bodysuit prior to Christmas via Direct Shipping. I've now decided to sell the item using Vestiaire and they are refusing it. I've tried 3 times with different photos, different description everything! I've spoken to countless people on the chat function - no one can tell me why I am unable to sell something that Vestiaire had no problem selling to me barely 2 months ago. \nWhat is it that Vestiaire know about this piece that I don't? My next step will be to look into the authenticity of the piece and raise it with my bank. Perhaps the rumours that their authentication team is extremely poor are true.","title":"Have they sold me a fake?","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-11","author":"Osmosis Muscat","text":"I would give a minus if i could. So I've lost £500. I never got my item sadly and they never gave me a refund. Im messaging and emailing everyday but got no where. Ive been just told they are investigating it. All images and emails attached. I feel so humiliated and upset. This is definitely a breach of consumer rights","title":"Learned the hard way","stars":1,"location":"OM","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-12","author":"Lyn Mcdonald","text":"No answers from the people selling items and automated live chat disguised as a person \nFound a bag I wanted, at a price too good to be true. I asked for two more photos and a couple of questions. Over a week no answers. Asked Vestiaire if they did anything to get sellers to answer, or sanction if no response (ie remove listing) I thought I was talking to a person called Leon. Turned out I was talking live to an automated machine. Terrible service, do not trust enough to purchase through them","title":"No answers from the people selling…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-12","author":"Jones Elizabeth","text":"Poor aftercare service concerning payment of refunds and lost items.Still waiting for payment for lost item sent in 2020.They have to repeatedly emailed just to get a refund for a  poor quality item and they are evasive about payment for the lost item.Very disappointed.","title":"Poor aftercare service concerning…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-13","author":"Stella Doyle","text":"Bad experience! Customer service is rude, no help from them. Their operations aren't organized properly - they sent my expensive purchase to the wrong address and they can't update the shipment even though it didn't leave their warehouse yet. Just sloppy and not attentive to their customer needs. Won't use it again.","title":"Bad experience","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-13","author":"Nicole B","text":"Terrible company with Terrible customer service. LIES AND SCAMS!! Does not accept returns for faulty and misrepresented items. Please do yourself a favor and do not buy from this awful company.","title":"Terrible company with Terrible customer…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-14","author":"Ina Clavano","text":"I truly hate VC with a passion. As a buyer, they do nothing to hold bad, dishonest sellers accountable. Both myself and a friend had orders cancelled by the seller due to them being unsatisfied with the ending price (that they set in the first place) and two different representatives stated it was within terms of service. This allows the seller to keep their listed and sold items at their sold price on their page leaving buyers to think they have a deal. VC has not taken off the \"Trusted Seller\" badge (which is dirt easy to obtain in the first place) nor do they allow buyers to leave reviews. They also pre-screen comments left on buyers pages\/items so there is no way to warn other potential buyers. Seller in particular (@alex125.) Their \"compensation\" was a $10 off credit. POS site. Not to mention the prolonged shipping\/fees to detour to their \"facility.\" Avoid if possible.","title":"Vestiaire s a petri dish for dishonest sellers","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-14","author":"Mitesh","text":"The site is full of fakes! When you report it to the customer service they don't even care and even promote it further to gain more attention from the buyers, shocking. Cannot believe they claimed \"pre-check\" the items from the pictures when all the clues are in there.\n\nListing 13748394 shows fake packaging and booklets from a fake LV product as the real ones never included those. Listing 14322423 is another excellent example as the tag shows the bag was meant to be a limited edition when that particular model wasn't - so how did these pass the checks of their experts? Disgusting.","title":"The site is full of fakes","stars":1,"location":"EE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-15","author":"MissN","text":"I SHIPPED MY ITEM UNWORN WITH TAGS, WHAT I RECEIVED BACK IS A TEE WITHOUT TAGS AND SMELLING OF GASOLINE!!! YOUR PAGE IS A FRAUD! SHAME ON YOU!","title":"I SHIPPED MY ITEM UNWORN WITH TAGS","stars":1,"location":"SI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-15","author":"Fashion","text":"Have purchased a second hand shirt for £49.\nUpon check out I have got a shock, import duties, VC fees, shipping ( no more up to us to choose direct shipping ) cost me almost as much as the shirt itself!!\nShipping £32.15 \nImport duties £9.80\nAuthentication fee £5.99\nTotal : £47.94\n\nThe UK's guideline is that no Customs is payable on purchases under £135.!!\nWhen questioning I am told \"it's because of Brexit, we can't do anything about it ! \" , but reading the Government guidelines, this appears to be untrue.\nVAT, yes, but not Customs fee. Especially on SECOND HAND ITEMS!\n\nClever practice again, Vestiaire? Making extra money on us while you can hoping you can blame it on \" Brexit\" .Shame on you!\nWhat is the point having a Vestiaire Collective branch in UK when products purchased from UK sellers by UK buyers still are shipped to France and then shipped back to us with\n import duties added on top?\n\nSo many years in business and you still don't have a clue what professionalism is!","title":"Braking the law","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-15","author":"Elisenda Rotger","text":"I've been using this platform since 2015 and never had any problem UNTIL now.\nI sold a trench coat to a girl for 160€ and I'M STILL WAITING FOR MY MONEY.\nI've phoned my bank twice and they tell me I don't have any movement planned from VC so this means I WON'T RECEIVE THE MONEY.\nYou have no shame because this money belongs to the sellers, not to you.","title":"DON'T SELL!!! THEYRE NOT GOING TO PAY YOU YOUR MONEY","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-16","author":"N Jones","text":"If you want to sell some clothes for some profit, this isn't the place! They have stupid a commision, anything you sell between £0 -£100 they take £10, meaning not only you don't make a profit but you will struggle to sell because you would have to increase the price £10, but who will buy anything from there when you have to sell higher then it is else where!","title":"COMMISION IS REALLY HIGH","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-16","author":"Bianca Beltramello","text":"Awful customer service. Still waiting for my refund after almost 2 months and I had to sweat blood for it and even involve Paypal customer service in the process.","title":"Awful customer service","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"},{"date":"2021-02-16","author":"Ishak Hmeyed","text":"Horrible experience : I place an order, receive the order confirmation email, payment is instantaneously registered on my credit card.\nThe day after, I contact the seller, he tells me that he hasn't received a notification from them yet, and that he's about to sell to another buyer. (Yes, item was still listed as available). I reach out to them to acknowledge the issue, they tell me not to worry, a system bug is causing the problem. Seller sells to another buyer, and gets the shipping labels instantaneously.\nThey send me an email stating that the order has been canceled by the seller, and refund is being processed !  \nBasically, the item was sold TWICE in less than 24h.\nWhat a shame.","title":"Horrible experience","stars":1,"location":"TN","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=73&stars=1&stars=2&stars=3"}]