[{"date":"2021-04-09","author":"Valued Customer","text":"To SELLER—be aware, please check Vestiaire commission on your items regularly!   Vestiaire overcharged their commission on my 7 new listings I posted about 20 days ago, after several emails to CS their technical experts replied & insisted nothing wrong (they keep lying as usual).\n\nI decided to take the matter to the Hong Kong Consumer Council, with HKCC’s involvement Vestiaire CS finally admitted they overcharged me and said their technical experts will have the mistakes corrected.  \nI asked CS how this could happen, do Vestiaire charge commission as much as they want & not following their commission guidelines?\n\nCouple of days have passed, nothing happen\/corrected, I will give them a few more days, will keep you guys updated!   \n\n——————————————————-——-\nTo BUYER— I suspect there are internal dealings within Vestiaire.   I bought a very rare jacket at super good price, I was excited & looking forward to receive it.   The seller confirmed to me she had shipped the jacket to V Paris, but it didn’t show in the system, eventually my order was cancelled & I was refunded.    The suspicious thing is the seller told me later she was paid, so who has my extremely rare jacket?  \n\n———————————————————-—\nAnother CASE\nA buyer offered me 48usd for a McQueen pullover, despite I’m happy my 500usd pullover go to a new home I don’t want to pay the 17usd fixed commission.   I explained to the buyer, I would appreciate 51usd so I only need to pay 10% commission  to V instead of the fixed 17 (51-200usd = 10% commission).     I was amazed seeing our chart messages were deleted about 30 seconds later.  \n\nBuyer agreed and bought it at 51, when the pullover arrived V’s HK office their experts informed me they found the length of the pullover was 1cm short from what I described.   They proposed to the buyer a few usd reduction, at the end I was charged 17usd commission 😡\n\nVestiaire used to be good, I have been shopping there since 2014 and started selling about 5 months ago.    Their services are going downhill the past 9 months, I just hope the Kering investment would bring V back to a decent platform once again!","title":"To SELLER—be aware","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-09","author":"Joanne","text":"I have just received an email this evening after I sold a brand new pair of shoes with original packaging saying that the buyer has flagged up an issue and that they may send the goods back to me and not pay me. I have written to the company asking what is the buyer’s complaint, but haven’t received a response. I cannot imagine what can be wrong with a brand new, unworn pair of shoes, other than the buyer has decided to change her mind as they don’t fit as they expected and I am being used as the scapegoat...I sincerely hope that I do get paid and that the Vestiaire system is robust and honest as I will be taking matters further if on this occasion I have my goods returned to me as thay say may happen...","title":"Email","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-10","author":"Ileana Lund","text":"I've never had an issue before with Vestaire, but in a recent purchase the seller sent me an item promptly, and then Vestaire refunded me the money in full, effectively stealing the item from the Seller! \n\nWe're trying to resolve this in the buyer\/seller chat, but Vestaire are putting barriers in our way at every turn. I really cannot recommend them in good faith now, which is such a shame as previously they've been great to use.","title":"Issues with seller payment","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-10","author":"BeautifullyDamged","text":"Placed 2 orders and they asked me for a copy of my bank stattement and photo ID. Very suspicious, so now I am not sure if I will even get my items bevcause they never reply to emails. This company is rididulous! order are 38013855 and 36196442","title":"Placed 2 orders and they asked me for a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-10","author":"karolina souvlakis","text":"I sent my Gucci bag from abroad. They didn’t accept the package to not to pay the custom duties. I received a message that my sale was canceled because they didn’t receive the package. I have all confirmation from the post. In the meanwhile my bag is gone somewhere in France.","title":"I sent my Gucci bag from abroad","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-11","author":"Kay ","text":"Is there was an option to give ZERO stars?!\nI had a LONG issue with refunds for 10 items I had bought where the seller had cancelled my orders. Vestiaire had my money though, they said they were changing payment systems at the time & my refunds took 3 weeks!!!  Through my perseverance & contacting customer service through chats & emails 10 times or more (not exaggerating) I finally got my refunds back. However, no credit or voucher was offered as a gesture to make up for all my time & effort that got wasted! They just said we are changing our system. However, that's not my problem?! \nMeantime, my moneys was with Vestiare for 3 weeks! And I paid interest to credit card company as my balance due date had come! Terrible terrible service.","title":"Is there was an option to give ZERO…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-13","author":"SM","text":"I ordered a Chanel Boy bag that was a nano size when it came. This wasnt registered anywhere. When I asked to return it they told me I had to just RELIST IT!!! Unbelievable and purely illegal in UK Consumer Law. Customer service extremely unhelpful. Daylight robbery I am so disappointed.","title":"ILLEGAL UK RETURNS POLICY","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-14","author":"Livs","text":"I don’t like to put negative review, but I think the users need to know. I sell  few items on this website which ok apart from the high commissions!! \n\nI purchased few items and 1 of them is FAULTY! for unworn new items description, I sent the photos and they agreed unlocked the return form and do the refund after 48 hours as received. \n\nI chased them with emails about the refund??!!! the last email I received  unfortunately they couldn’t do the refund after second check. Although I paid extra service for quality control at the beginning when purchased.\n\nNow I try to send few emails and all come back with failure notice!! \nReally don’t understand what’s happening ... POOR CUSTOMER SERVICE! They don’t try to solve the problems instead blocking my emails!\nSeems like they only concern to get commissions and forget to maintain the customer support with trust and loyalties. \n\nIf anyone has suggestions how to deal with this situation please leave a comment, they have my items and I paid for almost over £200 worth of goods (faulty) .","title":"I don’t like to put negative review","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-14","author":"K. D.","text":"In Short, bought something, then realised something was not right then requested to cancel the order within the hour. Their words \"we can never cancel a order\".Hmmm, what about the consumer right to cancel? I understand items are no return, but they do think they can overide the law, perhaps there are some tiny words in the T&C that says such. But not one point anything directs me to the those, anyway. not worth wasting time with them. Some customer service talks like AI designed in 90s.","title":"It seems they can override the law","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-15","author":"Maria S.","text":"Incredible poor management for return. The customer hasn’t returned the product for 1 month now and VC hasn’t followed up and has blocked the payment. I have been dozens of times on the chat is not follow-up, incompetent support saying the matter is with \"expert team\" looking into it (for 1 month). Meanwhile don't have the coat and neither the payment. Considering that VC is taking on top of that a high fee on transactions. Very disappointing!","title":"Incredibly poor management for return","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-16","author":"Sonia","text":"Le service de VC se degrade au fil du temps. Ca devient plus difficile de contacter les service clientele et j ai eu des problèmes récemment sur des achats et ventes. Je continue a utiliser l app étant donné que j ai deja listé plusieurs articles et j espère que VC fera des efforts pour améliorer le service dans les mois a venir.","title":"Le service de VC se degrade au fil du…","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-16","author":"LV","text":"I sold a Louis Vuitton pouch and its been more than a month and there is no sign of getting paid. \n1: Customer services evade questions or keep on repeating that say they are working on it. \n2: The buyer has wrote emails to Vestiaire customer service (I was cc'ed) to confirm that she has received the item and also shown the money withdrawal on her bank account.","title":"Horrible and disappointing","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-16","author":"Liubov shaykhranova","text":"Awful customer service, who does not LISTEN at all. Calling me by wrong name, giving the answers to all the question but not the one you asked.\nAnd now, VC is requiring my photo ID and proof of the address, which I should take a pictures of and send to them in order to be able to get paid for the items I have sold! I wonder if that’s legal at all to do this? It is sensitive personal information and I don’t trust VC, who’s personnel proved to be totally useless and incompetent in solving even simple tasks. Management of VC, have a look of what people write here and Listen to them, otherwise your company will be non existent very very soon.","title":"Asking for confidential information","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-17","author":"Szilvia Lakatos","text":"You can buy good quality items on a low price but if you got any issue, you are in trouble. Poor quality customer service, agents seem to not having any idea about what's going on. Whenever you contact them, they don't have a clear picture on what is going on and you have to keep telling the exact same details again and again. Isn't there an accessible track record that the customer service agents can look at? Or they simply don't take time to do so..?\nLast time my item got last (a 900€ Gucci bag), I contacted Vestiaire several times and kept telling them the same details while asking for information. This one time an agent sent me a screenshot, telling me that the parcel got already shipped to me. I looked at the screenshot that said that the package got shipped to Vestiaire and not to me. I informed the agent about what is actually in the screen..:D It was pretty ridiculous as she simply should have paid a little attention and read what was actually written there. Not a very reassuring moment..\nOverall, it was a really stressful situation and kind of ruined the experience of buying my 1st designer bag. Definitely not recommmended.","title":"Really poor quality customer service","stars":2,"location":"HU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-17","author":"Cathy Kremer","text":"I bought an article which they reviewed and due to a flaw I was offered a price reduction which both myself and the seller accepted. I then received an email from VC stating that I had now received a code worth the price reduction. When I tried to use the code the reduction applied was way less than the actual amount of the price reduction for the flaw. I complained to VC and after lots of emails and chat to explain which they had trouble to understand, instead of just reissuing a new code for the full amount they issued a second code for the difference. So now because of their mistake I have to make 2 purchases and pay more money if I want to benefit from the money that they owe me. They just say that I already received 2 codes for the amount. This is unacceptable behaviour and the result of a 1 week back and forth with them...","title":"VC making clients pay for VC’s own mistakes","stars":1,"location":"LU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-18","author":"Johan","text":"Buyers you ABSOLUTELY must have every item purchased on this site authenticated by a third party and ALWAYS! ALWAYS! pay via PayPal so you’d be protected!!\nAs they’re more and more scammers out there starting a resell business by flipping replicas for a quick buck as authentic, this platform is getting literally flooded with fakes! Shockingly, they grant Direct shipping option even to brand new sellers who abuse it and send buyers fake junk without VC controlling the item (not that they’d never let a fake slip through but still..) \nMore shockingly, they rather go after all the comments revealing the nature of the item and remove them all but let a fake be sold on their site so they could pocket commission! Most recent example: \n15539596 terrible fake of a lv bag, one you see for €10 on the streets in Southern Europe. Sold for €668 from a brand new seller via direct shipping!! Despite dozens comments saying what an ugly piece of fake garbage it is! They removed them all!","title":"Fakes, Fakes, Fakes and more FAKES!","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-19","author":"Moll","text":"I have to agree with a person below - customer service is AWFUL. I've sold a few things through the site, mostly hassle-free, but recently bought a pair of Gucci mules. I was keen to get these authenticated so they went to Paris, but from Paris never made it past the UK consigment centre. This was 2 months ago. They insisted I had to chase it with chronopost, the shipping company, and now despite the fact it according to chronopost has been returned to sender and has never come within 250 miles of my house are insisting I send them ID, proof or purchase, tracking details etc - when this literally has nothing to do with me. I will be seeking a refund via paypal, and will not buy through them again. I realise the hold up was outside of their control but the fact that they can't take responsibility for their shipping company - and the fact that this looks like its lost in their own warehouse?! - has completely put me off. Also I do wonder about fakes - lots of the sellers of the high -end stuff do seem remarkably suspicious","title":"Very poor customer service - lost in transit and not my fault","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-19","author":"VenJoha","text":"I used to think VC was a pretty good place to buy and sell products, and I picked up some good things there. I never bought or sold very expensive designer products, as I didn't trust it that much. But since Brexit, as a UK seller, things have gone downhill so much. I had to really push to get help on customs documents, which they should provide automatically, and they've had rows with DHL so it's sometimes been hard to send stuff using their labels. Most recently I had to contact DHL to arrange shipping, and they said they have LOADS of calls about VC problems, and that VC are using an old system that is obsolete. Is this what a professional company does?! And what is more, since Brexit VC claim that it's not possible for UK sellers to sell kids-wear or other products like glasses... they say they'll sort it, but it's been months, so I can't shift half my inventory. Recently they've also started a rule where they'll delist your items after a certain number of days (60 days after posting, i.e. only two months!) if you don't confirm. Except the link doesn't work, so some of my items I'm selling have disappeared. It's a hassle putting stuff on the platform with their buggy app, so I'm not sure if I can be bothered.\nThe customer service is pretty poor, passing buck or saying they'll get back later. And the standard of English is so bad that it's almost unintelligible. \nI'm already selling on other platforms, think I'll leave until VC gets its act together.","title":"Gone seriously downhill","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-20","author":"Ellyce","text":"Sold a coat via Direct Shipping to the buyer. As part of Vestiaire’s own policy I should have been paid within 72 hours of delivery. Instead on the same day the item was delivered, Vestiaire cancelled the sale, saying that I hadn’t yet shipped it. After a week, and contacting a different customer service person every day as you cannot have your case managed internally, I’m still being told by each person that it is being looked into by their Expert team. There has been no confirmation on whether the buyer will have their money returned or when I will be paid. Im being charged 35% commission for a system that doesn’t work, terrible customer service and all VC have done is issue me a courier label which their system can’t even track. Highly recommend avoiding this site","title":"Awful, avoid selling here","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"},{"date":"2021-04-20","author":"Tina","text":"Do NOT send your item via direct shipping!!! I have sold my item via direct shipping and after 72 hours received an email saying that the buyer has not flagged any problems and that is happy with my item. I went to check on the app where it said “item accepted”, “payment scheduled for 20th of April”. I was happy everything went well and waited for my payment. BUT, TODAY 96 hours AFTER the delivery and 24 hours after yesterdays email in which says the buyer is HAPPY with my item and did not flag ANY PROBLEMS, I received an email saying the item is NOT COMPLIANT AND THE SALE IS CANCELED!!!!! TODAY, 96 HOURS after the delivery and after saying the item has been accepted and after I was waiting for the payment. This is absolutely insane and shocking!!!!! I contacted support via chat but again NO HELP AT ALL. How in the world can a buyer flag problems AFTER 72 hours and how can they cancel the sale without ANY EXPLANATION?!??\nThis is ridiculous. I want my money RIGHT AWAY!!!","title":"HORRIBLE!! PLEASE READ!!! DO NOT SEND ANYTHING VIA DIRECT SHIPPING!!!!","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=63&stars=1&stars=2&stars=3"}]