[{"date":"2022-04-06","author":"Mgmirko","text":"Guys please listen to me DO NOT USE VESTIAIRE!!! IT’S A SCAM COMPANY!!!\nIT TAKES ONLY FEW MINUTES BUT PLEASE REPORT VESTIAIRE TO ACTIONFRAUDUK!!!\n Please listen to me STAY AWAY FROM THIS HORRIBLE APP. The people in customer service are a joke they are not willing to help at all they actually don’t care!!!! I’ll do anything to share this on any social media or any other platform because these people are scammers and they need to go to jail!!! \nIt’s like a MAFIA, please please stay away!!!\nEverything is just wrong, if you are a seller, then be ready to not see your money once you sell something and if you are a buyer be ready to receive FAKE ITEMS!!!!!! Let’s take down this company!!!\nI have reported Vestiaire to ACTIONFRAUDUK, guys do the same! Please report VESTIAIRE TO ACTIONFRAUDUK!!!","title":"Report this to ACTIONFRAUDUK!!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Diana Kim","text":"I experienced a problem with payment from Vestiaire for my sold items of more than three weeks ago. The money has never reached my bank account. I raised the issue 4 times via email, chat and FB with no results! They just tell me that they have made the payment, but when i explain that i have not received the money, they promise to investigate it and just disappear!!! There is no way to call them so i just have to keep raising the issue with no response!! This is really frustrating! And we are talking about 1224 euros here!! Terrible customer service! Items reference 19881515 and 9911276.\nIf the issue is not resolved or at least addressed this week i will hand it to the lawyers.This is unacceptable!\nI have sold more than 130 items on this platform, I would expect at least a decent customer support as an expert seller!\nHolding on my sales for now, till this issue is resolved.\n\nAwaiting the answer from treasury department. Hope the problem is resolved soon and I will get my money. I will update this review accordingly, depending on the situation.\n\nI finally got my payment. I would still say though that Vestiaire can improve the work of their customer service. It is frustrating when you don’t get any replies on your emails. Also regular update on the status of the query would be much appreciated.","title":"Problems with payments and terrible customer service","stars":3,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Diana Tavares","text":"worst costumer care ever ! i pay for the control and authentication and receive a bag in another shade. the item describes fuchsia and i rev«ceive a different kind of pink! the \"expert\" team is a joke. they didn`t refund me. it was like talking to a rock. forget about this site. if it goes wrong you will never see your money back...","title":"worst costumer care ever","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Liv","text":"Sent my sold item on time and buyer has received the item and the 72 hour evaluation period is long over. However due to an issue with Vestiaire’s website the sale was cancelled because it did not register the parcel before it was delivered, and I have not recieved my payment. Have contacted costumer service numerous times and each time I’m informered the parcel is indeed delivered and that I will be contacted by the “expert team” within 24 hours. Have never been contacted, and the costumer support just keeps insisting on contacting the buyer who’s payment they cancelled due to a failure on their website, and sending on to this “expert team”.Just ridiculous. I’m also pretty sure it is illegal not to issue my payment or return the item to me. It is not the sellers issue that Vestiaire does not collect the proper payment from the buyer. So will not be using this crappy yet polite service again.","title":"Item sent, delivered and but no payment to buyer…","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Mgmirko","text":"After posting a negative review on TrustPilot I’ve been contacted by Vestiaire customer service with a very disturbing email saying I should have removed my review and to not report Vestiaire to ActionFraudUK and also they have blocked my account due to this “ false “ review!! I’m honestly speechless how they can get away with this! They stole my money as they never refunded me for items they have lost, they threatened me over chat and had an abuse behaviour. Buyers and sellers beware of this!!\nThis company IS A BIG SCAM worse than MAFIA and as I said before please report them to ActionFraudUK!!! D NOT USE THIS APP!!!","title":"After posting a negative review on…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"Helen Picken","text":"I reported an issue with the courier as the seller, was given some flannel and told they would check with the buyer. The buyer apparently has now opened the case and Vestiaire didn’t bother to contact me until I chased my own case. The other item I shipped to the same address at the SAME TIME got there, go after the courier or the buyer because I did everything I was supposed to and now I don’t have my item OR the payment.\n\nThey’re THIEVES.","title":"Blaming me for issues with the courier THEY appointed.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"Aida Gargary","text":"The worst place to buy ANYTHING!!\nThe support are careless about how theire so called trusted sellers which has sold 3 items sell and behave🤬\nI recommand you ALL to stay far away from that platform if you can call it that","title":"The worst place to buy ANYTHING!!","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"TwoCents","text":"En français, pour faire court : évitez, évitez, évitez. Sauvez votre peau. Service clientèle très évasif. Zéro soin pour vos articles coûteux dans l'expédition. Et s'il vous plaît, ignorez les réponses de VC dans Trust Pilot. Si seulement ils faisaient autant d'efforts dans leurs réponses privées avec les clients ! Mdr.\n\nOh my goodness where to even start with how bad this site is. I feel a sense of relief to see it's rated so poorly on this site - I know it's not just me. Sorry for the rant but...\n\nI ordered an item in OCTOBER 2021. I finally got it in April 2022. Seller sent it on time, no problem. It went to Vestiaire... that's where it all went downhill. They sent it out to my address.... without my address line. Like, literally my Apartment number, Post code, and City. No street name, nothing. Sent back to the Vestiaire warehouse obviously because it couldn't be delivered without a street name (not that anyone from Vestiaire told me or emailed me that it came back, I had to find out myself later by asking). I message Customer Services - they're like, \"Oh yeah, it's here! :-) :-P\" Ok cool thanks for telling me. Ask for it to be sent out again. I tell them: for the love of god, use my correct address it's very IMPORTANT. (Please note my address is correct ON THE VESTIAIRE WEBSITE so it's not on me that they keep sending it incorrectly. I wrote it out again for them in the service chat). They say of course... long story short they re-attempt delivery with the same wrong address... wait for it... three more times. I mean, it's almost laughable. So - whatever - all trust in this site gone, can I at least have my delivery charge refunded? No response EVER. I have now asked maybe 7 times? Their response is always \"Sorry this delay has happened, I'm here to help!\" and I have to keep replying \"Please refund me\". They're not even saying no they just don't answer to that. It's like in their customer service guide it says \"Just don't engage until the customer loses their mind and gives up out of sheer insanity and exhaustion\".\n\nConsidering the price you're paying on this \"luxury retailer site\"... I say run. Ebay, Vinted, ANYTHING ELSE. This is bad bad bad. Don't even get me started on how the products they have on there are 50% good sellers, selling their ware, but then 50% just people buying new designer and jacking up the price... even though you can just buy it literally yourself straight from the designer's site. Vestiaire does nothing about it. Expert vintage sellers I follow have also posted about clear fakes being posted on Vestiaire. Whole site is just bad news.","title":"Oh my goodness where to even start...","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"Tanya Harbas  from Croatia","text":"Dear VC agent\n\nIn response to your email please note :\nYes, it appears I was paid or at least VC attempted to pay me .Wrong name …my account details !\nAfter ten days my bank send money back as they would not release funds .\nOn Tuesday 3 April I sent My banks report to VC.support pro .\nThe ball is in Vestiaire Collective court now !\nHopefully this will be soon sorted out .\n\nTanija","title":"Dear VC agent","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"alix","text":"I have not received the payment. I have sold an item more than a month ago, been promised more than once that they'd solve the issue, of course they didn't and then even stopped emailing me or answering my emails. So now, after a month and a half, I can say that they robbed me. Would sue if I could","title":"I have not received the payment","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Jess Palmer","text":"A big headache and a lot of hassle avoid","title":"A big headache and a lot of hassle avoid","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Jasmine Bee Emily Boni-Ball","text":"As someone who wanted to sell a simple pair of Hermes Oran Sandals, I highly recommend you look to other platforms. This is the first and LAST TIME I ever try to sell with Vestiaire Collective. \n\nNot only did it take nearly 2 weeks to have my items shipped back to me (they were not approved to be sold) but they returned them damaged. I am furious.","title":"Sellers be aware","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Natalie Egmore","text":"Lost item again. They lost some chanel espadrilles that I never got. I did get a refund lucky that time. Just spent £900 on a louise vuttion neverfull, again the something, God only knows if I'll get a refund. Customer service once again appalling and have no clue what's going on. Six weeks last time this went on of stress and waisting my time. Because they did give me a refund I did buy other items, that we're no problem but as soon as you have a problem they are litterly rubbish, they have no clue what their doing, you never get an honest answer and if you do get an answer one person say's one thing another person says another thing. I can't handle the stress of buying through this company. If it goes smoothly brilliant, if not then you could be out of pocket and product massively.","title":"They've lost my purchase again","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Mia Osborne","text":"I have come to understand the agents have the power cancel a sale if they want the item or if they want to give it to an expert seller or collector. I had saved on premium an item that when the alert came up - the link was broken or the listing disappeared. 24 hours later it appeared with an expert seller for 6 times the initial price. This can only have been an ‘internal’ sale as I checked the listing within 1 minute of the item being available online. Really disappointing like their customer service where you have to wait days for a response and also the response is usually not at all to do with the question asked in the first place. I think the reviews on here paint a pretty accurate picture of what happens when there is a problem - there is no sort of customer support. I think in general the customer support has gone down incredibly in the space of 2 years.","title":"I have come to understand the agents…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Tracy","text":"Terrible terrible company…… \nPlease do not use!!!!!!!\nItem not delivered and 5weeks later still no refund, please do not use","title":"Terrible terrible company……","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"gillianHolling","text":"Sorry but I thought that fees were not taken on the first sale.","title":"Sorry but I thought that fees were not…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Aliyah Rośe","text":"Do not use if you don't want your item to be lost or not refunded or paid, I just lost £2000 on a louis vuitton handbag that i sold on vestiaire collective website they had sign me out from the account or shall i say deleted my account and not heard from them for over a month now, I'm devastated. Worst nightmare is vestiaire collective i will be calling the police and my lawyer hoping i wi get my bag back, also I've paid £12 to them to return it back to me which did not happened! Terrible company i will put this everywhere i can in my power.","title":"vestiaire collective scammed me and not returned my £2000 bag","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Amanda Clarke","text":"IF YOU PAID BY PAYPAL PUT IN COMPLAINT AND ESCALATE IT. \n\nI purchased a VALENTINO ROSIER handbag it was a fake and a bad one, I own 20 so I should know I bought 7 from them. They said it isn’t a fake and then put it for sale under my name. Anyone that asks me I tell them it’s a fake and I won’t on sell it and find it unethical and unscrupulous. I have contacted them via chat bot 5 times. Emailed 3 times. Nothing. There is no contact person, no direct phone number. If you look at all the negative feedback in the last few days I am guessing they are BANKRUPT. Buyers be ware.","title":"I purchased a Valentino Rosier handbag…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"KaterinaKontoklotsis","text":"very high commission","title":"very high commission","stars":3,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Kate Evans","text":"Item number 21632400. Hermes\/Evri lost the parcel. Vestiaire promised refund on 3rd April. Spoke to customer service who seem to have no authority…, everything has to go to an ‘expert’. An expert in what ??? Reading tracking information ??? 32 days since parcel shipped. Added bonus that sellers have NO choice but to use Hermes\/Evri. Carrier  pigeon more reliable.","title":"Item number 21632400. 32 days later","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=7&stars=1&stars=2&stars=3"}]