[{"date":"2021-05-11","author":"Customer Mrs Regan","text":"I have very recently bought a Chanel hand bag I paid for it and waited patiently for it to arrive eventually it did. Baring in mind the description of the bag was very good condition virtually no signs of wear. When I opened the box Immediately I saw that the clasp was broken along with the flap of the bag was very badly stained and deep scratches around the bag. Vestiaire is very bad to get anyone to speak to I sent numerous emails I had to send pictures of the state of the bag then send it back for inspection. After 2 days Vestiaire confirmed the bag did not match the sellers discription\nand said I would receive a refund but no apology or acknowledgment that it should never have had a label on the bag to claim it had been inspected.\nI had to send e mails every day for a week to get them to pay me my refund it was extremely stressful.\nVestiaire even sent me notifications that the bag had come back into stock but this time it was down graded \nto fair condition and they listed all that was wrong with the bag and that some of the bag had not got Chanel parts to it. \nMy advice to others who are thinking of purchasing anything from this site don’t they are not professional and very much living on past reputation.","title":"Vestiaire not inspecting the merchandise","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-12","author":"Ryan","text":"I bought an item and went through so-called Vestiaire Collective check (which is a paid service). I specifically asked the seller if there were any signs of use, any wear and tear, and received a reply that it was all perfect. The item arrived faulty. Vestiaire Collective claimed that I cannot return the item as their staff has checked the item and it complies with the description of the seller. Totally unacceptable. How is RUST on metal considered perfect condition?","title":"Useless Vestiaire Collective Inspection of Item","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-13","author":"Emma","text":"Same problem as was commented: I need to identify myself to receive payments, but every time I try to verify my ID, their system doesn't work. It's because they blocked the input!!!\nNo money, no goods back. Fraud.","title":"ID verification blocked","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-13","author":"Sarah Smith","text":"No payment received. I sold an item and was assured I'd be paid by today.  Just received an email to let me know , it'll be another 2 weeks. Get your act together VC.\n\nDisappointed,  yet again","title":"No payment received","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-13","author":"Super girl Band","text":"Terrible business. I don’t know if we all need a place like this. Your items are lost, “not received”, fake marked as authentic, sold and never arrive, canceled out of the blue. Please let’s buy directly from stores or better businesses. This store offers you a high risk. Beware, girls!","title":"Terrible business, items lost, cancellations, fake items","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-13","author":"Charlie Parkes","text":"Vestiaire is a site which sells fake goods and mis-sold items then when the buyer complains they are told to re-sell the item. \nThe customer services team is beyond useless and buyers are left in a position to either keep a fake and faulty item or bury their morals and pass the problem onto the next poor buyer.\nAn absolute disgrace.","title":"Vestiaire is a site which sells fake…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-13","author":"Megan ","text":"The worst company I have ever had the displeasure of dealing with, please never ever order from this site. \n\nA customer service assistant straight out lied to me and confirmed with me that I would be paying no extra charges for my order. I was then informed that actually I would have to pay a £300 fee, and there is no way to cancel the order at all. When expressing my dissatisfaction  I was met with a customer service assistant with the most disgusting attitude, totally not interested, refusing to pass me on to speak to someone higher and then disconnected me from the chat.  I’m honestly appalled this is supposed to be a luxury selling site, absolutely disgusting and misleading. \n\nI was told as a customer to double check policies even when told by a customer service assistant that this is the policy.","title":"The worst company I have ever had the…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-13","author":"Megan ","text":"The worst company I have ever had the displeasure of dealing with, please never ever order from this site. \n\nA customer service assistant straight out lied to me and confirmed with me that I would be paying no extra charges for my order. I was then informed that actually I would have to pay a £300 fee, and there is no way to cancel the order at all. When expressing my dissatisfaction I was met with a customer service assistant with the most disgusting attitude, totally not interested, refusing to pass me on to speak to someone higher and then disconnected me from the chat. I’m honestly appalled this is supposed to be a luxury selling site, absolutely disgusting and misleading. \n\nI was told as a customer to double check policies even when told by a customer service assistant that this is the policy.\n\nDO NOT ORDER FROM THIS SITE YOU WILL ONLY EXPERIENCE PROBLEMS THAT WILL COST YOU ££££££","title":"The worst company I have ever had the…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-14","author":"B F","text":"Here are the reasons why after a year of engaging with Vestiaire Collective, I've decided to pull the plug on this horrible app\n- VC takes a huge cut from every sale you make, goes to control freak measure to limit the price you can set your items\n\n- your items get refused for no reason. **Every time you list something, there will be a chance your efforts are wasted!** Curation team is a real hit or miss with the items they review. These guys don't know how to authenticate many brands listed on the site. \n\n- I've turned off the offers function many months now since most of them are NOT binding at all-- when you're operating with this system, one or two fall throughs are natural. When MOST of the offers I've accepted don't turn into buys, it becomes a nuisance to everyday life. Why can't VC lock in negotiations??\n\n- Shipping cost is a major turn off. I wouldn't buy unless the item is that enticing\n\n- VC is launching promo campaigns that don't exist! Every now and then I'm getting pop ups telling me to list a few items in return for a $xxx voucher. I then try to list a couple of things and there is no follow up on this voucher business-- there was a campaign recently that sellers could list certain brands commission free, it turns out that this is only a regional promo not applicable to certain countries. Where is the clarity in these campaigns? \n- Another annoying thing is frequent alerts asking me to reduce my price on a certain item to xxx to \"increasing my chance of selling by 50%\". Define 50%. I've always been puzzled by what algorithmic measures are taken once I take this action. Again, the lack of clarity gives me suspicion that this is all just false claims.\n\n- There really are better platforms to use without all the hassle and frustrations-- did I mention the lack of customer service? Don't even go there. \n\nLooking forward to my last pay so that I can de-list everything from VC and finally delete my account.","title":"One year selling on VC and deleting this app.","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-14","author":"LK","text":"As a long time customer of VC, my latest purchase was absolutely not as described. The Chanel bag was described as in good condition on the site - the seller also assured me that the bag was in good condition.  When the bag arrived, it had holes and deep scratches on the leather. I flagged this to their customer service team who basically fobbed me off. I’m appalled as I have spent a lot of money purchasing from their site over the years.\n\nTheir quality control and customer services have gone downhill drastically. I don’t think I’ll be making another purchase until they improve their service.","title":"As a long time customer of VC","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-14","author":"JJ plays","text":"Still awaiting payment for an item received by the buyer 10 days ago. Not worth the hassle. Where's my money VC?","title":"Still awaiting payment for an item…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-14","author":"Luxury Closet","text":"Your system sucks. For how many months I sent you an e-mail, you didn't answer me. I ship all my sold items within 2 days with DHL. I'm paying myself. And you are miscalculating my statistics. That's why my sales have already decreased FOR 5 MONTHS. I will not add new products anymore and I am thinking of closing it for sale.","title":"Your system sucks! No answer!","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-15","author":"Charlotte Jones ","text":"I have been a professional business seller on VC for 5 years for my business Love Luxe, and paid thousands of pounds to them in commission over those years. This year I  have received the most TERRIBLE customer service- I sold an item on 16th February and still have not been paid for it, VC have withheld my payment of £2300 for OVER 12 WEEKS. My emails are being ignored, live chat is pointless and does not resolve this issues, no phone number to call. This is nothing short of FRAUD. I will not stop until I am paid for my sale and then I will close my account. If you are thinking of using VC, my strong advice would be do not use this company. The way they operate the business is an absolute disgrace.","title":"VC are committing FRAUD","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-15","author":"Theodore Mahardika","text":"Among all the reselling platform, Vestiaire Collective is the WORST! they are trying to be snobby and exclusive but selling the fake vintage Chanel in their site. I can’t believe their authentication team approved those fakes. They take the highest commissions with the lowest customer service experience :) and they forced you to lower your price ALL the time, to the point it’s annoying. just try it yourself. Their customer service will use passive aggressive tactic on you, if you ever make a complaint. I,ll just stay away from VC, no thanks!","title":"Among all the reselling platform","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-16","author":"Constantinos Constantinou","text":"The worst website! As simple as that! Purchased a Givenchy jacket through \"direct shipping\". The jacket arrived and since at first it looked \"ok\" i didn't pay attention even though it was obvious the jacket was not new. After 5 days when I wore the jacket, I noticed that in the back the leather was scratched and the givenchy label (inside) was poorly re-stitched. I informed vestiaire immediately and uploaded pics and they told me that they can do nothing about it since the 72hours went by. The jacket had no other labels (size,washing instructions,serial number) so it was obviously fake. Their customer service never helps and they just sent automated messages! I am a seller too and they keep sending me messages to lower my prices + they get extremely high commisions! Be aware!!! Choose websites like luisaviaroma and farfetch that put huge sales and sell legitimate items!!!","title":"The worst website","stars":1,"location":"CY","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-16","author":"Greta ","text":"I am completely disappointed with the seller experience on Vestiaire Collective. I sold item number 14960881 on 26.04.2021 and shipped it to the buyer on 28.04.2021. The buyer requested that the item is delivered to a DHL facility in France, where it is convenient for her to pick it up. The item has been available for collection at that facility since 29.04 and the buyer has still not collected it. I contacted customer support 4 times already to request that they contact the buyer to pick up the item, because I cannot be paid for the sale otherwise. I have been waiting for almost 20 days now and the buyer has still not collected her item. I contacted customer support today as well, to request resolution and support. I have fully fulfilled my contractual obligations and I have made the item available for collection to the buyer, which I explained to customer support. However I received a response saying that there is basically nothing they can do and if the buyer contacts them to request that the sale is cancelled they will refund her and return the item to me, since she has not picked it up yet. This is completely unfair towards me as a seller and there is clearly zero seller protection while selling on Vestiaire Collective. They are making me wait for 20 days for the buyer to collect her item and now if she decides she does not want it anymore they will cancel the sale, which is completely unfair towards me as a seller. In this timeframe of 20 days I could have sold the item to another buyer, but Vestiaire Collective is taking away this opportunity from me, as the item is stuck in a DHL facility waiting to be picked up and at the same time Vestiaire Collective's customer support is refusing to pay me for my sale and they are telling me that I should simply wait for an unknown period of time....\n\nCompletely unfair attitude towards sellers, extremely poor customer support that is 70% executed by automated messages instead of actual responses. \n\nUnfortunately, I cannot recommend selling through Vestiaire Collective as they clearly have zero interest in protecting the sellers on the platform. Nevertheless they charge HUGE commissions from sellers and in return sellers do not even get minimum protection...\n\nI hope my issue to be resolved in the end and to be fully paid for me sale, so that next time I can leave a positive review for Vestiaire Collective.","title":"Zero seller protection on Vestiaire Collective","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-16","author":"Ivy T","text":"Only if I could have given no Stars. First and likely only time of purchase is nothing short of terrible. Bought a D&G bag, seller gave wrong information that it would come with Authenticity card and dust bag, but when received the bag it comes with none. Filed a complaint to VS, fast response, they contacted Seller with no response, first suggested to relist the bag without commission, eventually agreed to give me refund if I were to send them the bag. So I did, a week later they said the bag matched with description but refused to acknowledge Seller gave wrong information and refuse refund. After many emails, now suggest I relist with a small commission!! Do not buy from Vestiaire","title":"Horrible service, will mislead you in every direction","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-16","author":"Danielle Steele","text":"As a person who has been purchasing off vestiare for a little while. I became suspicious on a zimmermann dress. My suspicions were correct and the dress was fake along with a jumpsuit from the same brand I purchased on thier, tags and labels were off. I purchased a sandro dress from them too and I'm telling you the best fake ever just missed out on details compared to the one in store. Now I checked my prada monoliths through authentication site and these deemed fake all items were checked as well the authentication system is flawed. I don't believe them at all such a rubbish service fakes slipping through the net making a breeding ground for these sellers. Vestiare is flawed.","title":"They sell many fakes....","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-17","author":"Elena","text":"Horrible service of the “Expert team” of Vestiaire Collective! \nThey marked my sold original brand item as a fake one and cancelled the sale! The item has all the documents and a bill from the store that proves it’s authentic . Also it had all the etiquettes and protective stuffs as it was the new one. To all my letters that I wrote them and asked to show me what is wrong with the item they just answered that I need to pay money if I want to return it. So, they made me pay the courier service to return it back! And in the end I received my item without any etiquettes, so now it’s used after such an “Expert team” of Vestiaire Collective!!!! Totally disappointed!","title":"Horrible service of the “Expert team”…","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"},{"date":"2021-05-17","author":"Ronald","text":"I’ve sold several items with this company and the quality control lately has become an absolute nightmare. I sold a Givenchy totem pouch which was sent in pristine condition. I later received a mail saying the item was non-complaint. When inquired into reason for non-compliance, It was Initially stated that the item did not match the description I provided when uploading, which I pointed out was false. Upon resiliently insisting I shipped the item in pristine condition as was depicted during upload,they simply stated it had a ‘humid smell’, which came as a surprise and quite dodgy as there was no such ‘smell’ when item was shipped. Now I am uncertain what conditions my item was subjected to that would cause such a thing to occur. Abysmal performance by their control team and terrible communication.","title":"I’ve sold several items with this…","stars":1,"location":"GH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=59&stars=1&stars=2&stars=3"}]