[{"date":"2021-10-24","author":"Rukia Hussain","text":"My order is yet to arrive 5 weeks on from my delivery date. I’ve tried so many times to request a refund, unless I write a hand wrote letter (?!?!?!?!) and share my personal ID, they refuse to open the case. Absolutely ridiculous. Poor from start to finish. Beyond me this business is still running. Avoid, do not waste your money.","title":"Appalling service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-25","author":"Jessica Karlsson","text":"I uploaded my item and after a few months it was sold. The first thing not working was the printing the shipping label. I had to contact customer service three times before I got the shipping label to my emailadress. Once this was sorted I contacted them due to the limited time of shipping in the add. They told me this would not be problem. I shipped the item but because the add had \"run out of time because of delayed shipping\" I could no longer contact the buyer. The buyer received the item on the 11th of October and then within 72 hours I was supposed to get payed. One week later I contacted customer support because I had not been payed. They told me they would look in to it. 4 days later I still hadn't heard anything and contacted them again. This time they said the sale had been cancelled and the buyer had been refunded because the shipping-time had not been prolonged. Customer service told me to they would look in to it but that I next time should contact them to prolong the shipping time. That I had already done from the start!!! So here I am, one month after sale and still not payed, I've had to contact them roughly 6 times. I have never experienced a sale this difficult. It is the first time I have used Vestiare Collective and it will be my last. I cannot recommend anyone to sell through them. Other selling sites are way more convenient (such as eBay, tradera etc). My recommendation is to save yourself the trouble and time and go with another selling-site.","title":"Nothing works! Neither customer service, shipping or payment","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-25","author":"lisa forsberg","text":"Be warnerd, VC has started using cheaper options for shipping, requiring sellers to go to Hermes shops to drop off their items, rather than having couriers pick up the items from their home\/work. Gived what they charge in commission, this is unacceptable.","title":"Stingy on shipping","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-25","author":"Lina","text":"I will never buy on Vestiaire Collective again. They don't properly review the articles and check their quality and they are not helpful at all in case the article is not how it what meant to be.\nThe lack of professionalism of the customer service is absolutely unacceptable. They are completely unable to find solutions to your issues and close the chat before even asking for your permission.","title":"Do not buy anything there!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-25","author":"Mrs Gabeva","text":"Update: again,as i say, what is fair is fair. Actually, to my dismay, VC fixed that problem too. So, i am sharing here.  It is nice when you can share a good experience. I am giving three stars this time, because i am happy problem is resolved but not happy that a problem like that occured at first place. But thank you VC, for resolving it. I am looking forward when the system starts working great again, like before, and one can share only positive feedbacks.\n\nI wish a day can pass without VC showing their total lack of knowledge and any kind of professionalism about knowing high-end items.\nAnd they always come with something new and at a new level of ridiculousness. How they can manage this is almost astonishing 😂\nToday an item, Chanel pullover , was declared “non-compliant” because the wool is “felted” . Really? If any of them even knew Chanel products or collections, they would have known that this is how the fabric for this model is. But they do not. Because they are neither professional, nor experts, nor knowledgeable about luxury items and moreover Chanel. And yes, the company is getting worse. It is so expected that not even surprising any more. Anyway. It is VC. As we all know - the company that does much more wrong than right. And continues to be successful in that with flying colors. “Great job”, VC","title":"Solved - Unprofessional again - not shockingly","stars":3,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-25","author":"Agnieszka Oprzedek","text":"They cancel my order #18569099\nI payed 12£ to return item. No response.\nNo help whatsoever. I lost a jacket worth a lot of money. Please people avoid. Never sell here or buy. They are stealing you stuff. Don't trust them!!!!!!!\nAvoid!!!!!!!!!","title":"They cancel my order #18569099","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-26","author":"Naomi","text":"I'm just gonna drop this here and everyone can make up their own opinion :)\nHere's what you have to do if Vestiaire's courrier loses your parcel worth GBP45 (not a Birkin bag). After having chatted to a machine (after a while you get the combinations right and stop ending up in an endless loop and finally get to talk to a human), having been told it has arrived, sent a screenshot of their own app saying that it is still 'in transit' (since July, now it is November), you get this email, literally copy\/paste:\n\nHi N,\n\n\n\nFirstly, I’m really sorry to hear that you haven’t received your item. I will be looking into this personally to resolve the issue.\n\n\n\nIn order to move forward with the investigation, we just need a few things from you.\n\n\n\nFirstly, a handwritten statement confirming that neither you, your neighbours, or any members of your household have received the shipped item. Please include all the following information:\n\n\n\nYour full name\n\nThe delivery address \n\nYour Tracking Number \n\nThe date \n\nYour signature\n\n\n\nA copy of your valid ID.\n\nAn invoice for your purchased item.\n\n\n\nThe letter and the ID can be photographed and attached to an email for ease.\n\n\n\nIt would also be helpful if you could let us know the following:\n\n\n\nWas anyone present at the delivery address during the delivery of the parcel? YES \/ NO\n\nDid you receive a notification of the delivery attempt at your delivery address, or at the post office? (Notice of delivery attempt, an email, or SMS?) YES \/ NO\n\nHave you checked your letter box? YES \/ NO\n\nHave you checked with your neighbors if anyone has accepted the delivery? YES \/ NO\n\nIf you have any further information to include about the delivery, don’t hesitate to include it in your reply.\n\n\n\nOnce we’ve received your reply, I will get back to you within 7 working days to update you on our progress.\n\n-------------------------------------------------------------\n\nIf you don't send this handwritten letter within a few days, your case gets closed, and you start the whole process over again.\n\nThe time I spent on a mistake their courier did, to get back 45.- , wow. \n\nSome competitor research would be in order. Vinted for example could give some tips regarding customer service.","title":"I'm just gonna drop this here and…","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-26","author":"Am","text":"Seller cancelled my order after 6 days. I contacted the seller, she admitted she sold the item to someone outside of Vestiaire after I had purchased it. Then she blocked me. This seller has a trusted seller badge and before buying I asked if the item was still available, she said yes.\n\nI am also having problems with another order. The seller claims the item has been shipped, yet it has not, I guess this purchase will soon be cancelled. Also this seller has a trusted seller badge. Do these sound like trusted sellers to you??? These sellers are a joke, apparently the trusted seller badge doesn't mean anything.\n\nVestiaire now has 150€ of my money after I made purchases from these two \"trusted sellers\". Only 1 of the 3 orders I made appear to be successful. This platform seems to be full of dishonest and rude sellers, or should I say scammers. Needles to say, I will never buy from Vestiaire again, they don't care to fix any problems, they just want your money. This platform is totally unprofessional!","title":"Avoid!!! Totally unprofessional platform!","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-26","author":"Am","text":"Seller cancelled my order after 6 days. I contacted the seller, she admitted she sold the item to someone outside of Vestiaire after I had purchased it. Then she blocked me. This seller has a trusted seller badge and before buying I asked if the item was still available, she said yes.\n\nI am also having problems with another order. The seller claims the item has been shipped, yet it has not, I guess this purchase will soon be cancelled. Also this seller has a trusted seller badge. Do these sound like trusted sellers to you??? These sellers are a joke, apparently the trusted seller badge doesn't mean anything.\n\nVestiaire now has 150€ of my money after I made purchases from these two \"trusted sellers\". Only 1 of the 3 orders I made appear to be successful. This platform seems to be full of dishonest and rude sellers, or should I say scammers. Needles to say, I will never buy from Vestiaire again, they don't care to fix any problems, they just want your money.","title":"Avoid! Totally unprofessional!","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-26","author":"Nahla Roshdy","text":"Worst shopping site. Bought a shoes and didn’t receive it or get a refund back\nRef no 11088326","title":"Worst shopping site","stars":1,"location":"EG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-26","author":"Luiz Guilherme Moura","text":"What a horrible experience selling an item there. Not only they completely ignore ALL of the customer services messages, they also obscure the entire curation system so nobody has any clue what their standards are. There is a myriad of fake items online but when you try to submit a legit one they refuse it... Go figure 🤣","title":"Zero Transparency","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-26","author":"Shopalot","text":"From a Seller point of view: ridiculous process - they keep declining my items saying can’t confirm authenticity, when they 100% authentic and I provided photos exactly how they wanted. I even compare those who successfully listed and sold, my photos are the same if not better quality. In addition, I have seen many FAKE items\/bad photos getting approved\/listed. Seems like double standard to me. \n\nFrom a buyer point of view: tried to purchased three items (only one went through) as they have so much additional costs\/fees, but the worst part is one item I purchased the seller indicated it’s available, and suppose to ship within 7 days, but they extended to 14 days without telling me (they agreed directly with the seller), yes thanks for the courtesy not. Even after 14 days the seller still didn’t ship - totally time wasting by giving seller the extension. The other item, quality didn’t pass quality control, I purchased premium membership to get the free shipping, but they forfeit my free shipping even though it’s my fault that the item didn’t pass quality. I would think they should reimburse my free shipping. Terrible","title":"Ridiculous - from buyer and seller","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-26","author":"brooke hunter","text":"As a buyer and consignor with Vestiaire I have had numerous reasons to contact customer service. They have conveniently opted-out of telephone communication so you can't speak to a live person.  Ever.\n\nYour only recourse is to rely on their chat or email service.\n\nOn all the occasions that I've made contact, you receive the canned reply that someone will be reaching out to address your concern, but DAYS GO BY and alas there is ZERO FOLLOW-UP.  \n\nThere are very serious questions that require a straight answer like \"Are there trained gemologists on staff to fully analyze jewelry for gold content and stone verification?\" \n\nTheir so-called \"authentication\" process has left me feeling uneasy about my purchases.","title":"Customer Service is Terrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-27","author":"Patawee Heasley","text":"Unreliable quality control and so-so customer service. I had purchased multiple items last year and and no major issues. But this year is different. The customer service reps could not seem to answer the questions. The items I purchased don’t quite match with the descriptions, and all they do is pointing to their second quality control. If the first one did catch anything, how will the second one make a difference? I guess I will have to rely on my credit company to fight for me. I will definitely not purchase or sell anything on this platform for again. NOT worth it at all. Don’t waste your time.\n\nUpdates on 11\/8\/2021 I have received the refund, but I was also told that my claim was rejected. I would say I would be reluctant to buy big items from private sellers because pictures are not always taken at the best lighting. VC focuses more on making sure the items matches semi blurry matches pictures and authentic.","title":"Unreliable quality control and so-so…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-27","author":"Stella Lim","text":"VC just took my item and never give me the money for the sold item\nI sent my item which was sold in VC.\nI needed to add my bank info to get the money for the selling item. VC removed my account so I couldn’t get the money. I asked to solve the issue almost 10times. They never responded they just took my item and never give me the money!!!","title":"I sent my item which was sold in VC.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-27","author":"Tiffany Petrossian","text":"Be warned.. Vestiaire is the worst resellers website I have ever dealt with.\n\nEvery. Single. Item. That I have sold on their website has encountered issues and hours of going back and forth with incompetent customer services agents on a terrible ‘chat’ service that keeps crashing. Shipping labels that don’t work, cancelled sales when the reason I hadn’t shipped was because of their own errors, promises to extend the shipping window but then cancelling the sale when the item has already been picked up the courier, unpaid for an item I shipped 2 weeks ago, items rejected for no reason. \n\nOne issue that I actually laughed about was when I sold a sweater to a buyer on the 13th of October and then the sale somehow cancelled itself. I checked the item and the ap stated I cancelled the sale on the 4th of October… meaning I time travelled and cancelled the sale before it was sold. Vestiaire customer services made out I was crazy and didn’t know how to resolve it. \n\nThe worst one is a pair of trainers I sold 3 times to the same buyer and each time the shipping label didn’t work. Each time I complained to Vestiaire (after explaining everything OVER and OVER to customer services) they would tell me to cancel the sale and relist. Each time I would relist they would reject my listing claiming it’s not authentic, I would then have to hop back on customer services chat and complain AGAIN and explain AGAIN to someone new. They’d allow the listing.. buyer would purchase again.. shipping label wouldn’t work again! This happened a total of 3 times and I am currently in the process of waiting for my listing to be approved a 4th time. \n\nWhat a waste of energy and time. I’m awaiting payment for an item I sold 2 weeks ago with customer services sending me sporadic badly worded “rest assured” emails that they are working on it.. I replied to one of their emails today to follow up and guess what.. I got a bounce back saying the email address no longer exists. The thought of getting back on their ‘chat’ portal makes me want to cry.","title":"Be warned. Worst reselling experience EVER","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-27","author":"Lena","text":"i purchased an item and for whatever reason, the carrier did not deliver to a parcel locker and just dropped it off in front of my apartment; item got stolen. opened a case with vestiaire collective nearly TWO months ago. one month in, i was told that i would receive a refund by 1 october no matter what- that never happened.\nabout a week after that, i was told that the carrier officially confirmed the package lost- still no refund. \nnevermind the ridiculous length of time this simple issue is taking. the infuriating part is the misleading information the customer team is telling me. one person on the team says one thing, the next says somethign completely opposite.\nin case you're wondering, the item i purchased was roughly $700 so its a pretty significant purchase.\ni will never buy from these people again. the selection is great but the poor CX is just not worth the hassle anymore especially when there are other companies out there that provide a more seamless CX.","title":"don't waste your time and money. these people don't care about customers and will hold onto your money for dear life","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-27","author":"Angelica","text":"Up until this recent sell, I have had no issues. But I sold a jacket MONTHS AGO and have yet to receive my payment. The buyer stated that she received the item through message. But I never received payment. I’ve emailed and tried to you the chat. No response. I could have kept my jacket. DO NOT SELL YOUR ITEMS THROUGH THEM.","title":"Do not sell","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"},{"date":"2021-10-27","author":"Nikki Soin","text":"I sold a dress recently and have still not received payment despite the buyer confirming she had received the item. Firstly it took ages to get to her due to Hermes but then the idiot customer service chat support is terrible with the same response but no resolution. Given the reviews below, it’s clearly all a con where they want to hold onto your money as long as possible .","title":"I sold a dress recently and have still…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=38&stars=1&stars=2&stars=3"}]