[{"date":"2021-03-18","author":"Carmen","text":"Avoid - Horrendous service and bad customer service. Parcel lost without any explanation !","title":"Avoid","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-20","author":"Yu Chang","text":"I sold 2 items through the Vestiaire Concierge service in February. On the website, it says the payment 'To be transferred on 17\/02\/2021'. It's now the 19th of March and no payment. I tried to get help through both online chat and email, no response on email and customer service from online chat just kept saying they will talk to the accounting team but nothing happened. Seriously considering filing a fraud complaint to Company House.","title":"I sold 2 items through the Vestiaire…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-20","author":"Mari","text":"After a successful sale Vestiaire Collective keeps all the sale money for themselves leaving sellers robbed of their earned money. Customer service is non existent. Vestiaire Collective can't be reached via telephone or email. Only option is via chat and then they reffer you to their FAQ page so you can't talk to anyone. Questions via chat are not answered. Stay away from this website. It's a fraud!","title":"Vestiare Collective is a fraud","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-20","author":"Dennis E.","text":"Experiencing the same issue as other people.. Sold an item and money was supposed to be transferred the 14th or next workday the 15th.\nI’m still waiting for my money and customer service is pretty much useless, because they can’t contact anyone to escalate cases. \n\nVeatiaire take 25% commission and spam you to ship the item fast, but can’t even transfer money to the seller on time.\n\nOh and they have given me several different timeperiods with deadlines for my money by now, but they keep breaking them. \nNow they won’t even give me a deadline anymore. \n\nThe company is useless if you are a seller, don’t waste your time.\n\nI just sold another item, but i’m not shipping it before I get my money for the other one. They can spam me all they want.\n\nUPDATE 24\/3-2021:\nStill no money 10 days after the promised transfer.. They promised on Twitter that I would get my money today, but now they don't answer and haven't heard anything new..\n\nUPDATE: 29\/3-2021: \nStill no money received and now they have moved back the transfer on their website to tomorrow. I can see on twitter that a lot of people are waiting for payments, one of them have been waiting since december.\n\nUPDATE: 31\/3-2021: \nStill no money received. Was suppose to go through the 30th, but of course it didn't. \nI have filed a complaint with econsumer which is a international complaint center. Please do the same if you have the same issues. You can reference my case: 132288172.\n\nUPDATE: 1\/4-2021:\nFinally got my money, but I had to get in touch with one of the “head of” people.\nSadly I can’t change my review because I know of others who have not gotten their case handled yet, sadly.","title":"Don’t sell on Vestiaire!","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-20","author":"Dennis E.","text":"Experiencing the same issue as other people.. Sold an item and money was supposed to be transferred the 14th or next workday the 15th.\nI’m still waiting for my money and customer service is pretty much useless, because they can’t contact anyone to escalate cases. \n\nVeatiaire take 25% commission and spam you to ship the item fast, but can’t even transfer money to the seller on time.\n\nOh and they have given me several different timeperiods with deadlines for my money by now, but they keep breaking them. \nNow they won’t even give me a deadline anymore. \n\nThe company is useless if you are a seller, don’t waste your time.\n\nI just sold another item, but i’m not shipping it before I get my money for the other one. They can spam me all they want.\n\nUPDATE 24\/3-2021: \nStill no money 10 days after the promised transfer.. They promised on Twitter that I would get my money today, but now they don't answer and haven't heard anything new..\n\nUPDATE: 29\/3-2021: \nStill no money received and now they have moved back the transfer on their website to tomorrow. I can see on twitter that a lot of people are waiting for payments, one of them have been waiting since december.\n\nUPDATE: 31\/3-2021: \nStill no money received. Was suppose to go through the 30th, but of course it didn't. \nI have filed a complaint with econsumer which is a international complaint center. Please do the same if you have the same issues. You can reference my case: 132288172.\n\nUPDATE: 1\/4-2021:\nFinally got my money, but I had to get in touch with one of the “head of” people.\nSadly I can’t change my review because I know of others who have not gotten their case handled yet, sadly.","title":"Don’t sell on Vestiaire!","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-20","author":"Barbor Beijba Bartošová","text":"The app created an awesome community of vintage\/ luxury sustainable lovers, I’ll give them that.\nHowever, their customer service is simply appalling.\nFirst issue I had around two months ago - an item was sold to Italian buyer (I’m based in the U.K.). I contacted DHL and they said due to lockdown & Brexit they’re unable to ship internationally. I contacted Vestiaire and it turned out they knew about the issue but did not advertise it anywhere on the app and still let the sale to go ahead. They advised me I cancelled the sale, which costed me a badge of trusted seller (therefore loosing visibility and trustworthiness) and there was no reimbursement from VC.\nRecently, VC introduced a new commission model which saved sellers some money. I sold two items and accepted low offers for these as I thought I was under new commission model. Wrong. Turns out all items listed previously were under the old, more expensive commission model. I contacted VC and once again no reimbursement.\nI’ll ship my newest sale, will wait for the payment and then will most probably close my account. Very disappointed with the customer service experience.","title":"Great community, Awful customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-22","author":"Yu Chang","text":"I sold 2 items through the Vestiaire Concierge service in February. On the website, it says the payment 'To be transferred on 17\/02\/2021'. It's now the 22nd of March and no payment. I tried to get help through both online chat and email, no response on email and customer service from online chat just kept saying they will talk to the accounting team but nothing happened. Seriously considering filing a fraud complaint to Companies House.","title":"Vestiaire don't pay seller","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-22","author":"Karo B","text":"I have been a long-term customer of Vestiare Collective, and while I never had issues with VC, the latest incident really made me question the company's Customer Service, and as such terminate my relationship for good. \n\nAs a seller, I  sent 2 valuable items to VC, within 1 week apart. Shipping was done from Switzerland. Both items arrived after 2-3d in Paris, cleared customs and waiting to be picked up by VC. It never happened. \n\n1 item was sent back to me after nearly 2 months, with the reason that VC refused to accept the items. \n\nI have been with the customer service on several chats, over several days\/weeks. \n\nReason #1: we did not receive it, because you need to pay for VAT, which is the Buyers obligation. \nMy Answer: no, i dont need to pay it. the VAT is added to the final invoice of the item, hence it was already paid. \n\nReason #2: we did not receive it, because we had a system error, and were unable to accept it. \n\nReason #3: we did not receive it, because you did not attach the label. \nAnswer: i received back one item, label correctly attached, all visible - I cant even make it up, because the french & swiss post attached other labels to it. \n\nReason #4: we did not receive it, because ....\nAnswer: please just be honest with your seller.\n\nThe support of the customer service goes as far as: you need to check yourself with the delivery company where your item is and what the problem is. \n\nI was connected to approx. 4 different people at Customer Service - they dont understand the billing and taxing - one of them even told me, that I have to pay for the VATs, and that the Buyer did not pay for the VAT, hence the Officials are still waiting for the Buyer to pay it. makes no sense.\n\nSince both my items got shipped on time, got cleared by the customs  (within 3days!!!), and waited for VC to be picked up\/taken over in less than a week, i can simply not accept that it was either the Buyers or Sellers fault, that they were not picked up by VC. The only explanation I accept is, that they had a system error and were unable to receive it.\n\nAfter many worrisome weeks, and a financial loss (im paying for shipping costs), I decided to pull all my items from VC and find another trustful company. I also had sold another item in the meantime, but decided to stop it since VC doesnt accept my items. \n\nPS: I also bought a pink coat - it was orange - and it got accepted by VC.","title":"VC Customer Service does not help you","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-22","author":"Theona Ciocîrlan","text":"One star is too much for this company. I have had 3 people connecting and then disconnecting from the live chat and in addition, I spent 350 pounds on a pair of boots. The money was taken from my account, but the item still did not appear as sold. I have contacted PayPal and my bank and there was no issue on their end. When I finally got through to vestiaire customer service, they told me the payment was declined, yet it was gone from my bank account. Absolutely unhelpful, I have no money and no item as of right now, ridiculous service. I am still waiting on an update from them and after I get my item, I will never use them again.","title":"One star is too much for this company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-22","author":"Elizabeth Zans","text":"I used to be a loyal customer...for 4 years, not anymore..For the first time ever, I was charged custom fees, almost 40 percent of the value of the items! then when the package arrive Vestaire did not pay the 100 USD in customs fees. I have spent 2 nights trying to resolve this problem. I was promised an email..that never came...I see why many customers are getting frustrated with Vestaire. I too will look elsewhere and no longer use them. Trying to deal with such poor customer service is too frustrating.....nothing gets resolved...just broken promises of resolution...I certainly relate to many of the poor reviews below. Not to mention how corrupt it is to be charged customs fees by Vestaire..that they never paid","title":"corruption, taking money for customs but not paying","stars":1,"location":"TR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-22","author":"Ruonan Lei","text":"The authentication takes already 10 days I have no idea what is happening.","title":"The authentication takes already 10…","stars":2,"location":"PR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-23","author":"S.E","text":"You sold your items, they took the money from buyer, but they don’t pay the seller... over 1000 euros!\nContact customer service or write emails countless times and never get a reply...\nTheir service does not exist!","title":"Bad service and team","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-23","author":"Suzanne MS","text":"At first sight it may look like a fashion eldorado, but beware - compared to other online 2hand fashion sites like Rebelle and The RealReal - you enter with VC a community where misleading advertising and carelessness is a daily order. Top management may flash a green climate agenda. However they forget that ethics and legality is also important to create a sustainable business. An example of their misleading advertising is their Golden Voucher Competition where they invited members, including me, to list items for sale. A prize of 1000 Euro was at stake (this amount was flashed in other big currencies so it looked like there were several prizes, when in fact there was only one). After listing several items it was brought to my attention that only French residents could join the competition to win. So why did VC invite me, I am not a French resident? To boozt sale, naturally. A day went on and a growing number of members were dissatisfied. VC finally admitted it was a mistake. A bit later VC mailed me I could not join the competition due to my account being in DKK. Only accounts in Euro, GBP and other large currencies were eligible. However, 24\/7 any member can adjust their account to any of these currencies. It takes under one minute. So this new explanation from VC is ridiculous and the thinnest argument north of the Alps! Several attempts to get an explanation, or even proper excuse, from VC has been in vain. Customer service has become more and more robotized over the last year. My patience is worn out. I could name numerous other cases of VC laissez faire attitude, lies and hiding their head in the bush like an ostrich. They are full of petti cheating and big mess: In short: a scam.","title":"Vestiaire Collective = A SCAM AND BIG MESS","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-23","author":"Martine Lawley","text":"What is the most and utterly frustrating thing when dealing with a company that does not listen..   Is a sweet spoken member of staff who tells you how to suck eggs but does not have a clue what they are talking about!  Because :\na - they are trained to be 'nice' but ...  that's it!\nb - (in my case) have not read the complete message so their answer is not only 'vague' but incomplete\nc - .. and they do not do what they say they will do!\n\nNot yet ready to leave VC.. but honestly guys, move to the 21st century, invest in highly trained and well paid staff (Take a leaf out of ebay support staff!!)\n\nOh.. and by the way..   VC have installed all sorts of weird things on their site regarding things that cannot be imported to the UK such as small leather goods and glasses..    🤓    But guess what, you are also now restricted from buying them from the UK too, even if you are a UK buyer...    😂😂😂","title":"What is the most and utterly…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-23","author":"Brian","text":"Extremely Unprofessional ! You get Zero help ! You can contact them but the are unavailable all the time! Also to get your money it takes MONTHS!!!","title":"Extremely Unprofessional","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-23","author":"Laura","text":"I ordered an item and it did not arrive. When I tried to track it, I saw that it was stuck in Portugal awaiting ‘extra clearance’ before shipping to the UK. It sat there for 3 weeks and I had no luck with customer services. Eventually it was returned to sender but, again, I had no communication. When I managed to get through to someone they sent me an email asking for a handwritten note and photos of my ID - all very dodgy. I only got my money back by raising a case with PayPal. Terrible company. Avoid.","title":"Terrible service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-23","author":"Elisabetta Luxardi","text":"This company once had some kind of customer service in place , I don't know what has happened but now they are total rubbish. You can't even send them a customer complaint because they  don't have any customer service department to complain to  !!! I have written to their chat department about 12 times and they have still not resolved my problem!!! They hand ball me to a so called expert that never writes to me .Totally disgraceful !!!","title":"Total rubbish…disgraceful customer service","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"},{"date":"2021-03-24","author":"Fina Hodgson","text":"Reference my item 5893191\n\nI am writing to complain about disgusting, unhelpful, useless customer services I received from Vestiare collective. I sold my item on 4th march, shipped it on 5th march using a prepaid airway bill provided by VC. Item arrived to Greece on 8th March and got stuck at customs. I contacted VC immediately asking to resolve the issue. Given that it was VC that issued a shipping label and all paperless documents attached, DHL demanded that the matter should be resolved by VC, as they were the account holder for this shipment. I contacted your useless customer services over 15 times, and each time a different agent who hardly understands English or nature or the problem promised me to resolve this. 3 weeks later, 24th of march, one of them replied to me, having a cheek to say that because I didn't provide a consignee ID, shipment was being returned to me. This person does not even understand the difference between SHIPPER who is myself and the CONSINGEE who is the receiver!!!!!!!!!!!!!! As being a sender I clearly cannot provide the CONSIGNEE ID, as I am NOT THE CONSIGNEE!!!!!! This is how unhelpful and unprofessional customer services are, and worst thing, they don't even care. There is not way to contact anyone in VC over the telephone, the chat option is not working today, so all that customers got left is wait for days for email updates, and when they come, they are so useless, and pointless that nothing is resolved!!!!!!  This is disgusting, absolutely disgusting. I have not received my shoes back, and I have not received my money for the sale!!!!!! I want my money paid to me now!!!!!!!!!!! I am attaching all copies of this nightmare, called Vestiare Collective customer services, so you can see how I have been messed around by your agents for 3 weeks,  - I can only imagine how the buyer feels!!!!!!!! Unacceptable, unforgivable, very low to treat customers like this!!!! please confirm when I will be receiving my money back!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nYou simply cannot treat people like this!","title":"appaling customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=66&stars=1&stars=2&stars=3"}]