[{"date":"2022-03-31","author":"Inna","text":"UPDATE Re: So I have been patiently waiting for over two weeks to hear back from VC since April 5 when their support representative replied here to my review  saying that they were looking into a solution. As of now, no follow up and no solution. Horrible experience:(\n\nre: Thank you VC for looking into this. \nRef.17077575 sold on Feb. 11, 2022\nI will update the review depending on the outcome of your investigation. Looking forward to hearing back from you.\n\nI sold a vintage leather bag in very good condition that arrived to the NY hub badly damaged by the courier. It arrived all smashed with a huge hole and the stitching popped out because of some heavy weight applied to it. As an expert seller with a record of over 300 items sold, I clearly know to distinguish between an item in a very good condition vs a destroyed bag. My sale got cancelled and the bag was sent back to me. I immediately contacted VC with request to open an investigation\/claim with a courier. I was advised that they needed more photos from me to do so. Obviously, it wasn't possible while the bag was being shipped back to me. The transport department failed to mark the parcel as a return, so it took almost a month and about 12 emails to get the bag released from the customs. To my great surprise, after I finally received the bag and sent the requested photos to VC in order to open the investigation\/ claim, I got the following response. \"Even if I wanted, to open the investigation\", wrote the agent, \" It wouldn't be possible because there has been a month since the delivery\". I think the quote clearly shows that there has been no intent what's so ever to follow up on my claim initially. I lost both my sale and my item which now is ruined and not wearable\/unsellable. My mistake was to simply follow the advice of the support team instead of filing the damage claim directly with DHL. I guess the fact that I assumed that VC was actually looking into my complaint was wrong, as seen from the ridiculous response \" even if I wanted\", which they clearly implied they didn't in the first place. Too bad it took me 20 emails to exchange to finally understand the point. Beyond disappointed with the horrible service!!!","title":"Non existing support","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Anna Anyon","text":"Used this site repeatedly because I like the listing of European stuff, however the customer service sucks, the shipping is insane, the BULL.-S that they actually verify stuff is a lie I paid a fortune for fendi shoes and went to fendi shoe shop in Bal harbour shoppes miami and the shoes are fake…..customer service don't help and the repeated no help is terrible seller screws up and they say just list it with us….they are seriously a bad company….watch out and good luck with thinking you can buy from local American sellers lol took 10 days to get shoes promised in 3 nyc to Miami…it’s a joke….","title":"Used this site repeatedly because I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Luke Reynolds","text":"I recently sold an item on Vestiarie and it was dispatched immediately although took 3 days to be sent to the buyer via the UPS postage set up by the webiste.   Despite a confirmed delivery to the address on the label, I was notified immediately that the buyer had not received the item and that an investigation was being opened and would take a further 20 days.  \n\nAs I fulfilled my obligations to the letter, I do not see why one should so long for this to be resolved, meaning I was out of pocket for a further few weeks.   My biggest complaint however cocerns their customer services which is nothing short of disgraceful and shambolic.  The repsonse time to emails is literally days and then a response comes through which does not relate to the question and in essence ,it buys them another 48 hours.  There is absolutely no guidance about my situation, they lied to me on live chat that I was actually being paid and that payment had been processed and when, a week later, I finally get a repsonse, I am told that the matter is still under investigation. \n\nDespite dozens of enquiries and emails demanding that someone call me, two weeks later and I still have not been called.  Farcical.  As a result, I am suing Vestiaire whom are even making that quite diffcult as they will not respond to any emails about to whom to write in their legal team.  I am £350 out of pocket and fuming!","title":"I recently sold an item on Vestiarie…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Elena Stirbu","text":"They don't want to cancel my order even if I told them I've ordered it by mistake 5 minutes later.","title":"They don't want to cancel my accidental order","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Prince","text":"Lets get this company taken down we should do a petition of how many people they have scammed I sold an item buyer reported fake claims. They shipped my item to crawley,uk I live in London this is shambolic and I wish I read reviews before selling. They’re like a brickwall to get through to","title":"Lets get this company taken down we…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Maisie","text":"My order recently been cancelled as the seller failed to send the item. I have been notified that I will be given a refund of £69, however the cost of the order was £77. I live in the UK, so does the seller, so there was not any custom fees or transactional fees applied. I really liked the items on offer, but without full refunds I don’t feel confident buying from here again.","title":"Not full refund, not confident to buy again","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Nerea Altuna","text":"Terrible  experience buying and terrible  experience selling. \n\nI wrote a formal complaint to Vestiare Collective a couple of months ago related to an item I bought where I had a terrible  experience. It was mostly resolved after months of hassle and I didn’t want to write a public review but I’ve had another terrible experience and this is just unacceptable. \n\nI sold an item from the app in February, shipped the item and apparently the buyer didn’t pick it up. It’s impossible to contact the buyer, not possible to track the item and the “customer service” bot from the app it’s just useless. I’m tired of wasting my time with this app, it doesn’t provide any protection for buyers \/ sellers and their customer relations is very poor. \n\nAVOID USING THIS APP AT ALL COSTS or regret later.","title":"Terrible  experience buying and…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Anna","text":"I am a buyer and have made over 15 purchaces in the past 5 years. Was very satissfied from the start but will not buy here again. Several reasons. 1) Customer service is now only available in the chat and although some are good some just leave the chat in the middle of it or promise to come back by email and don’t do it. Whatever error they make they suggest a 10% voucher for next purchace and write a shablon message about how they understand why you are not happy but they will do better. 2) Got an item with defects that passed the quality control. Good that at least that the return was smooth. 3) Got an item that was over 2000€ without original box although buyer wrote it will come with box. Quality control didn’t notice the box was missing. 4) A Chanel bag I purchaced was 2500€ but because I am in Sweden price was shown in SEK in my Vestiaire app and it said 28133SEK! While according to the exchange rate that day it should have been no more than 26000SEK. So where is +2000SEK (approx. 200€) comming from? Sadly I checked what price in EUR it was only after purchasing in SEK. If I had switched to EUR in the app and paid in EUR with automatic exchange in my bank account I would hve saved 200€. Now it went to Vestiaire account I guess because seller only got equivalent to 2500€ minus selling fees of course. Sad, as 3-5 years ago there was a customer care available by phone and the quality control was professional.","title":"Not buying here again although start was good","stars":3,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Dace Smiltniece","text":"I sell and buy from VC a lot. 95% its just great. But on 31st January 2022 I shipped sold item with DHL. DHL tracking page shows that the item was delivered to buyer but on VC app it shows that item still waiting to be delivered. So the item is delivered to customer but its 4th March 2022 and I still have not got my payment. When I try to solve the problem in VC chat I have n one to talk to because there is only robots answering. My item Ref.code is 18474244. If somebody from VC reads this- please could you look into my case.","title":"Sold item on January still no payment","stars":3,"location":"LV","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Mgmirko","text":"I wrote a review a long time ago where I gave 4 stars to this app but unfortunately in the last 9\/10 months Vestiaire has gone down hills. It was all good until their “quality team” has started randomly refusing my items saying they were not genuine, At first I was shocked as I’ve been selling for the last 2 years pretty much the same items as I work in retail and I can get it using staff discount, so I provided them with proof of purchase and they got very rude, one of the customer service guy started threatening me saying I shouldn’t question their quality team and if I carry on he would have blocked my account LOL to get my items back Vestiaire charge you €12.50, what a beautiful scam, they mark your item as not genuine and you gotta pay to have it back. Anyway, I asked to provide me with some evidence that the items were fake and they closed the chat without answering. A friend of mine created an account on Vestiaire and to test their so good authentication team, he decided to sell a fake item, and you know what happened? The item has been checked and accepted by their quality team 😭 I was absolutely shocked by this! ( don’t worry my friend contacted them before the item was shipped to the buyer) at this point my friend was expecting his account to be closed and they didn’t they any action! They have no experience or any type of qualifications to do this job! BE CAREFUL GUYS ON BUYING ON THIS APP! PLEASE GO SOMEWHERE ELSE!!\nAnd this is not the only problem I’ve been having, when uploading photos their other quality check team 🤣 another joke and absolutely useless people, they make impossible to upload an item even if this item was already sold previously!!! I spent hours and hours because they don’t have an option to resell the item like eBay so you are forced to spend so much time in taking pictures for then not being approved!!! The same pictures they approved just a week before !!! And even if you take new pictures they are still asking you for more pictures and then it gets declined anyway!! When I contacted customer service guess what? The person laughed at me saying it’s not their fault if the pictures are not good ! WHAT KIND OF CUSTOMER SERVICE IS THIS!!!???\nMan this is a proper scam company!\nCan’t believe this is actually legal!","title":"They can’t tell the difference between a fake from an original","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Amalie Qwist","text":"Extremely bad customer service","title":"Bad customer service","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Denise Gough","text":"I got a response here from Vestiaire saying my issue is being handled by an agent. I have now had 12 different agents email me and not one of them is in contact with the other. They do not understand that Chanel Paris have kept the fake bag to destroy it and keep sending me shipping labels to send the bag bag to them. I’m waiting for Chanel to send a letter of proof that it’s fake but Vestiaire are not even acknowledging the situation. Except to tell me they’re doing everything they can to help. THEY ARE NOT. It’s exhausting trying to get any one person to deal with this. I don’t believe the emails are even from real people, they seem to be computer generated as it’s never the same person and they are all repeating the same information without taking on board anything I’ve told them.","title":"I got a response here from Vestiaire…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Fatima","text":"I have been in touch with this company for several weeks now. They have been holding a substantial amount of my money for a purchase that I have yet to receive.\n\nThey offered me a partial refund since they sent me the wrong product and it somehow passed their ‘authentication and verification checks’ that we pay for. The product did not match the description. I returned the product very quickly and STILL have heard nothing regarding mine. All I know is that it is at the warehouse. \n\nThey are now trying to not provide me the cash refund and are offering app credit - why would I choose to use the app again after this distressing experience? \n\nI’m starting to think Vestiaire and the colleagues I have spoken to so far (Oury, Laura, Fanni, Max) are all part of a scam. \n\nI will be contacting my credit card provider regarding obtaining a refund. I will keep Trustpilot updated with my experience.","title":"Must be a scam company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Holly","text":"Vestiaire get rid of UPS I can only assume to cut corners you’ve now subjected your customers to their service. I have three packages all delayed and the previous two the same problem, with one returned to me. DHL delivered within a day or two was prompt and came at the allocated time. UPS shows up whenever they want and ring you to give out that your not home when they’ve come two hours outside the window of collection time! One of my parcels which was to be delivered to France from ireland has gone through the UK? Why? Heard of a little thing call brexit? I contacted your customer support and was told this was fine. Well it better be because the last parcel UPS had couldn’t find the buyers address and sent the parcel back despite me contacting your company 4 times to tell you the address was apparently incorrect, parcel got returned to me and now there asking for payment because they had to return it to me! Keep dreaming! Told them what to do with their invoice and it wasn’t polite! Go back to DHL or any other company that’s not UPS before you lose a lot of customers and if any of my parcels are lost I will be holding you accountable and expect a full refund. Vestiaire was such a good company you’ve literally gone so downhill it’s horrific!","title":"Vestiaire get rid of UPS I can only…","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Claudia Yara","text":"I don’t feel I can leave a good review after I sold a valuable item on Vestiaire Collective - posted it as asked and the item got lost. After numerous emails weeks later she’s in the same place - no item no money for the item. She’s livid as she just gets the same email back from Vestiaire customer service saying they are looking into it .. how long does she have to wait ? I was thinking of opening an account but I don’t want to risk losing my valuable items too. \nShocking behaviour !","title":"Item lost in post - no money no item .. no customer support","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"A.S","text":"This website and customer service is disgusting. DO NOT USE THIS PLATFORM. My item worth over £500+ seems to have been misplaced by the team and I have had several cancelled orders due to the team not sending out my item in time. The only customer service help I receive is an automated email letting me know someone will get back to me within 3 days. \n\nThis has been going on for 4 weeks.","title":"AVOID","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Rina","text":"I am writing my review as seller. So far Vestiaire sent me label to send with DHL, but today I got UPS label. I went to UPS (cheapest and slowest option for Vestiaire) and UPS do not have package box, you most bring your own. Lol. They expect me to prepare package. After Vestiaire take comission from seller and take fees from buyer for delivery, at least they can organize shipping with package and not expect me to take care of it. UPS do not have any other packages besides plastic wrap. Vestiaire please have some class and decency. Or lower your fees and comission cuz this is embarassing.","title":"I am writing my review as seller","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Ruth M","text":"Some of the agents sells things on Vestiaire too, so they are jealous of others sellers and makes things very difficult for them, I’ve sold an item which I got from the shop and they told me it was fake, so I had to pay to sent it back to me. Terrible customer services.","title":"Some of the agents sells things on…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"miranda","text":"i've had several really bad experience with this site.. their customor service is to absolutely no help..","title":"i've had several really bad experience…","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Mia Osborne","text":"I have been a member both buyer and seller for over 10 years… what an experience to ruin it all.\nI purchased a dress for £550 which was cancelled about an hour after so I chatted to the seller asking what the problem was. She assured me she didn’t cancel the sale.\nI spoke on the chat to customer service they said it was a glitch and to ask the seller to relist.\nThey sent this issue to the expert team.\nSo the seller relisted and I repurchased. An hour later the same thing happened. I spoke to seller again and she said there was some sort of misunderstanding it was her first time etc. The customer service chat told me the seller had asked them to cancel the sale as she had sold it elsewhere. I was shocked the seller had been lying to me and asked her is she spoke other languages incase her English wasn’t good - I also suggested she list elsewhere if the al was hard to use. Next thing I know I am blocked from buyer seller chat. I report the seller as I purchased the dress a third time (so at this stage I have spent £1700) and she cancelled the sale again. I talked to 4 different customer service people retained all the transcripts and was told the buy\/seller ban will be lifted and they are sorry, this seller behaviour isn’t acceptable etc. the expert team show me how to check when a refund is issued … condescending to say the least as I have used the app and website for a long time. This morning I get an email that I am banned forever from chat. Talk about a final slap to the face. The seller has 0 restrictions and is brand new yet a seasoned premium customer is treated like dirt .\n\n\nListing 1 Item numbers : 22213044 \nListing 2 Item number : 22232967\nListing 3 Item number : 22236755\n\nSeller profile : members\/profile-16223190.shtm\n\n\nGets even better - I get an email today from customer care telling me the first time the seller cancelled the second two was payment error however All the money left my account. Successfully and I was emailed earlier to expect refunds…. Wow it’s a bunch of imbeciles working there - all on the same email response.\n\nAnd to add to the response below your customer service ‘expert’ team is as useless and unhelpful as your auto generated comment below. I have one spoken to one person in the last week who answered my actual question. That’s disgusting based on the number of customers uou have. I’d will not be using your site anymore and will de list my items. You don’t deserve anyones money for the poor poor poor poor customer service you offer.","title":"Waste of time and energy - worst customer service ever.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=8&stars=1&stars=2&stars=3"}]