[{"date":"2021-02-03","author":"michela","text":"Their checking service is not professional!","title":"Their checking service is not…","stars":1,"location":"MC","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-03","author":"D Hilton ","text":"I am not happy with the service at Vestiaire. They are very picky and I feel that they are unfair. They have different rules for buyers and sellers and you can not appeal any decisions that they make. The commission that they take is the most if any site and the payment takes a while to receive. Just think there are better sites to buy and sell on. The additional customs and tax from purchasing in the EU are astronomical","title":"I am not happy with the service at…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-03","author":"Sliding Foxx","text":"Do not buy anything with them!!! If your parcel is lost it is a nightmare to have your money back. I bought a leather bag 6 weeks ago and I still dealing with the customer service! They don’t check if they have delivery the item to you so it is you who has to chase them, there is no phone with who have a chat and deal the problem, and it takes days for them to come back to you with an answer. Always By email But never with a solution. Even if my item shows that it has been stock in Chronopost for more than 3 weeks and it has Not been delivery, they wants a hand write letter from me saying that me, my neighbours or a family member has no received the item!  Definitely It doesn’t worth At all all the problems that You have with them in case that something goes wrong in the process. A Nightmare","title":"Do not buy anything with them!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-03","author":"Tim","text":"Personally i think half the positive reviews must be fake on here. I have just purchased an item from VC advertised at £1450 (and Invoiced from VC), and they have taken from my PayPal account £1920.24!! It is a complete rip off, and I strongly recommend you avoid purchasing anything from this company.","title":"Worst experience in my life!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-04","author":"bianca mihaela","text":"As a seller on this platform and buyer as well ,i've meet one after one problems in last period .\nLast year this platform was great to sell and buy ,this year the services from chat and control were worst.\nThey are not capable to authentificate more a product and make a difference,between real and fake,you work to subbmite your products and they just change wrong the describe ,remove some photos ,especially when you mention the deffect of item,status it's late actualizate,quality control stoling the small gifts we sent to our buyers,incapability to manage problems with lost packets and some chat employers ,because of theyr\"less mood\" to work ,reject your problems ,telling they can't help you and other colegs make double work for them!\nWell in the end i was decide first to give 1  star after all problems i've meet in last period,but i will give 3 stars ,because i found 2 really nice womens on support v.that fix me all that problems in one week and also\"the veterans\"that still make good their work!\n\nIt's still hope that they will be back as the platform they were in past and my advice it's to take care about who's working there!","title":"Seller and buyer opinion in same time","stars":3,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-04","author":"Andres Andra","text":"I have ordered one coat, they had a bug regarding the shipping label,  they didn’t fix in seven days.\nAfter this seven days they did a refund of my amount after I order the coat again, and I have the same issue, the seller can not ship the coat to me.\nDuring this time I’ve made about eight complaints🤦🏻‍♀️, also the seller, and nothing happened.\nNow I’m waiting for the second refund of my amount.\nAt every discussion I had with them every time they told me that they are fixing it but nobody took care of it 🙁and are  already almost  two weeks.","title":"Poor service  and technical bugs","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-04","author":"Ka","text":"UK Buyer Subjected to Import Charges When Buying from the UK\n\nI recently purchased a handbag from a UK seller and purposefully did so as I reside in the UK to avoid import charges post Brexit.  When paying for the item, it clearly states £0 on Import Duties\/Taxes which reassured me of this.  \n\nPrior to this I've even read in the FAQ on the Vestiaire Collective website that nothing will change for UK buyers buying in the UK (even if it is not through direct shipping).\n\nHowever, I received a email this morning from the courier stating I must pay £132.40 for import charges.  Baffled by this, I started spoke to a representative in their chatbox.  \n\nAt first, the representative told me they can go ahead and pay me back for the import charge once I paid it.  All I would need to do is provide proof it has been paid for.  A minute later he\/she comes back to say, 'My bad and I apologize for the confusion.'  The representative goes on to say this refund is now not possible because I did not use the direct shipping method.  This does not make sense to me because again I why would I have to pay for import taxes on an item purchased from the same country?\n\nThen, the representative goes on to tell me the £132.40 charge may be VAT which he\/she says is different from inport charges but did not seem certain and will get back to me after he\/she escalates this to a senior department.  I asked how I could follow up but the response is that I can only wait for them to contact me about this or email the support team (which I assume is would require me to explain the whole situation again to a new representative who may have to then escalate this issue to someone else.)\n\nThere is no clarity to this process.  I am very frustrated and cannot understand why I would be paying import taxes in this case.\n\n*EDIT: I was reading some of the responses VC left for other comments left on Trust Pilot.  In one line it, they state 'When you buy in the UK from a UK seller, you won't be affected by VAT even if you select an authentication service.'--- SO WHY AM I BEING AFFECTED BY VAT?","title":"UK Buyer Subjected to Import Charges…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-04","author":"Amanda Wogan","text":"I paid EU to UK import duties\/taxes on my order direct with VESTIAIRE.  Today I received a request from the courier DPD that I must paid the same import duties\/taxes before they can deliver my item. I contacted VESTIAIRE who suggested I pay them again and claim a refund from them!!!! I have refused to do this as it is their error. They have been backwards and forwards via email with the same request. \nI sent them the link I received from the courier about making a payment but they have not been helpful at all. \nVery very disappointed and now awaiting a full refund. I will not use them again. Customer service is appalling!","title":"I paid EU to UK import duties\/taxes on…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-04","author":"Luz Clemmensen","text":"I sold a bag through Vestiaire collective and I have not gotten pay for this. I send Many mails and messages and I have not gotten any answers.  I am still waiting for an answer.\n\nEvery time I try to write my Banks details i Their system, I get a message from Them where I Can read that  I am suppose to get a mail to identify myselv. \n\nI have not received this mail. I just get  VC Daily marketing mails.","title":"Missing paid for a sold bag.…","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-04","author":"Jessica Louise Mott-Brown","text":"I have sold things on Vestiaire & they arrive but I have now waited THREE WEEKS for some shoes I ordered, TWO WEEKS it hasn’t moved & no one will message me to investigate. I’ve tried calling the delivery company but it’s all in French. \n\nSuch terrible customer service. I’ve sent two emails in the last two days & feel like I’m just being ignored. \n\nI wish I’d seen other people’s comments before I bought things. \n\nThis is the second time I’ve bought something & it’s not arrived from them! So concerning. Especially when I sold something & they received it the next day!","title":"No response from customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-04","author":"Sarah Smith","text":"Item 14 19 3509. I've tried to list my bag approx 10 times. However , they keep refusing me accusing me of stealing photos from the internet. I've spoken to ref Ronillo at VC head office to explain that I've taken all the photos myself. As an expert seller you'd expect my photos to look somewhat good ! Not so says VC and keep refusing my listings no matter what. Complaining to them directly does no good\n What can I do ?","title":"Item 14 19 3509","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-04","author":"Sarah Smith","text":"Item 14 13 95 47 . Item refused by them because my photos look too good for them. They think they're stolen from the internet. Spoken to hear office. No reaction\n Trying to list a bag. No response other than that. Hello hello??? Anyone there from Vestiaire ? :-)","title":"Item 14 13 95 47","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-04","author":"Lauriemk3","text":"Terrible awful customer service \nThey promise response and then don’t respond\nThey have one of those awful AI assistants...useless!!\nMy order could not be delivered because they messed up the documentation\nWont be buying from them again!\nCrap crap crap service","title":"Terrible awful customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-05","author":"Rowena A","text":"I used to love buying from VC however since Brexit, I’m unable to purchase anything even from the UK now. No one has appropriate answers. If customs tax is applicable then VC need to work quickly to provide this information to the buyer otherwise sadly ruin the risk of losing plenty of customers.","title":"I used to love buying from VC however…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-05","author":"verityshaw","text":"Dodgy company -  flooded with 5 star reviews every so often for a boost... 🤔","title":"Dodgy company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-05","author":"Semtec Partners","text":"Vestiaire is now almost unusable for anyone in the UK. They have arbitrarily imposed bans on goods that can and cannot be posted to the UK. A total disregard for the actual import\/export tariffs.","title":"Quel Horreur !!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-05","author":"JA","text":"Waiting for an item and only hear lie after lie about how someone will contact me with an update. All I wanted was an update and to know the item is being stored properly and will come in x weeks.\n\nUPDATE: After weeks of waiting, Natalie from VC sorted out the matter for me (order flagged with shipping issue). Unbelievable how many times I had to contact for someone to take their job seriously. Thank you to her!!\n\n2nd UPDATE: Bag came completely squished. Guessing it stayed like that for a while because it doesn't seem like it can be fixed. Never again","title":"Hit or miss customer service","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-06","author":"Jayte","text":"VC is very much a mixed bag, with an apparent lack of consistency in various facets of customer operations.\n\nI'll preface this by saying that I'm very particular about providing accurate descriptions and photographs, warts and all.\nIf an item has a flaw, no matter how minor, I will highlight and detail it.\n\nConsequently, it is baffling and unprofessional when VC inexplicably amends an item description in either\/or an inaccurate or illiterate manner.\n\nIf I correctly list an item as \"Silk\", for instance and VC mistakenly\/randomly amends that to \"Linen\", I'd expect to have an unhappy and confused buyer in spite of the fact that I originally described the item correctly.\n\nI'm therefore now checking every item carefully after it is listed and I'd recommend others do the same.\n\nTrying to contact customer services in order to rectify the issue is typically more time consuming than listing the item in the first place! Further, a request to reinstate the originally description might not be honoured but rather replaced with a description that is butchered...again. \n\nSeveral times in the last few weeks, I've simply pulled items from VC due to the amount of time required to explain the issues to Customer Services, usually to little avail.\n\nWhat is the purpose of staff amending detailed, *accurate* listings in a manner that can fundamentally change an item description and render it inaccurate? It makes no sense whatsoever and is a colossal waste of time for all involved!","title":"Please stop the rogue edits\/inserting incorrect details in listings","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"},{"date":"2021-02-06","author":"Victoria Diaz","text":"I've sold an Acne Studios sweatshirt (absolutely new, with tags). By mistake I've sent the wrong size. Instead of sending the item back to me they lost it.\nDuring this time I've contacted VC customer service several times but no one solved, nor informed me where my item was. In fact I have downloaded a chat where one of VC customer agent (Bart) ensured me my item (11617815) was safely guarded at VC France warehouse. Another customer service agent told me they have lost the item (Laura) and they . The mistreatment VC displays against sellers is outrageous. \"customer support\" is not more than a bunch of arrogant people that will NEVER answer any questions. After 4 months VC refuses to pay for my sweatshirt as it shows to be lost.\nThey do not answer mails. They blocked all communication. I left with no product and no payment.\nI want a full refund for my lost. I need a person in this company to contact me with to solve this problem. After 4 months nobody takes responsibility and they don't want to refund me for an item. PLEASE HELP!!!!!","title":"VC lost my item and they don't refund me","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=75&stars=1&stars=2&stars=3"}]