[{"date":"2021-11-20","author":"Nicole J De Marco","text":"Fraudulent Company! I will have to join the chore of bad reviews and people who would give it 0 if they could. \n\nI have received a few present from VC in the past, not being me who bought it and having received pieces I really wanted I decided to join as a seller in order to re-sell some of my loved items. I sold my first Mulberry bag and packed it carefully with the right labelling. The client was based not far off from London so the chosen courier was Hermes. A few days after sending the parcel I receive a message from the buyer who informs me she received a pair of £29,99 Zara trousers instead of the £160 Mulberry bag. \nThe client shared a picture of the parcel and I luckily also took some before sending the box. The two picture did not match! Proving then that the parcel has been tampered and that the bag has been stolen by someone (Hermes? VC? Who knows!)\n\nFastforward 5 days of chasing VC over the live chat, explaining the happening to every single agent and with the promise that 'someone will email you' or 'rest reassured we are taking care of it' and 'we apologise for any inconvenience' I still have no news of what happened to the bag I carefully packed or about a compensation for losing my item. \n\nAfter reading countless complaints here and on other platforms, it seems obvious to me that VC with a facade of sustainable luxury fashion re-seller is in reality a dishonest company that makes money on the shoulders of those who naively believe they found a bargain, not to mention the lack of professional structured customer service dedicated to the resolution of issues with orders, payments, listings etc.\n\nIf you really are looking for a high end luxury pre-owned item you better off on Ebay or Marketplace.\n\nSTAY AWAY FROM VESTAIRE COLLECTIVE!","title":"Fraudulent Company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-21","author":"JS","text":"Vestiaire's feedback was incorrect: it took a total of 22 emails to get the description changed. Each time they said in the chat that it was changed, it wasn't, and I finally had to tell them the exact wording in the email. Pathetic ineptitude - and weasely response from them below, as always.\n\n\nVelvet Jacket, Ref. 19047137\n\nAs the seller, I was surprised to see that someone at Vestiaire had changed the description of my jacket without consulting me. In my first contact, approx 4 November with Angela, I was assured the changes had been made. Two further contacts were made, apologies were followed by assurances the changes would be made.\n\nI've just checked and, having three times given the same instructions to change the description back to what I originally wrote, it's still unchanged. \n\nIt still reads 'not just for dressing up' instead of 'not just for fancy dress parties'.\n\nIt still reads designers instead of designer's in the second paragraph. \n\nThe third paragraph - clearly someone's invention - is still there when it's obvious it shouldn't be.\n\nEvery time I've been assured the changes had been made and would be visible in 24 to 72 hours. \n\nThey haven't been. My first complaint was approx 4 November, it's now 21 November; I've wasted a huge amount of time interacting with Vestiaire customer service, always receiving the apology for the inconvenience and always, ultimately, with nothing changing. Pathetic way to treat customers.","title":"Incompetent Time Wasters","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-21","author":"mary m","text":"So disappointed in vestiaire. I don’t know what happened to this company but definitely they are not doing what they advertise. They cancelled my sale coz I was 1 day late to ship it (it is kind of not my core business to allocate time first thing no matter what). I contacted the most useless chat with them, of course they promised to contact buyer and to sort this out and to relist. Nothing happened - just waste of time in their chat. In 3 weeks I contacted again and also receive loads of promised - nothing happened, wasted 1 hour. Chat alway disappears itself, on the same chat you are getting asked the same questions. I do t understand why it is so complicated to relist the item and to ask the buyer to place order again as it was vestiaire who cancelled the purchase. Awful service and total waste of time.","title":"So disappointed in vestiaire","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-21","author":"Hannah","text":"I purchased a pair of Chanel Mules ref 18895937. Once I opened them I was unsure about the authenticity, knowing the quality of Chanel I was concerned when I noticed stitching coming undone, visible glue and no serial number. I arranged an independent company to authenticate them for my piece of mind (even though I paid Vestiaire to authenticate!) and of course they found them to be counterfeit. I wrote to Vestiaire Collective within 72 hours, via their help centre online form, explaining my situation and asking for the return process. If Vestiaire don’t support the selling of unauthentic items then why aren’t they responding to me? I feel like I have been robbed. Vestiaire what is your return process? Fancy selling fake items and then not responding to their customers. I will be taking this further and expect a response from Vestiaire and this mistake of their own to be sorted out.","title":"No response from them when things go wrong","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-22","author":"Schoen Kopen","text":"Worst customer care ever! They read your messages and don’t even reply to it to help you! Also there is some wrong information about where the item you want to buy is located, so you think you buy in Europe and the item is located in Dubai?!?!","title":"Worst customer care ever","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-22","author":"Nataliya ","text":"VC, I need your answer regarding the sale of items no.18147203 and no. 14607765.\nTo date, I have not received any response from you to my 3 (three) e-mail sent previously regarding the sale of items no. 18147203 and no. 14607765.\nI have also not received any feedback to my Trustpilot.com complaint posted (in Italian) 4 days ago.\nSuch behavior on your part is unacceptable: it is called disservice and incompetence.\nI hereby ask you for the following:\n1. Update the status of the sale of article no. 18147203, received by the buyer on 8\/11\/2021. To date, I have not yet received any payment for the item sold.\n2. I need explanations on article no. 14607765 sold by me on 11\/11\/2021 and declared NOT compliant by you on 11\/18\/2021. Since that date I have not received any updates on the matter and to date the article has not been put back on sale by you as you promised.\nI am waiting for a reply from you.\nUpdated 06\/12\/2021: VC, Thank you for you assistance: I've finally had the payment for the sale of article no. 18147203.","title":"VC, I need your assistance about the sale of items no.18147203 and no. 14607765.","stars":3,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-23","author":"Oliver S.","text":"I sold two items through Vestiare, both send via direct sale. I received the confirmation that sellers were happy and from one day to the other I am unable to login to my account. It takes ages to reach customer service, but the agent says both items are counterfeit (claimed by buyer, not Vestiaire) and my account is closed down. Both items were bought on Vestiaire and were sold here. Now I lost items and money. Noone dares to help. This is a company such a mess, horrible service and absolute unreliable service. If you are keen on loosing money and your products sell here","title":"LOST MONEY and ITEMS - DON'T SELL HERE - BEWARE SCAM","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-23","author":"Elise Augarde","text":"Another terrible experience with Vestiaire Collective. I sold an item with VC and it took 1 month and a half and easily 20+ emails from me to get the item delivered just the other side of town. I would have been much faster bringing the item walking...\nDespite their automated answers saying I would hear back from them in 24\/72h, I wouldn't and had to constantly chase them. Whilst 1 lady of customer service was great (Anna) I was quickly moved to really incompetent ones who would refuse to look into my case without me sending a copy of my ID. When I asked what for, I never got a clear answer!! Eventually a colleague took over and moved on with the case, no need for my ID! This is so erratic and incompetent!\nNow that the item has been delivered and approved, I was relieved that this would be all over soon. But NO, I am STILL waiting for payment 9 days after delivery!!!","title":"Another terrible experience","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-24","author":"Daniela Diaconu","text":"I bought an item that wasn’t available. It didn’t show on the website that is not available. 2 weeks later I am still waiting for my money back. Every time I contact them on that awful chat they tell me someone will contact me and they never do.\nI will never buy anything from them again. They are unprofessional and they have awful customer service","title":"I bought an item that wasn’t available","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-24","author":"Benedetta Trifirò","text":"Vestiaire collective is a platform that steal your money by selling out your items without your permission. I had 31 items ojn my profile barely posted, meaning that I have posted most of them not even a week ago and I found just last night that all the prices that I have just put on the items dropped without None of my COnsent!! I have reached the company to understand what was happening and they said that I WAS the person who Made that Change!!! I WAS NOT EVEN AWARE of that change how can I possibly have made it myself!!! So, I honestly would like to delete my account because of it but Because i dont want them to win over it, I will post all over the items again with original prices. One more thing that you all should be aware of. Vestiaire collective send emails to possible buyers of our products saying that we would be willing to lower the prices of our products even if that is not true, so that they might offer you a lower price to buy it.","title":"Thief","stars":2,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-24","author":"Cave Man","text":"Their quality control team made damage on my Hermès  bag and refused to take responsibility , this is a scam don’t trust them","title":"Their quality control team made damage…","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-24","author":"Ying","text":"VC removed my item 17887569 without notifying me. This is so annoying and I would never use this site again because I cannot be bothered. It is an absolutely waste of time. When I contacted the live chat. I was told it is delisted because I did not go back to them to Confirm that my Item is still available. Well I cannot go back to confirm anything I suppose if I have’ve never got your message, right??? This is absurd.","title":"VC removed my item 17887569 without…","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-24","author":"MaryC","text":"The costumer service is alright and responded to my email with considerable amount of time, there are genuine sellers and not so updated sellers.\nI will give 1 star for this was my first purchase on their app and it didn’t make me happy and feel safe to shop. \nBoth my items was refunded but the money didnt come backnin my account within supposed business days. 72 hrs(?) is it?\nFirst item has been shipped by the seller but Vestiaire somehow cancelled it and the seller doesnt know why they did it. Im waiting the refund that I felt will never comeback.\n2nd item, the seller seems to be online on her account and confirmed that the item is available, took 2 weeks but didnt ship it. I messaged the seller but didn’t even reply. As soon as I message, few hours later, the item was now unavailable and now Vestiaire have to give me the refund. The seller didnt even apologised to me for not communicating and checking on her selling item when she was actually online few times when I look at her profile.\nIm furious because this is my hard working money spent here. I’m eager to pay the seller who actually committed and communicate with me personally via her own number. I might as well pay her directly on her account and not through the site.\nYou guys need to update your quality of service. My first experience is bad. It will take awhile to convince me to buy another item.\nGood luck to anyone who use this site.","title":"First time buyer experience","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-27","author":"kathleen fong","text":"The worse experience selling an item online. \n\nAfter being told that my item was successful recieved and that I will be getting my payment in 5 days- I patiently waited for 2 weeks before sending out my first email to the customer service team. I requested some details of the payment so that I can check with my bank, and while they’ll provide the invoice number they kept masking the bank account it was sent to (only leaving the last 4 numbers). Firstly, It’s my bank account, why must you mask it? And despite only providing 4 numbers, they got the number order wrong! I even sent a screenshot comparing what i provided to them on the app and what their invoice showed. \n\nAt this point it was 1 month of back and forth and when I brought up the payment being made to a wrong account- but all i got from their agent Renz was that “this is a exception.. will reply you in 3 day..” \n\nAbsolutely frustrating - its a straightforward case of contacting the bank to make a report and paying me for what you already earned commission for! shady af and judging from how other sellers didnt get their payment, it screams scam\n\nEdit: The team has fulfilled and transferring the payment owed in full. Though it was a long process and a ton of chasing on my end- there was a resolution and they had proven to stay accountability and not a scam business.","title":"the worse seller experience","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-27","author":"Christelle G","text":"I have now had 8 items cancelled by the seller since August. Each time the seller tell me they have been messaged by someone else who offers them more. This is incredibly frustrating especially when these are big orders and credit is not available to put towards something else for 72 hours.  What people now do is look through the 'sold' items to see if they have missed out on anything. VC should get rid of the sold items function. Ebay and vinted don't show you sold items so why does VC? I'm just really upset because every time I order this happens now.\n\n\nOn the plus side the new commission fee for VC is much better .","title":"Stop showing sold items","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-27","author":"morten jensen","text":"They are still refusing to return my items which they have not sold for around 2 years. Please don’t use this platform.","title":"They are still refusing to return my…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-27","author":"Wenrui Shu","text":"The customer service is useless.\nI never received my order and asked them to resolve the issue. They kept on saying they will get back to me in 24 hours but they never did. I purchased the item on 08\/10, it’s been more than one month and they still couldn’t solve the problem.\nI asked for refund and they just kept me waiting.","title":"The customer service is useless.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-27","author":"jasmine","text":"This is the first time I purchased from Vestiaire and I won’t ever purchase again. I ordered an item and immediately after purchasing realised that I had set up a klarna payment plan using the incorrect card . Meaning I would not be able to make the payments . I contacted them on chat within 10 mins to request to cancel the order and was told only the seller could do this . I then contacted the seller and they were happy to cancel it but said they weren’t able to as Vestiaire has already booked in for DHL to collect the item. I used the chat feature multiple times to speak to someone from customer service to explain they needed to cancel it on their end because the seller was unable to and that I had a large amount of money pending from my account i needed to be cancelled immediately. At the point I was so appalled by the customer service there was no way that I wanted to purchase anything via them so wished to completely cancel the order and did not want the item at all. i was told that they don’t cancel orders unless the item is no longer available which is completely against the Consumer Contracts Regulations in which I had a  right to cancel an order from the moment i placed it and for another 14 days that had passed from the day. As the item had not even been collected and was still with the seller there should of been no issue for them to just cancel the order for me but they made it literally impossible to the point I had to contact my bank to ask them to stop the payment from going through. After multiple chats with customer service and emails from myself and the seller the sale finally was cancelled but I will never trust this company with my money again","title":"This is the first time I purchased from…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-27","author":"JT","text":"AVOID!! SCAMERS!! Sent an item for authentication. Item didn’t pass authentication, was told to send 12 £€$ for it to be returned. But my account was deleted, so I can’t process that return. They have kept my £900 item! SCAM!","title":"AVOID! SCAMMERS!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"},{"date":"2021-11-28","author":"Natalie Kurpel","text":"Update: Vestiaire finally paid me for my item! Thank you!\n\n\nAbsolutely terrible service. I sold a Gucci leather jacket, shipped it right away using the label they provided. Customer never picked up the package. It has been almost a month, the package hasn’t been returned to me. So I am out of jacket and and of money! I contacted them numerous times, and the only response I get is promise to resolve the issue or get back to me within 24 hrs. Nothing has been done for a month!!! Impossible to call them as they don’t have this option. Absolutely terrible!!!  Will never ever do business with them again!","title":"Absolutely terrible service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=33&stars=1&stars=2&stars=3"}]