[{"date":"2022-03-09","author":"Joe Dancey","text":"Another fake item gets passed through their £20 per item authentication service as real. This time it wasnt even the same item the seller pictured, they dont even compare the item to the sellers pictures, this company is a complete joke. Beware their authenticity is consistently wrong and you have a long battle to prove you are right. Their authentication is rubbish. greenwashing. UPDATE: They have agreed a second hceck but not a refund, apparently the seller was banned for selling fakes so why was my order still put through after they were banned AND authenticated? And still they have not offered me a refund. THIS WEBSITE IS A JOKE.\n\nThe response is also a joke - they are definitely fake and their authentication team are clueless","title":"Another fake item gets passed through…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"Stephanie","text":"They are slow to ship, the sellers list items incorrectly and slow to respond to issues.  Other resellers such as TheRealReal, Poshmark even Ebay have much better customer service as well as track records with ensuring an item is properly described.   Do not use Vestiaire.","title":"Terrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"Liv Eline Larsen","text":"Recently I ordered an expensice pair of leather-pants from Vestaire. They were perfect in size for me, I did not have to «Force» them on or anything. \n\nBut after only 1 hour of careful usage, they ripped. It seems to me like they were poorer in leather quality where they teared.\n\nNow I have to take them to a seamstress, which will cost me approximately 50-60 USD extra, and there is no guarantee they will fit me as well afterwards. I feel scammed and sad.\n\nOrdernumber: 51264079","title":"Ripped leather pants","stars":1,"location":"NO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"Sarah Bayliss","text":"I ordered and paid for a bag, they use Hermes couriers who don’t deliver and just don’t reply, the bag is now lost, nobody gets back to you it’s a total nightmare they take your money but you don’t receive the order. Don’t use them they are very bad.","title":"Beyond Terrible don’t use!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-09","author":"Rebecca Möller","text":"Unfortunately, I had a very bad experience with Vestiaire Collective.\n1. For my first order, I ordered a bracelet. In the description it dazu sit had a retail price of 12.000€. The item was sent in to Vestiaire Collective to check the authenticity. They failed to recognise that the item was the small version with retail price of only approx 4000€. \n2. For my next order, the house number was missing on the parcel. I tried to get in contact but nobody was ready to help. Problem could have been solved so easily by just giving the number to the delivery company. But the woman in the chat just did not want to help. Also I had no possibility to call.","title":"Very Bad Service + No Authenticity Check","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"Mari","text":"I am very disappointed from my experience with VC. I bought a bag received it but as it was much smaller than I realised I relisted it in 2 days while I had 72 hours to do so without being charged a commission. I finally sold it a few months later and they charged me a comm. Days later after letting them know and proving I relisted the item in 48 hours they give me NO excuse just 3 copy paste emails that say 'we understand but this sale will have a comm'. Unacceptable. Also their fees are way too high and this discourages both sellers and buyers.","title":"Very disappointed","stars":2,"location":"CY","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"Sam s","text":"Avoid this company.  Happy to take your money but dont ship the product to you.  I shipped an item to my buyer a week ago and its still on hold.  Despite chasing them to release this, no one from customer service is bothering to action.\nAvoid at all costs.","title":"Company with Bad Reputation - AVOID","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"Natalie Egmore","text":"So I decided to give Vestiaire another go after I was sold a fake item that luckily the customer cancelled the order, not because it was resolved by Vestiaire. They now seemed to have lost my latest order, Leather chanel espadrilles under reference 21321705. The customer service is terrible, you can't speak to anyone other then this computerised website. If you read a lot of reviews from both customers and sellers this is the main complaint that there is no real help from customer service if you have a problem. When I asked customer service where my order was he initially tried to say I'd received it on the 4th March but luckily I have email confirmation to say they had received my order on the 4th March at their hub for authentication. It is now the 10th March and I'm still not getting an answer as to where my order has gone. Customer service is so bad you can't really get an answer either. I think when your spending money on high end items there should be a proper customer service team that you can verbally speak to if you have any problems. Everytime I ask if I can speak to someone they ignore my question on the Web chat. I think my latest item has been lost in their hub as I've ordered other items from abroad after my espadrilles that have been authenticated and now sent to me. I think if you have any problems there is no real help which is a very worrying concern. I feel there is a real possibility that if an item gets lost you may never get your item and loose your money. Reading the reviews of people on here there is obviously something very wrong with this company, their are so many complaints about customer service and things being brought but not sent and items going missing, refunds not being given etc etc etc, I really think Trading standards and legal action needs to be considered with this company as what their doing is very wrong both legally and morely, the stress to the customer and seller is so unnecessary if the company new what they we're doing. Surely someone in management should be reading how bad their reviews are and looking into why they have so many complaints, it's all to do with word of mouth and people will stop buying from here unless someone within the company looks into why their is so many problems with items going Missing and people loosing money for items not received.","title":"So I decided to give Vestiaire another…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"ZanW","text":"Purchased a pair of Louboutin shoes on 24\/2. Unfortunately seller couldn’t post in the agreed 7days so agreed to cancel the order which was done within 24hrs of purchase and refund requested. Vestiere authorised refund and added this on the order page. However no refund was issued and they’ve since altered the order page to show it was authorised on a much later date and deleted the previous entry! Received an email a week ago to say refund would be in my account within 48hrs but still here I am 2weeks later and still no refund!! Spoken to 3 different people on live chat chasing it all of whom are saying different things and none of which are coming up with any factual information. \nCustomer service is useless and they haven’t issued the refund that is rightfully mine. \nI will never buy or sell on Vestiere again as it’s such an unprofessional set up that fails to pay genuine & trustworthy customers their money back. \n\nAVOID AVOID AVOID","title":"Shocking service, still waiting for refund.","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"Mags","text":"UPDATE: My item is still NOT posted. I’ve been exchanging emails, using online chat, messaging on Facebook messenger. My head is about to explode. I keep receiving conflicting information from different people. I was offered a refund - I accepted, then was told it will be shipped on the 15th of March - I said ok, so I was waiting. Today still no item, it’s not shipped, no refund, no reliable information. Can somebody please take some responsibility for what they say. I’m absolutely exhausted dealing with it, such a disappointment. \n\n\nAnother awful experience! Bought an item two weeks ago. Seller posted same day, item was checked and accepted by the VC team in the 3rd of March. Today, a week later it hasn’t even been shipped to me!!! What are they doing with it???? Customer service is a disgrace. I was told it would be shipped yesterday, still nothing. Customer service advisor doesn’t reply to my emails! What a horrible place to shop! How difficult is it to get it posted??? \nAvoid! Absolute disaster! \nSelling is great as long as everything goes well. Any issues and you’re left with nothing, no support whatsoever!","title":"Another awful experience","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"Sylvia Fetzian","text":"VC is a brilliant idea at the hands of the wrong people!!! If you ever have a dispute, your questions are never really answered! They have the worst communication ever!!!","title":"Worst customer service ever!","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"Kate O","text":"Another disappointing experience as a seller with VC - mainly due to them continuing to use Hermes as the delivery service. Hermes reported an issue with the buyer's address and therefore tracking shows that it was \"on it's way back to the sender\" (me), on 28th February. It's now 12th March and I don't have my dress back, I don't have payment from VC or any updates and the Hermes tracking has no updates as of 28th February. So I have lost the dress. I have contacted VC customer service\/chat bot but they aren't helping.\nIf VC want to portray themselves as a luxury brand, they need to sort out their customer service and UK mainland delivery service. Please go back to DHL or at least use Royal Mail.","title":"Another disappointing experience as a…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"Helen","text":"Vestiaire are a great company until something goes wrong and you’re reliant on their “customer service” which is non-existent. \n\nI am an expert seller who has sold almost 500 items on this platform. Sadly (no doubt as a way to cut costs) Vestiaire started using Hermes for all UK shipments under the value of £200. Hermes are slow at best and incompetent at worst. They have no contact centre that sellers can reach out to as their “dedicated phone line” is for account holders only and Vestiaire are the account holder not the seller. As a result when things go wrong you are reliant on Vestiaire to resolve and anyone that has experienced their customer service team knows how that goes…\n\nI have currently had two parcels (sent at different times) appear to have been undelivered (according to Vestiaire anyway) and tracking now shows each parcel as “on it’s way back to sender” when in fact they are not. Instead they appear to be lost. Item reference 21056327 was shipped on 28th February and item reference 17689586 on 4th March. I’ve contacted Vestiaire on so many occasions and they don’t seem capable of doing the most simple action and contacting Hermes (despite the fact Hermes have a “dedicated account holder phone line”). The tracking doesn’t even appear to have got to a delivery stage, it’s like there’s a technical glitch because it goes from being collected from the drop off point to “on its way back to sender”. One of these parcels should have gone to Vestiaire for authentication and the other to a buyer directly. No delivery attempts appear to have been made and yet the parcels are coming back?? It makes no sense. Nor can I understand why if they are being returned they haven’t actually come back?! Vestiaire could contact Hermes and no doubt resolve this issue pretty quickly (as gauging from the reviews this has happened to more sellers than myself so might be a more widespread issue) but instead I either get emails asking for identification documentation (which I’ve already provided and they’ve done nothing with) or I get no reply at all. I am one of the highest performing sellers on this platform and yet Vestiaire clearly do not care about retaining business. I’m out of pocket on two items - I don’t have the goods or payment and Vestiaire are not being remotely helpful in finding a resolution. There are no issues with the address details of either parcel (as I said, one was going to Vestiaire’s U.K. hub) so why can’t Vestiaire just liaise with Hermes to ensure the parcels arrive at the destination addresses? It doesn’t feel like rocket science and is simple enough to resolve with companies like DHL and UPS who view the seller\/sender as the client and therefore actually speak to sellers when there’s an issue. If Vestiaire want to save money by using poor courier companies like Hermes then they need to accept that when there’s an issue the onus is on them to do the leg work to resolve.","title":"Please stop using Hermes","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"Tanya Harbas  from Croatia","text":"What kind of a scam are Westiaire working on ?\nI have sold 5 items but got paid for two only .\nHermes and Chanel handbags.\nIn spite of numerous emails and time waisting no payment for 6 weeks !\nReceived a note yesterday verification failed again .\nInformation on my payment account is correct .as two payments confirmed .\nAll this is from 31.1.2022 …..why .\nI receive email from you indicating payment will be 24,26,28 February- no money.\nSecond email 6 .March suggesting payment in seven days ….until last night. Stating verification failed .\nI feel sad and disappointed in this kind of working practice.\nHow to proceed ..?\nI expect to be paid ASAP without full fees .it’s not unreasonable request .\nTanija","title":"What kind of a scam are Vestiaire continued","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"Margaret","text":"As a new seller on this platform, I was attracted by the authentication service and quality of the goods being sold. While most of my items have sold without issue, the first item I sold, which was received by the buyer on 24 Feb was reported on 27 Feb to have an issue. I was informed that the situation would deadline after 7 days. Since then I have heard nothing despite contacting customer service by email twice. I have not received any confirmation that my queries have been received nor is there a number to contact. When something like this happens and you discover that you have no channels to reach VC (the chat bot is useless) you lose trust in the platform. I would beware of what you choose to sell here as when things go wrong you have no way of resolving them easily. At this point I just want my item back. But I am totally in the dark.","title":"Poor customer service-no response to requests for updates on sale","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"Demmy","text":"My experience at VC as a buyer and seller had been great up until recently. \n\nI sold a scarf (REF: 20744177) and they found a hole during authenticity check which I had not noticed. It was a really small hole and the buyer wanted to buy the item still. They cancelled my sale and returned the item to me.\n\nI told them that the buyer still wanted it and they asked me to re-list it. I re-listed it, mentioned the hole in the product description and added pictures to show it this time. And they rejected it and cancelled the sale again for the same hole. (REF: 21582880) Because it did not match the description which it clearly did. And it was the same buyer who purchased it before and wanted it regardless.\n\n1. It wasted my time and the buyer's. The buyer in fact told me she won't shop at all at VC anymore.\n2. I am not even sure if they made the hole bigger during the check, it seems to be that way. I will see when I have my scarf back.\n3. It sank down my expert seller stats.\n4. They want to be sustainable but 4 times back and forth for nothing is the opposite.\n5. Their customer service is misleading and not really helpful. \n\nSo I am pretty disappointed and will expect a better solution. If they will help, I will update this review.\n\nApart from my bad experience recently, I like that they upgraded user experience - no more bugs and easy uploading for products. If you are lucky with seller\/buyer, you get good value for money. There is not enough customer protection though.","title":"Misleading customer service","stars":2,"location":"CZ","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"Igor Virgo","text":"Zero customer services.","title":"Stay away!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"Wendy","text":"Had a great experience as a seller but as a buyer a disaster. \nOnce they canceled the sale and the promo code I used for making that sale got wasted, they never replaced it. \nTo sell, great experience","title":"Had a great experience as a seller but…","stars":3,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"DontuseVestiaire","text":"I have been using them since 2014. They used to be expensive but the quality control worked ok - every now and then a few hiccups. \nRecently, 3 of my orders went badly. The price of quality control went up and the service is down. \nThe chat is served by a bot and \"experts\" use the templates, no one reads anything. Very very disappointed.\nHighly NOT recommended.","title":"Non existing quality control team","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Nane","text":"Comissions too high. The authenticity team not very professional.","title":"Comissions too high","stars":3,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=12&stars=1&stars=2&stars=3"}]