[{"date":"2022-01-12","author":"A. Kazemi","text":"The UK (Crawley) branch of this “company” is a total disgrace! Run by a bunch of unskilled, unprofessional, wannabe “expert authenticator” cowboys who are completely CLUELESS at doing anything that they have been employed to do! They are NOT experts, they are unskilled fools!  Speaks volumes of the kind of amateurs this company chooses to employ! This is evident in their requirements for the job role which only ask that the applicant holds either a “qualification in fashion” or has a “passion for fashion”! Absolutely disgusting to be putting any useless fool in charge of processes such as quality control! \nThis is the second item for which the complete morons have generated two reports filled with inaccuracies and false statements and due to their bullsh*t I have had sales cancelled; all based on their incompetence and falsehood! It seems as though it is the same individual clown based at Crawley who is directly responsible for these false reports so beware of sending your valuables to this dodgy, unreliable branch as it will most likely result in your time being wasted and losing out on potential straightforward sales! I am now starting legal proceedings against them as I have clear evidence of their statements being completely false. They are either blatant lies that they feel compelled to tell because these useless amateurs feel as though they need to pull s**t out of their a*s even if there is nothing wrong with the item that has been sent to them in order to fulfil their job requirements. This is how pathetic they are! They have no shame or remorse in inconveniencing others due to their sheer dumbness or to make themselves feel worthy by generating reports full of bs and they actually think they can get away with it time and time again! Well they are going to be in for one hell of a wakeup call when they receive a legal claim backed by full evidence to disprove their bs and prove exactly what a bunch of incompetent fools this company chooses to employ! These fools are uneducated in the industry, have no real experience under their belts and their “passion for fashion” gives them no right whatsoever to go around jeopardising peoples’ sales! These types of dodgy so called companies run by the most unethical pr*ts who go around employing any idiot and putting them in charge of things that are way beyond their scope, need to be exposed to the public in every way possible, including media coverage and on every social media platform as they love to advertise themselves by portraying an image of something else completely, deceiving others into thinking they are 100% legit! Attempting to cover up the fact that they have been constant f ups for as long as they’ve existed by using terms such as “we are fashion activists, we are helping the planet, we promote circular fashion, we work with Selfridges” but they fail to tell people how they will rip them off with hefty fees, put valuable items in the hands of incompetent and clearly inexperienced fools who will in turn generate a pack of lies without a second thought, if an item you order from their dodgy platform happens to go missing they will give you maximum hassle and stress for months on end in an attempt to mentally exhaust you into deciding not to pursue a refund, their so called “customer support” is nothing but another sick joke operated by the most useless agents who have no authority to do anything and the only thing they’ll tell you is “we will have to pass this on and will be in touch via email” so you might as well be talking to a robot! \nThere is a reason why this disgraceful company has endless 1 star reviews (which in almost every case would have been zero stars had there been the option) with both buyers and sellers equally disgusted at their experiences and the issues they have had to endure due to this unethical platform. It needs to be brought to the attention of Selfridges too as working with such an infamously disgraceful company will only ever prove to be a liability for any business and for a reputable, long established company like Selfridges to be working with these morons, they must be completely oblivious to their horrendous reputation.","title":"Disgraceful UK (Crawley) Branch Run By Incompetent Clown!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-13","author":"Gogoncea Isabella","text":"Hello!Is there anybody that Can help me with a telephone number from Vestiaire Collective,please?I got scamed and for about 1 month and a half they don’t give me an answer at the mails.Thank you!","title":"Hello!Is there anybody that Can help me…","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-13","author":"Emily","text":"I've used VC for a couple years now and have had no problems with the company up until today. I bought a leather ALLSAINTS jacket that was listed as 'very good condition'. After receiving the item, it was not in good condition at all. There was numerous areas of fading, stains and tears in the item. I asked VC for a refund since the item did not match the description and the issues I reported were not initially photographed, and all they said was that I can re-list the item for the same price I bought it for\/using the previous seller's description. So essentially VC wants someone else to get scammed? I've now lost money and am stuck with a bad jacket. All I want is a refund (will gladly send the jacket back to VC for them to sell). If this cannot be done I won't be a customer with them anymore and will tell everyone I know about how horrible\/deceitful their service is...\n\n\nRe: VC’s response - the item was only newly listed as “good condition” instead of “very good” is because I had to reach out to VC directly and ask them to change it since it wouldn’t allow me to do it myself.  This idea of “if the item you bought doesn’t match the original description, just re-sell it” IS WRONG. You should have a proper return policy in place for when these things happen. I have no idea if the new buyer will be happy with the item but since this is all your policy allows for there’s nothing I can do.\n\nREF 20279958","title":"Beyond disappointed","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-13","author":"Ditte Bille","text":"I've sold so many items on different second hand platforms and it's always been easy and both as seller and buyer. But never have I ever experience such a bad platform - especially if you're a seller. \n\nFirst of all, I send my email address to a potential buyer once(!) in a message - because I didn't know that wasn't allowed. Then I was BANNED from the chat for 24h?! Kind of extreme and send a message that you don't give a s h i t about your consumers. And all their \"customer service\" do is give you a lot of copy paste answers and are in no way interested in helping you. She actually send me wink smiley face when I expressed how bad an experience this is. It's clear to me that they don't listen to you as a single person but just have these black\/white automated rules that they are in no way interested in taking a closer look at for each complain.\n\nSecond of all, it's extremely hard to even create an add as there are SO MANY rules! I don't think I've ever waiting that long to have my items online. \n\nThird of all, if a potential buyer make an offer on the item you're selling, you accept it and they don't buy your item anyway and actually DECLINE it again, you can't accept any other offer in 24h. So you loose a lot of potential buyers. You should be able to accept more than one offer and than it's just up to the bidders to buy it first.\n\nAnd finally, WOW Vestiaire Collective take a HIGH amount of the payment - both as seller and buyer. I have never seen such high percentage being taking from the platform. It makes it impossible to negotiate as you will receive so much less as a seller and pay so much more as a buyer. I don't know how you would even justify this.\n\nYou should really take a look at how other second hand platforms are doing it - for example \"Trendsales\". It's so easy to be professional and yours is just so outdated, lack customer service and understanding and just so, so, so bad. I mean, really bad. And please take a look at your employees. It's almost embarrassing the answers you get in the chat.","title":"The worlds worst second hand website","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-13","author":"Ivona Buzov","text":"Avoid, avoid , avoid because this is a scam company. I've been waiting for more than 2 months for money return for the products that was never delivered to me. \nI seriously doubt I will ever see my money. They are using all possible excuses and still no money back. I've deleted they app and I recommended to all of my friend to stay away from them.","title":"Avoid , scam company","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-13","author":"Eline","text":"I wish I could give 0 stars.","title":"WASTE OF MONEY AND TIME.","stars":1,"location":"NO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-13","author":"Ilaria Rapuzzi","text":"Dear VC \nIn order to operate I ll suggest you not to hide behind the excuse of COVID \nYou guys seriously need to put on place a solid Customer service operation   where at least there is somebody you can chat to \nIn real time if you don’t have the gut to answer to phone number anymore.\nYou  should be ashamed about it \nYou guys are a fraud.\nYou sold me a pair of boot that are listed in the website of a brand but I finally received a different brand \nHow does your quality control work??\nSame way of the customer service by a  brainless machine???\nStanding by your policy I am able just to put them on sale again ??\nMisleading people is a solid reason to be able to ask for a refund \nI ll seek more information with my solicitor \nI won t use this app anymore","title":"Misled","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-14","author":"Dalel","text":"I have sold an a jacket,item number #20070082 that I bought myself directly from the brand I worked for.\nVc cancelled the sale because they were not able to authentificate (lack to their expertise) really shameful! Then the asked me for €12 to return my jacket which I shouldn’t be liable for,the buyer should pay for controls not ME! plus my bank doesn’t support international payment,now my jacket worth 2k is on hold at their warehouse for no reason and blackmailing me for €12! I will take this further and post what has happen in all social media,so people doesn’t trust this company that pretend to be an expert in luxury consignment!!!\n You can see in their reply they said I sent the money to the wrong account and they are lying I did sent the money to the account they provided me in their email on the 04\/01\/2022\nAnd it is correct!!! They provided me with a different account on the chat but I didn’t save it because I thought it is the same details on the email.Now they are trying to steal another €12,I will keep posting here until I see what lie they will tell next","title":"Be aware,don’t use this platform","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-14","author":"Anonymous","text":"Shockingly bad experience.  Concur with another reviewer who wanted to give no stars.  Have deleted my account, won't work with them again and don't recommend.","title":"Shockingly bad experience","stars":1,"location":"MM","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-14","author":"Anonymous","text":"Shockingly bad experience. Concur with another reviewer who wanted to give no stars. Have deleted my account, won't work with them again and don't recommend.\n\nDeleted my account.  Not interested in the compensation.  Won't work with or recommend your company.","title":"Shockingly bad experience","stars":1,"location":"MM","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-14","author":"Anonymous","text":"I would give zero reviews if I could- These people are crooks and only care about their commission - they don’t care about buyers or sellers. AVIOD AT ALL COSTS! I tried to help a buyer find a parcel that was delayed ( not my job-theirs) consequently got BANNED from the chat (!) for trying to help! Tracking shows parcel has finally been delivered but Vestiaire won’t update the tracking to show it’s been delivered and so I won’t get paid! I can’t contact the buyer to ask for it to be marked as received as they have banned me! I will no longer buy and sell and highly recommend others not to do so .CROOKS!","title":"I would give zero reviews if I could-…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-15","author":"Rania Fadel","text":"If I could give this website a MINUS 100 I would! Worse selling experience of my life! I sold them a authentic delvaux bag tagged with the serial number booklet receipts and all and they still knocked it back telling me it's fake! Now it's stuck at customs as they want me to pay duty and tax again!!! \n\nThis company and the people who work in it are an absolute joke! Takes them so long to reply to emails and you can't contact them directly either now I wonder why that is lol. \n\nSTAY AWAY PEOPLE THIS COMPANY IS A FRAUD THEY HAVE NO IDEA ABOUT DESIGNER AUTHENTICATION AS THEY WILL NO ANSWER MY QUESTION OF HOW ARE THEY QUALIFIED TO ASSESS AND AUTHENTICATE BRANDS! \n\nSTAY AWAY!!!!","title":"STAY AWAY FRAUDULENT COMPANY!","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-15","author":"Alexandra Gor","text":"Honestly I have been selling and occasionally buying with them, mostly without issues, but be prepared their customer service is pretty bad and they aren’t easy to get hold off.\n\nSo, I have an older Chanel bag purchased from the boutique, that’s missing a hologram (wore off) so a couple of months ago the bag sold, VC authenticated it but informed the buyer of the missing hologram (as I didn’t mention it in the description, didn’t realise it was an important thing to mention) offering to either keep the bag or to cancel the sale, the buyer cancelled sale. Fair enough, I didn’t realise I should have added this in my description, so they sent the bag back to me and I relisted it for sale once again, clearly stating about the missing hologram. The bag sold once again for a lower price and this time Vestiaire collective have rejected it all together saying they failed to authenticate it and cancelled the sale automatically. The bag still had the tag from the first sale - the tag that approves the item and has details of the person who inspected the bag. Now I have to pay for the bag to be returned to me which is pretty ridiculous. It’s a Chanel boy as well, not exactly a complicated bag to authenticate, I seriously wonder about the professionalism of the people they hire as “experts”!!! Not impressed at all, their commission is ridiculously high and I am seriously doubting I will continue selling with them. On top of that, yes, you can’t return items and get refunds! That’s their policy - you have to re sell the unwanted items, so be prepared if you aren’t happy with the item, it’s yours anyways.","title":"There are many issues you will encounter at some point.","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-15","author":"Carmel Harmston","text":"The customer service at Vestiaire when THEY owe YOU something (ie a refund of a voucher code following a promotion) is absolutely awful. Truely the worst customer experience - I have experienced this on several occasions now and it is always consistently a poor outcome - this most recent time is because I use a gift voucher to purchase an item, the seller then cancelled the sale and Vestiaire are refusing to refund the voucher component of the sale. The first time I participated in a promotion and should have been awarded a voucher code - instead I had to fight for weeks to get the code and Vestiaire tried everything from claiming the promotion didn’t happen (luckily I had screenshots) to claiming I didn’t qualify (again, luckily I had screenshots). They are an awful company when it comes to customer service.","title":"Exceptionally poor service","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-16","author":"marta","text":"If you want to buy ANY item you have to pay 15€ of Shipping!!!! I wanted to buy a 15€ shirt and have to pay 30€ for it… nonsense","title":"nonsense commissions","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-17","author":"Auguste Barbora","text":"Please bring back the free directed shipping!\nSince the new seller fee, my sales have dropped about 80%. I wondered why. Then I found out that Direct shipping was 8 Euros instead of being free. Now the shipping is even 15 Euros!! You should be able to make decent money from the seller's commission enough, why make the shipping so expensive? Now it's almost impossible to sell here, no one wants to buy an item with +15 Euros shipping.","title":"Beyond greedy with the new shipping prices","stars":3,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-17","author":"Ema Nedkova","text":"Horrible shipping price!\nIf you buy 4 items outside of your country, you will pay a total of 52 EUR for shipping (shipping of each article is 13 EUR!!!). I don't think anyone will pay 52 EUR shipping for second hand goods. \nObviously, they try to make money from this!","title":"Horrible shipping price! Stay away!","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-17","author":"linda hendon","text":"I would not even give this company a one! I bought a bag that took 8 weeks to come and they lied constantly about where it was, if it had been sent etc. You cannot contact them directly and their customer service is appalling. I would NEVER use this site again and I would advise anyone thinking of buying from here Please do not. You just have to read the countless other awful reviews to see what an absolute unprofessional company they are!","title":"ABSOLUTE AWFUL CUSTOMER SERVICE AND ATTITUDE. PLEASE DO NOT BUY FROM HERE","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-17","author":"Anne Russell","text":"I have been trying to 'unsubscribe' to their emailed newsletters. Impossible to do so! No details anywhere to contact them.","title":"I have been trying to 'unsubscribe' to…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-01-18","author":"Sonya G","text":"I recently sold a Prada bag via Vestiaire Collective. I shipped the bag on time and VC confirmed it was compliant. 5 weeks later and I still didn’t receive my money while they have the bag and the buyer payed for it. When I contact costumer service I need to wait days before I get an answer which just repeats that they are ‘working on it’. Very rude tone of voice and no clear explanation as to what the problem is. A TOTAL RIP OFF!\nStay away, you will lose your expensive item (s) and will never get your money. And I’m not the first one to have been ripped off by Vestiaire Collective from what I read\/heard! Look for other resell platforms with more reliability and better costumer service!","title":"Ripped off, never got my money!!","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=23&stars=1&stars=2&stars=3"}]