[{"date":"2021-04-28","author":"Kirsty Youngman","text":"v poor. As a shopper there is no aftercare or support if the item ordered is not as described. I ordered a pair of sunglasses. These came with a prescription lens, were wider than described and with a bent arm. None of these issues were advised in the listing. I even took the lenses to an optician who verified the issues. Vestiaires response was initially \" after investigation, we do not see an issue'. My further emails quoting their own terms that have been breached have all been ignored. I have phoned three times and either had the phone put down or promised a call back which has not been forthcoming. Ebay has a better mediation policy and buyer protection. I have bought 3 items from them - 2 I have had issues with (not as advertised). Neither have been resolved. If you want buyer confidence do not use this site. I will not be using again.","title":"v poor","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-04-28","author":"Sanna Mäki","text":"I’m very disappointed with Vestiaire Collective.\nAs a buyer your position is really weak.\nI bought a LV bag and since (The Trusted Seller) did not have dustbag I got the authentification from VC.\nWhen I bought the bag seller had 4-5 pictures of the bag at their add. \nThe bag passed the authentification and it was send to me.\nWhen I got the bag it had terrible cigarette smell and the bag had a stain that I did not see in the pictures that the seller had in their add.\n\nI immediatly contacted customer support and I told all of this.\nThey were understandable at the beginning and they asked me to send the bag back to them. They also said that they will contact the seller about this issue.\n\nMagically the day after I made the complain 5-6 new pictures were added to the sellers bag add!! When I saw this my heart dropped, since I knew that my changes of getting my money back were low, since they would automatically believe this ”Trusted Seller”.\nI was also suprised that the authentification team passed a bag that had s super strong cigarette smell, so be very avare that the authentification team will pass bags that have digusting stink.\n\nAt one point I was promised that I will receive a full refund but what happened is that the bag went trought another authentification process and it passed again (off course since they compared the pictures with the new set of pictures that the seller had!) everything was ok from VC point of view. Now I’m 750€ poorer and stuck with a bag that smells like cigarettes.\n\nI will not buy\/sell anything throught VC since I don’t trust their processes and I don’t believe that they truly care about customers. What a shame.","title":"I’m very disappointed with Vestiaire…","stars":1,"location":"MT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-04-28","author":"Farah23","text":"Bad company avoid at ALL costs. \nFirstly they take a huge commission and then due to brexit huge amount of tax and customs on items.\nWhat even worse is their customer service who are clueless and have no idea how to help other than to read from script. \nAlso they sell fake items which they say they verify but I went to third party who said it was FAKE! When I contacted them they refused to take accountability.","title":"Bad company avoid at ALL costs","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-04-29","author":"K S","text":"Again. Glitchy system, that keeps demanding I send the item that has already been delivered 2 years ago (and sent within 1 day of sale), and showing 0% rate for items sent the same day. And awful customer service, not willing to do their job. Used to be a regular customer, buying and selling something every week, now just waiting for my items to be sold to close the account. Shame on you, vestiaire.","title":"Again - awful customer service.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-04-29","author":"Lucie Victorie Lekesova","text":"I have only bought 4 items on vestiaire and 3 !!! of them were later cancelled for unavailability! Waiting 5 days each time to get my money back..\n\nI think it's really bad when people list their items and then they sell it somewhere else and leave the listing on Vestiaire online! \n\nI am really frustrated.","title":"Most if the times item UNAVAILABLE after purchase","stars":2,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-04-29","author":"Daria Kr","text":"I bought YSL heels advertised as new in box. VC team when checking them pointed out that the heels have signs of wear providing one photo with some marks - looking like dirt, offering to discount an item by £13 if I still wanted them. Trusting them that marks presented on photos are accurate I accepted the offer. Heels arrived and they are brand new with no signs of wear BUT with DEFECTS. Marks assumed to be wear are in fact discolouration - heels caught dye from something. Any attempt to remove the dye results in paint coming off - they already arrived with white patches with no paint. Heels also came with dent sole and only one dust bag - YSL provides 2 dust bags, one is not big enough to fit both shoes. I contacted then VC both on a chat and by email and they don’t think they’re at fault. £13 was also provided in a form of voucher to use a on VC website and not a refund, it does not compensate anything. It seems like misadverting the item is completely fine. To fix the heels and repaint them costs a lot of money, and additional time and effort. On the photos used by the listing heels seem to be in a perfect condition. On the only photo provided by VC with caption “wear” one can see few dirt marks. Upon arrival it’s clear they’re defected, and dark discolouration marks are all over the heels. Paying over £200 for misadvertised item is a SCAM. There was no mention of white patches with no paint, discolouration marks or dent sole.\n\nI received a response from VC asking for a quote from shoe repair. I spent multiple hours to look for open shoe repair in the middle of pandemic. They confirmed what I stated - marks are not dirt from wear but black dye and heels are defected. I’ve send them a quote multiple times, it’s been 6 weeks since sending it the first time and they never replied. I opened PayPal dispute and I’m supposed to return these shoes, out of my own pocket, so now I have to spend my own £30 just to return it. I will of course return them. The amount of time I wasted is shocking and now I’ll be losing money.\nI’ve been buying online for 10 years now and never have I ever came across a company that treats people like this.\n\nNext pair of YSL shoes came with a scratch, marks and dirty sole covered in glue, with only one dust bag instead of two. It’s a joke.\n\nDon’t buy anything from them because they don’t check items properly and then claim it’s not their responsibility to solve a problem. If you do have problems with them ask PayPal to step in or your bank for chargeback as their customer service is useless.","title":"Absolutely the worst company there is and appalling customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-04-29","author":"Sp Eedy","text":"I have sold item over Vestiaire Collective, since I am outside of Eu I had to pay shipping, they are not covering. Immediately when I sent package I have sent copy of the bill and tracking number to VC. Package arrived to France after 20 days (delays, due COVID), and I got notice that  they have to contact French customs, probably to pay for customs charges, which they refused. Over twenty times I contacted VC to solve the problem and 55 days later they didn't do anything about it. When I asked them should I forward invoice to French customs they categorically banned me to do that and confirmed to wait for their \"Expert Team\" to solve the problem. After few days sent me email, with note that they're trying to locate  package which was not true, I have sent them email correspondence with French customs who held package do to customs charges. This is the worst experience ever, be aware of what I wrote when you selling with VC and sending internationally.","title":"I have sold item over Vestiaire which refused to accept package and do anything to help their customer","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-04-30","author":"silvia","text":"Not having the possibility to talk directly to the support team makes the overall service worse than in the past. Thank you","title":"Not having the possibility to talk…","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-04-30","author":"Maggie Ilie","text":"This happened me twice. Once while I was selling a bag and the second time when I bought a Chanel shoes. \nA buyer tried to purchase my bag which was listed for 1800€. She offered 1500€ and wished for a direct shipping. As bag listed over 1500€ she was not eligible for direct shipping. I changed the price in the listing to 1500€ to make her able to choose a direct shipping option BUT the price was visible to her for 1575€ and for me 1500€ so they were trying to make 75€ more than the 400€ they would charge me for sales commission. So unserious and disrespectful for their customers. I have ZERO trust for them!\nI was in touch with them both times and the answers I got was “ oh I see we are sorry” not much more than that!  \nJoli closet is much valuable, serious and helpful site to sell and buy pre loved items.","title":"Terrible, they trying to make more money than the given commission Behind your back!","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-04-30","author":"Vi","text":"Be very careful when you decide to sell on Vestiaire! If you post an item for sale specifying it does NOT include invoice, once it sells and you ship it to their warehouse, they demand you send to them the invoice. When you say the item does not come with invoice and therefore you won’t be sending it to them, they CHARGE YOU €12 to have the item sent back!!! I won’t pay this ridiculous fee and instead just file a police report for them unlawfully keeping an item worth thousands of dollars!","title":"Do NOT sell on Vestiaire","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-04-30","author":"Ryan","text":"Had a very bad buying experience. Purchased an item but still listed as available after the amount has been taken from my bank. Contacted customer service and they were not only unhelpful, but also inefficient and constantly giving different excuses.","title":"Very bad experience and horrendous customer support.","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-04-30","author":"Lara","text":"STAY AWAY, HORRIBLE AND INCOMPETENT CUSTOMER SERVICE.\n\nEVERYONE SELL ON VINTED OR DEPOP OR JOLI'S CLOSET INSTEAD!","title":"STAY AWAY","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-04-30","author":"Lou","text":"wouldn't even give it the one star !Awful awful awful ! As a seller i can't tell you how many times chanel items have been bought and lost by the company on me and ME the seller having the product and money not given back to me. Requesting the return of my chanel trainers from head quarters for over 4 months now !!! \n\nSold a chanel skirt and they left me money short which hasn't been returned -only for i checked calculations i wouldn't have realised im left short ....Do you think they would reimburse me -no told me expert team will get back to me -still waiting over a month now \n\nI would advise to use EBAY authenticity new platform so much easier and way less fees. Vestiaire to sellers is daylight robbery!","title":"Robbing B***s","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-05-01","author":"N. Johari","text":"Horrible. They made a mistake and their customer support has been useless","title":"Horrible","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-05-01","author":"Percypigs1988","text":"I was sold a pair of chanel earrings. When I got them I tried them for a few weeks and decided they were not for me. I then sold them on VC again.\nI then received an email after someone bought them saying the sale had been cancelled because they were fake.\nI have tried 10 times in the chat box to get this actioned and all you get is sweet \"I'm so sorry that happened I'll help you\". After the millionth time this happens and nothing has changed it gets a bit old. I have bought many items off VC and I now wonder if they were fake too. I've paid monthly memberships for a year and spent thousands and this is the treatment you get. So I now have no earrings and I'm down £400. \nI have chased you every couple of days for nearly a month and you've made zero progress.This was the absolute last resort making a complaint on here because of how long I have waited. Disgusting","title":"I was sold a pair of chanel earrings","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-05-01","author":"Valued Customer","text":"AVOID!   What more can I say?  All the negative reviews posted here are true, I’ve experienced most of the issues.   Selling & shopping should be joyful, at VC it often turn out to be very stressful & frustrating!\n\nListen VC, without us (the sellers & buyers)  your platform is nothing!   You are arrogant, treating us dishonestly & disrespectfully will eventually push us all away!","title":"AVOID","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-05-01","author":"Percypigs1988","text":"This is a scam. They sold me earrings and I then sold them to someone else on VC after deciding they were not for me. VC then decided that they were fake, yet they were ok selling them to me when I bought them! They have now kept the earrings and refuse to get in touch with me. I've spoken to them on the \"chat\" over 10 times. This has been going on for 4 weeks. So I have no earrings and lost £400. Thanks for nothing.","title":"This is a scam","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-05-01","author":"shelley harker","text":"Do not sign up to this company they do not give you an option to delete your account and when I spoke with customer service they only said to deactivate. \n\nmy personal details are still on there website. \n\nScam","title":"DO NOT SIGN UP","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"},{"date":"2021-05-01","author":"Rose Danesh","text":"Bad customer service, I sold my item,and didn't get payment yet since December 2020,please avoid from this website  this is scam","title":"Bad customer service","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=61&stars=1&stars=2&stars=3"}]