[{"date":"2021-12-01","author":"Nicholas Holt","text":"Agressive marketing emails which they refuse to stop sending.\nHave emailed them before yet daily emails appear and option to unsubscribe simply doesn't work.\nAvoid like the plague","title":"Agressive marketing emails which they…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-01","author":"EleA","text":"Their customer service is non existent and have given me false information repeatedly. They make you use Hermes courier for collection and delivery which is a nightmare. The listing journey is awful too. Most resale websites are better and much cheaper than Vestiaire Collective.\n\nEDIT: Disregard their reply to this review, I have received no refund as of 07\/12\/21. Also, they never mentioned in their customer care that they found my shirt. It is completely out of order that I was never offered the option of having it returned. Again, avoid this website for your designer items.","title":"Avoid - unreliable customer care","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-01","author":"Igor Virgo","text":"VC rejected to accept my authentic  baseball cap which comes with original dust bag as well. The item doesn’t look like counterfeit at all but they asked me to provide a receipt! Meanwile i have spotted many fake items on their website with wrong labels, sizes e.t.c. Complete joke!","title":"Avoid!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-01","author":"Rachael Moles","text":"Awful customer service. \nBelieve all of the bad reviews! \nItem that I purchased, although being listed as a U.K. item was infact from France and they changed this after the listing had closed. \nItem took weeks to arrive and no response to emails. \nAlso, having gone through TopCashback (which would have given me £50 cash back) they have declined the cash back despite me having screenshots showing the referral. \nUntrustworthy and considering they sell high end items, a total scam of a company. \nWill never use again and should have listened to the Purse Forum and FB groups.","title":"Awful customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-01","author":"Kevin McGee","text":"I sold an item and shipped it in the designated time period. Due to a storm, the package was not picked up by the postal service in time, and the payment was refunded to the seller, despite already being shipped. The seller will not respond to Vestiaire, and it's been months now with the seller having my item and me not getting paid.\n\nIf you have any sort of issue, their customer service is basically useless. I have spoken to them day in and day out and wasted 10s of hours to still not get anywhere. Awful company and would not recommend to anyone whatsoever.","title":"Vestiaire Customer Service Is Awful -- Sold an Item and Never Got Paid.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-01","author":"Karolina Wikowicz","text":"I bought Chanel handbag model 19 ref No. 18567618. The bag has got different dimensions than those specified by the seller in description (the seller specified bag as average model with dimensions for the medium model 30cm\/20cm, in fact it is a small model).  The bag was sent to Vestiare for re- checking, was double checked and Vestiare continues to maintain that the handbag conforms to the description.  Moreover, Vestiare put it up for sale from my account with completely different dimensions (correct for small model) than this specified by seller and they  added note that bag has got traces! When I was buying it there was No word in description  about traces, seller wrote that The bag is in perfect condition and this condition was accepted by Vestiare . For me this is theft and fraud! I’m talking about 4500€! And I aldo paid for authentication ! If I knew that it is a small model I woulndn’t buy it, I would add 400€ and go straight to The chanel boutique for new one. I could wrote be careful before buying but it won’t help. They will do and accept everything just to earn money. It isn’t a safe platform to sell and buy anymore.","title":"They will sell you everything just to earn money","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-02","author":"Lilly","text":"I keep getting the emails to confirm the availability of my items, however when I try to, I can't (I use the webpage and not the app due to privacy concerns and the notorious problems with the app), reaching out to customer service is hopeless. Chat seems to be auto-replies and the \"agent\" not even reading what you said. I am not sure if it is a lack of command of English or general disinterest. \nI tried to email them and usually get also auto-responses that do not even address the problem (clearing cache will not help if the link does not work, I logged in and pressed the link, it led me to the buyer seller chat) when I try to send an email nobody seems to read it, the latest one was somebody claiming that the since the popup isn't there anymore the problem is solved. How can it be solved when I could not confirm the availability of my items? \nThe problem has persisted for months now, I have reported it each and every time, yet nothing has been done apart from \"Well then download the app\" and the items that are very much available are deleted.\n\nIt seems to be impossible to contact anybody, I gave up listing because where is the point? This time I might address a complaint to the Information Commissioner's Office, as I see this as a blatant attempt to force me to use an app where I do not have any control over the data and tracking the company employs, which is actually a violation of GDPR.\n\nSince I have informed them every time this happened, and it has happened regularly and nothing has been done, I feel like I am left with no other choice!","title":"There does not seem to be any customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-02","author":"Mrs Gabeva","text":"Really VC?! For someone who has sold 450+ items on your platform and none of them was non-authentic, you decide from a picture to refuse a brand new Chanel top because you can confirm authenticity from the pictures submitted. You are becoming a bigger and bigger joke. Beyond ridiculous.\nThank you for your submission.\n\nCHANEL \nTops \nReference: 19616108\nNever worn \nOn the site: 450 € \nFor you: 382,50 €\nThe team responsible for our catalogue has carefully examined the item you wanted to sell on our platform.\nUnfortunately, when applying the specific criteria determined by Vestiaire Collective, it was not possible to confirm the authenticity of the item.\nAlthough we have been unable to accept this item, please do submit more pieces you wish to sell to our curation team who would be delighted to check them out!","title":"Beyond ridiculous again","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-03","author":"Jenna","text":"Chanel sports backpack with broken zipper! Says on website zipper not working optimally. Optimally means (not well) I thought it was the little pocket that wasn’t working well, but it was the main pocket for the whole bag. No pictures, no writing which pocket. It should had said “zipper broken”! And marked poor condition. \n\nI ordered a Chanel backpack on 11.11.21 that was sold on VC once before by a danish girl. A girl from Romana buys it and relists the item with the same description, but in this description it says nothing about the main zipper is broken! Which is probably why she is selling it again. The bag can’t be zippered up or down it’s stuck and nothing can be in it, as everything will fall out. This was not described or shown in the pictures on the website.\n\nIt was listed as “very good condition” a item in “very good condition” is an item that is a second-hand item that is hardly worn and is very well maintained, although it may have slight defects from wear. If the item has defects, they must be mentioned in the description and be visible in photos. (There where no photos showing the broken zipper.)\n\nVC did a quality control on this bag 3 times. This item was checked upon and VC got back to me saying the clasp was off of the bag. The CC zipper clasp.\n\nThey wrote : Our Quality Control team has checked this item and found that there's a tiny difference between the description and the item itself. This minor flaw wasn’t mentioned by the seller in the description, nor was it visible in their pictures. You can read the details in the report from our Quality Control team by clicking below. That said, we still think it’s a wonderful item and a great deal. Our recommendation is that you go ahead with the order but, of course, the choice is yours!\n\nBut the bag has not only a clasp missing which is a tiny and minor detail, like VC says, the whole bag does not function and this they did not tell me nor showed pictures of when doing quality control on the product. This is not a minor detail! This is a huge detail. I seems they didn’t even look at the bag probably. \nThey looked at the product again as I returned it to them and they won’t accept a return and instead offered to relist the item for me again! Like the did for a other seller, that cheated me! They keep putting the item back online with no pictures that show the defect and bad and unclear description which is cheating more buyers.\n \nI won’t pay for an item that is not described right! When I list items I have to upload loads of photos and they want all details, but this bag has 3 photos, no pictures of serial number, no pictures of dirt on interior and no pictures of missing parts nor broken zipper. This listing is not honest and VC doesn’t want the bag back cause they know it’s not probably functioning and they know they can’t sell it. \n\nI paid with klarna and I am no paying for this item!!!! I’m not letting you cheat me and others. \n\nI spoke to Lady Ann A from VC which will take this matter up again. I hope she can talk some since into the “Quality team” as they clearly don’t do there job right.","title":"Chanel backpack with broken zipper","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-03","author":"Nancy","text":"Despite purchasing an item listed as being in the UK and myself being in the UK I have been sent a DHL. Customs and duty bill of nearly £500!!!! This is the second time I’ve had this situation.   Someone is being disingenuous.  The item shouldn’t be listed as being in the UK if it isn’t.  Customer Services is hopeless and no one seems to want to sort this issue out.  This bill isn’t right and VC should sort it out !   Last time I’m ever buying on her and as soon as I sort it his situation out I’m deleting the app and making sure I spread the word to avoid this company at all cost.   The customer services email doesn’t work now we well so all you have is “Chat”.  Someone is supposed to be emailing me but let’s see how long this takes and how many times I’m going be chasing for satisfaction.     Edit: no. 2.  Well yes originally I was told on 6th December that VC would take ownership of the bill, but guess what its 29th December and I am being told to PAY IT and wait for reimbursement!!   So I've deleted my previous edit which said my faith has been restored because clearly VC lies to customers and just passes you from one Customer Services person to another.   So ignore VC's comment below so many weeks later they haven't sorted this matter out, they haven't taken ownership of the DHL invoice, and I'm being told to pay and hounded by DHL.... Merry Christmas VC !!!","title":"Despite purchasing an item listed as…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-03","author":"Eva S","text":"Absolutely disastrous customer service that resembles fraud!! Do NOT trust VC with your valuables. I sold a coat and the parcel got lost by UPS one month ago. Customer service wont help or willfully misunderstands my chat mails. I have been in contact with them like 6 or 7 times already, and the people answering the chat seems unable to comprehend even very simple questions. On VC’s own website they say that VC should open an enquiry with the courier when the parcel tracking hasnt updated for some time. I have asked and asked and asked without result. Then, yesterday, they wrote me that they had actually opened an enquiry - about a pair of shoes that I had never ever had any problems with or enquired about (they had actually just been received by the buyer the same day!!!). It looks as if VC actively uses the employees’ lack of communication skills\/understanding to dodge payment that they are legally obliged to make. That resembles fraud. I have never in my life experienced this level of incompetence from a company.","title":"Absolutely disastrous customer service…","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-04","author":"Anca","text":"Bought a fake Burberry shirt from them.\nI have chose direct shipping and when i received the shirt i realised is a fake.I ve contacted VC and they answered to me weeks later asking me to resell it on their website ?!couldn t believe my eyes.I didn t learned my lesson, so purchased again a Prada bag 3 weeks ago.I have received two emails saying that the bag was received and passed the authentication proccess.Tried to contact them on the chat but they don t answer.They didn t used to be like this.Wouldn t buy from them again!!","title":"Bought a fake Burberry shirt from them.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-04","author":"Emily Barry","text":"Vestiaire has ruined a vintage Chanel jacket during the quality control process - the intricate beading is missing in a long line down the centre of the back, leaving it unwearable and unsaleable.  I can put up with zero customer service but this has led to significant financial loss for which I am seeking compensation.  I would never use them again","title":"Vestiaire has ruined a vintage Chanel…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-04","author":"IR","text":"Disaster) above predatory commission, they push on you to sell things cheaper, I mean seriously cheaper. After posting an item I immediately started receiving offers ... 30% off the price I set. I understand all the users there are just looking for a good bargain, but this is insane. I looked through item of same brand posted on VC and found out they sell much more simple things of same type but lower design line for the price twice or even three times higher! So I deleted my item, explaining the issue to a service. I said, I'm sorry but I have to delete my item and than post it back but with higher price because 6 people in 24 hours were just looking to buy my item for 30% less than I rightfully expect to get. And what do you think they did? When I posted my item back, 48 hours after I received a rejection because 'we are not sure your item is original and authentic. send it to us so we can check it and approve it'. Seriously?! So the previous time when few days ago I posted same thing but 30% cheaper you didn't have any question about it's authenticity (which is untruth as I provided all the HR pictures with labels and codes of the product).Hahaha. No way, VC. My advice: use this burglar platform only if you want to get rid of some things you couldn't care less about anymore (but why not just bringing it to charity than right?). In case you own something valuable and want to make a fair deal - avoid Vestiare Collective at any cost. They will take 25% commission plus will drag you to lower your price to ridiculous minimum... so what's the point in dealing with them? Any day (sometimes twice a day!) they will send you notifications like 'drop your price', 'it's a week your item haven't been sold', '10 members added your item in their wishlist so you'd better drop your price and sell!'. Drop your commission down instead...because the service provided doesn't worth it.\nAnd if you're about to buy something on VC... think twice why the price for good label items are SO attractive and approachable (bear in mind 25% commission and think about why would someone sell, for example, 'Aquazzura shoes in perfect condition' for 35 bucks?!'. It's easy right? Probably things are not in that good condition as they're described. Check fair prices for things. So it all starts from people being honest and fair, no matter if you're a seller or a buyer, or a service in between.","title":"Disaster) predatory commissions and marketing blackmailing","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-05","author":"Elena","text":"There are so many things to complaint about 🤦🏻‍♀️ I don’t know where to start!\nI am an expert seller @luxauthenticuk, I sell authentic preloved designer items and have 100% score not only on their platform but on EBay and Depop as well. \nThe main worry is something happened to their authentication of Mulberry and Burberry, they are very slow, once it took a week to post on the site! But also they refused two of my Mulberry bags, both bags are so straight forward to authenticate🤦🏻‍♀️ Mulberry Dorset (ref 19640278) and Vintage Scotch (ref 19661302) grain with a serial number tag. I always list as many photos as possible with all of the details, the reason of refusal was “it is not possible to confirm authenticity”??? How can you provide authentication services if you couldn’t authenticate such obvious authentic bags? I am wondering how many fakes gone through to the website?\n\nThe other matter is where is my Chanel wash bag (ref 18617794) that was sold but stopped by your “expert” team because of a wrong size?? How? So from 14.5 x 21 x 7 it shrunk to 13 x 20 x 7, what on earth have you used to measure it and where is a proof of it that I requested? The sale is lost, the status shows it was posted back, but no tracking info or any other info at all.\n\nI suggest somebody gets back to me as soon as possible!\n\nAn update:\nFirst of all thank you for your reply.\nSecond thank you for listing both bags although only one of them left for sale. \nThird, thanks for posting the Chanel bag back to me, I will do my own check and will update with an outcome 👍\n\nSo the bag was returned to me and as I expected my measurements were correct. There was no need to cancel this sale. I have been advised to list this item again, shame that such important selling time is wasted!","title":"There are so many things to complaint…","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-06","author":"Josephine Strandfort Lexner","text":"I would strongly advise not to buy anything on their site. Their authentication check-up is extremely poor. I bought a LV bag and when I received it, the condition was much worse than reflected in the pictures and described. The faults I discovered were not mentioned and neither shown in the pictures. Vestiaire took it back for a second check and said it lived up to their standard accordingly to category. Then i wrote them back with pictures and the specific faults second time. The customer rep said they didn't check those specifics but just a standard check-up. I had 24 hours to decide if i wanted the bag back, or they would just relist the item for the purchase price and charge their usual commission. I am very frustrated as I feel I've been sold a product based on pictures that wasn't reflecting the real condition. Their customer service is poor and slow. So on top of the price paid for the bag, I paid for a quality check-up (as its part of the process when buying) that is extremely poor, plus shipping cost. And their suggestion is to relist the item on the price i bought the bag, using the same pictures so that a next buyer will be in the exact same situation as me. Plus they will charge me their standard commission. So in the end if I decided to accept any of the offers being made on the bag at this point, it will end up costing me equivalent to 150 gbp \/1500 hkd and time for a product that i dont even have. So just money out of the window. After telling about my story, other people have told me lots of items on the platform are fake. So poor quality and authentication check-up really isn't trustworthy with them. Conclusion buy dont through them for second hand.","title":"Poor quality check-up and customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-06","author":"Daniela Bogoeva","text":"Vestiare Collective steal your money ! \nTwo items and still they haven’t paid me and my account is dissapear. I made new one with same email adress and there was not problem . \nThe item ref 19120944 is checked and accepted 30.11 and nothing happens. The paymen stay sheduled and everybody from customer service said after 5 days after 5 days. And keep lying. I think to may report to the police because this is cheat!","title":"Vestiare Collective steal your money","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-07","author":"Alessandro Vecchi","text":"Have been using VC for quite some months now.\nWhen there are no complication, it all goes smooth. As soon as something extraordinary comes up, they desappear and have no clue on how to resolve the issue.\nHave emailed them several times, being in chat everyday. And the only reply received is “Trust us, you are in expert hands, your issue will be resolved in 3 days but hopefully in 24hr”.\n\nFinal result: after 7 days nothing resolved, lost my Expert Seller Badge and the customer never received the item purchased.\n\nAll this because they were not able to solve a problem on the label side, which was never provided, and I had to cancel my sale.\n\nSomeone really needs to look into this or they will lose all clients to other websites!!!!!!","title":"Terrible and unreliable Customer Service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-07","author":"Isabell Cohen","text":"Horrible scam company. Bought a bottega bag, re sold it on VC and they said it was FAKE, after they themselves before stated it as authentic😅😆\nIt took a long time to sort out and then I seen it was sold again by VC on the site, so 100% criminal. Bought a Saint Laurent bag from them in Very good condition, re sold that one also and they claimed it was not in that state, even though their on tag was still there since it was a resale. Soo unprofessional company and really sad how they scam.","title":"Horrible scam company","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"},{"date":"2021-12-07","author":"Grainne Mack","text":"I ordered shoes nearly two weeks ago and after being deemed compliant 5 days ago they have still not left their warehouse. ‘Stuck’ apparently. I have contacted them multiple times to be told there are delays because it’s December. But they can’t tell me when they will ship my order. I can’t understand how such a company can’t organise timely shipping. If it were delayed due to the shipping company I would totally understand however she just haven’t bothered to ship it. It’s unfortunate they are so disorganised because the company has a good ethos. However due to this I wouldn’t buy from them again. If they had sorted the matter, I.e. shipped the item when I first started to enquire a number of days ago I would have been happy however the shoes are STILL sitting in their warehouse. Leaving me without shoes I paid for nearly two weeks ago and leaving the seller without payment. My advice is you are better buying elsewhere or new if this is the service they give. How disappointing.","title":"Extremely slow delivery","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=31&stars=1&stars=2&stars=3"}]