[{"date":"2021-08-09","author":"Natalie Barkus","text":"And another bad review for Vestiare Collective. You can't get hold of them. My bag was delivered for assessment on the 29th of July and i haven't heard anything since. This is the only was to get your attention. Can i have someone to call me?????.\nRef17265401","title":"And another bad review for Vestiare…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-10","author":"Frieda Ryckaert","text":"Over and over again they fool and sabotage you as a seller. A rare pair of deadstock GUCCI sunglasses with no issues at all but still have the guts to write there is a tiny issue ...? This is not the first time and I'm not blind, be professional and please don't reply with 'We are so sorry to learn .... ' I've had it with VC!","title":"Over and over they fool and sabotage you","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-10","author":"A.","text":"Horrible experience with Vestiaire again. I am currently in constant emailing with them, but i am talking and arguing with a dead horse.\nI ordered a vintage Chanel bag from a so called “expert seller”, and payed for the “quality control” and “authentication process”. Both these so called control processes are horrible and mean nothing! You only lose money to be lied to.\n\nThe seller stated that a button in the bag was not fully working as new, but that it could easily close, would not pop open AND would be an easy fix. All three turned out to be false. Of course Vestiaire passed the bag as compliant, because easy money for them with their abnormal high fees and commissions.\n\nThe bag is BROKEN, the seller lied to everyone about the current state, as this button was very much completely broken and unfixable by Chanel, leather spa’s, handbag spa’s and cobblers. This is unacceptable.\nI immediately filed complaints with vestiaire and they kept telling me the bag was compliant. After haven spoken to like 6 different staff members, someone told me to ship it back. Which i immediately did, ONLY TO HAVE THE BAG SHIPPED BACK TO ME WITHOUT ANY COMPENSATION!! Someone else from the website offered me 10% off, but i just wanted to leave this ugly, broken bag behind me. After having it back i immediately spoke ip again and i could only relist it. I do NOT want to have to resell a faulty bag. It feels immoral and cruel to lie about the condition of expensive luxury goods like these.\nI now have relisted it, but i am still not done with the demand for a return! You can tell me all you want how the bag was deemed compliant, but it did not match the description at all! And yet, the seller gets her money and is still a so called expert seller.\n\nI am currently still in contact with vestiaire and will not back down unless i can return it and have them sell the bag themselves. \nI also escalated the claim with klarna and my bank account, to have the payment charged back. If needed i am filing an official small claim in court. This is unacceptable and their whole business model is shady and even prohibited by EU consumers law.\n\nHere to warn possible future buyers. Don’t trust their “quality control” and don’t purchase from private sellers, as they do not allow you to return anything, even when it is not matching the description. This act by them alone is already prohibited by EU law, hence i am excalating the claim by my bank.\n\nAnd to Vestiaire, y’all know what issue i am talking about. I have no patience left anymore and am not paying for the junk you guys sent me. I will pull through with the claim through my bank and have the payment charged back. Tomorrow i’ll ship the bag back again and you can do whatever y’all want with it.","title":"Horrible experience with the worst “quality control”","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-11","author":"Mel","text":"If I can give 0 stars I would. This website is a total scam. The customer support teams that brings you in circles and keeps telling you they will pass the conversation onto someone from the \"expert team\" will resolve your issue, but no will ever contact you after the chat is closed.HUGE RED FLAG. \n\nDon't trust this platform as a buyer, you will send your expensive items and never get paid!!! I got passed from one customer support person to the next with nothing ever getting resolved. The buyer is also very frustrated since using their direct shipping tool on their platform, they never got the item. \n\n\nI sold a very expensive dress and dropped it off at a parcel point as per the Vestaire collective email instructions. The delivery company never picked it up, and had asked to pickup the item that is in Sydney, even though the buyer is located in Melbourne. The devilry team for some reason never picked up the item and I am getting angry messaged from the buyer saying that the parcel is still in Sydney, and I am getting emails from Vestaire saying the parcel is awaiting pickup. Even though the courier never picked it up, and Vestaire collective (who are the only one able to contact them since they have the item). When I contacted the support, the support team member even lied to me saying that the buyer contacted the support team today and said they were picking up the item. (Total lies! Because the buyer contacted me saying that she is unable to pickup the item because the pickup location never changed).\n\nThe never got the dress, and I never got paid. The dress is still with the courier and I just lost a very expensive dress which has been unable to be retrieved. I also wasted hours with the customer support team. \n\nDO NOT USE THIS PLATFORM. IT IS A SCAM. AND THEY DO NOT HAVE PROPER CUSTOMER SUPPORT OR A WORKING CONTACT NUMBER.","title":"Delivered my item to parcel point correctly and never got paid!","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-11","author":"Trina ","text":"Terrible company, don't use them. When I sell something they issue me with a WAybill number that NEVER works, so you have to spend an hour with Customer Service trying to get them to sort it. It's not worth the effort. And now they're using Bots so you can't even talk to a human. I had to cancel my last sale because of this. If anyone knows another good online company for reselling designer clothes please post it here. Vestiaire is an absolute joke.","title":"Terrible company with shipping system that doesn't work.","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-11","author":"No","text":"21 August 2021\nResponding to Vestiaire-Collective, who responded to my first review (here below):\n\nThank you for taking the time to get back to me. It is nice to read an answer that is longer than 3 sentences, which is what I had received so far when contacting you via your “Help” or “How-to-contact-Vestiaire-Collective”, which is also why I have no intention to use those options, so no need to send these links again in future answer. \n\nI also feel that answering you here is far more helpful to other VC users.  \n\nAs written in my first review here below and as communicated with your “support” several times: the sale was canceled due to your mistake without even contacting the carrier nor myself. When I contact you (via your “support”), I provided  with a proof that UPS and myself shipped the item on time. Moreover, the buyer did not cancel the sale but you did. She wrote me in a comment that she contact you because she didn’t understand why the sale was canceled. Strangely enough, you deleted these comments after the second time I contact your “support”. \n\nAfter the third chat with your “support” my item was sent back to me without any consulting nor mentioning the buyer. On the App however it is still “in progress — item assessment”. Strangely#2. \n\n   \nI’m still waiting to your solution on this lost sale. To quote your motto and goal as written in your answer to me here below: “we will solve this issue because our staff has one and only goal: help our members until a satisfying solution and make you happy!”\n\nPlease solve.\nref. #11907221\n\n\n...\n\n11 august 2021\n\nFirst, I wish I knew this website before having my stuff on Vestiaire Collective.\n\nNow, this is the first time I make an actual complain because this experience was extremely disturbing. Especially because it could have been so easy to solve. But the Support does not support nor communicate with the users in a transparent and honest way. And this is not Okay. \n\nIn short: I sold an item and shipped it on time. Apparently, VC did not register it as shipped on time so they canceled the sale. I only heard about it because the buyer wrote a comment on the item's sale page asking about it. Confused just as her, I tried to reach the support of VC and have it solved asap. Once told my item was not shipped on time, I sent a clear proof from UPS that it was handed on time to them. Strangely enough, after the first chat with the Support the item was somehow tracked and appeared as shipped! And few days later in the warehouse to be checked. \nThe “support” by the way never updated me as he promised. Everything I found was via the App or the website. \n\nAnother things that happened was that VC deleted the item’s sale page including the comments related to it. In the comments one could read the buyer expressing her confusion from VC and her desire to purchase this item. My last respond to her was not to worry and that the item would eventually reach her… how naive. But at that time, I really thought this could be solved easily. \n\nAfter the “item check” at VC warehouse seemed to take forever (6 days), I contact VC again. the “support”, who apologized for this whole inconvenience, assured me that the matter would be solved including contacting the buyer to let them know the item was available. Ironically, few hours after chatting with her and another support person, I got an email from DHL that the item is being shipped back to my place. \nWhy? \nAnd why no one consulted\/ updated me?\nAnd what about taking responsibility for making me loos a sale? not to mention a compensation. \nI tried to get answers again from the “support” but it seems like even when communicating with a human it is also copy\/paste answers. A lot of apologies, very little action. \n\nAfter searching on the web for reviews about VC I realized that I was not alone. This gave some comfort but also an urge to make it public. Because like said above, this is not Okay.  There is a serious problem with the way VC handles the items and their sellers\/buyers.\n\n\nPS. And on top of that VC noted on my profile that I \"Usually ship in More than 7 days\". Do the departments in VC are in communication with each other?","title":"We truly apologize for the inconvenience. Do you?","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-11","author":"JRob","text":"Wow, Vestiaire Collective, you’ve done it again. You’ve managed to screw up in ways that exceed my wildest imagination to prove that the first time you screwed up was not a one-time event that deserved a mulligan, but instead a pattern of almost impressive incompetence and lack of regard for your customers.\n\nQuick background: I wrote a first review for VC on August 17, 2020, which you can easily find on this page, detailing my very negative first experience with the company. Long story short, I ordered an item that was badly damaged (that damage not being detailed in the item listing of course) but I did not inspect it within the return time period since I was moving and packed the item away quickly, and furthermore this happened in the middle of COVID which makes everything more difficult. I very apologetically asked VC if they would make a one-time exception due to extenuating life circumstances and offer me a refund, and they totally refused even though the damage on this item was ridiculous—torn plackets on *both* sleeves of a silk shirt. Only when I wrote a scathing review about my experience on Trustpilot did they contact me and offer me a store credit voucher in the amount of the shirt, which isn’t as ideal as a refund but fine, I guess. They did something purely because they did not want their public reputation damaged. I was still not pleased with the situation but at least they finally agreed to rectify it a *little* bit.\n\nFast forward to now—my voucher was about to expire (really weird to have store credit expire because no other company does that, but okayyy I guess) so I placed another order for two sweaters. The total amount of the order exceeded the voucher amount so the remaining amount was charged to my card, which is fine, that’s to be expected. I loved one of the sweaters but the other sweater arrived with—you guessed it!—a hole in the sleeve. I’m not sure whether it’s the seller’s responsibility or VC’s responsibility to accurately list the quality of the item including any flaws, but I know that VC inspects all items before they are finally sent to the buyer, so with this in mind I find it outrageous that they failed to detect a major defect in an item not once but TWICE (remember the previous order that I wrote a review for!). So this time I made sure to request a refund and send the item back within the time span specified by their policy—since that’s what I had trouble with before—and they agreed to refund me for the one sweater. It's a significant problem that they seem incapable of accurately describing the quality of their items, but I thought fine, I’ll take the refund, this should work out.\n\nAn important thing to point out here is that I specifically requested to customer service that I receive a refund of the excess I paid to my card (the price for the one sweater encompassed that entire amount), because it makes sense to use up my whole store credit voucher and receive a refund of the excess charge instead of receiving another voucher, no? When I mentioned this point they didn’t say there would be a problem with it, so I figured all would be good and I’d just wait for the refund on my card.\n\nSo I finally see the pending refund appear on my credit card account and it’s for less than half of the original amount I was charged. WHAT. I immediately contacted customer service through their chat function and they told me to wait until the refund actually posted because I might receive an additional refund for the other portion later… oookay… sure. So I waited a few more days and lo and behold, I still ended up only receiving that first refund for less than half of what I was owed. Absolutely preposterous.\n\nNaturally, I contacted customer service again and they told me they would escalate the issue and get back to me soon over email. Fine. As long as this gets rectified, I’m willing to play. So then a few days later I receive another email from VC claiming their Accounting team verified that the refund was made properly and that I should \"kindly coordinate this to [my] bank\" if the refund was still not reflected in my account. EXCUSE ME? What in the f***?!? I would like to add that my account on their actual website shows that a refund for the entire amount was processed, which is an even more confusing contradiction.\n\nSo now I’ve filed a chargeback claim with my bank for the remaining amount because these utter fools at VC have entirely failed to do their job competently to the point of hardly even doing their job at all. I wish I could go back in time and never even order from them in the first place; I wish I had never heard of this website at all. Congratulations, Vestiaire Collective, for going above and beyond in your shocking ineptitude and ludicrously poor customer (dis)service. You deserve an award because at this point, I’m impressed.","title":"Even more horrendous the second time","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-12","author":"Alison","text":"Do not use.\n\nI ordered an item from this site and when i have received the goods from a seller, it was too sheer. Vestiaire did not allow me to return the item and only offered me the option to relist it and sell it myself. So now i am stuck with a skirt that is too sheer and I have to pawn it off to some other innocent buyer. It is outrageous. I will not be using them again.","title":"Do not use.","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-12","author":"AlAnon","text":"Honestly the worst customer service experience of my entire life. Their “experts” refused to validate my item, even when confronted with the evidence of its authenticity in the form of the original sales receipt. Virtually impossible to get through to a human being and if you do, they are incompetent, rude and dismissive. Eventually had to pay to have the item returned to me. I should have heeded all the terrible reviews. Don’t make the same mistake I did. Avoid avoid avoid.\n\nEDITED TO CORRECT INACCURACIES IN THE RETAILER’S REPLY:\n\n1. “The certificate, engravings, finishes, hallmarks and details do not comply with Cartier quality standards.” This is objectively a lie, since the item was purchased directly from Cartier, which I am able to prove by way of the original receipt. Are they suggesting that Cartier sold me a counterfeit item? 😂\n\n2. “Our authentication team has made a meticulous analysis of your item before coming to this conclusion.” Again, I’m afraid this is yet another lie. If they had made a meticulous analysis of my item, they would have known that it was authentic. Both things cannot be true. Therefore they cannot possibly have inspected it properly, if at all. Or perhaps their “experts” are actually totally useless and wouldn’t know a real Cartier item if they saw one? This is also possible.","title":"Avoid like the plague","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-13","author":"Toulouse Ulyana","text":"They lost part of my item when they open the box that I sent, I wish I could rate 0 star.","title":"They lost part of my item when they…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-13","author":"Mrs Gabeva","text":"After three weeks of back and forth with VC about fixing their own mistakes, after few public answers here from their side “ to rest assured that the problem is taken to another level and is going to be solved” the “masterminds” and self-proclaimed experts came up with this (i am directly copy\/pasting it)\n“Dear , \n My name is Mariel and I am here to help with this matter. \n Although we are not able to reinstate the badge manually and I do understand the disappointment that losing it has caused, I would like to let you know that the badge will be automatically awarded based on the next few sales. \nI know that the loss of the badge was not your fault and we are truly sorry about the inconvenience this technical issue has caused. \nAs soon as you have fulfilled the shipping criteria again, your badge will be automatically reinstated.\n Please let me know if you have any questions and thank you for your understanding.”\n\nNote from me: just for info, since the issue occured i have sold five items. All five shipped on time (not administered in their system); three already passed “quality” control and are paid - still in the system shows “zero” items match their description. One is on the way because they sent wrong shipping label and is taking a week to reach them and one is shipped today. Meaning - their rating system is not functioning.\n\nTip for sellers from me : if you anyway after experiencing distaster from Vc or reading about it, decide to sell on this gimmick platform, just take it easy, expect the worst, do not waste time to be diligent and perfect, do not waste time and nerves to do it right, as no matter what you do, their autocratic system is going to mess with you sooner or later. There is no professionalism and there is no assistance. It is just the luck of the draw. And total unwillingness to improve. They are totally ignorant and being ignorant is the official company policy. This is what VC represents. As soon as you know it, you are ok. It is not a serious platform for serious customers.\n\nUpdate: regarding the replies from VC. Please spare yourselves the embarrassments. Users are perfectly aware that you are not working on improving anything. This is just sand in the eyes. And nobody even expects you to fix anything. If you were really “working on improving “ something you would not have fallen so low at first place by totally trashing and bringing your company to such an unacceptably disgraceful level. Everything was working fine years ago. So, at least have the dignity and do not lie to your customers. As i said - expectations from you are zero, or better said - expect the worst from VC and you will never be disappointed. Because this is exactly the case with your “expert team”, “next level expert team” , “fixing problems”, “working on improvements “ and the whole company. So, really, stop giving meaningless replies. This is next level disrespectful from your side.","title":"A low level, below mediocre online trift store","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-13","author":"Raquel C","text":"they price you below market rate and constantly brow beat you to lower your price - it is difficult to upload items and it looks ugly the way they do it they mistreat the sellers so so do the buyers no wonder Poshmart is so much more popular","title":"they price you below market rate and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-17","author":"Beth Wightman","text":"I recently sold a designer dress through Vestiaire collective. Since then, they cancelled my sale telling me I didn’t ship the item (even though I shipped it within 2 days using their provided shipping label). I chatted with customer service agents on 2 different occasions providing my shipping receipt who assured me the sale wouldn’t be cancelled and this still hasn’t been rectified. \n\nIn the meantime, UPS has lost the parcel. I can’t even make a claim with UPS directly because the shipping was set up through Vestiaire.\n\nIt has been such a headache and a stress. \nAnd the commission they charge for such a shocking service is extortionate. I’m hoping for a full refund of all commission and shipping costs after the headache of this experience.","title":"Cancelled sale- lost parcel- total headache","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-17","author":"Lisa","text":"DO NOT ORDER FROM VESTAIRE UNLESS YOU ARE OK WITH LOOSING MONEY HAD AN ACCOU T WITH THEM FOR 7 YEARS NO ISSUES UNTILL 1 DIRECT SHIPPING SELLER NEVER SEND MY ITEMS. VESTAIRE ARE REFUSING TO HELP ME AND ARE GOING AROUND IN CIRCLES TRYING TO AVOID HELPING ME ABSOLUTE SCAM WILL BE TAKING THEM TO COURT","title":"DO NOT ORDER FROM VESTAIRE UNLESS YOU…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-17","author":"Consumer","text":"Was super happy to find Vestiaire Collective as there are a lot of nice items. On the first day I got banned from chat for no reason... I carefully read rules to ensure there is no violation on my end and there was none. Contacted support team several times to resolve issue, they promised they would so nearly a month later it is not resolved still. After reading all bad reviews here I understand why it is good idea to delete my profile and never come back.","title":"Issue never got resolved...","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-18","author":"MICHELLE SIMMONS-MEARS","text":"The worst customer service, Barr none. No phone number, a chat bot, customer services that never get back to you and they've stolen money. Sold a bag, upon verification they asked me to reduce the price by £400 due to a small biro mark on the inside. I said return the item, it is not worth a £400 reduction. Then the buyer contacts me to say that she's happy with the bag and has accepted VC proposed reduction of £100! So VC have pocketed the difference. I cannot speak to anyone as there is no phone number anymore, no one on the chat is able to help. They say it will be escalated and no one ever comes back to you. Furious doesn't even come close. Oh and to send me the money for my bag (less what they have stolen) they want me to upload my passport or driving licence, despite paying me for the past seven years without this and having both my bank and PayPal details. The fact that you have to verify who you are to get a PayPal account or bank account does not seem to matter. No one cares?! Don't pay their 30% over inflated commission or nearly 50% import charges on goods that if coming into the UK and are under £135 are not subject to import charges in the first place.","title":"The worst customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-18","author":"Vanessa Lewis-Charles","text":"VC have overcharged me for custom fees (Order No.40695851). Customer Services have agreed the amount charged is incorrect and emailed stating accounts had processed the refund on the 10th August. 8 days later still no refund and Customer Services giving me the run around, that I should check with my bank. Any retailer that processes a refund, you don't need to check with the bank, because as long as the refund has been processed it will appear 3-5 days later, which VC has said the refund should take. I don't believe the refund has even been processed, therefore if I don't receive a refund in the next 24hrs, I will dispute the entire £190.65 paid for the order with my credit card company. I've been with VC for 8 years and they used to be good, but their services have diminished rapidly. VC are quick enough to charge your card immediately for orders, but work at snails pace to refund their mistake. Disgraceful!!","title":"OVERCHARGED CUSTOM FEES & STILL NO REFUND!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-18","author":"Cecilia","text":"I can't recommend Vestiaire Collective either as a seller or as a buyer. The customer \"service\" is simply one of the worst I have ever been in contact with. They do not help whatsoever, they does not read what is written to them, make promises that are not kept, and do everything but help - no matter what you want help with. \n\nAs a seller, the commission rates of 25% are really high, and once listed, you are spammed with \"lower you listing price now\" until there is nothing left for you if the item sells. It takes forever to get your payment. Vestiaire also changes the text in your listings (!!) so that it might end up not be what you wrote about the items. As a seller you can't change in a listing once it is uploaded, and if you lower the price of an item it can't be changed back. \n\nAs a buyer, there is no help at all if the item does not match its description. The authentication is a joke, as it feels if they do not look at the item at all, and even less compare the item with its description. Worn items are listed as new, and items that are clearly only in fair condition can be rated as good or even very good condition, with no flaws described. Items that are no longer for sale at the seller are still on the site. Often the price are almost as the price of brand new items.\n\nThe thought about Vestiaire Collective is good, but in reality it does not work. Like, does not work at all. I have tried several times both to sell and buy, but now I have had enough and deleted my account.\n\nUpdate upon answer from Vestiaire Collective below:\nI have tried to contact Vestiaire eight times for my latest question - STILL without any help at all. On the contrary, Vestiaire does not respond to my questions  but on something else, or just play dumb like it is some kind of joke. This is not a one time happening either, but like this EVERY time I try to get any help at all from Vestiaire Collective. No matter the subject.\n\nReferring to FAQ as a response for high commission rates does not make me gain more of the pay on my sold items. I still think the commission rates, especially for what you get (or more exactly - don't get), are very, and too, high.\n\nTo Vestiaire: I will not contact you again, just to have no help, once more. I have removed all my listings, and deleted my account.","title":"Use other sites instead!","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-18","author":"Joe","text":"DO NOT TRUST 'Verified and authenticated by our experts'. They cannot even recognize apparent FAKES! Extremely disappointing!","title":"They sold fake!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"},{"date":"2021-08-19","author":"Tanya","text":"Update.\n\nThe Help Centre of Vestiaire Collective promised that they will contact me within 72 hours from 21st of August. \nSince then nobody contacted me, I have made another complaint on their website. Later on they reassured me that they are considering my case and payment will be done on time. Another week passed. \nDespite the receiving email I have not moved any further,  they did not provide me with any information and I still haven't received any payment. \nThey just mentioned about customer's concern or delivery failure.\nSo, I have done my own research and found out, that the customer has already received the item on the delivery day, has already weared it and shared a post on Instagram. \nI have sent to the Customer Service all screen shots evidence (delivery confirmation,  screen shots customer address,  name,  Instagram profile, \nthe customer wearing the boots) and still haven't got any response. \nI am considering to contact the police and make fraud concern about their customer,  because seems to me that they are not helping to sellers at all and just deliberately delaying the payment. \nThey keep sending their apologies yet it doesn't help me to sort it out. \n\nI am complaining about their customer service. \nThe responding person was very rude by rushing to close the chat and I believe they do not try to sort out things yet just pretend to do so.","title":"Very rude customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=49&stars=1&stars=2&stars=3"}]