[{"date":"2022-05-05","author":"Savinee","text":"Worst customer service! \nI sold my Dior bag worth £1,000 , sent the bag to VC to check and they sent it to customer but i dont get paid! They said my payment was scheduled on 30\/04 but still not processed my payment until now! Its impossible to chat with the same agents and you have to tell them your story over and over again!! Why dont you just make it easier for the customer who paid you fees ?! After speaking with 3 agents and still no one email me back , they are just using the same phase that they will contact me back via email and will send this to experts! Where is my money? \n\n\nItem ref: 7832779","title":"Sold £1,000 bag but not paid by VC","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-05","author":"Fanny Ann","text":"THEY THINK THEY CAN IGNORE FOWL TREATMENT BY COVERING UP “ invited” possibly fake reviews!!\nThink again \nYou can not keep items that don’t belong to you thats thief ! \nYou can not silence and ignore mistreating sellers! That’s malpractice!!\nWe will continue to tell the truth and even more so when you hide,cover up wrong doings\nDisgraceful,","title":"THEY THINK THEY CAN IGNORE FOWL…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-05","author":"David","text":"RE: Louis Vuitton leather backpack - item: 22390385.\n\nPurchased an item 12\/04\/2022. The apparent item was not received or posted by the seller to Vestiaire Collective. I was told after 10-days would receive a full refund. 10-days past. I was told after 21-days would receive a full refund as VC is insured and the refund will be automatically refund to my account. Item has not been refunded by VC. I have on numerous occasions requested the issue to be escaled to the management Team. However, I have not receive any update from them. I have saved all the transcripts via conversations with VC (customer service). It's the same story one day after the next asking me to be patient and wait a few more days. \n\nI would like to believe that Vestiaire Collective would adhere to their customer servive policies and obligations to resolve this issue as soon as possible with further ado.\n\nNB: I am still waiting patiently to hear from the Management Team on the matter. \n\nRegards, David.","title":"RE: REFUND","stars":1,"location":"SA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-05","author":"Jess Palmer","text":"Messed up my expert badge  and shadow banned items their mistakes and cock ups. Then they Hold onto expensive items and don’t return( I wonder if that was the plan)\nThis is a SCAM\nCan someone tell me who you complain to is it trading standards? The Ombudman we all need to mass report as this treatment is unexceptionable.  I hate lies cheating and stealing.    No other companies operate like this , god forbid. Daylight robbery they do what ever they like without accountability, this is flat wrong!!!!!!!!!","title":"Messed up my expert badge, my account  and shadow…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-06","author":"Fumming","text":"You can not trust Vestiare. The fact that sellers are writing their experiences means to believe it. The fact that some issues are going on for months shows a flagrant disregard for genuine concern and issues, issues that in many cases that are the fault of VC.\nThe fact that issues are being repetitively ignore THIS SHOULD GIVE HUGE RED FLAGS .good luck.","title":"You can not trust Vestiare","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-06","author":"Carolina Ortiz","text":"TERRIBLE EXPERIENCE. I purchased a watch that took about two months to arrive. I had a terrible experience trying to reach an actual person to help me with this (very frustrating). Their customer service is a robot. Turns out my package was lost in Hong Kong. I told them I no longer wanted the watch and they told me to return it once I received it. When I received it I immediately sent it back. Today I get an email saying that my return package arrived “empty”. They asked me to provide so many things yet I haven’t been able to talk to an actual person.","title":"TERRIBLE EXPERIENCE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-06","author":"Mas","text":"I have bought from Vestiaire a few times now. On two occasions I have been sent bags which are NOT authentic despite them charging me for “authenticity”. \n\nThe first one was a YSL bag and it was SO obvious that it was a fake. I sent it back and they accepted it was fake and refunded. Just to give you an idea - there was no brand stamping on the zips and hardware and it just looked so cheap. \n\n The second one was a Celine vintage bag. It wasn’t even a good fake! It was so amateur! What are these “authenticity experts” doing? I sent it back and they think it matches the standards? The Celine logo wasn’t even straight! The logo tag was an odd uneven shape!! The hardware wasn’t brand stamped or metal! Soooo amateur! The leather isn’t even real leather. Anyone who knows designer bags and has owned them could tell. I think it’s so they don’t have to admit that they’ve done this to me AGAIN! They either don’t care and want sales or their authenticity experts are not very effective.\n\nExtremely disappointed with this recent “review” and I urge everyone to be really wary when buying from them as there’s a lot of people trying to sell fakes on there. \n\nI’ve got ALL the photos and all the proof. I can’t attach them on here or I would so you can all judge for yourself what their “authenticity experts” are doing.","title":"BEWARE of FAKES! Authenticity checks are terrible and amateur.","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-06","author":"Claire","text":"I was excited to order a vintage mulberry handbag and reassured by their authentication process. I paid £282. After using the handbag a few weeks, I noticed that a part of it had fallen off and when I checked closer I noticed that the leather connecting to the hardware was reinforced with cardboard (which was now tearing off in pieces). I then checked the serial number online and it was confirmed as a fake. I sent detailed information to customer service and they told me to return it and the authentication team would check it again. \nThey confirmed the handbag as real! Refusing to refund it they said they would relist it for sale! I said I would report them to Trading Standards for knowingly selling counterfeit items so am now pursuing a refund that route and through my credit card company. Honestly I thought they were legitimate but just a bunch of crooks and more expensive than the fakes on ebay. Live and learn, won't use them again.","title":"Counterfeit goods knowingly sold","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-06","author":"Fumming","text":"Ignorant \nUnresponsive \nTreat seller appalling \nUnhelpful, way until you have a problem so the good reviews enjoy it while it lasts a shut up when is does go wrong\nThe most unprofessional company with unskilled oblivious robot customer service AVOID\nREBELLE IS NOW excepting UK , good riddance VC","title":"Ignorant","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-06","author":"KS","text":"VC changed their commission again, so sellers get even less, and didn't even bother to announce it. Moreover, you are now charged 3% transaction fee in addition to their commission.","title":"No respect for sellers","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-06","author":"Mouj","text":"I sold a Fendi bag with them, and my buyer has received the bag and DHL has also confirmed that the bag has been delivered. However, after a month they have not paid me. They told me that DHL has lost the bag and that is completely a lie because I confirmed with my buyer and she told me she has received the bag. Their customer service is terrible, they will always reply back with no solution and keep telling you the same exact words. It's as if they are using bots to reply back and there is no real associate. They also have no phone numbers which make things even worse. Don't ever use them. They will steal your money.","title":"Terribe, DO NOT USE THEM","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-06","author":"Jessica Greenslade","text":"Order placed for a pair of shoes in a UK 6.5, received a UK 3.5. Despite the listing being incorrect, Vestaire told me to return them, but rather than refunding me in full as I requested, they instead relist the shoes and sell for a profit . They have offered to refund me less £150 the original purchase price. Have tried contacting their customer services multiple times, but they simply regurgitate the same Terms of Service and refuse to refund. Trying to seek a resolution via my credit card company. Do not use this company, they are scammers!","title":"Scammers","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-06","author":"shay","text":"I sold an authentic LV belt on this platform 2 weeks ago. \nReceived an email from Vestiaire stating that buyer reported an issue with item. \nI messaged buyer but she is just as confused as I am.\nI am now at a loss of my item and money as I have not been paid. \nI have not been able to speak to anyone at Vestiaire either as its all bots answering the chat messages.\nAVOID AVOID AVOID!","title":"Loss of money and my item...","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-07","author":"Sarah French-Fleming","text":"Vestaire is now taking a 3 % commission fee on top of the 12%......basically we work for them. not the th e other way around..only sell if you must get rid of the item....","title":"Vestaire is now taking a 3 % commission…","stars":3,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-07","author":"Sophie","text":"Received my order ( item ref 22612943) last Wednesday..:saw immediately that the belt was not ‘in perfect condition’…the leather was all wrinkled up and it was obviously it had been worn a lot…unbelievable that this has passed quality control…reported this immediately, accompanied with the  necessary pictures…I m still waiting for feedback…","title":"Order not compliant","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-07","author":"Olivia ","text":"Unfortunately I haven’t had a good experience with VC. I made a sale on good Friday and you are given 5 days to send the parcel. I happened to be leaving to spend time away over Easter and didn’t have time to print the shipping label so when it came to sending the parcel I wrote the address out manually and sent it. I told Vestiaire collective I had done this and they just cancelled the sale without waiting to find out if it was all fine. They say they are now unable to reinstate the sale so I have now lost £150 and I have no facility to contact the buyer!! Really bloody annoying experience","title":"Poor customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-07","author":"Mariam Choksy","text":"I bought a bag from this company. They charged me £15 to authenticate it. They said the bag is authentic and shipped it out to me. I got the bag authenticated by two other companies once I reviews it  and both companies said  the bag is fake! I have certificate to show it’s not authentic. I opened a dispite on  vestiaire and they are ignoring my messages! \nFirst and last time I will be purchasing from this company.","title":"I bought a bag from this company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-08","author":"David","text":"Hello Francheska Mari A,\n(Support Vestiaire Collective)\n\nThank you for your email regarding item: 52802957 Ref: 22390385.\n\nI wish to complain about a Louis Vuitton Leather travel bag (22390385) that I purchased on 12\/04\/2022 on Vestiaire Collective.\n\nI am complaining because on numerous occasions I have been told (assured) I would receive a full refund after 21 of purchase\/investigation. However, this has not be the case.\n\nI first learned of this problem with the Sellers shipping (address not recognised) and was told nothing could be done about the problem until after 21-days of purchase. I believe that this response is unfair because of the lack of professionalism and conflicting timelines given since the issue began.\n\nI would like confirmation from you explaining Vestiaire Collective’s position on my refund and what you will do about my complaint.\n\nI look forward to hearing from you as soon as possible to resolve this problem.","title":"Hello Francheska Mari A,","stars":1,"location":"SA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-08","author":"Egle Vilunaite","text":"Commission is a rip off ! Constant emails and notifications to lower your price are super annoying and now they also charge you € 12 for shipping your item back to you if they decide item is inauthentic or they keep it. \nI'm deleting my account with them, will not let them to make another euro on my behalf.\nPerhaps as a buyer you can get good deals but from seller perspective is it's a nightmare.","title":"Commission is a rip off","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"},{"date":"2022-05-08","author":"Natasha Kaur","text":"This site obviously doesn’t want to sell or make money. I ordered an item but wasn’t as described which QC picked up only had option to cancel or accept not negotiate with seller based on information not disclosed. \n\nBased on customer chat not advice I cancelled and Reached an agreement with seller to buy at reduced price via messaging but VC are taking forever to relist the chat people are useless we have both spent hours and they clearly don’t understand the issue.\n\nThe seller and I are having a nightmare getting this sale done. I can Imagine easy site if everything goes to plan but if you need help forget it! All I want to do is buy a bag which is the purpose of your site. \n\nHonestly use designer exchange or another site far better customer experience.","title":"This site obviously doesn’t want to…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?stars=1&stars=2&stars=3?page=36"}]