[{"date":"2021-10-01","author":"Charlotte Mommsen","text":"I am disgusted with Vestiaire Collective. They treat sellers like cash cows and have no time or respect to actually assess a situation and resolve issues to a satisfactory standard.\nThey recently sabotaged a sale that I had agreed and was going through with a buyer for a worn once Roland’s Mouret dress. After nearly 10 days, no sign of any money in my account despite having alerts to say authentication complete. \nThe seller contacted me directly to ask me ‘why I had cancelled the sale?’, I knew nothing about this. Contacted Vestiare and they said initially they knew nothing about the sale being cancelled, I waited days then had to contact e chats for hours, before insisting on speaking to a person accept an from overseas call centre. Eventually,  Vestiare admitted they did cancel the sale because they said the dress didn’t meet their authentic policy: because there was no size label. This was not true. The dress did have a size label. I sent a picture to prove it. They agreed to their mistake. By this time, it was nearly 2 weeks later, and the seller stopped responding and sale never went through. They sent the dress back to me and told me to relist it. I was so angry they offered me a £50 voucher to say a belated ‘sorry’ but the voucher was never approved snd I received nothing and I heard nothing more. No record of e chat so I would have to explain the whole sorry story to someone else.\n\nWhy did they not just contact me first to ask me about their concerns regarding the label - that turned out to be their incompetence? \n\nThat was for nearly £194.00\nI was so angry as it was the time and effort trying to relist. It’s just not worth the trouble. Better to use eBay or competitor. \nAVOID, AVOID,AVOID!","title":"Cancelled my sale without good reason","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-02","author":"R.W.","text":"I sold item 11909428 on the 22nd and sent the same day, since the 25th Hermes tracking (why VC uses Hermes I do not understand) says the parcel is delayed and they will have it moving within 24 hours, today is the 2nd of October, a week later, the same message, the parcel isn't moving.\nI do not use the App due to privacy concerns, so trying to get in touch with Vestiaire is impossible as apparently the website hasn't bothered to keep their security up to date. When I try to go to the FAQ I get this message:\n\"Your connection is not private\nAttackers might be trying to steal your information from faq.vestiairecollective.com (for example, passwords, messages, or credit cards).\"\n\nSo there is no way to contact them, NONE, as I really don't want to use the App and let them track me!\n\nI can't get in touch with Hermes, as VC is the customer and issued the label!\n\nAnother item 13097442 was also sent through Hermes and according to the tracking:\nDelivered on\nSat 2nd Oct\nDelivered at\n11:50\n\nNow it is 5PM and it still has not updated as delivered, and I have no way to get in touch with VC.\n\nThere is the issue with VC using Hermes in the UK, they have not the best reputation, there are so many issues and I really worry about sending anything with Hermes as so often things get lost and delayed. At the dop off shop items are forced into containers and might (despite thorough and protective packaging) get damaged or lost, then if items are not confirmed as delivered, there will not be payment. Then there is the issue that contact via the website is impossible due to the security problem and browsers will not open. Like a lot of others I do not want to use the App, despite being pressured to do so.\n\nI still can't buy or sell sunglasses, children's clothes or fur if I am in the UK, even if the seller is also in the UK, this problem has persisted for 10 months now, despite VC claiming they are \"working on it\"\n\nFor a website an international website, that is a bit poor and promising customer service when the customer service can't be reached is very misleading.","title":"Disasterous Hermes shipping no customer support","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-02","author":"V","text":"I purchased an item (ID 43580095) on 4 Sep and it was shipped on 8 Sep. I opted for direct shipping and seller confirmed she has posted it using Hermes (tracking number available).\n\nI contacted Vestiaire on 18 Sept and after receiving an email, I send them the screenshot of tracking number, alternate address etc. They asked me to contact them if I don't receive the item until 23 Sept. On replying to the previous chain of emails, I received received reply that the email no longer exists and the link takes me to FAQs. It is disappointing that the site is not user friendly.\n\nI've had good experience in the past and I have been  a long time customer but this experience has put me off Vestiaire.","title":"Direct shipping, item posted but not received","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-02","author":"Hayleigh","text":"In essence I think this is a really great app which is really easy to navigate and it really appeals to those of us who want to work towards a slower fashion industry. However, both times I have ordered from here I have had major issues with delivery. 1st item a Mulberry handbag - I opted for the checking service with this item so it went to France first for verification and then onto me. First time they got my postcode wrong so it was returned to France and then I had to liase with them to get it sent back out...even though the address on my account was correct. 2nd item, a Joseph coat, I chose direct shipping, seller was UK based and I felt confident in not needing the verification service. This time the sender sent the item in a couple of days and I received notification that my item would be delivered by Hermes, but to my local parcel shop. Its not a major issue but I would have liked to be told this was happening beforehand. However in the spirit of lowering emissions, I was happy to walk up the road to collect it when it arrived. Now over the course of this week I have received notification from Hermes that my parcel is ready to collect on 3 different days. Each time, my parcel has not been there. I am struggling to get information from Hermes and I think Vestiaire are having similar problems. I just think Vestiaire need to get better couriers.","title":"In essence I think this is a really…","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-02","author":"Liang C","text":"This app is so suspicious...\n\nHere is my experience:\n\nI sent an offer on an item. The seller accepted the offer. I bought the item and the payment went through. \n\n2 days later I check the app (didn't get an email) and it tells me that my order has been canceled by the seller. I messaged the seller and no response. \n\nThe next day I see the item I bought for sale again and when I clicked on it, VC tells me that I didn't purchase the item on time and the offer expired... WHAT!?\n\nI purchased something else today, which also got canceled by the seller... apparently... I messaged the seller also and waiting for a response.\n\nI'm very suspicious about this app... I will make sure my refunds are back into my account and deactivate my account. It could be issues with customs for all I know, but either way, don't offer items for sale if you are just going to cancel all the orders.... \n\nAlso, the sellers they \"suggested\" I follow all have very few items or no items for sale... maybe they got smart and left early. \n\nI so do not recommend buying from this website... better stick to ebay, poshmark, mercari and others!!!","title":"This app is so suspicious...","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-03","author":"John","text":"The most useless customer service of any resale company. I wish I could say I had just one bad experience, but I have received subpar service EVERY TIME I deal with an agent (and they ONLY have a chat option, very terrible). The agents are not well trained and cannot answer simple questions, they are always forwarding questions to the \"Expert\" team, and refuse to help at all. Only occasionally are they are fluent and able to communicate in English.  If you do not reply for 1 minute, they will end the chat to avoid helping you further.\n\nThe system where a sale will be cancelled if not shipped within 7 days is horrible as well. If you can't meet this deadline, your sale will be cancelled. The 7 days includes WEEKENDS too, when I cannot actually ship. If you have already shipped the item and the app doesn't recognize it, your sale will still be cancelled and you will receive nothing. \n\nI sold an item which I shipped after an agent reassured me it would not be cancelled, and two days AFTER I had shipped the item, they cancelled my sale. The buyer has already received the item and they have not paid me. They are still \"investigating\" and it has been 10 days with no update.\n\n\n\nEDIT to respond to Vestiaire: unsure what was meant by “the carrier was unable to localize your parcel”. The tracking shows it was delivered on Sep 27 (I shipped on Sep 16).","title":"The most useless customer service.","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-03","author":"Irina Laine","text":"There were never any complaints. In August I bought Moncler raincoat at 420 Euro which turned to be a fake. This @Vivian 12238107 Seller from Germany has a lot of fakes declared by her as Moncler, Burberry (Aliexpress).\nI tried to contact the Seller directly but was blocked.\nI want to warn People!!  It's better not to buy expensive things. There is a risk. Unfortunately, my time has passed. Almost 2 months I was away, noticed only now. Good business to trade fakes from China- selling raincoats (Burberry) for 1000 Euro!!!!!!!","title":"Moncler from Aliexpress","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-05","author":"someone who is blocked","text":"As a buyer, I've already spend more than AUD1000. However it became nightmare now. They sent me a stuff which is not matched with the description. Since I though it's brand-new as the description, I over-paid it. It's really obvious fault but it's not detected through their authentication (it costs extra AUD10). However once I complained, they offered 30AUD voucher and blocked my account. As their perspective, I'm a black consumer who complain and ask money back or vouchers even though there's no issue at all. It's ridiculous. They advertise they provide reliable authentication process but don't trust them. Just do it by yourself as much as possible.","title":"Terrible","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-05","author":"dalit izakov","text":"I am a premium member bought many bags . The other day i have a bag in my cart received an offer wanted to pay and couldn’t! Contacted them with chat was told there is an issue with the app and its guarantee the bag will be mine. Called twice and then realized the bag was sold to someone ejse! The company not honoring their own rules! Service is terrible! Chatting chatting with agent that can not help you buy keep repeating “ rest a sure” and sorry !!! But promised the problem will be solved and nothing! Just unreliable! The customer  service is terrible and even now the response i got is that to covered…. And not taking responsibility!!!","title":"I am a premium member bought many bags…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-05","author":"Angelica","text":"I recently bought a pair of boots described as patent leather and in very good condition. I received suede boots, with small wear defects (but this was found in the description) in addition to which they had a major defect, a visible deformation of the heel (not in the pictures or description). VC replied that the boots correspond to the description and since then I have not received any message from them, 4 days have passed and also passed the relist time. I find this attitude shameful, especially when it is obvious that the product does not fit.","title":"I recently bought a pair of boots…","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-05","author":"Elizabeth Williams","text":"I have used this site for buying and selling for many years. What amazes me if that they can suggest a price of 67€ for a Giambattista Valli dress which originally cost €1,400 or suggest a Burberry Trench Coat where the full retail is over a €1000 is listed for €120. If this some kind of software telling me to do this? Because a person who knows fashion would balk at their price suggestions. The commission seems to be a lot higher too.","title":"suggested prices are absurd","stars":3,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-06","author":"A A","text":"I've been waiting for my refund for a month. I talked to numerous people that work at Vestiaire about this and they keep telling me that my refund will be sent within 24-72 hours. \n\nNot a trustworthy company. I'll never buy from here anymore.","title":"Refund problems","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-06","author":"A.WALSH","text":"My item never arrived. Vestiaire collective kept telling me to wait 1 week then it was 2, then 3 more days, then 5-7 more, then 15-30. Appalling service. They have made no effort to resolve the issue and repeatedly broken commitments and failed to meet deadlines they themselves have set. Absolutely disgusted.","title":"My item never arrived","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-06","author":"nicole bhandari","text":"Did not receive full refund:  I purchased a Chanel pin for $460 that didn’t pass VC inspection.  They only refunded me $419 claiming I do not get refunded for fees!  Total BS!  I’ve had purchases before that didn’t pass and this is the first time they’ve kept my $! I will never buy from this site again!","title":"Did not receive full refund","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-06","author":"Lauren Roth","text":"I really wanted to love this site and gave it a few chances, but after this, it's the last straw. It started where representatives emailed me asking me to sell on their platform. I said sure and they listed everything for me. I made my first sale, but they did not send a label (buyer paid shipping) and when I finally received my money, which was a few weeks, it was significantly less than what was portrayed and buried in fees. I bought an item and it went off fine, but item was not properly described. Website was of no help. Second purchase, seller canceled my order because they didn't want to pay shipping and for the insane fees. No notice or anything. Finally on my last purchase, after 8 days, my item has not shipped. I contacted the seller and they said they didn't have the item and could not fulfill my order. I asked the seller to cancel the order, they would not cancel the sale. I contacted VC twice, at first they said there was nothing they could do and the item would have to expire when the seller would not ship. Now, they said they cancelled the order, but it's still active on all ends. I'm so disheartened by my experience with this site and cannot recommend to anyone.","title":"Extremely Disappointed and Disheartened.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-06","author":"Athina Karouzou","text":"Refused Items\nI have recently started using Vestiaire Collective both to sell and buy preloved items. The overall experience is good and I can't say that I have faced any major problems with payments or lost items (as mostly described in bad reviews). My big problem with the application is that the customer service is somewhat non-existened. Some designer bags I own (which have all been bought at boutiques and have serial numbers) have been refused. Recently, a pair of Louis Vuitton sneakers and a Vintage Gucci bag (both in very good condition) were refused with the automated explanation via email that they couldn't verify their authenticity. This is strange because the LV sneakers came with their box, and even the small booklet that comes with LV shoes bought straight from a boutique. As far as the Gucci bag is concerned, it is in very good condition, and I've come across bags of the same model in other used item reseller apps. It was bought from the Gucci boutique in Paris back in 1998 and the only defect it has is a very small scratch which is only visible in very bright lighting. Moreover, a Balenciaga work handbag that i bought from the Balenciaga store in Harvey Ninchols London was refused in the same way, with an automated explaination about not being able to verify its authenticity etc etc. When I contacted Customer Service I only received automated replies that weren't at all helpful. It is sad that such a popular app does not offer customer service and does not make you feel that you are being heard and that someone is actually working to solve the issue or give you a more specified report\/ ask you for more info etc. Not only is this bad for the site because it pushes users towards different apps but also they are actually losing money this way. Moreover, this whole procedure ends up becoming intimidating. For me, reselling staff was a very enjoyable and fulfilling experience that has just started turning into a nightmare. UPDATE: 1 of the rejected items was accepted after I tried uploding one more time. Waiting for Vestiaire to send me an email, but still quick response by VC here.","title":"Refused Items and Bad Customer Service","stars":3,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-07","author":"Sallie","text":"If I could rate lower I would. Most inept customer service. Not online support.\nAbsolute dud system from start to finish.\nI still haven't been paid for an item that I also had to pay for my own shipping... now I am down a designer piece of clothing AND the cost of shipping and Vestiare have the money.\nComplete incompetence and utter disregard for customers. Worst platform EVER.","title":"If I could rate lower I would","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-07","author":"Blue Egyptian Lotus","text":"This company is non-responsive to…\nThis company is non-responsive to customer concerns and lacks integrity. I was a first time buyer with them who purchased a pair of Chanel earrings on 9\/7\/21. I had received discounts totaling $99.99 (a 12% cash back RetailMeNot cash back offer ($50), $30 off $300 promo, and $19.99 ship fee waiver (suppose to be refund) for first time buy honored by rep. (The ship fee \"refund\" was compensation I asked for because VC 1) insisted I should be charged a customs fee when seller was in my country, and 2) because the $50 off $150 in app was not working.) THE VC \"EXPERT TEAM\" WRONGLY CLAIMED THE EARRINGS INAUTHENTIC AND CANCELED MY ORDER. Both the seller and I knew the earrings were authentic. THE SELLER HAD RECEIPT FROM THE BOUTIQUE. VC FINALLY ACKNOWLEDGED THEY MADE THE WRONG ASSESSMENT BUT REFUSED TO REINSTATE THE SALE, AND WHILE WE WERE BACK-AND-FORTH TRYING TO NEGOTIATE A RESOLUTION, THEY SOLD MY EARRINGS TO SOMEONE ELSE. VC WOULD NOT HONOR THE DISCOUNTS I ORIGINALLY HAD WITH THE PURCHASE AND THEY WERE EXPECTING ME TO PAY THEM FOR A WRONG AUTHENTICATION ($28.50). \nTo date, I am still trying to get them to right their wrong here. I AM NOT INTERESTED IN ANY PAIR OF EARRINGS.  I WANT THE EARRINGS I PAID FOR, WHICH ARE A HARD FIND FROM A PRIOR COLLECTION.  THE FINANCIAL LOSS AND STRESS THEY CAUSED ME IS VALUED FAR MORE THAN THE VALUE OF THE EARRINGS. The RetailMeNot cash back offer is no longer effective. They are dishonest and claim they provided a refund of the ship fee, but they did not. They merely canceled the order. While in reconciliation process, I was unable to buy the earrings at the cost I originally had due to their error. The best I got from them is excess stress and a $30 promo. I insisted that VC reinstate my order AND inform the buyer that THESE earrings were already purchased. VC currently has the earrings and has not mailed them out to the buyer yet.  THEY MUST CANCEL THAT ORDER AND SEND ME MY EARRINGS. THIS IS ALL DUE TO THEIR ERROR. This is the only resolution I see short of a lawsuit.  PLEASE BUYERS BEWARE: VC DOES NOT HAVE EXPERT CHANEL AUTHENTICATORS. THEY CANNOT DIFFERENTIATE WHAT IS FAKE FROM WHAT IS REAL. They cause more trouble than anything else.\n\nUPDATE 10\/15\/21: Immediately after VC replied here on 10\/11\/21, I emailed them the reference number they requested and the following: \n\n\"To whom it may concern: \n\nThere is no other earring that I am interested in.  I want the ones that I purchased. \n\nYou have acknowledged VC error in stating the earrings were inauthentic, and you have acknowledged your error in cancelation of my order.  \n\nYou are aware that I purchased those earrings and still reposted them and sold them to someone else, after I had made it very clear that I would repurchase them for the price I paid.  \n\nThe only resolution, short of a lawsuit, is to inform the buyer of your error, cancel their order, and prepare my invoice to repurchase my earrings with the $180 euro voucher that Morgane claimed I would be provided.  \n\nLook forward to hearing from the individual who replied to the review.\"\n\nYesterday, 10\/14\/21, I received a generic message addressed not to me, but to \"{ticket.requester.first_name}\".  This was a new email separate from the original back-and-forth thread regarding the issues and they ask that I not email them again.  Seems as though they are trying to avoid accountability.  Again, they claim they will reply in 24hrs with the resolution, but still no answer from them.  The following is a copy of their email-->\n\n\"Hi {ticket.requester.first_name}},\n\nWe've not forgotten you!\n\nOur teams are still working on a solution for you, and we're really sorry for the unusual delay in getting back to you. We will be in touch within the next 24 hours to resolve your enquiry.\n\nWe understand it's frustrating to wait, but please don't submit your enquiry again as this can add to the waiting time.\n\nThank you for your patience.\n\nThe Vestiaire Collective team\n______________________________\nI am still waiting on the supposed call from management that Morgane said I would be receiving early this week.  I am also still waiting on the supposed $180 voucher she said I would receive and of course the earrings that I paid for.\n\nHere is the email from Morgane on 10\/8\/21: \n\"Morgane C (Support Vestiaire Collective)\nOct 8, 2021, 14:58 GMT+2\n\nDear Samira, \n \nWe will get back to you early next week to schedule a phone call. \n \nIndeed, our manager isn't available today to arrange a call as she has several meetings. \n\nKind Regards \nMorgane for Vestiaire Collective\"\n________________________________\nNow today, 10\/15\/21, the seller informs me thru Instagram that VC paid her today for the earrings and she has no idea who the earrings will be going \nto.\nIf the earrings are not on the way to me, a lawsuit will be filed. Class action anyone?","title":"This company is non-responsive to…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"},{"date":"2021-10-07","author":"Natalia Accomasso","text":"Don’t accept the real pictures taken by ME of original goods!!! Already 2nd time they block my add because they don’t accept the pics!!!!! It’s a criminal they take a huge commission and they cannot invest in good service of verification pictures !!!!!","title":"Don’t accept the real pictures taken by…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=42&stars=1&stars=2&stars=3"}]