[{"date":"2021-08-19","author":"Hauteclaire Stassin","text":"For the first time I feel I should actually spare a few minutes of my life to write the following, hoping that it can make a difference for even just one person. In short: avoid Vestiaire Collective, at all costs. \n\n1) VC customer service is appalling. Any problem you have to report becomes at best a time-wasting nightmare, at worst a money-wasting hell. \n— No contact number, only a chat \n— You have to go through an ill-designed automated customer service anyway\n— Staff is incompetent. They don't actually read complaints, they just deliver an empty apology and copy-paste a line taken from VC policy: totally unhelpful.\n— You’ll be chatting with multiple agents to solve an issue and you’ll have to spend time to catch them up with your issue and its status every time (again, they don’t read) \n— You have to chase them to get updates, they’re really not on top of things\n— They lie ALL THE TIME. And when you catch them in the middle of a lie, they continue to lie. This is quite difficult to handle — how do you deal constructively when confronting dishonesty? (Not a rhetorical question, I’m really asking.)\n\nFrom a seller's POV: \n1) VC take too much from each sale without providing any kind of decent service\n2) They spam you to ask for price reduction several times a week (imagine if you have more than one item listed...)\n3) Their offer system is not binding. If you accept a lower offer from a potential buyer, they don't actually have to buy. However, people who previously liked your item will get a notification saying this: “Pssst! You didn't hear it from us, but another member has successfully negotiated the price of [Image of item]. The seller is ready to reduce their price to the amount shown below”. From that point on, you will receive only same or lower offers... Very unlikely you’ll sale at original price.\n3) There is always an excuse for payment issues\/delays: \n— Maybe it's your bank (it never is, believe me), in which case you have to check yourself and get back to them\n— Maybe VC didn't register the item as received, even after you got an email saying: \"your item was delivered 72 hours ago, and your buyer hasn’t flagged any problems. Your payment will be issued within 5 working days”. \n4) Their authentication process is a joke (more on that later), same for the verification: they constantly find issues on new items and cancel your sale or ask you to revise the price substantially. Imagine you accept to lower your price by £200, only to find out later through the buyer chat that he\/she accepted a £100 discount… You read that right: VC will blatantly lie to make more than you think from a sale! \n5) \"Direct shipping\" offers no protection: if you send an item that gets damaged in transit or by the buyer, VC will cancel the sale and return your broken item without compensation. As a seller, you’ll always be the loser in a transaction.\n\nFrom a buyer's POV: \n1) Their authentication process is a joke: fakes are accepted all the time. Imagine: you paid the price for a real [whichever brand] + their authentication fees, and you get a fake. You're disappointed, but you can send it back within 72 hours so you don't worry. Then, VC tell you that they stand by their judgement, so they won't accept your return but give you the \"opportunity\" to relist without extra charge. If you accept, you're selling an item that you know is fake, hoping to fool somebody else… Now, imagine that someone buys your item: you don't feel great about it, you send it anyway, and now VC say it's a fake and cancel the sale. The item is returned and you can't relist it. You've lost money, time, and ended up with an item you don't want in your closet.\n2) The verification process is another joke: they will send you a damaged item listed as \"new\", and when you complain they’ll say that it was perfect when they inspected it. Again, that one will be on you.\n3) You find a rare item: you negotiate, you buy, you get a notification of the arrival at VC for authentication, and then it “disappears” in the warehouse. You complain to get a refund (the seller may also get money from the sale but not necessarily: VC lie about receiving items if proof is missing). Meanwhile, someone in VC is most likely wearing or reselling the item you spent time negotiating for yourself… \n4) UK\/EU: they overcharged you with taxes even if the amount is below the threshold, and you cannot do anything about it. \n\nI know this is just another bad review added to the pile of so many others, and it’s obvious that Vestiaire Collective do not care at all about bad reviews — I have no hope for any kind of change on their part. The only plausible option is to stop using their platform and start using others. The price of dishonesty should be self-destruction; so please, let's just all let Vestiaire Collective die.","title":"Avoid at all costs","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-19","author":"Beatnik","text":"So, what type of company marks a sold item you mailed to them “delivered on 23 June 2021” “in progress item assessment…checking the item matches it’s description and brand standards” and then claims they do not have item and because no mail tracking, your problem. Welcome to Vestiaire.  They refuse to address why they marked my item delivered and in assessment temporally to me shipping it to them and then months later telling me I need to get with post office (having no idea issue with delivery since they marked the item as delivered).  Does this seem like the actions of a legitimate company to you? It doesn’t to me.  Serious questions about this company. Not a company I would recommend dealing with.","title":"Vestiaire marks item delivered then tells seller to get with mail service about item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-20","author":"Louise Goëtz","text":"so basically I ordered Versace vintage sunglasses who were categorized “perfect state” I received them ( with a 1month delay..) broken.. I told them many times: same answer for 2 weeks : “this is completely normal it’s the shape of the vintage” LOL seriously?? I told them I am going to send you the sunglasses so you can clearly see that it’s not the shape or whatever but they are broken.. when they received it: “no they are in normal state” 😱 they sent it back to me and that was it.. they clearly stole me 200€… you just answered me that you did not receive the photos, I send 10 photos 3 times..","title":"never order with them !!","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-21","author":"Rosie Brennan","text":"I bought an item from Vestiaire over a month and a half ago, the seller dropped the item off at the designated drop-off point the day after I paid and it hasn't moved since. The seller has been chasing Vestiaire with no joy from any customer service people, I have been talking to them for over a month also without any resolution at all. They have told me that the parcel is at the drop off point so I know the seller has done her job but it still hasn't moved and each rep that I speak to (a different one each time) keep saying exactly the same thing: they are investigating it, thank me for my patience and that they will be in touch when they can. My patience has totally run out, I'm moving house in 4 weeks time and at this rate I won't live at the property when (if!) it finally does arrive. I have asked them to just refund my item as it is clearly not going to be delivered to me, a few reps have said they will but generally they ignore my request completely and nothing happens. The seller only gets paid on a successful delivery so in theory they have not only taken my money, but also taken the seller's item. Do not use this app, considering this app is for fairly expensive designer items, it's not worth it.","title":"Paid for an item that they lost in their system","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-21","author":"Taoran Zhao","text":"I have been a long time VC seller\/buyer\nI started selling on VC since 2016, but I have to say, it is daunting to see how fast their custom service or even just day-to-day operation goes down. From before they have a customer service line you can at least call to, to now there is basically no customer service at all. all inquiry will respond on their preference (I have gotten whole bunch legit inquiry that never gotten responded). Not even mentioning the high fee they charge, it is frustrated both as seller and buyer, because you cannot sell\/buy items at competitive rates. I always ended up selling at other sites instead of here... \n\nAt this point, I am just so exhausted with them and I am leaving VC for good. I feel really bad for all the sellers that are still selling on the site. There are definitely more great site options out there.","title":"I have been a long time VC seller\/buyer","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-22","author":"M Williamson","text":"I’m new to the site and have made two purchases in the last 3 days. Both purchases were cancelled after my payment was taken because the item isn’t available. 1) Why are items listed that aren’t available? Why doesn’t VC require sellers to remove items or charge sellers for cancelling transactions? 2) Why does VC take payment from my card BEFORE ascertaining whether the item is available or not. They take your money and hold it for a few days before issuing a refund. The process is totally backwards - no money should be debited until VC checks that the item is actually available. \n\nI won’t use the site again.\n\nEDIT: The response from VC below is disingenuous. The transactions were both cancelled because the item wasn’t available (not because the sellers failed to send the item within 7 days). My point still stands - VC should check whether the item is available before debiting a customer’s card.","title":"Cancelled purchases and money still taken…","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-23","author":"Anna ","text":"Don't buy OR SELL anything from here!!! Worthless support, that you cant get a hold of and they don't seem to know what they are doing at all. Only a stupid chat function support and on email it takes 2-3 days for them to answer... I sold a very expensive LV bag, that the buyer still haven't received after a week, even though it was with Vestiaire Collective already!! The customer doesn't get a hold of the support and is desperate, wants the money back. Total disaster. I will never buy or sell anything here again!! I don't think you should either.\n\nRegarding your answer: You have my reference nr in this review if you look mire carefully... And what do you mean with blocked?!! You emailed me that it was sent to the customer?? Bad excuses! This review stays and I stand for it 100%! Don't get involved with this company. They are not serious.","title":"Don't buy OR SELL anything from here!!","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-23","author":"Anna-Maria","text":"I sold an item but access to the shipping label was denied ??\nAnd the Customer Service is not helping at all...","title":"I sold an item but access to the…","stars":2,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-23","author":"Ross","text":"I have been reading the latest reviews on internet on this company and they are all disgraceful ! They have no customer service at all now , it must be a cost cutting exercise but this way you will lose all your customers !! The company has gone down hill very fast . If you have any problems in the UK contact the small claims tribunal they maybe able to help . Beware when you sell items directly there are loads of dishonest people that advise Vestiaire that the item has a problem when in actually fact the item you sold didn't have any problems at all , it's your word against theirs  . To recap this company has no customer service at all and if you need to contact them it's a drama . Be careful and don't sell anything of real value directly !! I've edited this review because after Vestiaire replied to this review they still haven't done anything about the item I sold and I still haven't got my money !!! Makes me so angry !!","title":"Total disaster negative review minus 1000000…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-24","author":"Em Keane","text":"Awful customer service and worse since Brexit. They’re only concerned with profit and greenwashing. Not customer centred and no clear complaints procedure -everything is cold and automated. Really slow to resolve simple customer issues. As a result I’ve removed my items from sale and looking for an alternative with humans working in customer services. They don’t value their sellers at all. Terrible.","title":"Awful customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-25","author":"Sofie","text":"Sells fake bags, authenticates it, and then won't acknowledge that it was fake. Had no serial number, so obviously fake.","title":"Sells fake bags","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-25","author":"guro tuv","text":"ll us about your experienceRead our Guidelines for Reviewers\n\nTotal disaster. Shipment lost, which is confirmed by DHL, but Vestiaire Collective have updated it as delivere!! And VC want a copy of my ID pluss a handwritten, signed letter to handle my claim, even though I have forwarded e-mail from DHL confirming the parcel is lost. If WC spent as much time helping their customers as the do replying to all the negative review they get- maybe the site wouldnt be in such a state. What a f...... fraud!! Keep away!!!!!","title":"Total disaster","stars":1,"location":"NO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-26","author":"Ross","text":"I just wanted to update everyone on trustpilot about my last review. Vestiaire hasn't replied to my messages on chat and they replied on trustpilot which was a total waste of time because I still haven't received my money from the item sold directly to a customer on Vestiaire because my payment has been blocked now from the 19th of August . Vestiaire why reply to my trustpilot message and then do nothing to resolve the problem .","title":"I just wanted to update everyone on…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-26","author":"Maria Beswick","text":"First time to buy and it's turning out to be a nightmare...on 16th August bought a piece order number 43039768 The seller sent on day 7 but for some reason there was no way for her to mark the item as 'sent'....I received the item the very next day....but there was no way to mark as 'received'.....I went on Chat and explained what has happened and I was told the system will update automatically.\nBut no one was answering my question of HOW can it update without the sent and received indication. They assured me and ended the chat..... ref number 16902790\nThe next day I got a notification that said I would be refunded!!!! So yesterday I was refunded. Tricky to get on a chat...but Vestiare were unable to reverse this and asked me to pay again....I said no until I received refund(5days) then..... I was banned from our private chat.\nThe customer service person in Chat gave me full Vestiare bank transfer details to pay but I had chosen Klarna pay in 3....as soon as I left Chat I couldn't get back to the conversation with bank details......so now I'm just waiting for Vestiare to reach out to me for an apology for this mess and how can I now pay the seller @georgia13093149","title":"First time to buy and it's turning out…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-26","author":"Mr A","text":"I purchased Gucci Tennis Ace Trainers. I already have 2 pairs which I have purchased directly from Gucci. When the purchase from Vestiaire arrived it was clear immediately that the trainers were fake. The weight was wrong. The stitching was wrong. The serial numbers were wrong. I complained and sent the item back. Vestiaire refunded my money - BUT THEN RELISTED THE ITEM! So someone, somewhere, who doesn't have the correct knowledge has purchased counterfeit Gucci trainers. This is the second time that Vestiaire collective has sent me a fake item. The first time was a fake Stone Island Sweatshirt. I will not be using them again.","title":"Fake Gucci Tennis Ace Trainers","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-26","author":"Raphaela Thaler","text":"I‘ve ordered many times on VC and already had some troubles with stuff I bought, which wasn‘t like it‘s been pictured. Never said anything cause I‘ve always got it re-sold. This time my parcel didn‘t arrived. On UPS it‘s been showed as ‚arrived‘. I already contacted the VC-team and been waiting for my answer.. still waiting on my answer. Really annoying. Not gonna order again on here and do NOT recommend. The customer service is way too bad!!!","title":"I‘ve ordered many times on VC and…","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-26","author":"Ann Doyle","text":"Currently in Australia minimum postage is $56 per item. No direct shipping option possible- a $30 scarf with postage is $86! Contacted VC and they don’t know anything about it…","title":"Currently in Australia minimum postage…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-27","author":"Tina Cholla","text":"Guys, never use Vestiaire collective!!! \n\nI am really tired of them.\nLast time I deal with an issue with them … \nI sold a valentino belt NEVER WORN. Obviously not because there was a defect but because the lady didn’t like it , she used an excuse that it had defects and send a picture that shows absolutely no defect. Vestiaire because they didn’t want to investigate further, they accepted this nonsense and cancelled the purchase. \n\nMy fear is that how do I know if this person didn’t exchange the original belt with a fake one, damaged the product and more !!! \n\nNot a good service to use ….\n- system extremely poor \n- customer service horrible \n- not worth it","title":"Never using Vestiaire","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-27","author":"Defeated","text":"Bought a superfake bag from the UK. Item was shipped to France, \"authenticated\" by \"experts\" who have no experience at all dealing with superfakes (convincing fakes with logo cards and logo dust bags). They need to have much higher hiring standards in France. The bag was a French brand, and STILL they cannot recognise real from fake. Actually not a bad business model - they don't take any financial responsibility from selling fakes. The buyer gets duped by the seller, and bears all financial costs.\n\nHow did I know the bag is a fake? I compared it with professional photos of the same bag taken by a legitimate luxury e-store. The size was wrong. The logo text was wrong. The zipper was also the wrong size. Honestly, who are these people they hire?? They should hire me. I wrote a whole essay for them, with proof. It was checked by two separate people, and still they couldn't do the right thing.\n\nSell all the things you need to sell, and then GET OUT! It's terrible that their staff earn money from doing such a bad job. Fakes are terrible for the economy, for French fashion. It is simply unforgivable to circulate fakes!\n\nAnd I won't trust them to \"resolve\" this issue. I already sent multiple support emails. It was checked by two people. I even warned them NOT to send the seller the money yet, but they didn't listen.","title":"Bought a superfake bag from the UK","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"},{"date":"2021-08-27","author":"Olga Tomeckova","text":"ANSWER: what are you talking about? I was buyer and seller for two years. Do not teach me how it works please🤮. Truth is that : i have listed an item.fake profiles have sent me price offers. Their offers were ALWAYS something abow 70% of listed price. ( these are your conditions)They have never bought stuff. Only in one case.but YOU have immediately contacted others who liked my items that i am ready to drop the price. Is this a fair trade ? You have earned thousands on me! And another fact is that some people sell fakes. LOT OF THEM.Your profits are huge and its shame to earn money like this. Without guarantee.  \n\n\n\nI DO not recommend this site. Its full off fake profiles and people who cant afford the items. “Customers” have sent the offers and when you have accepted it,they havent bought the stuff. In 90% percent. When sale is “cancelled” vestiaire will send bulllshit messages to other customers\n like: (she is ready to drop the price) robbers. Nothig but this.. i was selling Chanel; LV stuff. Now,I have deleted the account..","title":"Olga","stars":1,"location":"SK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=48&stars=1&stars=2&stars=3"}]