[{"date":"2021-11-28","author":"Miruna Ariadna","text":"They're great, until they steal your money and refuse to give it back. \nOnly pay with Paypal or credit card!!! I can't stress this enough. \nI've sold multiple items and bought a lot, and everything was (almost) ok until now.\nI bought an item almost 3 weeks ago. A week ago I receive a notification that the item arrived at their warehouse and was going through the process of being authenticated. After a week of going back and forth with customer service in order to find out when will the item be sent to me, they claim they actually never received the package from the seller and that the item is lost. I asked for a refund and they refused. They asked for my ID in order to open an investigation, which I told them I will not provide, because that's between them and the seller, I have no part in that. They never explained why they need my ID, since the shipping company that supposedly lost the package only had the seller and their information. Why is MY personal private info needed??? I now see this is a common abuse they do. \nI asked multiple times for a refund, they refused each time. So basically they stole my money. \nI opened a claim with Paypal and now waiting. \nA similar thing happened a couple of years ago when a seller never sent the item and they refused to issue a refund and told me I have to wait 30+ days in order to get my money back. I had Paypal step it and got my money back. \nOnly shop with them knowing these things happen and take all precautions. Having a 3rd party purchase protection is a must!","title":"Only pay with Paypal","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Ola Kot","text":"I sold a bag - reference number 18869895 with direct shipping. Buyer received it and reported a problem that the bag wasn’t the size she wanted - even though the dimensions were in the description! And Vestiaire let her return it to me!!! Besides that, the buyer received a refund and didn’t send the bag to me - so they kept the bag and the money. I contacted Vestiaire on chat about this and they didn’t respond my question - they ended the chat!!! This is ridiculous. My lawyer will be contacting You and legal actions will be taken. Give me my money back!!!!!","title":"stolen bag","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Luiz Guilherme Moura","text":"Needing any help from this platform is a horrible nightmare. Their help center is inexistent - all they have is a robot they call \"Chat\" (major joke) and a message box that has NEVER worked. Ever. I have sent them countless messages both through the app and the website and I have never received any response from them. The only time they ever wrote me was with a generic text here on Trustpilot. They are always happy to charge their overpriced commission on every sale but have absolutely no consideration for the users.","title":"Disgraceful support service","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Igor Virgo","text":"I had my Giuseppe Zanotti baseball cap on their website for about 6 days. Last week i went away and just removed it from sale but when few days later i tried to relist it again  it was refused! I was told they are not sure about authentity. Same item!  I personaly purchased it from Giuseppe Zanotti store last year and this cap doesnt even look like fake. Well known model and could be easily found on Google. I am also a trusted seller and do not sell counterfeit goods. Every single item i have is 100% genuine. Very dissspointed.","title":"Shocking experience!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Anna Denton","text":"I have a buyer. She can't pay me because the website won't let her for some reason. Both she and I have tried to get in touch with Vestiere on their help channel and we've had no reply - 3 days later. I have absolutely no idea how to get in touch now and she has no idea how to pay me and get my shoes. Useless.","title":"I have a buyer but the site won't let her pay","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Stephanie","text":"Do not buy! Scam! Bought a swarovski necklace and it’s been held in customs for over a month after it was authenticated by vestiaire… come to find out from FedEx that they reason i haven’t received my package is because it’s completely EMPTY! I have contacted vestiaire several times and they give me the same response of getting back to me in 24 hours. I’ve waited over a month now since they claimed that I received my item. Such a joke. Do not buy from them! Told them I would give them a week to finally fix the problem but when I found out the package was empty and that’s why I haven’t received it, that just pushed me over the edge. Already disputed my charge and I will be letting all my friends know and social collectors groups know so they don’t get their hopes up like I did. Thanks a lot vestiaire.","title":"Do not buy! Scam!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"S S","text":"I am trying to sell my first item on Vestaire.It has been quite the nightmare so far.I was asked to ship to their Hong Kong office and my courier asked that I needed to include a name in order to send the parcel.VESTAIRE REFUSES TO GIVE NAMES OF THEIR EMPLOYEES.They are very shady.VC DOES NOT HAVE ANYONE IN THEIR OFFICE THAT I CAN CALL.NO ONE PICKS UP EVEN THOUGH THE CALLS GO THROUGH.A chat rep had the audacity to tell me that they have no workinng number because everyone is working from home due to the pandemic and therefore they cannot provide me with a number to reach out to...\nWhere on earth am I shipping my items,I have no idea..\nDO NOT recommend using this platform,if any problem occurs you as a seller are on your own.","title":"SHADY,UNPROFESSIONAL, BORDERING ON FRAUD","stars":1,"location":"PK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Wendy Kelly","text":"i use this site and except for the one item overall have been fairly pleased till recently i purchased a LV bag description and pictures did not match i was horrified at the bags condition !!!!\nstains and mould and rubbing bobbles on the inside and the straps were broken not totally but split right through the leather how is this an item in good condition it had way more faults than shown in the pictures i contacted vestiaire , and returned the item to be re examined , today i got an email they said it is compliant !!!!!!!  i am disgusted to say the least , if an item has faults they should be made to show all faults no exception !! i bought a bag and paid over £525 with tax and would not give it to a charity shop i wish i could show you all pictures !!! come on vestiaire you sell world wide there should be no unwanted surprises of faults allowed  at all\nwho ever checks these bags should be sacked !!! update they re checked bag said it was compliant and then relisted it and changed the condition of the item to fair and listed all the faults \nhow is this compliant !!!","title":"Beware of faults and defects not being shown in pictures and vestiaire thinks it’s ok to deceive buyers  !!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Liv R","text":"I have purchased a couple of things from Vestiaire in the past and, although slow to deliver the items, it went pretty smoothly. However I recently purchased a Burberry trench coat for £215 and it has been an appalling experience right the way through. The coat was listed as being located in the UK where I am - I had specifically only looked at items in the UK both to avoid duty \/ fees and also as I didn't want long shipping distances from an environmental perspective. After 2 weeks the coat still hadn't arrived, so I took a look at the tracking on the website. I then saw that the coat was now saying it was located at Vestiaire France not in the UK as it has been previously. I contacted Vestiaire on 3 occasions and provided photos of their website showing the coat listing had said it was in the UK. I told them explicitly that I would not pay any duty on the item given that the location had either changed, or had been falsely represented in the first place. Their customer services team ignored the evidence provided and just kept telling me I may be liable for duty charges.\n\nWhat's worse is when the coat eventually arrived 18 days later it was reeking of damp and literally covered in mould! It had been described on the listing as being 'Perfect' and in 'Very Good' condition. Yet it is literally unwearable. The 'UK12' coat I had purchased was also the equivalent of about a UK 20 with a bust measurement of 51 inches instead of 39 inches. \n\nThis is despite me paying Vestiaire additional money to authenticate the coat and undertake quality checks to make sure it complied with the information in the listing. \n\nI am absolutely furious about this. I have provided Vestiaire with photos to demonstrate the issues, but based on my experience to date who knows if they will actually acknowledge their errors and refund my money. I will update this review to confirm.","title":"Worst experience with Vestiaire - item NOT as described at all","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Maz","text":"Firstly, I don't enjoy leaving bad reviews and I feel every business deserves some grace. Secondly, this is the second time I have had to leave a review because it seems to be the only way to get somewhere with this company! You just had a billion dollars worth of funding....spend it on customer service!!!\nI can't fathom luxury goods and the fees you charge and having customer service that can't answer simple questions, not a lux experience at all.  \nI got an email stating I need to cancel my premium or it will be renewed for a fee. I literally asked customer service this months ago (August) and was told my product is a one off and it won't renew. \nI go into my account, try to figure out how to cancel and can't, its not listed on anything (I tried app and desktop) so I email customer service. Bear in mind this is after speaking to someone on chat who said \"your product won't renew don't worry\". \nI opted to contact and get double confirmation because I have dealt with VC customer service a few times and they are usually polite but completely uninformed. I got an email back today \"unfortunately you can't cancel its less than 10 days-it cancels in 3 weeks. He couldn't be bothered to double my information before sending an email. Beyond frustrating dealing with this company. Cancel my premium!! I would do it myself if I could. \nAll this being said, the Premium product itself isn't bad but dealing with the company when I need something is maddening, final straw for me.\n\nUPDATE: 16 emails later I was able to find it in the desktop site and unsubscribe. This is my second really lousy VC experience. I was sent a fake bag months back and haven't purchased a thing since. I was not expecting to be enrolled in an auto renewing service without notice and was hoping to never have to deal with their snobby, rude customer service ever again. The customers and their submissions are your product, your fees are ridiculous and your service is subpar. Serious changes are needed.","title":"I give up","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Consumer","text":"Hopeless. Do not trust their authentication and checking service. I bought a wallet said to be in good condition and it was ‘checked’. it arrived and was a mess, exterior leather wearing off, colour faded, not good enough for the jumble sale. I queried this and they said the wear was visible on the seller’s photographs - it wasn’t. So poor quality items can be sold as good and the buyer has no recourse. Of course, I could resell it but don’t want con another customer as I have been conned. \neBay is much better at customer service, transparency and responsiveness. Truly hopeless.","title":"Hopeless","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Dear Mr Odusanya","text":"A THOROUGHLY DISHONEST COMPANY. I would have given a zero star, but the system does not allow this. I bought a trouser listed on the website as size 44 F (France) Mens size which Vestiaire listed as equivalent to 36 or XL in UK size which is my size. When I got the item, my leg couldn't even fit into the trouser. I could only assume that it was either a woman size or the size listing on the item was misleading. I have always use XL or 36 waist when buying either online or from shops with no issues whatsoever. I asked for a refund of my money and Vestiaire kept telling me it can only relist the item. I informed them that I can't relist an item that was listed with a misleading information.  I have contacted them several times and they keep sending same message. I wish I had read the reviews here before patronising this fraudulent company. More annoyingly the company did not even post the response to the seller regarding my complaint meaning they have no duty of care for their customers.","title":"A THOROUGHLY DISHONEST COMPANY","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-11-30","author":"Consumer","text":"Please believe the bad reviews you see below. The worst customer service ever. As a buyer, Vestiaire is the bottle neck when you want to authenticate. They delay on the delivery and all you get is a very annoying chat bot to answer your questions and very little customer service support. \n\nI can’t wait for the next company to come along that rivals Vestiaire but puts customers at the centre. They will become the next Kodak, it just a matter of time. Some other customer centric company will wipe them out. \n\nTerrible terrible terrible.","title":"Please believe the bad reviews you see…","stars":1,"location":"NG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-11-30","author":"Liv","text":"I have purchased a couple of things from Vestiaire in the past and, although slow to deliver the items, it went pretty smoothly. However I recently purchased a Burberry trench coat for £215 and it has been an appalling experience right the way through (ref 47180114). The coat was listed as being located in the UK where I am - I had specifically only looked at items in the UK both to avoid duty \/ fees and also as I didn't want long shipping distances from an environmental perspective. After 2 weeks the coat still hadn't arrived, so I took a look at the tracking on the website. I then saw that the coat was now saying it was located at Vestiaire France not in the UK as it has been previously. I contacted Vestiaire on 3 occasions and provided photos of their website showing the coat listing had said it was in the UK. I told them explicitly that I would not pay any duty on the item given that the location had either changed, or had been falsely represented in the first place. Their customer services team ignored the evidence provided and just kept telling me I may be liable for duty charges.\n\nWhat's worse is when the coat eventually arrived 18 days later it was reeking of damp and literally covered in mould! It had been described on the listing as being 'Perfect' and in 'Very Good' condition. Yet it is literally unwearable. The 'UK12' coat I had purchased was also the equivalent to about a UK 20 with a bust measurement of 51 inches instead of 39 inches.\n\nThis is despite me paying Vestiaire additional money to authenticate the coat and undertake quality checks to make sure it complied with the information in the listing.\n\nI am absolutely furious about this. I have provided Vestiaire with photos to demonstrate the issues, but based on my experience to date who knows if they will actually acknowledge their errors and refund my money. I will update this review to confirm.\n\nIN RESPONSE TO VESTIAIRE:\n-------------------------------------------\nAgain, the listing stated the item was in the UK at the point of purchase. Vestiaire has offices in LONDON. Nothing was flagged on your website when the quality control option was selected to say you would not in fact send the coat to London and that 'crossing borders' to France would be required. If I had been made aware of that I wouldn't have gone ahead with the purchase.......\n\nUPDATE:\n-------------------------------------------\nI did end up getting my money refunded to me (given how vastly different the item received was to what was described I had my lawyer at the ready had the decision gone the other way). However, I paid for Vestiaire to undertake quality checking before the item was sent to me. So it should never have passed that check and been sent out to me in the first place. Therefore, I am extremely wary about purchasing anything from this website in the future given that their quality checking process clearly does not work. An incredibly disappointing and stressful experience from start to finish which is not how you want to feel when spending hundreds of pounds on a designer item.","title":"Worst experience with Vestiaire - item NOT as described at all","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-11-30","author":"Customer","text":"Don’t trust them. They destroyed my products and then they canceled my selling.","title":"Don’t trust them","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-11-30","author":"Marie","text":"AVOID BUYING FROM THEM. THEY DON'T REFUND YOU ANYTHING IF THE SELLER LIES IN THE LISTING\nI bought a Chanel jacket on Vestiaire Collective. The pictures look amazing, only that when I received it I realized they missed all the defects of the item. Pictures are professionally taken and used careful lighting and deliberately the side of the jacket with defects. I sent them back, and they dared to say that it fits the description. If you think you are buying from a safe source with quality control, you think wrong, as they only care about selling as many as possible. Once it's out, it's out. Shameless company. I'm sure they will go bankrupt soon with more and more customers realizing this.","title":"AVOID BUYING FROM THEM","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-11-30","author":"Jelena","text":"I don’t leave bad reviews usually because I think every business\/store\/professional deserves a second or even third chance but I can’t not to in case of Vestiaire. I have sold a couple of items recently and all of a sudden I get an email saying I need to verify my identity or I cannot be paid (mind that I had already sent the items and they have been accepted and all). I have used Vestiaire for a couple of years now (since 2017 if I’m not mistaken) and suddenly now they need to verify that I’m… well… me. I didn’t question it at all and went on the app to fill out the forms I need to fill out until the last part where it showed error. I have tried countless times, on the app, on my desktop, I even deleted and downloaded the app again, nothing helps. Always the same error. I have contacted customer service three times. Useless. They just tell me they have sent the matter forward to their IT or whomever and that I should refresh the app with 24 hours. This was a week ago. Still the same error, still not paid for my sales. No money, no items. Awful.\n\n\nUpdate: As you can see I was right about leaving the review. Instead of admitting the faulty system I get a reply that I don’t agree with Identity verification process. Where have I written that I don’t agree or understand the process?! I have nothing against it. I have even tried several time to do it but failed because of the faulty sistem\/interface and\/or unhelpful\/useless\/unexistant customer service.","title":"I don’t leave bad reviews usually…","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-12-01","author":"customer","text":"Terrible terrible terrible. Worst customer service I have ever experienced. \n\nI would avoid this company at all costs. Do not be sucked into the false promotion codes.","title":"Terrible terrible terrible - avoid at all costs","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"},{"date":"2021-12-01","author":"Megan","text":"Really bad - I sold a Gucci belt for £180 after confirming with customer service I wouldn’t get charged commission on my product for my first sale. I then put it up and was charged £27 - after 10 lots of emails finally was told I couldn’t be refunded. Half the emails after one reply was ‘this email no longer exists’ - I wouldn’t have sold the Gucci belt for £153 so very annoying all round and each email is a new person who has no idea about your last chat. Provided all evidence of being told I would not get charged commission but didn’t matter","title":"Really bad","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=32&stars=1&stars=2&stars=3"}]