[{"date":"2021-01-25","author":"MARIUS","text":"Bought a new with tag coat that is not that new and smells horrible. Of course as is a scam no return possible.","title":"Bought a new with tag coat that is not…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=77&stars=1&stars=2&stars=3"},{"date":"2021-01-25","author":"Customers abet pye","text":"Very dissatisfied with their customer services . They have not sent one of my items back to me and haven’t paid me for another item . I’ve spoken to 4 different agents now to sort it and nothing been done .","title":"Very dissatisfied with their customer…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=77&stars=1&stars=2&stars=3"},{"date":"2021-01-25","author":"Hanna Gry","text":"TERRIBLE EXPERIENCE!\nI purchased item from US and I am located in Canada. I was charged about 40% tax. FORTY. For item crossing border once!\nBefore purchase I contacted VC chat to check about duties and agent indeed confirmed that tax rate supposed to be lower and the difference will be refunded to me once I receive an item. I contacted them so many times, every time their response is that they are investigating. It’s been 3 month. Never got refund for wrong calculated duties. \n***VC YOU ARE TERRIBLE LIARS!***","title":"TERRIBLE EXPERIENCE!","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=77&stars=1&stars=2&stars=3"},{"date":"2021-01-26","author":"Mellie Jelly","text":"HORRIBLE customer service. This will be my last sale on Vestiaire, as it's simply not worth the effort anymore.  My review is in line with the other negatives reviews on here - shoddy\/inconsistent service, and mixed messages. Also, FedEx failed three times to pick up my parcel and now I am at risk of losing my sale. Will be deleting the app after this. \n\nAlso - this customer service agent: Jean Elaine Monares Salamante is to be avoided. She basically logged off the chat without giving me a resolution.","title":"HORRIBLE customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=77&stars=1&stars=2&stars=3"},{"date":"2021-01-26","author":"Mrs Gabeva","text":"What does it mean when VC gives you the fully automatic response such as “ We are sorry to hear about your dissatisfaction.\nIn order to assist you further, we have already forwarded your case to our expert team.\nWe will keep you updated on its progress via email.\nThank you for your kind patience and understanding!”\n\nMeans - we are not going to do anything because we do not want to bother about putting any work into it. We do not have an expert team. We have a computer system that does random picks.  And the customers are paying commission for a computer system full of glitches. Because if they did have an “expert” team the item submitted with 10 detailed good pictures of the  real item and a very detailed description and 1 picture from Vogue Runaway of the fashion show just to give the customers a better idea  (which is the right way to present a listing and almost all my listings are done this way) would have been already  online and most probably sold. But this is not what VC does. Because they believe having a great concept is enough. But great concept combined with lack of adequate customer service and fairness usually ends up nowhere. Ridiculous to the point of funny.","title":"Total BS","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=77&stars=1&stars=2&stars=3"},{"date":"2021-01-26","author":"customer","text":"I’m deleting my account once I recover my money. I ordered 2 pairs of pants that went through their authentification and verification system (for which I paid them for). After verifying them, they decided they are in the condition the seller mentioned, which was “new, with tags”. The pants arrived and one pair was cut and shortened by about 10-15cm by the seller (not mentioned) and the other pair is completely discouloured in many spots. Of course, me being naive and stupid, I thought I’m getting a great deal for “new” pants. I asked for a return + money back (including import taxes, shipping and authentification). They do not want to give me anything back. It’s a very shady company. AVOID AT ALL COSTS!!!","title":"I’m deleting my account once I recover…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=77&stars=1&stars=2&stars=3"},{"date":"2021-01-26","author":"Babydoll","text":"If I could give a 0 I would. Ref. 13270314\nVery very displeased and disappointing.\nMyself I sold already a couple of things on VC and most of the times there were issues where they wanted to sell my (expensive) items for less because they were complaining about minor things). I assumed buying something myself they would be as strict!\n...\nAfter chatting with a seller I requested a lot of information on a pair of diamond earrings.\nFirst of all it took them much longer to send them (so always calculate extra time with authentication even though their terms mention differently they will make up excuses like Brexit even though the package was from France to France to Belgium).\nAfter considering the trustworthy I ordered for a bit over €1000 “with certificate”.\nEventually I received much different earrings as from the picture. VC should be ashamed! Someone named Allison at VC checked them (I paid extra for that) and agreed on the fact the pictures matched the items?! Sham on her. Ripping of your customers. I do have attorney assistance for this reason if they fail to sort this out. Never by diamonds or expensive jewellery, they can not be trusted!!!\nOh yeah and the certificate? Was just random Word sheet with some information. No stamps or whatever.","title":"If I could give a 0 I would. Don’t buy their jewellery!","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=77&stars=1&stars=2&stars=3"},{"date":"2021-01-26","author":"Rebecca McGlynn","text":"Ref, 13842488.  \nI sold my fendi bag through VC, sent the bag with all the accessories noted in the description and in the pictures.  I’ve been informed my bag is missing the raincoat, it was 100% sent with my bag, in the inner pocket. I’ve requested my bag gets a recheck and as yet, 4 days later nobody has responded back to me with an update, clearly it hasn’t been rechecked and I’m not sure if it will.. they don't seem to care!\nMy buyer has now cancelled the order! It’s an absolute shamble, I’ve made over 10 chat and email requests, there is no contact number to speak to them.  They have no customer care, the whole experience has been so inconvenient and has caused me so much time, stress and frustration.. I’m now left waiting for a response and cannot move forward with re listing my item until I have reply from the “expert team”  I have to wait.. with my bag sat in their offices... Awful.  \n**update** surprise, surprise, VC eventually got back to me 5 days later and after me chasing them 14 times, to say they found my raincoat.. as they informed my buyer already that my item was missing a piece noted in the description my buyer cancelled! As an apology VC said they would pay me my payment (minus their commission..) and it would be processed on the next pay run (every Wednesday) well.. it wasn’t processed and now there is an “investigation” going on to see why I’ve not been paid, I’m still awaiting a reply from the so called “expert team” in the meantime they have personally sold my bag (although I can’t find an evidence of this) and they are holding my money - over £1000..! It is absolutely disgraceful and I would be extremely cautious to sell through them..\n*** update 10\/02\/21***. I’m still waiting for a reply from the “expert team..” I yet again contacted customer service Monday and Tuesday this week, to no update, I have to patiently wait, I’ve been told.  It has been confirmed my bag was sold by VC themselves on the 03\/02\/21 under reference 14197543 so they are now holding my money as they’ve sold MY bag.. I have no updates on my account and I’m really concerned my payment has gone missing..   It’s really a very stressful experience as you cannot get a response from them, feels like fraud! They also closed down their chat today (likely because its payment day and i was in queue of over 70 people last week so many more must be experiencing the similar concerns ) literally you cannot get hold of anybody!\n\nBrief breakdown of the horrendous experience so far..\n.15\/01\/21, Sold Fendi bag  13842488\n.19\/01\/21, Arrived at the VC hub \n.21\/01\/21, I was notified its missing the raincoat, therefore VC advised my buyer to negotiate\n.21\/01\/21, I raised a complaint and a re check as the raincoat was 100% sent in the inner pocket\n.Buyer cancelled the sale in between 21\/01 - 27\/01 whilst waiting for VC to re check the bag..\n.27\/01\/21, Elaine VC customer service confirmed they found the “missing raincoat” and confirmed  a request to submit my payment for the error made, VC would relist the item and take the proceeds of the sale.\n.29\/01\/21, Damian VC customer service confirmed payment is scheduled on 3rd Feb\n.03\/01\/21, No payment received, another 2 chat conversations and emails sent, it was confirmed by Christian C (VC customer service) that the issue is being reported to the experts and I would receive a reply in 3 working days.. \n05\/01\/21, I contacted customer services again, no update, awaiting reply from the “expert team”\n06\/01\/21, I contacted customer services again, no update still awaiting a reply from the “ expert team”. I was notified my bag was sold on the 03\/02\/21 under reference 14197943 and again my issue has been raised with the “expert team”\n*** this has been nearly 4 weeks since my bag sold and I’ve received NO MONEY, not to mention they are still taking full commission from me £350!!!***","title":"terrible customer care, lost item **includes update - they “found” they sold and I’ve not be paid!**","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=77&stars=1&stars=2&stars=3"},{"date":"2021-01-26","author":"Katie Tang","text":"DONT BUY FROM THEM !!! WORST COMPANY EVER. Purchased an item and they told me the item I've purchased is partially compliant. Messaged them to get more details about the flaws of the item not mentioned by seller. Been waiting for 5 days and still heard nothing. No customer service. Happy to take your money but no help is available.","title":"DONT BUY FROM THEM !!","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=77&stars=1&stars=2&stars=3"},{"date":"2021-01-27","author":"Jess","text":"“We will pass you on to our expert team”\nI have been in this loop for two weeks now! \nI have PROOF my item was delivered to the buyer. I sent within 24 hours - packaged beautifully! \nMy £166 is being withheld for something I did not do and now I’m being passed from pillar to post with not one expert team member in sight! I want a phone number to call - but nope - nothing. EVERYTHING on this site should always go through the company for authentication and delivery then this would not be happening. I have bought from Vestiaire before and as a buyer had a good experience. As a seller however - they don’t care!","title":"“We will pass you on to our expert…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=77&stars=1&stars=2&stars=3"},{"date":"2021-01-28","author":"Semtec Partners","text":"Using Brexit as an excuse to charge more and remove items for posting to UK from EU and vice versa. Vestiaire have deliberately made any chance of doing business with their platform totally unworkable for the UK. the have no idea of the new Customs tariffs and codes so just filed it in the ‘Too difficult’ box.\nTheir customer services is non existent. That is of course if you can actually get to speak to a person .... if you’re in the UK Vestiaire no longer wants your business","title":"UK\/ Brexit - Vestiaire restrictions","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=77&stars=1&stars=2&stars=3"},{"date":"2021-01-28","author":"MARIUS","text":"Make yourself a favour and don't use this platform. Fake products. One of the items in my order, a Balmain new with tag tshirt came dirty and after washing looked like a £2 rag. My purchase included the autentification and paid for it as well. Please learn from this.","title":"Scam and fake products","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=77&stars=1&stars=2&stars=3"},{"date":"2021-01-28","author":"Frida Dinham","text":"DONT BUY from them, I was excited and bought 3 items, now I’m having to beg for the goods, first item took a month to arrive, second another month and now I’m having to nag and beg them again for my last item, NEVER AGAIN!!!!","title":"DONT BUY from them","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=77&stars=1&stars=2&stars=3"},{"date":"2021-01-29","author":"TLC","text":"Very fast - From searching, negotiating, buying till i received the item. I purchased on Mon and received it on Thurs in Singapore (Item is in France). Really fast but i started to have doubts.  Please open your eyes to take note of the following doubts;\n1) No one used the word, Genuine or 100% Authentic on their listings.  Why?  it is a very common word used for selling branded used bags online\n2) Every listing seems to use the same photos for the same model of bags they sell online.  Agree?\n3) Lack of detailed descriptions.  All listings are the same - very brief words for selling such expensive and branded items.  Dodgy isn't it?\n4) Go to their Facebook Page - They removed the REVIEWS Tab and also all negative comments on their Posts are being removed or hidden.  Strange isn't it?\nI hope my doubts are unfounded  but if i were to read up more about VC online in here, i won't buy from them. And yes, the discount amount given is not a full discount like it supposed to.  But it's a very small thing compared to end up buying a non-authentic item.\n My order number is 33937016 and seller reference number is 13999134.","title":"Everything Seems Dodgy","stars":2,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=77&stars=1&stars=2&stars=3"},{"date":"2021-01-29","author":"John","text":"Verstiaire Collective authentication process is a scam !!!!\nJust received my palm angels rainbow pants and posted it to multiple platforms for legit check. And guess what all the results show that the pants is a FAKEEEEE.\nMy product reference is 13942529\nAnd STAY AWAY from this seller @supremeracer","title":"Just Got a fake Palm Angels Rainbow Pants","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=77&stars=1&stars=2&stars=3"},{"date":"2021-01-29","author":"Han Walk","text":"Absolutely horrendous, you will NEVER get through  BY PHONE there is no customer service. They refuse to escalate any issue and drag you through the unnecessary ordeals of typing in chat. They DO NOT listen to the complaint and repeat what ever mantra they decided. Totally lost any value and credible customer service. When a company gets so big they forget who made them that’s when they fail. I will be using an alternative resell this has been an awful experience\nZERO CUSTOMER SERVICE YOUR COMPLAINT WILL BE IGNORED!","title":"Absolutely horrendous","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=77&stars=1&stars=2&stars=3"}]