[{"date":"2021-05-02","author":"Lorena","text":"Worst customer service ever! Not a single time that I contacted them, they were able to solve the situation which basically is that their app is horrible and while they operate globally the app can’t cope with exchange rate. They send you promo codes that don’t work, customer services does not seem to receive any training and they just pretend they don’t see, they don’t understand. Go to Vinted! No fuss, no commission, straight forward and cheaper!","title":"Worst customer service ever","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-03","author":"Elle","text":"Without asking me first, Vestiaire changed my account to “direct shipping” which means buyers can receive my item directly (ie not after a Vestiaire authenticity appraisal) without paying, and then after a certain period of time (several days) they can choose to return the item (hopefully not after having worn it)! I mailed my item to Vestiaire at the end of March and still hadn’t heard anything back from them, it’s now May 3. It turns out FedEx still has my item and the buyer has not collected it (or obviously, paid for it).Vestiaire obviously was not keeping track of this. If I had not called them they would not be reaching out to FedEx to see if my item is still available to be returned to me! Apparently for me to request removing “direct shipping” from my account entirely requires a review by “the experts“ at Vestiaire. Please see attached chats fir frustrating experience of trying to get info from this company.\nI have been using Vestiare for several years now and it’s gotten progressively worse in terms of policies and customer service (For example, one day I looked at my account to find out that all my items listed for sale had been erased! They apologized but I still had to upload pictures again etc). It’s especially bad as a place to try to sell items — Which makes sense because their commission is on drumming up lots of sales.\nI just realized this is a Vestiaire-run review, so I doubt this will appear. I will try to post this review also on non-Vestiaire-run review boards. There’s no option here to leave screenshots of my chat conversation.","title":"“direct shipping” is terrible for sellers","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-03","author":"Percypigs1988","text":"Scam. Sold a fake item. I didnt realise that it was fake and when I tried to resell vestiaire collective keeps the item and my £400 and are impossible to contact. Thieving *****","title":"Scam! Avoid!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-03","author":"Valued Customer","text":"The past few mornings my partner & I got VC emails stating we lost our expert seller status, in order to gain it back we need to add new listings & sell more.   We ignored the emails, by each evening VC sent email congratulate us became “expert seller”...AGAIN?😂 what a joke!  \n\nWe started selling at VC this February, we each sold more than 30 items quickly since then & earned ourselves “expert seller” badges.  \n\nI’m wondering who run VC, a bunch of mobs or some fresh graduate bullies from “mean girl university”? 🤣.  \nHow can they be so low forcing sellers to list new items, are they really that desperate?   \n\nTo avoid their daily harassment, we turned on our holiday mood for one month & will dedicate our free time to combat their fake 5 stars reviews by leaving negative comment here.   \n\nMay I suggest whoever been mistreated by VC and aren’t depending on VC make a living, to activate their holiday mood for a month to pass on our dismay message to VC?","title":"The past few mornings my partner & I…","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-04","author":"Evertom Everton","text":"In 2 years I sold hundreds of items worth €100-€500, now I sold an item worth €1800 and after that somehow magically i need to get verified my personal info and bank account which was verified not long ago. I sent the ID as I been asked for it. Nothing happening, and I did not receive MY MONEY until now, customer service below zero, constantly saying that they will forward MY CONCERNS to an expert team, expert team came with some bullsh explanations that my payment scheduled on 04\/27, but in my account I see that is GOING to be transferred on 04\/27, not transferred. As in this moment I have absolutely no info where is my money or where is an item which I shipped.\nThis is so unacceptable, if you have problem with my bank account or my information you should suspend me from selling until you have the info, not sell my items and then ask for information and do absolutely nothing when I give it to you!!! This is some kind of racketeering, I want my money or my item back !","title":"In 2 years I sold hundreds of items…","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-04","author":"Eva Mal","text":"Horrible arrogant customer service at chat\n\nThey NEVER check the description so if the buyer says with durect shipping you misrepesented the item they believe it\n\nIncompetent on many levels\n\nThey charge the same commission for direct shipping but don’t even check the item.\n\nBuyer can say anythung they believe it.","title":"Horrible arrogant customer service at…","stars":1,"location":"HU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-04","author":"Ying","text":"Recently I sold a Brand New bag on 21 March 21 by direct shipping, delivered on 29 March 21. Issue was reported. After waited for 7 days I emailed Vestiarie for an update. and then I was told the buyer did not order the bag from me (ref: 14808785). so why asked me to post it. today I received the bag back, it was used clearly as the brand tag and cover on the strap were removed from the bag. it is utterly unacceptable which makes me think how my rights as a seller can be protected  2) sold a wallet (ref: 14689432) and already got the payment, but it is marked as authentication in progress on the website, for this, I lost the trusted seller badge.. 3) sole a Chanel wallet on chain,  (ref: 14869988), was asked to provide extra documents (so what counts as extra documents please) and there were no emails to me to ask for exactly what they were looking for, I only saw the request under the notifications in my profile online. so I emailed the team and stated that I sent to them all I mentioned in the descriptions, do they need anything else?. No reply then rejected my item as non- compliance.. this is fine as this is highly subjective but why let me submit the item at the first place since you are clearly lack of expertise in the field you are in. In summary, do not do direct shipping with them as someone may rip you off. do not buy from them as I don't think they have the expertise (I bought 20K worth of goods from them and I deeply regretted). I won't spoil my time any more.","title":"Stay away from Vestiaire Collective","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-05","author":"Sofia M.","text":"I would give negative stars if I could.. Absolutely ridiculous! It's been 3 weeks since my purchase and I'm still waiting for them to deliver the product. First, they said that the seller used the wrong delivery method. Funny, because even in that case the product was delivered to them quite fast. Meanwhile, the order information showed that the item was already sent to me 10 days ago. For 10 days now I keep on contacting the customer support service according to which the item is in their warehouse, it has already been under authentication process, and it is ready for delivery, and for one week now they say that they have forwarded a pick-up request in order for the item to be delivered. Yet still no delivery, no tracking number, no confirmation mail provided. Nonsense! Absolutely nonsense. It's my first order, and definitely the last one. Ridiculous service!","title":"I would give negative stars if I…","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-06","author":"Super girl Band","text":"Sold and bought before and it went ok. Moved to Norway and sold a jumper. Sent it for almost 40 pounds insured and tracked. Allegedly in advantage of Covid making deliveries less personal, vestiaire received my item after 13 days of leaving Norway. The french post confirmed it and so did vestiaire on the 17th of April when I got a notification that my item was ready to be sold again directly from them. So I. Accepted the listing. It was bought on the 19\/4. Vestiaire informed the buyer that the item was being under the authentication process and it would ship. Days after many enquiries they tell the seller I never shipped it and they never got it. The Norwegian post confirms it was delivered and received. Now vestiaire keeps on denying ever receiving it (after accepting they did). Terrible. Be careful. I am erasing the app. Now I am without a not cheap jumper, 40 pounds to the bin and the buyer can’t get the item. Beware please, be very careful.","title":"Vestiaire accepted receiving the item and now denies having it BEWARE","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-07","author":"Ays","text":"I am adding my items since 1 week but 100% of them got refused even I have added with their serial codes. the items are all authentic and I have sold more than 1600 items. I have used VC system for about 5 years, and I know which criterias my photos should have. I communicate them for two times, but find no solution. The worker said add your item again with its serial numbers, I said I have added for many times (more than 20 times each item) with their serial numbers in photos. She has no answer and says keep adding. I really dont understand but I know there is a technical problem with the item confirmation system. Please tell this problem to your IT department and check the system. I am not the only one having this problem. Please give a real answer to my question not an automatic answer. \nI could not add any items since last week and the problem makes me mad.","title":"All my items are refused with no reason","stars":1,"location":"TR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-07","author":"Chi On Lai","text":"Misery to sellers \nI bought a lot on a monthly base at VC during 2015-2017, then occasionally between 2018 and 2020.   I would say my experience was OK except issues like conditions & colours aren’t as good\/accurate as described, long delivery time, etc.   I didn’t care much cause I bought mindlessly & frequently, I read an article at that time Hong Kong is VC biggest consumer.....yes, even bigger than their local French market! \n\nSince COVID I’m clearing out my wardrobe & started selling at VC, it took only 4 months as a seller have I experienced most of the negative issues posted here!  \n\nI realised now shopping at VC seem to be problem free to some buyers, but when you shop at VC you probably contribute in creating a lot of miseries with sellers!   AVOID","title":"Misery to sellers","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-07","author":"Jenny","text":"New to VC about 2 months now and have purchased over 10 items so far. Sold 2. Mixed reviews on service, payment speed and communication. But good prices and platform.","title":"Mixed reviews","stars":3,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-07","author":"JJ plays","text":"Just received an email from VC. \" Problem with your item. We may need to cancel the sale. And your payments on hold for 7 days \".\nOops , what could have happened ?\nBuyer bought my item. VC deemed them o.k to be Direct Shipped. Now she's saying that she collected them  and the package was damaged and the shoes gone !\nSo, I contacted them and was told. \"We're conducting an investigation with the courier\". So , why am i being contacted to tell me I may not be paid?\nHmm..not happy with this \"No service \".","title":"Just received an email from VC","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-08","author":"ED","text":"Made a purchase, item never arrived from Germany. Seller uploaded a so called ghost tracking number which was confirmed by DHL, Vestiaire basically do nothing about this, they told me the only way to get a refund was to hand write a letter, copy documents to prove who I was & then send at my cost to them overseas just to start the process of a refund, completely RIDICULOUS process for an online retailer, VERY bad experience, would never use again.","title":"Made a purchase which never arrived","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-08","author":"Agne Karuzaite","text":"Super slow service, impossible to call and get the issues sorted- you have to talk to the computerised system first then you are directed to a chat with representative which keeps on breaking up if you are sending the documents or pictures then you have to start the process again and again. As a buyer I had good experiences and bad. More bad than good - tried buyibg the same item from the same seller 4 times. As soon as the items was uploaded onto VS I clicked to buy and paid within seconds, the money was taken out of my account, I received order confirmation number etc and then a minute after I went to my account and got message “refund is being issued” as  apparently  someone else has bought the item. I still don’t understand how they can take the money out, confirm the purchase and say item was sold to a different buyer??? I also signed up to be a prime member so that I get first access to items but the same thing keeps on happening. It feels like I’m being scammed and wasting my time. As a seller- really annoying process of items being put on the website- they are too slow to upload the items, they refuse the items for no reason then when you upload again with the same information they allow you to proceed. It’s just a ridiculous process. So for anyone who is looking to stay “sane” in this process I would probably say stay away if you can, however if you have some free time to spare then by a luck you will buy a nice item once in a while.","title":"Super slow service","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-08","author":"Mirela I","text":"The worst site ever! it's been two weeks since I've been asked to identify myself to receive payments of over € 3,000 from sales, but every time I try to verify my ID, their system doesn't work. I have written them dozens of times, I receive the same answer and the same e-mail. I want my money or goods back !!! I'll contact the police if nothing happens, it's not possible, thats fraud!!!","title":"The worst site ever","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-09","author":"Chi On Lai","text":"How green is VC? \nDespite VC emphasising they are promoting green fashion, they insist on 1 item 1 shipment.....why? \n\nI’m very familiar with DHL corporate rate fees, I’m certain VC makes a huge cut from the shipping.\n\nDisregard how rare a garment is, VC only want to sell mass, they keep pushing sellers to sell low.  By not combining shipments, not only VC contributes tons of shipping material waste, have a big carbon footprint....but also deceitful to all buyers.\n\nI don’t accept their lame excuse “avoiding mix up of shipment”.  If they have an outdated IT system? Then fix it.\n\nRealReal deals with tons of orders everyday, they have no problem allocating items, combine shipment & ship on time.   \n\nIn short, VC don’t care if you make a decent selling price, they only want to sell mass, make money from overcharged shipment & customs fees.","title":"How green is VC","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-11","author":"Meriam","text":"Vestiare Collective is a service that connects sellers and buyers. However, the customer support is not trained to deal with situations appropriately. I believe that there is lack of training and investment on something that should be the focus of the business. \n\nThe app recently gave a different information on what would be charged on the credit card.  Later, my credit card got charged with duties and importations that were not informed before. This might have happenned due to a malfunctioning of the app. I took screenshots of the entire process which demonstrated the system error and the VC support can't handle this issue which is an illegal one. Later I noticed that the issue was fixed but none was done to solve my situation.\n\nA customer agrees to a price and gets charged another and only later I was given an explanation on why. \n\nHowever, the click of a buttom is a contract between the user and the company. The price charged and the price that customer agrees on can't be different. Even with proofs, VC didn't solve anything on the customer end. \n\nI don't recommend the website because the customer can't feel safe to purchase. Its very complicated to go shopping online and don't have a third party that actually does its job. Its not secure.","title":"The customer is never right at VC. Poor customer service.","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-11","author":"Caroline Gamester","text":"Avoid Vestiare Collective! \nI haven’t bought anything but have sold and been worried when VC allow my items to be sold ‘direct’. Someone bought a beautiful beaded top from me then took a week to collect it ( at the time I thought this is going to be bad as I think they have changed their mind). I then get an email from VC saying the garment is non compliant. That beads are coming off the shirt. It was in perfect condition when sent wrapped in tissue in a padded bag. This buyer has clearly damaged the garment to get a refund. It is coming back to me but will be unsaleable. I was an ‘expert seller’ this is how we are treated. I have emailed and even spoken on the phone- a miracle!! But they are going to pay out this woman before i even receive the top back! Even eBay don’t do this!! They let you inspect the goods before issuing a refund. I have taken off all me items and will not use VC again. I am lucky this wasn’t the white  Armani  suit I  sold earlier","title":"Avoid Vestiare Collective","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"},{"date":"2021-05-11","author":"Zoe","text":"I bought a pair of shoes from VC, where I put in the promocode WELCOMEUK for £20 off. The system registered the discount, but when I completed the transaction, the discount disappeared and I was charged the full amount. I wrote the customer service and complained, and they refused to refund me the £20 that I was entitled to. They offered me free delivery in my next purchase, but that is (A) not the same as £20 off (B) completely useless unless I buy from them again, which given this experience, I won't be doing again. Especially as there is no option to cancel orders and get a refund on the platform, once they've charged you then it seems there's no way to get the money they've overcharged me back. With the extra charges from this (not to mention all the extra charges that are added during the customer journey for processing, expert checking and delivery that you need to diligently edit options to avoid) and dealing with their customer services who are polite but are unable to help beyond repeating the \"free delivery\" offer, I'm going to shop elsewhere from now on. It's a shame really, as I really liked the idea of this and their sustainability ethos. Shame there is a lack of honesty.","title":"Dishonest service - Refused to refund after they charged me full price despite discount code entered because of their system glitch","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=60&stars=1&stars=2&stars=3"}]