[{"date":"2022-01-09","author":"Joan Rice","text":"If I could put minus stars I would!\nTotal fraudsters. \nAvoid at all costs. \nCustomer service is appalling.  Repetitive emails stating they are investigating the loss of the handbag by the courier when clearly they have done nothing.  This has been going on for months. There is nothing to investigate.  I paid money and have received nothing.  A total scam.  \nIf I could sue them easily I would.  I am looking into that now. \nI will also look at posting negative reviews on all social media channels I can access in an attempt to make them look into my case and issue my refund.  It is theft to take payment \nand provide nothing in return \nJoan Rice","title":"Fraud","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-09","author":"Kaśka JL","text":"Couple of weeks before I bought an item, paid for it and was waiting for authentication and delivery. I got an info on my VC profile that the item had been delivered even though no parcel nor any info from shipping company was sent. Its been now 4 weeks since nothing had happened. No parcel at my place nor  refund was made. No one answering my complaint emails neither. Never met such a poor customer service and what’s more looks like a crime.","title":"Never got thing I bought or refund for it. Couple of weeks before I bought an…","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-09","author":"Emma ","text":"The worst customer service & so many problems recently as a seller. Items going missing, not being paid & VC holding payments for no reason. \n\nI won’t be listing anything new until problems get sorted out & sellers & buyers have proper protection.","title":"Avoid selling due to too much hassle","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-09","author":"Kate A.","text":"The mark of a decent organisation is how it responds when there are issues. I've bought before from VC and had no problems but my most recent experience has put me off ever buying from them again.\nI purchased a coat, which, on arrival (having swallowed the extortionate shipping and duty costs) had clearly been taken in at the sides.\nI raised a complaint and sent it back, only to be told that, in their opinion, the item met the description. It didn't but I have no further recourse so now I either accept them selling it, minus the duty charge, the shipping AND their fee (which means I'll be lucky to see half of what I paid), or have it returned to me.\nIn order to get it returned you have to make the request within 24 hours. And that requires that there's someone their end to speak to. I've been on their Chat for the last hour, being promised that \"waiting time is less than a minute\" so who knows if I'll ever see the garment again. \nMy impression is that they've grown beyond their capacity to manage their inventory and are taking their customers hugely for granted. I'd rather take my chances with eBay in future - at least buyers have some protections there!","title":"Avoid, avoid, avoid. Buyers have zero protection","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-10","author":"Kate O","text":"Since VC started using Hermes Courier to deliver Direct Shipping sales within the UK, it's all gone wrong. They used to use DHL which was stupidly expensive, and I can't count the number of times I responded to their surveys asking them to use Royal Mail in the UK. Hermes is dire and I currently have two VC parcels which they have failed to deliver. Hermes is a bottom of the barrel courier and not in line with the luxury image that VC aims to portray. I give their use of Hermes in the UK another 6 months before they realise, like everyone else, that it's not worth the hassle. Vestiaire Collective - please move to Royal Mail or at least back to DHL for UK domestic direct shipping sales!","title":"Wish that VC would STOP using Hermes for UK Deliveries","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-10","author":"MO","text":"DO NOT USE. Purchased an item that clearly states it was located in the UK and have now received a large bill from DHL for import duty. Contacted them via the chat function and was not not properly listened to and then my case closed without a response. Cannot get in touch with them by any other way\nOrder number-45704485","title":"DO NOT USE","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-10","author":"Laura","text":"I used to like the marketplace, but lately the buyer fees for shipping have skyrocketed. First to 8 EUR and now already to 13 EUR in EU, it’s not worth it using this marketplace anymore.","title":"Skyrocketing prices of shipping","stars":2,"location":"CZ","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-10","author":"VC","text":"I sold the items REF#17774449 and REF#17778498. Both were shipped, received by the new owners and accepted. I am really tired of endless conversations with the chat of vestiare collective that does not really help. The only thing they do is to send an email every now and then saying \"we have not forgotten you, we are looking into the issue, we will get back to you in three days\"...... but they do not get back in three days... when I ask in the chat I get vague answers... I just spent one hour in the chat and guess what \"we will get back to you tomorrow\"\nWhen I read the reports it seems to me that VC is making a lot of money by not paying the sellers...................................................... I am not the only one reporting this, just read the other opinions below","title":"After months I haven't been paid for two items I sold","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-11","author":"Ella","text":"I was a very happy vestiaire customer, buyer and seller, till my last experience. I sold to the same person two very similar items from the same brand and when she decides she doesn’t wanted  the one of them, she claims her doubts about the authenticity of the one of them. I was 100 per cent positive for my item’s authenticity (as I bought it from the original store by my self) and I was waiting for the (positive) assessment of vestiaires specialists, all thought my item it’s hard to authenticate because it’s not by some universal brand. When the specialists assumed that the item is fake, I was really surprised and  I got in touch with vestiaire but they seemed unhelpful and I had to pay 12€ to get it back ( an item -brand new- costs around 350€). I was really disappointed and I strongly doubt the experts services.","title":"assessment","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-11","author":"Beth","text":"Why are vestiare asking me for my personal information such as my driving license or my passport so I can gain a refund????? This is completely unethical, this is the 2nd parcel that hasn’t arrived and has been lost it took me a month last time to gain my refund back! Now i can’t even log for a refund apparently until I give out my private information! \nYeah sure here take my personal information so it can be sold on the dark web and I can be cloned 100 times over sure take it! I’ll bend over as well shall I! This company is a damn joke I swear it’s a front for something else! Why in the world would anyone want someone’s driving licence or passport to give them a refund! It’s a joke I just want my money back then I will close my account. \nYou don’t need any of my private information to reverse a payment. \nGIVE ME MY MONEY BACK","title":"THEY WANT MY PASSPORT!!!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-11","author":"Bonnie S.","text":"I wish I knew about how horrid this website is before I sent my vintage Celine to them. My item sold so I shipped the item to Vestaire, although they reported a fault to the buyer which was not accurate, so the buyer cancelled! Now they sent my item back to my OLD address !! Customer service is horrid, they palm you off, take 6 minutes just for a yes or no reply! Their spelling is horrid, I don’t know where they found these people as a 3 year old can probably type better !! I’m now being told there’s a investigation at the moment regarding my return, but by when they investigate this, my item will be delivered to wrong address & DHL refuse to redirect parcels unless you’re the sender. DO NOT USEEEEE THIS PLACE !! SELL ON EBAY !! OR ANYWHERE ELSE !!!\n\n—- REF 16612002 FOR THE ITEM.","title":"I wish I knew about how horrid this…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-11","author":"D Bullas","text":"I am owed £157.50 from the sale of my bag on 18 Dec and the alleged process of my payment on 22 Jan.  I did not receive payment therefore I shipped my valuable bag but have not been paid for it.  I have instigated numerous on-line chats and emails to Customer Services and am getting nowhere 3 weeks after payment was allegedly made but “stuck in the system due to a technical error’!!.  I was also told the exceptional circumstances need to be looked into and I am constantly fobbed-off by generic holding emails.  The bottom line is they have not paid me and whatever problem they have at their end is not my concern.  This is despicable business practice and I will seek legal action.  I will never buy or sell via this site again and warn others to stay clear of it.\n\n18 Jan - review edit: Well isn't it amazing that I get a response from Vestiaire Collective on a public review site but cannot get a response from my numerous (c. x20) emails communications to Customer Services and the On Line chat facility involving x7 named operatives!  They all continue to ignore my pleas to be paid and neither have they responded to my emailed proof of not being paid - I attached the relevant bank statement and bank account screenshots of incoming transactions over the expected payment period.  During one of my communications with on-line chat, one of the named operatives apologised that my payment was “stuck in the system due to a technical issue” - so what is their story?.  I have not been paid.  I am owed £157.50 for for sale of my beautiful Alexander Wang bag.  The buyer has the bag and Vestiaire Collective received the payment from the buyer but I - the seller and Vestiaire Collective’s ‘bread and butter’ - have not received my due amount of this business transaction.  It’s appalling how much time and effort I have had to put into trying to get paid.  It’s impossible to speak to anyone on the phone so they hide behind e-comms. \nI hope my appalling experience of Vestiaire Collective is a warning to others.\n\nFinal edit\/update - on 31 Jan I was eventually paid the money owed to me since 18 Dec but only after numerous further pleas from me to the On-line Chat facility.  The operative sent me a screenshot confirming payment to the (wrong) ex-bank account which in fact clearly stated ‘Status - De-activated’ but VC still would not accept they hadn’t paid me (no further mention of the monies ‘being stuck in the system’).  I had to ask Tesco Bank to write a letter to me confirming no payment had been received, which I scanned & sent to VC.  A week later - after I’d chased up an acknowledgement - VC asked me to delete my (correct) bank account details and re-enter them, even though they had paid into the correct bank account since 18 Dec for a 2nd sale.\nI’ve had no unsolicited contact fro their Customer Services nor an apology. \nI’ve now cancelled my account with Vestiaire Collective.","title":"I am owed £157.50 from the sale of my…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-11","author":"Audra Susinskaite","text":"i received this email 1st of december (below)\nit has been almost 1.5 months, i still do not have money in my account... every time i write an email, i get answer from another person, who doesnt bother to read the history of conversation...  \n\n\nIn regards with what happened, receiving an incorrect item from the buyer, we'll ask you to shipped the incorrect item to us (in our warehouse). Rest assured that the amount to be transferred as your payment is the amount for your sold item Burberry Large pants with reference number of 18975740.\n \nAttached is the label you can use to shipped the 2 pairs of Vera Moda jeans.\n \nWe sincerely apologize for all the inconvenience you had. Certainly not the kind of customer experience that we want you to get. We truly appreciate your patience and cooperation.\n \nIf you have further questions regarding on this matter, please don't hesitate to respond to this email.\n\n \nAll the best,\n \nAnna Marie from Vestiaire Collective","title":"the buyer returned wrong item","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-11","author":"Jane","text":"I am done now after 1 month and 10 days.\nI give up. I have not received my 2939 euros yet from a sale I made in end November. VC claim that I owe them 291 euros and they will not transfer my 2939 euros before I pay them the 291 euros. I have now yesterday paid the 291 euros to VC they have already received them today into their account so now I dont know what VC will use as an excuse for not paying me the 2939 euro that they owe me now for over 1 month and 10 days.","title":"I am done now after 1 month and 10…","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-12","author":"Girl Eyyy","text":"BEYOND UNPROFESSIONAL WEBSITE, I cannot tell you enough how bad this app is! The VC helpdesk doenst do ANYTHING! Nothing! If something goes wrong (which ALWAYS does) they won’t help you with anything, also the app is filled with FAKES and the authentication team is a literal JOKE!","title":"BEYOND UNPROFESSIONAL WEBSITE","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-12","author":"D. L.","text":"Total scam..\nI sold a bag, the shipping was from Germany to France. As it arrived in Paris the UPS tracking said the order was canceled by the buyer (I contacted the buyer and he said he never canceled..). However here comes the problem, bag was supposed to come back to me.. After a couple of days I saw that the UPS tracking was updated to deliver to the seller, but it was not deliver to me (it was address in Saarbrücken, i live far away from this city). I contacted the support, the worst support in the world, wrote 20 times with them, exchanged emails, sadly for me send them my ID (which is so stupid from my side..). They wanted also handwritten statement?! and all sorts of other documents.. After a month I received an email, stating that they spoke to UPS and the item has been delivered to me a couple of weeks ago, I have updated my shipping address to Saarbrücken.. Talked with UPS about the issues and the adress in Saarbrücken, to which my item was delivered is a warehouse from Vestiaire Collective.. Haha\nP.S. IMPORTANT In one of my first chats with them they stated they don't have a warehouse in Germany and it is supposedly warehouse from UPS (another lie from Vestiaire). In my last chat with the support, after I told i will sue them they said that if the item is received in their warehouse in Saarbrücken they will send it back to me. They think their customers are stupid or something. When I confronted them about this lie they said it is brand new and they just opened it.. What a joke. \nVestiaire Collective GmbH\nLebacher Str. 4\n66113 Saarbrücken\nGermany","title":"Total scam.. Don't use it","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-12","author":"Carmel Bell","text":"This company is the worst I have ever dealt with. Their 'verification' process is ludicrous. Seriously, if you have any need for customer service or assistance, don't try. I will never use this company again.","title":"This company is the worst I have ever…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-12","author":"Roxana Merlas","text":"I am a buyer \/seller for many years .\nThey disappointed me many times.\nFirst of all you don’t have someone to talk to (at least an email adress).\nI bought a bag ( verified and sent by them) few years ago ( 8343320 7\/10 \/2019) . Now I wanted to resale it and they refused it because of its authenticity. What ???\nHow is it possible ? I have everything written in my account ( my orders)\nI wrote them and no one answers.","title":"I am a buyer \/seller for many years .","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-01-12","author":"Joe Dancey","text":"Purchased a fake jacket authenticated as real, sent 4 emails about it and was ignored for 10 days. Finally got a response to my in depth email with full pictures comparing it to an authentic version in full detail. They said they would send it off for a second authentication, it was marked as authentic(wrongly) and automatically listed for sale again on my page? I deleted it for sale when I realised but somehow it still sold to a new buyer - passing a fake on when I tried so hard to just get a refund. It took to me writing a lengthy complaint on their Facebook page to finally get them to accept it was fake and refund me - plus get the new buyer to return it and finally - deal with the original seller of the jacket. All in all TERRIBLE plus their authentication is nothing more than rubbish greenwashing to look good. The whole thing wasted about 4 hours of my time and I was never given an apology (I had been a very regular customer of the site up til that point)","title":"Purchased a fake jacket authenticated…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=24&stars=1&stars=2&stars=3"}]