[{"date":"2021-01-09","author":"Afia","text":"Ordered a bag which was worth quite a lot however the delivery company has handed my delivery to someone else  which shows very clearly on the delivery picture. I have requested them to resolve the issue as soon as I relieased they told me to wait 24hours. As I clearly can see the delivery was left with someone else I wasn't willing to wait and raised a dispute. As it stands I'm still waiting for them to come back to me. I sent my id and a form back I have emailed a few times but I have had no reply. Such poor service its upsetting enough, I am not in receipt of my order and not get a reply back is worse.","title":"Missing order","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-10","author":"AF","text":"They are not reliable as an authentication website. I have sold and bought many items with them over the years, but the quality of the service is ramdon. Many people have reported buying items from them and, when they tried to resell them, they were classified as replicas. It happened to me, once I tried to sell a Balenciaga jacked with them, which a friend had bough there. They refused the jacket and said it was not authentic. I was shocked that my friend had done this to me, innocently believing on them. So, I sold the jacket very cheap to a friend, as I thought it was a replica. My friend went on and listed it on VC herself, sold the jacket there, it went through the certification process and declared authentic. I lost then my beloved jacked and thousands of pounds because of them!! Another time, all my items were being refused and I thought it was strange, as I knew they were genuine. I contacted the customer service and they told me that there was a problem with my photos, as they were too professional, like professional brands. Thus, they thought that I had stollen them online. This looks like a prank! I have good photos because I am a professional and have good equipment. Anyone that knows about photography, knows how to check the photos and verify if they were stolen online or not, as photos came with settings, which professionals know how to authenticate. If they do not know how to do the job, how come that offer that service?! More recently, I had another experience even worse. Last summer I sold a Gucci clutch on their website, item 11173740. The bag went through the authetication process, declared genuine, but there was a small fault, as the clutch smelled to perfume. They proposed to reduce the price of the item and send if to the buyer. I refused the proposal, as I prefered to have it back. They clutch was returned and later on I listed it again. The same item was sold on VC, item 11719601, some weeks ago. But, guess what, this time considered non-authentic. The same item!! I contacted them by chat and was told that it was difficult to authenticate that item; they were unsure, so, they had refused it. Firtsly, I would like to know how come that the same item was accepted once as authentic and second time as non-authentic. Secondly, if they would be unable to authenticate an item, why not be honest and tell that both to the seller and buyer. I may understand that they would not sell it. But, if they do not know if it is authentic or not, then, they cannot also classify it as replica. I no longer have the receipts of course, as the clutch was offered many years ago. But, as a consequence of their lack of knowledge and unfair policy, I lost my expert seller status. I have sold 170 items with VC througout the years and only had one problem once!!","title":"Same item declared as genuine and later on replica","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-11","author":"E E","text":"I don't know any other platform to buy and sell preloved items with authentication and ships to my country so VC was my only option. \n\nI recently purchased a Dior Book Tote labelled 'very good condition' and seller noted no defects. Upon receiving, I found an orange stain on the bag which was not stated in the description and obviously missed by VC! They sent me a very generic response stating they are sorry and they will do their best as not to let it happen again. \n\nAbout 3 weeks prior, my cousin ordered a Gucci Marmont bag which was \"brand new\" and listed the condition as great. When she received it, she found three dents + creases on the bag which were OBVIOUS. When she brought it up, VC basically copy and pasted the same response of being sorry and ensuring it will never happen again. \n\nI sent a screenshot of the email of the response my cousin received to them to say that they let the same problem happen again, and to me. After that they apologised to state that I can send the bag for cleaning and they \"might\" refund me the cleaning fee. I said that I needed a guarantee for this cleaning fee and a \"might\" would not suffice. Again, they apologised to say that they can't confirm it..... what a sloppy company. How is it that they missed so many defects? And refuse to do anything about it. It's evidently their faults for overlooking defects\n\nOn a less important note: the seller told me that the Dior Book Tote came with the dustbag. When I received it, it had the VC dustbag instead which I was sooo disappointed with. Maybe it's my fault for not making sure but I also think the seller should've been more transparent stating that it wouldn't be the original dustbag and VC should have also confirmed with me if I was okay with it being a non-Dior dustbag","title":"VC missed sooo many defects","stars":1,"location":"MY","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-11","author":"Lucy","text":"I had previously bought a bag from them and the process was very smooth without any problems. I bought another item from them and had to relist it since they don't accept return and the process was fine except they took commissions out of the sale when they claimed they wouldn't for relisted items. \n\nThe real problem happened after I purchased a Dior clutch through direct shipping and the purse looked very different from the pictures. So I raised a dispute to return the order to get a refund. The following two weeks became hell ... I went back and forth talking to their support agents through in-app chat service to get a coherent answer on how the refund process works. One agent told me to send to the seller directly whilst another told me to send it to their France hub because of Brexit! Brexit?! I was sent two emails from VC telling me two different timelines of handing the refund and when i reached out to them again they changed the story one more time. \n\nNow I don't have the purse nor the money - same goes for the seller. Their online agents seem to be trained to make up stories so that you can get a satisfactory answer so that you can give them good reviews and leave them alone. But things never happened as they had promised in their chats ...\n\nI have now raised a dispute with PayPal knowing they will never give me a satisfactory answer. Always use PayPal for things like this!!!","title":"Worst customer service that makes up facts to get you off their back ...","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-11","author":"Chin Michelle","text":"This is the second time I leave a comment. \n\nThis time the curation team and expert team needs to be fixed. \n\nCuration team:\n- I’ve been trying 20 times to sell my Hermes 24 mosaic tea set with four tea cups and a tea pot. This was so unsuccessful as the curation team felt that the items were fake or not suitable. meanwhile a girl I was following managed to sell hers. Such blasphemy! \n\n- I tried to sell a Chanel blouse that\nI never use. Again VC’s curation and expert team thinks it’s fake. Even when the item was a NEVER WORN ITEM purchased from VC. \n\n-  I recently sold these Manolo Blahnik boots that I’ve worn once. The RRP was 1,4K euros and the expert team proposed me to sell it for 150 euros. \n\nThe Expert Validation Team: \n\n- recently I sold a paris-Edinburgh Chanel jacket which retail price is 3-4K euros. And I was accused of the wool being felted. I was forced to sell the item for 600 euros. A CHANEL ARTS AND METIERS JACKET FOR 600 euros. Is this CLAUDIE PERLOT? Or zadig and Voltaire. On top of that the item is not even felted at all. The jacket has a unique texture due to the Scottish vibes. however I don’t know what 18 year old fashion intern is working on this jacket. And just accused it as GOOD CONDITION. If it is good condition instead of very good, do you think I would\nnot have mentioned it. Since the buyer wanted the jacket so badly I accepted it begrudgingly. \n\nAnd for the record, I’m not one of those sellers that fake about an item that’s worn as not worn. So many buyers have written personal messages to me saying how the stuff I sold to them made their day. \n\nPlease fix this. You guys are growing a company. But if you grow too fast\nToo soon. At what cost?","title":"LA HONTE 2eme partie","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-11","author":"A. W.","text":"On 16.12.2020 I bought a Mont Blanc Business satchel Ref. 13380097 from Christopher[at]andrewboyles, Kanada. Short after he sent me the fedex tracking no. 980707310006407. By following the tracking no. I could see that the satchel received Vestiaire NY on 23.12.2020. But, on 26.12.2020 Vestiaire informed me that the satchel would not be available anymore. Sending the screenshot of the tracking development with the confirmed receiving at Vestiaire NY on 23.12.2020 to the support they told me that the selller (Christopher) canceled the delivery and the given tracking no. would not be the one for that article. On 28.12.2020 Vestiaire backordered my payment and spent me a voucher about 15 EUR.\nToday, 11.01.2021 I received an email during work that the article would be available again. Checking the issue after working (one hour later) it was exactly the identic satchel offered by the identic seller and just sold a half hour before! Means, instead of informing me before they did both in one time: informing me that the satchel is available again and offered it online on their pages. Not enough, I checked my account and found the official receiving of the satchel at Vestiaire NY on 31.12.2020! The authentication was made by Vestiaire NY on 04.01.2021! Obviously not conform! (Screenshot made!) But just sold with the identic criteria’s like one month before!\nI have never experienced such a badly business before. Whatever “customer” means to Vestiaire, it is definitely not identic to a regular customer’s identification.","title":"Customer? Service? What?","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-11","author":"V","text":"I have 2 separately orders . After checking the fotos, I found one of item may be fake (I have done a lot of researches). I took contact directly with customer service to asking cancel the order, they replied that it was too late (Even the seller had not yet sent the item). \n\nThis item has arrived the hub on 1\/11 and at the same day it has been controlled and accepted.  ......\nMore importantly, the seller of this item is NOT a professional seller, so I can not do the refund. \nWell, if this one is fake (because I have an autentisk product to compare with), I do have the right to do the refund, but it seems like they try to make difficult to the customers to do the refund, wired and unprofessional. \n\nThe another item, seller has not sent it within 7 days, it has been 9 days now, I took contact with customer service three different time, first both of times they told me I will soon receive a cancel confirmation and refund automatically but it has not. \nThe third time when I asked for the cancel confirmation the customer service said it takes 15 days to officially cancel the order!!! She said: sellers have 7 days but they will confirm the cancel confirmation efter 15th day! but WHY?\nWhy you want to make things more difficult?????\nOn the website, it says if the sellers have not ship the item within 7 days, the customers will receive the refund and cancel confirmation automatically, but on the order history the order is still not cancelled!\n\nWhen I constant asked her: \"so this order is actually cancelled but not really \"official\", I need wait for 15th day.\" And she was not 100 procent sure about that! Just keep telling me do not worry. \n\nWell, I do worry! It has been 9 days! I want my money back! The order should be cancelled! Company keep saying we are willing to help you blablablabla! And they do not take customers serious, they just want make money.\n\nBIG BIG BIG disappointed at company, they say the purpose of this company is that they sell real vintage on the website for reduce unnecessary consume and defeat the counterfeit but it is absolut on the contrary.\n\n\nUpdate: 01-13-2021\nI received a mail this morning, and it says that he will REMINDER the seller again(!?) Even though it has already been 11th day now, the seller has no right to send the item but he will reminder my seller again???? \nI talked to customer service again because he did not at all reply my mail, the customer service said \"the seller CAN still send me the item\"! And when I asked why it says it is 7 days on the website? She can not answer me this question but only keep saying that \"Because we can still receive the item from seller within 15 days\"!!!!!!\nI keep asking her but she just leaved the chat room, what a wonderful professional service.","title":"Efter 11th day they say seller still has right to send!!!!","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-12","author":"Customer","text":"This is a joke of a company. They don’t know what they are doing and they have false information on their website.\nOn theirs website currently still saying no changes for Uk to Uk sales, whereas I was surprised when I received a text from dhl that I need to pay £688 VAT for my item to be delivered! Vestiaire says well we didn’t know and we were surprised as you are ! Ha! What???\nSo basically pay up or we relist the item on your account! Did I authorise you to relist the item on my account?? How a company can behave like this??\nAnd from this morning they have closed the customer support email. They already had closed their phones!!\nGood luck to everyone who had anything to do with these fraudulent company.","title":"This is a joke of a company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-12","author":"Lara","text":"FRAUDULENT COMPANY STAY AWAY!! THEY ARE USING THE NEW BREXIT RULES AS A DISGUISE TO STEAL EXTRA MONEY FOR FAKE FEES THEY CLAIM THEY MUST INCLUDE!! FAR BETTER SELLING APPS OUT THERE SO SWITCH!","title":"FRAUDULENT COMPANY STAY AWAY!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-12","author":"Tina Cholla","text":"3rd Bad review for Vestiaire and the last time I use this app. \n\nI listed 2 items for sale. They sold pretty fast, I’ve send everything out and the person received the items. On the app it says that the payment has been received... guess what ... I didn’t receive anything !!! So conclusion 1) Vestiaire took my items, 2) sold them, 3) they made there own profit so they are happy with this & 4) finally they haven’t given me my profit even though they made their profit!! \n\nI am taking with the team... always this imaginary expert team needs to contact us back which they never do!!! \n\nREALLY GUYS NEVER USE THIS APP:\n1) horrible service \n2) miscommunication \n3) they make profit for Vestiaire and they don’t give a damn if they give you your money or not  \n\nI need my money and I am going to delete the app for good","title":"3rd Bad review for Vestiaire and the…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-12","author":"Y. Fang","text":"I am very disappointing about how the company is handling the Brexit situation:\n- they haven't communicate about the extra custom fee for goods going between the UK and EU region to the customer ahead of the changes being made. \n- I've due to receive my item on 11\/1\/2021 but have been told my parcel is being held at the depot because of outstanding custom fee. If I knew there are extra fee needs to be paid, I would not purchase the item at this price or otherwise negotiate a different deal. \n- They have not updated the technology to make sure that the correct charges are required and handled at the time of purchasing the item, hence caused the surprised custom fee required on the customer upon receiving the parcel, like my case. \n- their customer service does not know what to do, or find a suitable solution. the only words they can say is 'apologies' and asked me to re-sale it after receiving the item and paid for the custom fee. but there is zero compensations to the customer. \n- overall, bad customer service, poor communication and technology has not been corrected to reflect the change in time. I will have to avoid this website and use alternative instead if this is not improving.","title":"bad customer service, poor communications","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-13","author":"Eden","text":"I will not be using this company anymore to sell items of clothing. Their customer service is terrible. I tried to loin to my account recently and was told my email was 'not recognised'. I have contacted them on chat 3 times and emailed them about 5 times. They have no idea what the issue is and keep telling me they are passing it over to an 'expert.' I haven't been contacted by the 'expert' yet even though I have chased daily. I am now unable to sell anymore items as I can't access my account. They also take a huge cut in the profit. There are better companies out there which you can use to sell your items of clothing.","title":"I will not be using this company…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-13","author":"Georgio Chevalier ","text":"One of the worst companies   \nAs a seller I sold with them a Hermes buckle. \nI contacted dhl to pick up the item as they were very late though few minutes after they picked it up I saw that the sale was canceled. \nI instantly called them and they told me that as long as it was only 20 minutes after they picked it up the item. \ntheir courier can bring it back to me \nNext day I called them and they informed me that the parcel is with the courier on the way to me. \nSame thing they said few hours later\nAt the fourth time though a little before they close they informed me that the parcel is at the airport and that they might did not saw the notification \nI contacted Vestiaire and they told me that as long it was DHL's fault which is their partner they'll send the item back as soon as they'll receive it at their own cost. \nFew days after they got the parcel I contacted them again and they told me that the item was safe and soon they'll get me the tracking number. \nFew days after though I got an email telling me that that have been unable to verify it's authenticity so I have to pay 12 Euro for the return cost \nWhen I contacted them again and asked them if they mean that the item is not Genuine and asked for the specific reason they disconnected twice. \nI do believe that they just try to make and excuse for getting the 12 Euros which is lame. \nIt's not about the money it's about how they try to make profit even at their own faults.","title":"One of the worst companies","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-14","author":"Anna","text":"Is Vestiare facing financial problems? I sold a LV shoulder bag on 8\/12\/20 and was advised that my payment would be received on 16\/12. I did not receive my money. I was then advised that payment would be made on 23\/12, then 30\/12, then 6\/1\/21, then 13\/1 and today it says 20\/1! I have had endless chats with Leo and numerous account specialists, each of whom promise to refer the matter to their elusive \"Expert\". I am still waiting for feedback from the \"Expert\" and nearing the end of my tether. Can anyone help me get my money back from these people?\n\nThe situation is not resolved. Your response is a standard template!😡","title":"Is Vestiare facing financial problems?","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-14","author":"Laura ","text":"I have used the site a few times to buy and sell a few items. So far out of my buys 1 was with an issue but after significant back and forth it was finally solved but from my few sales I am still engaged in a lengthily never ending battle via chat with a poor customer service team (today was my 3rd never ending pointless chat) that instead of fixing my issue and apologizing for the delay on my commission payment keeps telling me I need to wait further. Long story short I sold an item, mailed it to the hub, they got it December 21st, confirmed all good and it's Jan 14 and I haven't been paid to date.","title":"Poor customer service","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-15","author":"Cs","text":"The customer service is ABSOLUTELY HELPLESS !\nand rather than apologizing for not being to help they kind of push the fault on you\nIf things work fine it’s a great concept \/ but if you have an issue be prepared to spend hours solving the problem yourself as they simply dont help and won’t even have a phone number to talk to someone.","title":"customer service extremely bad…","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-15","author":"Bcute Bbut","text":"I sold Christian Louboutin boots that have brand label. They said it is not original. As well as the product with the label. When I object, they say we do not review again. Your experts do not know the brands! They can't check authenticity! They know nothing! \n\nI also sold Louis Vuitton Neverfull GM and they said \"there is a smell\". Smell of storage..... They gave 150 dollars less money for what was in their warehouse. It was not my problem!! THAT IS NONSENSE!","title":"Their experts know nothing!!!","stars":1,"location":"TR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-15","author":"VR","text":"Saga continues with VC claiming the parcel has been located and at my disposal at Ups collection point\nI went to the collection point . They DO NOT have the package. They have looked three times into their pile of cartons ( which incidentally looked like a garbage bin) and ended up with concluding it’s my mistake and I should contact UPS to enquire \nThis is an absolute joke of a service \nI am wasting my money and my time , and in addition now risking my health going to a pickup point that let half a dozen people in at the same time , without masks in the middle of lockdown \nThis is an absolutely scandalous , shocking service and nightmare handling of a situation ongoing for 6 weeks","title":"Saga continues with VC claiming the…","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-15","author":"Sela","text":"Vestiaire will soon go out of business! Everyone switch to selling your items on Depop or Vinted or Ebay. Vestiaire is a fraudulent company. They are overcharging on customs and imports and their team is clueless and has no idea what is going on. They are also very rude!! Stay away from the terrible company and sell elsewhere!","title":"Vestiaire will soon go out of business","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"},{"date":"2021-01-16","author":"Tasha Roman","text":"20% Import tax levied on sales for UK buyers! Beware. I aborted a sale and I suggest all UK buyers do for any purchase made from the EU.","title":"20% Import tax levied on sales…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=80&stars=1&stars=2&stars=3"}]