[{"date":"2022-04-27","author":"Kate Evans","text":"Thank you,  'Dianne' for the third email, a duplicate of the first two informing me that you are looking into the issue......  emails dated 3\/3. 4\/4. 27\/4 \nPlease don't contact me again until you are prepared to refund me, as that is the proper, honest thing to do. Honesty...... there's a concept.....","title":"46 days and counting","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Olga","text":"Fast delivery, but don't trust their authenticity control. It seems to be another way to charge extra $15. I received a knockoff and I'm surprised it passed the authenticity control (product id on the tag is for a different item, material composition tag doesn't match the item's materials, brand tag doesn't match the brand on the hardware, etc).","title":"Authenticity control is bogus","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"CAROLYN  M.","text":"I have been buying and selling on Vestiaire for quite a long time and most of the time things run smoothly, however lately it seems they have been getting worse...especially where customer service is concerned. If you have an issue there is no human available to speak with, no telephone #. You have only 2 options one of which is \"live\" chat., which is really not live but rather some robotic response based on your key issue but not really dealing  with specifics. You can also send an email and hope that someone responds within 24hours. I sold a purse early this month and have been waiting for the payout for several weeks now. No one can explain why I have not been paid (it was supposed to be sent 11 or 12 April) . Their response is that they will forward my inquiry to the relevant department (and wait another 24hrs)! It should be easy for them to determine whether or not there has been a payout on this sale...yes or no! Why must I wait weeks for this to be resolved. I am very disappointed with Vestiaire these days and hope they get it together. They are no longer the only game in town!","title":"Customer (No) Service","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Delia","text":"Usually I sold really well with vestiaire, but this time, after i made the sale and was supposed to receive the money, i was informed by vestiaire that there was an issue with my item. I have been waiting for two weeks and nothing from them. In the end, I contacted the buyer who said that she didn’t report any issue with my sold item, but with another one. We both contacted vestiaire to tell them that they made a confusion and finally today I got a confirmation from them that the payment is on its way. No apologies, no nothing.","title":"Usually I sold really well with","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"mary orourke","text":"Seller cancelled after money after sale agreed and paid for\/money taken from my account  -all within space of 20 mins. I buy from another used clothing website (rebelle) and that has never happened when purchasing from Rebelle. Vestiaire gave €15 voucher so thank you for that but it does not make up for disappointment.update: seller responded to request that I repurchase as they are not able to fulfill 7 day delivery. Fair enough but as I’ve already paid I’ve to await a refund and then repurchase - a simple transaction has become unnecessarily complicated.","title":"Seller cancelled after money after sale…","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Saeed Aldosari","text":"I bought an item from Vestiaire. It has been 30 days now without receiving the shipment. Their customer support is bad they never give you real update. I contacted them 10 times and I always get the same reply from the customer support without any result or without follow up from the expert team by email.","title":"Bad Customer Support","stars":1,"location":"SA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Tracy Steel","text":"I bought a gucci belt that was advertised at 95 cm but it was 120 cm. They won’t refund me even though I have returned the belt and told me I have to sell it myself. I paid £15 for the vestiaire checks to be done and they obviously didn’t measure it. \nSo I now have no belt and no money. They have both. Robbing company who can not be trusted.","title":"Complete con artists.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"Emma H","text":"Total rubbish. The app looks good and works well, but customer service is total garbage. If you are a buyer, there are lots of choices on the app and it's easy to purchase something - but god help you if you have any issues with your purchase, or indeed even any simple questions about your account! They seem to make it so difficult to speak to anyone. \n\nI am unsure whether the advisors are even trained to help because they seem oblivious and only really share prewritten auto messages and then they will say that they'll email you, and they do, but it takes days to hear anything. From my experience when they do finally get in touch via email, you go around in circles trying to explain what the issue is because they seem confused and oblivious. It's easy to get hooked because it looks like there are lots of great things to buy in one place, but compared to an app like eBay (whose customer service is exceptional) this is really really scraping the bottom of the barrel. It can become quite frustrating to try and get answers to simple questions as a buyer or seller. Avoid - it's not worth the hassle.","title":"Total Garbage - Customer service is rubbish","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"Eva Galicz","text":"It is the second time that Vestiare lost my item! I have sold an item  last year, and i had to wait more then 6 months for the payment. Not too mention the waste of time with customer service and the totally useless chatting system. In fact i was hesitating to keep my account but i have decided to give an another chance. I have sold an item on the 10th of april. It has been told i will be paid 4-10 days. I have not been paid, my item gone missing and nobody is able fo tell me what is going in. I have contacted customer service 5 times. Last time it has been told i  will gave an email with the solution.  I wint reccmment to sell on Vestiare unless you like to work for others not only for free , but actually for loosing money!  You will have to chase  your item and \/ or money and you will need to deal with a customer service sho can not and do not want to help!","title":"The second time vestiare list my item and doesn’t pay!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"Karen Forde","text":"Very disappointed in vc in the last few weeks. several mistakes made in my account and customer service have been very unhelpful don't know if it's a language thing or they are not up to the job either way not impressed","title":"Very disappointed in vc in the last few…","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-04-29","author":"Kate Evans","text":"48 days and counting. No further forward..... I sent the parcel in good faith and Vestiaire were paid by the buyer. Something lost in translation, or does it just translate into a bad way to do business. Watch this space.....","title":"48 days and counting","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Mandy F","text":"VC are not authentication experts, be aware they reject authentic items as fakes despite proof of purchase, customer service is terrible it is impossible to talk to anyone who knows anything besides a BOT or standard answers.","title":"VC are not authentication experts","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Raffaella Petrini","text":"This was my first order with Vestiaire. The package was supposed to be delivered to Urban Diamond shop a delivery point in the centre of Luxembourg. The courier wrote several emails stating that the order was arrived at the shop and hurry up to collect, I have been 3 times to the shop and they were not able to find my package and the pick up number or name did not come up in their computer. I paid for the shoes on Vestiaire but did not get the parcel.","title":"first order with Vestiaire","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Mrs Gabeva","text":"Have not written reviews in a while, not because VC permomance has improved. Just the opposite, the downfall is epic. It is not worth the time to keep exposing them as in return automatic answers are received, which do not resolve the problem  in 95 % of the cases. They are either “terribly sorry”, or “looking into the matter” or “reserving their rights” (mainly to keep doing their endless scams). So, yes, waste of time.\nBut, could not help but share the last emanation of “professional knowledge” and “fashion literacy” - two things that VC is severely lacking.\nI listed an item, Chanel dress, item Ref 22742312, which took them 4 days to approve the listing, ok, lets say they are super busy … but what they did is to change my item description, deleted the very important information that this dress is from the Cruise 2014 collection and even had the impertinence to list the item under “vintage “ category.\n\nFirst, “dear” VC - 2014 collection is not vintage.\nSecond - you either know that and unlawfully delete truthful information and put a wrong one which is unlawful and  is against all claims how “properly” you display information on your platform.\nThird - maybe you actually know nothing, your fashion”experts” are self-proclaimed, have zero knowledge of collections, products, and are just given the freedom to randomly pick and choose how to display certain items depending on their mood or personal biased preferences . Utterly disgusting.\nAnd yes, vc, i know that you can “detain your rights” but does this include providing  wrong information and misleading your customers?! Just because you control your platform? I do not think so. Lying is not considered a right, it is considered an offense. But, in the world of VC all kind of wrongdoings are acceptable and highly tolerated. So, i guess, all is fine because it is VC and the last thing they do is stick to the truth.","title":"Undeniably illeterate, untruthful  and offensive","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Fanny Ann","text":"Garbage customer service \nTrash treatment, those of \ncorny “invited”reviews all saying great! You just wait until you have a common problem. Let’s hope you don’t complain when in the same position. \nI read another review who will be blogging about their bad experiences with VC, I feel this is a good way to go and also on FB. We will be heard!\nDisgusting management.","title":"Garbage customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-01","author":"Olga Barwich","text":"Not trustworthy! A bag without a serial number was approved as original. The same bag was offered simultaneously by another seller…\nNever again!","title":"Not trustworthy","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Kate Evans","text":"Here we are, 50 days later and the clowns that run this organisation are no further forward sorting this out…. Boy am I glad it wasn’t a really high value item…. \nWatch this space for further evidence of their corporate arrogance and stupidity.","title":"50 days and counting","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Kat","text":"I am a seller and have made a sale on vestiaire collective on 15 April, and have the item sent out and delivered to the buyer on 18 April. Unfortunately and unbelievably, I still have not yet received the payment of my sold item up to now, it is already May 2 2022. \n\nI have contacted their online customer service agent several times before, they saw that my payment has been put on hold because the courier company has charged the buyer an extra fee when she picked up the delivery, that’s why she requested Vestiaire collective to investigate and refund her the additional fees. I also contacted the buyer earlier and she confirmed that she has received the sold item, she has no issue with the sold item but just waiting for vestiaire collective to refund her the fee she paid. \n\nThis entire situation has been so unfair to me, I don’t understand why my payment has to be put on hold for so long, it is actually an issue between vestiaire collective and the buyer since the courier company charged her additional fees, but as long as the item has been delivered to the buyers hands, and no issue has been raised regarding my sold item within the 72 hours, I strongly believed that I should be paid accordingly. \n\nNow the fact is that my item is already in the buyer’s hands since April 18, and I never get paid. I lose my item and money, I have nothing now. It is ridiculous for vestiaire collective to handle the case this way. The company should pay me first, as a seller I have already done my part, sent the item and have it delivered to the buyer. And refunding the extra delivery charged that the buyer has paid is another issue between vestiaire collective and the buyer, please do not mix the two cases if you need extra time to handle the buyer’s refund. \n\nI am very disappointed with how vestiaire collective is handling my payment, this entire situation has been treating me so unfairly and wrong!","title":"I never get paid after delivering my sold item to the buyer","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Katelyn","text":"I accepted a counter-bid on a pair of shoes for 79 EURO. I then went through the check out process and agreed to pay almost 65 EURO to Vestiaire in shipping, authentication, and import fees. Then, they charged me in pounds. So, I went from paying 144 EURO to paying 144 GBP (roughly 172 EURO at the time of writing). This is not okay. I took this issue to the customer service and they tried to effectively convince me it was my fault - I am not silly enough to treat EURO:GBP as a 1:1 comparison!","title":"Quoting in Euro, Charging in Pounds","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Andrew Iacuone","text":"Impossible to contact this company\nI’m still waiting for confirmation after three weeks\nThey emailed me a report to confirm however “page does not exist”. No one responds to email, chat is impossible\nI’m concerned I will not get my order or a refund\nThere is no one to speak to!","title":"Impossible to contact this company","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=3&stars=1&stars=2&stars=3"}]