[{"date":"2020-09-05","author":"Andreea Scumpu","text":"I will never try to buy anything from Vestiaire, first of all almost one month ago I tried to purchase a wallet, few days after they charged me, I got an email without any explanation, In what they were letting me know that I will receive a refund because I cannot purchase that product anymore and for all the hassle they will give me a $15 cupon, that never worked. After that, I tried again to purchase something, after more then a week from the purchase moment, I was waiting for them to finish with the authentication process and send the item to me. Without letting me know, I’ve seen on the App, that they are giving me a refund, again, without no explanation. I’ve tried to communicate with 2 different persons from Vestiaire via Email, and one of then clearly doesn’t now anything, she was keep addressing me like I was the seller not the buyer, even if I explained her the situation and every question that I had she was telling that she is not able to give me a response, and I have to wait three days for an actual response. The other person that I’ve communicate with via Email, after responding me only one time, he stoped. Even If I’ve sent him 2 more emails. Basically they told me that the seller send an empty package to them, and they without letting me know about the situation, are keep telling me that they will give me a refund, but now I am a little bit worried because almost 5 days have passed and I don’t see the refund in my bank account. And this is not all, the seller, after he sent the empty package to Vestiaire, he has the same product for sale now, again, under the same name with the same pictures, how is this possible? This is outrageous, I don’t understand how they are allowing this person to sell the same product. I am sick of this! I will never try to buy anything from Vestiaire ever again, they lack on professionalism and customer service!","title":"I will never try to buy anything from Vestiaire again","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-06","author":"Victoria Diaz","text":"I've sold a Red Valentino skirt at VC. Then a 2 weeks later I get an email saying that the \"The buyer will return it to VC house to be checked by experts\" Then I never receive any notification since July 15th.\nAlmost 8 weeks after I do not have my Red Valentino Skirt. I do not have my payment. I have NOTHING.\nAs a seller I'm VERY disappointed because I have no protection. VC chat customer service is almost non existent. They are arrogant and they NEVER inform about cases or problems like this. VC's Help Center (chat) is a waste of time as all they do is to send you an automatic e-mail saying you contacted them and they \"will study the case and get back as soon as possible\".\n2 months after I sold my item I have no information, I have not my skirt, I have no my money.\nIsn't it stealing? What right do they have to treat sellers this way?\nI want an answer!","title":"Sold an item and never got payed.","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-06","author":"Sam ","text":"Please turn off direct shipping or let sellers choose if they would like to participate or not. VC are still charging 25% commission for a seller to ship direct to consumer? 😂😂😂\n\nHow about we just contact the buyer directly (as their address and phone number is on direct shipping label) and arrange a private sale, cutting out VC completely so both buyer and seller can save money. 😈\n\nDirect shipping is susceptible to potential fraud from the buyers who can claim they did not receive the item you are shipping or damage the item themselves and then claim it was received in such condition. Sellers pay high commissions to VC so VC can independently inspect the item and process the payment on behalf of the buyer, reducing payment fraud. \n\nI DO NOT WANT TO USE DIRECT SHIPPING SO STOP FORCING ME. THERE IS NO ADVANTAGE FOR THIS, SELLERS ARE OPENING UP THEMSELVES TO POTENTIALLY LOSE MONEY FOR NO REASON..COMMISSION IS STILL 25%, BUT MORE RISK.","title":"Direct shipping to buyer is dangerous","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-06","author":"Bella Vose","text":"This company is completely shady in their practices. A friend was sold a fake bag from a seller in China who listed their location as Japan. It was authenticated by numerous different people\/companies who have said it was FAKE. They even had photos of an authentic one purchased from store directly and compared it to the bag they received and the bag was so off from the stitching, hardware, and logo. How can VC stand by that and still claim it’s authentic? BUYER BEWARE.","title":"This company is completely shady in…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-06","author":"Catherine Karlin","text":"Terrible  service. I am trying to buy an item and they won’t let me buy as log in isn’t. Working. I can’t contact the poor buyer who has accepted my offer. I want to buy but can’t    Really frustrati","title":"Terriblet service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-07","author":"Ann","text":"I need to reach you for a one on one question.  Untill that happens, no good rating.  P.S. I don't read French.  Sad for me","title":"I need to reach you for a one on one…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-07","author":"Katerina NZ","text":"I have already left a bad review here as I had a very bad experience with a sale I made, I was payed 75 euro instead of 130 for item no. 11407218. After leaving a comment here and on Facebook messenger, they reassured me they would send me the rest of the money. It has been a week and quite honestly, I don't believe them.","title":"I have already left a bad review here…","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-07","author":"dorette","text":"Overall i was content with my purchased but i found out that 1metal screw was missing . I informed them about it & sent picture . I dont want to go through all the hassles of sending it for another round of quality control inspection? I would suggest that you must check properly & be detail oriented about the item . I was really wondering why the people in charge did not notice the  screw  missing which would hold the metal from the strap.","title":"Overall i was content with my purchased…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-08","author":"layal nakle","text":"I have had a good first experience using the website. It is well designed and easy to use. Then I had a first issue with one of my order, but it got fixed pretty fast. Now I am having another issue with an item that I ordered about two months ago and that never arrived. I have contacted them three times about this issue and never got any answer. So I won't be using this website again. It's not worth losing my money (the item was pretty pricey)  or my time over unreceived packages!","title":"Won't be using this website again","stars":2,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-08","author":"Alexander Weigert","text":"You might think that you bought an article from a seller, when you negotiated in advance, the seller agreed and you made the payment. But this is not the case! Before shipping the article to VC the seller may change his mind anytime and tell VC that the item \"is not available anymore\". This is part of the business model, as VC does not sanction this behaviour and also offers the seller a delay of 7 days to change her\/his mind (officially called \"ship\") before sending a reminder. After another 7 days of being able to sell the product elsewhere, the transaction is cancelled and you get a refund and a voucher. This happened twice within a few months and the \"support\" says that this is fully ok.\nSo be aware: you only bought an item if you hold the parcel in your hands.\n\nAnother drawback is the amount of fake (inactive) sellers and fake (unavailable) items. Probably because a huge number of articles and members seems to be attractive. Of course inactive members happen with any website, but there is no \"cleanup\" happening at VC. VC does not remove anything if the seller does not remove it. So if the seller is inactive the item stays there as \"available\" forever. The \"support\" says they are not allowed to remove anything. But they could, if they wanted. Many other second hand websites have an automatic termination date for the articles. And it would be easy to send a reminder to the seller after 6 months, that they need to confirm that the item or the seller is still available. As I said, it would be easy if VC wanted. But they don't want so there are a lot of dummy articles.\nKeep that in mind before you fall in love with a new piece.","title":"Be careful!","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-08","author":"Customer","text":"What is going on? \n\nI really liked your revamp of the service and for a while things seem to be going great, sales picked up, but now it is really downhill. Even when correct sizes are put in, something in the system seems to have flaws and lists them often as other sizes. So I have to really check everything that is listed and often contact you to make corrections. Contacting you via chat is at best frustrating, but via eMail you usually get no response and nothing happens, at chat, somebody is distinctively disinterested, they often have no idea, it takes about 45 minutes to have the size of an item changed, the size that I gave in correctly in the 1st place.\nYour app is plainly a horror show, it crashed my iPad and I had to completely reinstall everything, I am not going to use that anymore, so I rely on the webpage, now the issues start.... Sometimes the webpage refuses to upload pictures or save the description, on my best day, I tried 5 different browsers and 3 different computers. Your webchat told me it must be my cookies (seriously???) I tried to explain that it is an IT problem, he told me must be my cookies. Is that the standard reply for everything?\nNext thing price gouging, I believe it is the system making simply totally crazy price suggestions with \"Trust us, we know\" - so far what you are doing isn't super trustworthy. Valentino Garavani shoes that I have worn once, no, I am not going to sell them for the price of a no name shoe and if I would see them for your suggested price, I would think \"too good to be true, there must be a hitch\"\n\nNow you have taken away the option to see what else a seller is selling, where you can see all the items they have listed, so far that is actually how I found most of the items I bought, one item of a seller caught my eye, it wasn't 100% my thing, so I checked what else they had and often bought something else as our tastes obviously were compatible. Since that is gone, my sales have dramatically slowed down, I assume that is what others also do and now they don't find my items anymore.\n\nI quite like the fact that i can switch off offers, as usually the offers people make are often ridiculous, it doesn't stop people from making comments under the items. Not to mention all the men with different \"preferences\" who are on the site and ask for pictures of how women should pose for them, especially when it comes to shoes.\n\nI thought you were really going in a good direction when you changed the business model, but that didn't take long. Lately there is also the issue of somebody on your end asking for more pictures, without saying which pictures and you already have 10 uploaded, then you dress the mannequin again (considerable time) take pictures again, upload, and then somebody decides it is rejected with totally obscure reasons of it not being in very good or good condition (it was new with tags for the record) - I decided to put it to the test and asked a friend to put it up on hers, and oddly enough the same item was accepted straight away.\n\nI hope you are reading those quite valid issues, which a lot of people share, as there is a lot of talk on internet boards about it and don't just give me the usual copy and paste reply with \"thank you for leaving a review\" - I would love it if you could go back to the service you had about a year ago, where things moved smoothly and where it was possible to get a little bit of money for an item that was very very expensive. Try to see it from the side of us who sell our items, if I can afford to buy a dress, a bag or shoes that cost me about 1K, I am not going to spend about an hour (including taking the pictures, description, measurements, struggling with your webpage) to sell it for a return of 20 or 50. I was quite loyal to you, but now started using other sites as well and often list there for higher and sell a lot faster.\n\nEdited to add: Why do you ask to list the pictures in a certain order of view, when your system then just puts them up randomly?","title":"What is going on","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-08","author":"Julie w","text":"Can I just say as someone who hasn't sold or bought the reviews are really bad may I suggest a MASSIVE SHAKE UP....As I really want to be a seller","title":"Can I just say as someone who hasn't…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-08","author":"Adelina","text":"I sold an article through vestiaire collective some days ago ( ref. 11448173). I also payed to ship the article to the company for the control and verification. Once the article arrived, they just sent me an automatic email by saying that they couldnt verify my item, and cancelled the sale. Just that,no reasons why they couldnt verify it, no information at all. I am completely sure about the originality of the product because I bought it myself at the gucci store some years ago. Simply i cant find the order of payment and package anymore. Now they want me to pay again in order to ship my item back and also for 'the time and effort they spent for checking my item' ( the effort of saying we are not able to verify it) I am speechless. Sent them an email and it has been 4 days waiting for a response.\nThis was my first time using this platform and most probably the last time. Basically, I just payed for my article to make a trip in Paris while I could easily consider all the (majority) negative reviews about the others experience with VC and use my energies somewhere else.","title":"I sold an article through vestiaire…","stars":1,"location":"AL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-09","author":"Miss porro","text":"dears\n\ni m happy about you ..in my first buy... just one bad thinks\ni didin t know when the shoes was arriving... i don t understood\n\nand for my sell about DRESS JHON GALLIANO \nyou refused for shadow in the dress .. when the dress coming back \ni didn t  find nothing, i tried to write to you for understand \nbut i didn t understand how i could contact you for \nunderstand your control cancelled the sell \n\n\nbut .. i love you !\n:)\n\nsara","title":"dears","stars":3,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-09","author":"eva b","text":"If I could leave zero starts I would, I sold my item on July 25, they got it on Jul 31, shipped it and payment on the website says it was transferred, never got it. They told me that there was an error in my account number for my payment, I did not make this error it was them and they tried to blame me for it. Still no payment, I have contacted them several times and I have spoken to over 10 agents and one over the phone, yet nothing. I have messaged them through Instagram, they ignore me what kind of service is this? this is a huge scam and will be getting a letter from my lawyer suing them.","title":"If I could leave zero starts I would","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-09","author":"Mew S. Cheong","text":"I made a purchase, I waited for more than 72hours now, but no one responding to my email yet. is this site legit? or a scam?","title":"I made a purchase","stars":1,"location":"MO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-10","author":"Sam ","text":"So you can't accept offers from other  buyers once an offer has been accepted for 24 hours?\n\nI accepted an offer from a potential buyer who of course did not buy the item (not surprised as some customers on there are cheap and don't like to spend money on new luxury goods\/like to waste peoples time). In the meantime I could not accept a new offer from a promising buyer. Neither buyer or seller can cancel once an offer is accepted.   \n\nSystem is a joke.","title":"Can't accept offers from other buyers…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-11","author":"Peter R","text":"Just received a fake hat sold by a con artist in Spain as new. F..king joke. £200 thrown away.","title":"Just received a fake hat sold by a con…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-11","author":"Stefanie Krum","text":"Purchasing on VC for quite a while now I want to share my experience. \nWAY more then 50% of the items will not be shipped or do not match the description. \nEvery time it costs time to search for items, to pick them up or to return them, to set reminders, to text and so on. Also money is gone for at least 5-14days until one gets refunded. If seller refuses to ship, the deal is over. One receives 15€ for the next purchase even if the amount of purchase has been more then 5000€. The fees for credit card use are up on the buyer. If something does not match the description the buyer does not even receive anything at all. Even for amounts about 10000€. Really unpleasant way of dealing!\nPurchased an Hermès bag for about 10k \"very good condition\" - arrived broken!!! \nTook about a month to sort this out!\nIn the end VC took it back, set it online again and sold it for 1500€ less... Before there was no negotiation possible, also no goodies for the next purchase and no covering for any credit card fees.\nMoney was returned after they uploaded the bag again!!! Unbelievable!!!\n\nThis week I purchased another bag and paid straight away. Money was booked the next day. 5 days later, after 2 reminders for the seller to ship the item, the seller cancelled the deal! I have received 15€ for and over 5k purchase. That is it!!! Unbelievable!!!\n\nA lot of items do not match the description. Louboutins have been sold as \"very good condition\" even tough they have been fixed with clue buy a shoemaker...  not mentioned or shown in the offer - took me 3 weeks to figure that out and 3 times of shipping back and forth!\n\nClothing sold as \"very good conditon\" showing spots, loosen threads, open seewing lines and so on! - not mentioned or shown in the offer!\n\nBags sold as \"very good or good condition\" damaged, showing spots and so on - not mentioned or shown in the offer!\n\nIf items do not fit or you do not like them you can reupload them straight away \"without fees\" which is not true, one always has to pay a certain amount to VC for the \"service\". If you want to upload it as a new offer they often refuse or ask for bills. Therefore lately I asked them every time What is the problem\/ Is it fake? Because I had the proof that I purchased it on VC they took it back for checking a second time. Refunded the money to me and reuploaded the item without any notification for me. When I asked they told me it is original of course... Still a strange way of dealing and not very trustworthy. Especially tough there are a lot of feedbacks online telling about fakes sold on VC.\n\nAnyway it is really dissapointing, takes a lot of time and it is always a big Drama!!!\nAnd it happens rarely that everything works fine or even just acceptable... \n\nAs buying Hermès bags at Hermès is not a fairytale just as they keep telling one of course keeps an eye on second hand sellers. \nUnfortunately a lot of fake Hermès bags are uploaded for sale on Vestiaire Collective, even tough one can already spot they are fake. Same happens with other brands - offered as original, but obviously are not. \n\nVC takes 30% fees from the seller and another fee from the buyer to provide the best service. Unfortunately the service is really really bad and highly overpaid. \n\nCustomer Service always keeps telling about there rules... I do not see there rules as fair or helpfull. Also rarely they can help, plus it takes a lot of time to find solutions. \n\nNot recommendable!","title":"My experience from purchasing on VC","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"},{"date":"2020-09-12","author":"LaVerne","text":"This company is the absolute worst in customer service and has an “F” rating with the BBB, the lowest possible rating you can receive. They don’t authenticate anything. They just collect fees. The have the most incompetent reps who don’t have a clue of the general functionality of the company. I ordered almost 900.00 in merchandise that I never received. I was told to send them a claim form and my ID for them to file a claim with DHL. I had to send the claim form more than five times. Each time they got the form they would reply they opened a case the same day, whenetever I tried to follow up weeks after, they would state I never sent the forms. DHL stated they never contacted them not once to have my packages investigated and stated that I should open a claim with my bank. I chatted with their incompetent rep and was told they are working on my claim and then 2days later I get another email for the fifth times stating they never received the claim forms. I had to reply an attached all five emails from them confirming receipt of the forms. This went on for almost three months. They never looked for my packages nor did they refund my money. I filed a claim with BBB and my bank. Beware buying from this company. If you have a problem you will regret it.They approve everything as being authentic in order to collect the fee. It’s a lot of replica merchandise floating through this site and as long as they can profit they can care less about what you receive or don’t receive","title":"BEWARE!!!! Don’t waste your time or money!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=98&stars=1&stars=2&stars=3"}]