[{"date":"2021-03-09","author":"Lora Daly","text":"Buyers and Sellers beware\nThey have had my money for over a month now for items I sold and did not get paid for. I also purchased a Louis Vuitton lock which was fake when it arrived, which I have not been refunded for. So now I do not have the money for items I sold or my refund for buying a fake item. I have written numerous emails with no response. There is no way other way to contact them and I would never use them again.it’s a pity I can’t give zero stars.","title":"Buyers and Sellers beware","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-09","author":"Olga Novikova","text":"I bought a Dolce Gabbana necklace from a professional seller as New, with tag. It went through Quality Control and they did not even notice that one bead was missing. I applied to return the order but could not print the return label. I have been asking for days to sort it out but they even stopped responding. I have 14 days to return the item but I am unable to do so. They had my money for over a month now. Very poor communication and Quality control.","title":"Poor communication and Quality control","stars":1,"location":"CY","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-09","author":"molly","text":"absolutely disgusting service. really sarcastic customer service team. they provide postage however i had to request two labels and neither worked, resulting in paying my own postage.\nsince the postage was not through them the customer received the order and they have ignored me for over two weeks without giving me my money.\nthey refuse to allow me to escalate this and 'cannot provide' a number or escalation contact. \nto say it is a 'luxury' second-hand seller the service is actually disgusting.\nalso had to contact a solicitor to get involved.","title":"absolutely disgusting service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-09","author":"castellana Eleonore","text":"I am very disappointed by Vestiaire Collective.\nI have already bought and sold from them several times and I thought they were serious people. \nBut they are not. I spent more than 420 euro for a famous branded necklace, and I paid for the authentication fees, and the necklace arrived with the clasp ripped off.\n\nI've been sending them emails for 5 weeks now, talking on their chat, sending proofs because they asked me for a sworn statement, a copy of my ID, pictures of the necklace, tags, package, etc... everything to discourage me....\nBut far from being discouraged I provided everything, and then, no more answer for a week, big silence.... and since then I receive impersonal emails asking me to wait another 72 hours, always the same emails and never any answer.... another 72 hours, again and again...\nIn short, I'm being taken for a ride and told that I will be taken care of, that I will not be forgotten and that my problem will soon be taken care of, etc... \nin fact they don't solve anything, but they send me a little email every 10 days telling me to wait, but still nothing...\n\nSo I find myself without anyone to talk to because no phone number is available on their site and without the possibility to send back my broken necklace, and without my lost money of course. \nIt's distressing considering the huge margins they take, both on the sellers' side and on the buyers' side, I know it from experience because I've been on both sides. Compared to other sites I use. I do not recommend Vestiaire anymore.\n\nSo the conclusion of this sad experience, is that they have a very bad after sales service (non existant), coupled with a bad product verification team, and a lack of respect for the customer. To avoid absolutely.","title":"I am very disappointed by Vestiaire…","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-09","author":"Brian","text":"VERY BAD do NOT sell on the app you can’t get help on the app .. if you get a message its them saying that the help desk is unavailable! To get your money takes months!","title":"VERY BAD do NOT sell on the app you…","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-10","author":"Ally","text":"Absolutely a shxx app. I bought premium for 12 months, I unsubscribed for the auto-renew, then they said my premium is no longer valid??? I lost the free shipping chances for that. Unbelievable logic. \nI would vote void if I can. So bad. Do not ever try it. The customer service and the app itself is very hard to use too.","title":"Absolutely a shxx app","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-10","author":"Gajane Mkrtcjana","text":"I have sold two items and haven’t received payments for them. Contacted Vestiaire for several weeks to chase my payments and was assured they will fix it within 2-3 days but nothing hasn’t been fixed. Very annoyed that I have to pay commission for the service that they actually haven’t provided. Now I don’t have my items and no money.","title":"I have sold two items and haven’t…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-11","author":"Sarah Hicks","text":"I will not shop with VC again. Purchased two items and both had serious issues (first was a completely different colour than what was listed and second was a bag missing the strap that was included) despite going through “expert” quality control and authentication process. CS was responsive but ultimately unable to reach a resolution that worked for me. I expect more from a company that continually talks up the quality control aspect of the experience. I purchase luxury from reseller frequently and will stick with my trusted eBay sellers from now on.","title":"I will not shop with VC again","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-11","author":"R. Noman","text":"From worst to absolutely worst service and customer care!. They should be ashamed of themselves.\n\nNo phone or chat customer service!. \nThey take the money from the buyer on the same second but keep the money of the seller for so long with fake “4 steps” that each step they claim takes up to 7 days to process!!!!!.\nThey keep the money on the banking account so they make interest!.\n\nThey claim they have faster paying system! In fact it’s worst than before!.\n\nAvoid at any cost!","title":"From worst to absolutely worst service…","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-11","author":"Mrs Jones","text":"You can get some very good designer bargains on this site but be very careful i recently purchased a £60 designer bracelet only to find when it arrived it was a free gift with purchase chase of their cosmetics! The seller had sold more than one of these item, how can I give this as the intended present to my daughter I am disgusted how they can get away with this .","title":"Be careful …","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-11","author":"Matthew McCarthy","text":"Such hard work to make a simple purchase. I’m given an introductory discount code which is nice.. apply this at checkout within my browser.. NO, you need to use the app to apply this code! Annoying. \n\nDownload app, find item, apply code.. continually rejects my AMEX for payment. \n\nGive up, shop elsewhere","title":"Hard work to make a simple purchase","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-11","author":"am k","text":"i made an order on 10 march but was charged twice by vestiaire, whats worse is the item is still listed for sale so other people can buy it and the order information for the item which cost over 300 GBP shows that the sale was 15 GBP despite over 700 GBP. being taken from my bank account (as I was charged twice by VC). There;s no way to contact customer service, all you can do it email and then wait for a reply for days ,how it this helpful when the issue is on VC and I need an immediate response to rectify this issue? This is a serious matter to charge someone for an item twice for a large amount of money being taken from my bank account which to make things worse - the item i 'bought' is still available for any one else to buy! what's worse I have received no order confirmation email, just the money taken from my bank account and paid to VC with an order number which doesn't correlate to what i actually purchased which has a technical issue as it's dated 00\/00\/0000 rather than the date I made the order with an order value of 15 GBP for an item that cost over 300 GBP. none of this makes sense and I am very annoyed","title":"charged twice for an item that is still listed for sale for others?!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-11","author":"Veronica Lau","text":"I have bought and sold several times on vestiaire and despite problems every now and then, i found it overall a good idea to recycle fashion.  However, this experience have turned me away from them forever.\nI have bought an hermes bag charm from them for over EUR 500 which was fine.  But they decided to post it through a local carrier which is still fine as long as it delivers the results (in my case it doesnt).  I have purchased the item since 24th Feb and i still havent received it.  The biggest issue was when the delivery updates stopped for 5 days, i used their customer chat service on the 13th day after purchase, and was told i should get back to them when i havent received it on the 15th day.  i remember asking them \"so i shd get back in 2 days (11th March)\" and they said \"yes\", and only to find out their customer chat service suspended until the 16th.  I honestly struggle to believe on the 9th March they didnt know at that point they were going to close chat service the next day.  \nThe local courier has since then, updated the status to say part of the delivery details were missing and they are contacting the sender!! so knowing that customer service is non existent, i have decided to use the local courier chatbot (which i cannot because it's only in french) and i called their international number (with my own money) which was then diverted to a voice mail message also all in french).  In all honesty, i paid EUR 500 which i dont consider cheap, why couldnt they post with a more international courier with customer support who speaks english? it is not a EUR 10 T shirt.  If u want to save on customer service support, i would honestly suggest u choose a courier who will give you less issues.  so after 3 weeks, i am still seeing nothing, heard nothing and not sure if my item will ever turn up.  If you consider buying from Vestiaire just be prepared that they a) cannot guarantee to use DHL\/ UPS\/ Fedex as quoted by their customer services and b) when that happens ure on ur own, their customer service is pretty non existent.  Lucky i only got a bag charm, imagine if u paid thousands of dollars on a bag? it is surely gonna stress u out.","title":"I have bought and sold several times on…","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-11","author":"Georgina Kane","text":"I have been chasing up a refund for import charges I received and that I was assured before I paid them that I would be reimbursed. I’ve spoke on chat multiple times to be fobbed off! It seems I’m now £170 out of pocket for a purchase I made before brexit! I was a good customer but now this had put me off this company.","title":"I have been chasing up a refund for…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-12","author":"Nastya","text":"I rate you bad because these days Vestiaire keeps on delaying the payments if my sold items\n\nThis is the second time it is happening this month\n\nI sold the item with referrence number  14390776 \n The buyer was very happy with the shoes but no money were transferred to my PayPal account\n\n\nVestiaire keeps doing that .\nit is a second time that i am not getting paid!\n\ncan someone solve my issue  please???\n\nThank you","title":"I rate you bad because these days…","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-12","author":"Marija","text":"Scammers and liers! New payment system even longer then the old payment system hahaha. So in 2021 payment is “processing” five days. They transfered money on 9th March but it will, according to them ACTUALLY transfer on 16th March. I have no words for this crew anymore. Holding everyones money while giving so stupid argumentation that it hurts. In 2021 when you transfer money, ITS TRANSFERED.","title":"Scammers and liers","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-12","author":"Andrea ","text":"This company is scam. I read reviews and they were bad,  however website products are tempting so I wanted to try. I bought something small.\nI have to say, after my horrendous experience, I am surprised that sellers who sells expensive products and buyers who buys expensive stuff trust this company. I bought bag, but they messed up my shipping address so my parcel  was stuck. It was mission to get it back. Customer service is appalling I would say non-existent. Talking to automatic messages is not fun then queuing like being 155 in the queue and you get someone that will get back to you  and it never happens. \nSo guys, be aware especially if you buy or sell expensive stuff dont do it  it is not worth it. They take your money and products but they won't help you..there is no one to help....I am even shock that this company is not closed down as it is scam...","title":"This company is scam","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-12","author":"Andrea ","text":"This company is scam. I read reviews and they were bad, however website products are tempting so I wanted to try. I bought something small.\nI have to say, after my horrendous experience, I am surprised that sellers who sells expensive products and buyers who buys expensive stuff trust this company. I bought bag, but they messed up my shipping address so my parcel was stuck. It was mission to get it back. Customer service is appalling I would say non-existent. Talking to automatic messages is not fun then queuing like being 155 in the queue and you get someone that will get back to you and it never happens.\nSo guys, be aware especially if you buy or sell expensive stuff dont do it it is not worth it. They take your money and products but they won't help you..there is no one to help....I am even shock that this company is not closed down as it is scam...","title":"This company is scam","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-12","author":"R. Noman","text":"One star is too kind for them!. I wish there was minus 5 stars for this awful service!. Their customer service telephone no longer works, their chat service is down!!!!. You send an email and they answer many days later with wrong answer and you have to write back and wait another few days!. Always very late in everything but super fast by taking your money the same second you buy an item while they keep the money of the seller away for weeks!!.\n\nThey should be ashamed of themselves with all this fake images they advertise about themselves on social media!.\n\nAVOID AT ANY COST!!!!","title":"One star is too kind for them!","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"},{"date":"2021-03-12","author":"Maria Sousa","text":"I have bought and sold several items on Vestiaire Collective, and I have always encountered issues, but they were somehow solved along the way. However the last time I tried relisting an item the function did not work. So I tried contacting customer support for help.\n1- Chat function does not work any longer and it says there are no customer support agents available;\n2- the customer support email does not exist anymore;\n3- the forms to submit queries are not available either;\n4- as far as I aware there was never a phone number available in Europe.\nSummarizing, there is no customer support should you encounter any difficulties (and trust me, you will!). Therefore, I would rather sell on eBay or even on your own. They are not worth the fees they charge as they offer zero protection. I will sadly delete the app.\nStay away to avoid headaches!","title":"Do not recommend - no customer support!","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=68&stars=1&stars=2&stars=3"}]