[{"date":"2020-11-05","author":"Anna","text":"Not what it use to be. Quality control use to be thorough, but just bought a Chanel coat that arrived dirty and damaged, and still was rated as \"Very good condition\". They then provided a wrong return shipping label, and it has now been 9 days, and still they haven't received it and \"confirmed\" their mistake. Really uncomfortable buyer experience, will never shop things that requires quality control with them again.","title":"Not what it use to be; cannot trust Quality Control","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-06","author":"Mimizan","text":"Horrible!!! don’t sell and don’t buy!!! \n\nI sold a saint laurent dress and the buyer is chasing me. The dress is ready to be shipped but despite 100 times of chasing them for a prepaid label, I still haven’t received it. The buyer just sent me a msg that their customer service has told her that dress is no longer available. You guys are such a lier !! This is the second time you have done to me !!","title":"Horrible!!","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-06","author":"Killer queen D","text":"I haven’t received my money from my sells at all. I contacted them and they told me to double check my bank info so I did I called my bank and I put everything correctly. It’s so annoying that I had ship my items right away because I trusted the company. Now my items are gone and not getting money back. Today I can’t sign in to the app, it said no connection found! Weird weird weird. Seems like they tried to get rid of me. Do something VC what’s so hard to do it. ANNOYING\n\nJust contacted them again and they said they have issued with their bank, all payment that they have made wasn’t successfully yesterday. But i supposed to receive money since Nov 3rd! So it sounds like another lie from them. Horrible","title":"I haven’t received my money from my…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-09","author":"AJ","text":"Don’t trust buying high dollar items from this company. \n\nI bought a Chanel briefcase from their site on October 13th. On October 29th, 16 days later, I finally received the briefcase. The structure of the briefcase appeared perfect in the listing and the photos associated with the listing, however, the structure of the briefcase was completely bowed in on both sides when it arrived to my house. It was also significantly caved in on the front of the briefcase. \n\nI took photos and reached out to their customer support within 72 hours and it took them a week to get back to me saying that the “ The experts confirmed that the article conforms to the model.” \n\nTheir “expert quality control checks” are highly inadequate, especially for high dollar luxury brands. Their quality control review to determine whether an item is compliant with the listing or not is laughable. If the item that you received differs from the item that was advertised in the listing (even if the photos are CLEARLY different), they won’t allow you to return it. They’ll only allow you to relist it.\n\nAlso, their customer service is unresponsive. I finally heard back from them after a week and multiple follow ups from my end. \n\nBuyer beware!! I will never purchase from this company again. First and last time.\n\nMy update: Their customer service is horrid. It took 16 days, multiple emails from me (with a significant in delay of response from VC each time, the latest being 8 days), an eBay dispute, and a credit card dispute for them to make true to the promises on their website around items that aren’t as described in the listing. They finally offered to send me a shipping label to return the item. Don’t do business with this company unless you are extremely bored and don’t have anything more important to do then chase them down. At this point, I declined the return shipping label. I don’t want anything more to do with this crooked company and have luckily found someone outside of Vestiaire’s platform who wants to purchase the item from me (after I fully disclosed the issues I found with it). What a nightmare.","title":"Don’t trust buying luxury goods from them","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-09","author":"Oliko","text":"PLEASE AVOID!\n\nIt has been 2 weeks since I am trying to get funds from the sale of numerous items on VC - they confirm that the funds have been transferred and fail to investigate what happened. I have had problems with VC's customer service before but this is outrageous.\nI will not recommend this website to anybody - buyer OR seller, especially seller. You end up with no designer items and no funds. Bearing in mind that I also paid postage for these items - it's a complete waste of time and money.\n\nPLEASE AVOID!","title":"PLEASE AVOID!","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-09","author":"ST","text":"I discovered this site via a YouTube video, and was so excited about purchasing and buying items through this service. \nWhen I started creating listings, upon selecting the brand of one item, I got an automated error message that the brand was no longer being accepted.\nI tried a second item, same thing. I could see that other bigger brands still worked, so I reached out to Customer Service to find out whether I could still sell the items, as I did not want them to be shipped to VC only to be told they couldn't be sold.\nI did not get an answer. The agent who answered did not seem to understand the question at all, and tried to close the chat multiple times when my question was not answered. I would have included the transcript but there's no option to attach a file. \nAs I work in customer support myself, I got curious about the positions they have, and found out that customer service agents have to work 6 days a week!!! See here: (links aren't allowed in reviews, so to find the job posting access the website then click About -> Join Us -> Customer Service Representative (ENG\/FR))\nI'm guessing (hoping) they're still managing to respect French law by giving employees longer lunch breaks, but no wonder they're terrible at their jobs if they only get one day off each week. This is shameful. I'm deleting my account and I see other reviews are only here to confirm my suspicions, this is yet another soulless company that cares neither about its employees nor its customers. \nI could not trust a company like that with my money, or my items. \nIt's too bad, as this is a great concept and a well built website and app. But I also think we have to hold businesses accountable if they think they can cut corners.","title":"A bad experience before even purchasing or selling anything","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-09","author":"Claire Burns","text":"Very misleading to call individual sellers expert sellers. I bought thinking expert meant professional and now can’t return item. Item classed a vgc but smells so musty.","title":"Very misleading to call individual…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-10","author":"Holly","text":"DO NOT BUY FROM VESTIAIRE COLLECTIVE! They cannot be trusted. \nI recently bought a Gucci bag, upon its arrival it was much smaller than I expected so I went back onto the site to double-check the original listing. When I did this I found two listings using identical photos (both listings even had a photo of the bag with the same serial number) One was the bag I had bought and the other is a bag sold to someone else. Seeing this immediately made alarm bells ring ( how is this possible? do they not check the listings before?! Surely two listings with IDENTICAL photos show something fishy is going on?!). I had a look at some other listings for the same bag, of which all had different dimensions and different lining material. I then researched the bag online only to find that Gucci has never made a bag with these dimensions. I raised my concerns with customer service who instructed me to send that bag back to their head office. Once it arrived at their head office I was informed it has passed their \"verification checks\" within less than 24 hours (obviously not a very thorough check) and would be shipped back to me. No-body would answer my concerns and every person I contacted via customer service gave me a template answer. Doubting they even have real people working in customer service. The bag has now been returned to me (I have had to pay customs charges yet again) and I still have no proof that this bag is legitimate. I asked for answers time and time again only for all of my requests and questions to be ignored. All the evidence I have found proves this bag is fake. I wish I had checked their reviews online before making this purchase as it seems they are not a company who can be trusted. I am now out of pocket with only a crappy fake bag to show for it. Do yourself a favour, save your money and AVOID THIS COMPANY:","title":"Fake and Terrible Customer Service","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-10","author":"Teresa Chen","text":"Nov. 21, 2020 :\n10 days now since I left a review in here. the problem still hanging there. Waiting for the return label. The customer service level just make me speechless.  \n\nNov. 10, 2020: \nFirst time shop and purchased item from Vestiaire Collective.  I have a very unpleasant experience.\nFirst, Vestiaire Collective OVER report the sales price and causing me to pay extra duty and tax.  If I don’t pay for it, I won’t get my package (DHL delivery guy stand in front of my door.   What option do I have left?   I have to pay first. \nAfter that, I have contacted DHL and the feedback I have received from DHL, you have to contact Vestiaire Collective because they made the report\/ mistake.   There’s nothing DHL could do. \nI have submitted the invoice to Vestiaire Collective and I am waiting for VC to refund my money.  \n\nI have paid for the damaged item.  I opened the package and the padlock falls off.  The seller has never mentioned the hook was broken\/loose and it couldn’t hold the weight of the Hermes padlock.    I have filmed a video and took pictures as well.   I have sent all the info. to customer service.\nThe feedback I have received was this bag indicate as fair condition so you are not allowed to return but Vestiaire Collective has provided a vouch for you for your next order.  The code is freeship20.  \nI have reviewed the term and condition for Fair condition:  it has stated no broken parts.   \nSeriously..... you are expecting me to shop again and put a good review on your website since I have encounter such a bad shopping experience.  I am hoping I could get my money back soon or they could provide some sort of solution.      \n\nSent from Mail for Windows 10","title":"First time shop and purchased item from…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-11","author":"Simona","text":"12 days after my review on Trustpilot about a package that I never received and was stolen on the way to me, Vestiaire finally replied to my email. They refused to refund me. They have shifted all the blame on the transporter, who has also denied to take any responsibility for this mess. According to the transporter the bag 'correctly left the warehouse' and the package's weight (2.15kg) was on point - even though the recorder weight on the box was written 0.8kg (in reality was not even 0.8kg but even less) and the delivery man admitted that parcel felt empty to him when picking it up (this conversation between him and the transporting company dispatcher was recorded). \n\nVestiaire have invited me to file a complaint at the police station and to thereby put on my detective hat and solve this issue by myself somehow. How ridiculous? On Vestiaire's website it clearly states 'all items are insured against theft and accidental damage' and that they 'insure and assume responsibility for all items'. Clearly they do not, as I have been denied a refund. This is false advertising and is illegal.","title":"VESTIAIRE LIE ABOUT HAVING INSURANCE AGAINST THEFT !!!","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-12","author":"Iliana ","text":"Purchased a pandora bracelet with charms from them.. the seller mentioned that that the charms were ORIGINAL.. it passed their quality control.. they sent it to me.. I sent it back with evidence that the charms weren’t originals as there were no pandora stamps on them.. and they had the audacity to claim after the second quality control that it was Ok.. scammers and thieves.. they sell and accept counterfeit products to be sold!! STAY AWAY!! Keep your money!!!","title":"Unprofessional!!!!","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-12","author":"Katie Paris","text":"Yet again another awful experience with this site! My address is full and correct on my profile so I bid and win on a jacket I've wanted for years for them to tell me it cant be delivered die to incomplete address and it's been returned to sender and sale cancelled. Absolutely rubbish service.","title":"Yet again another awful experience with…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-12","author":"gul","text":"Waiting since september for my money to be transferred and get several times excuses that the system was down or payment is for sure scheduled.. but still (mid November) no payment received..","title":"Very poor service if something goes wrong.. delay in payment","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-13","author":"Maria","text":"I used to like this platform, but in the past few weeks it has become absolutely unbearable!!! ALL, I REPEAT ALL my purchases get cancelled by sellers who confirm the availability of the item, then 2-3 days later cancel, without even telling me although we are using a chat, and then relist the same item for higher prices, so would even in some cases pay a higher price is a seller would tell me about it before cancelling! And I miss on other items on another platforms because my money is stuck somewhere else. \nPeople are harassing each other in the comments etc. This has to be regulated! Either enable auctions for seller where everyone can bid honestly and equally or DISABLE post-sale cancellation! It’s absolutely ridiculous that it is so easy to cancel a sale, sellers have no sense of commitment and aren’t punished for this behavior in any way. Can’t even report anywhere such behavior. NOT SHOPPING ON VC ANYMORE EVER AGAIN. It’s a waste of time.  And also will recommend others other platforms where this just doesn’t happen.","title":"Buying has become a nightmare!","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-13","author":"Maria","text":"I used to like this platform, but in the past few weeks it has become absolutely unbearable!!! ALL, I REPEAT ALL my purchases get cancelled by sellers who confirm the availability of the item, then 2-3 days later cancel, without even telling me although we are using a chat, and then relist the same item for higher prices, I would even in some cases pay a higher price if a seller told me about it before cancelling! And I miss on other items on another platforms because my money is stuck somewhere else. \nPeople are harassing each other in the comments etc. This has to be regulated! Either enable auctions for sellers where everyone can bid honestly and equally or DISABLE post-sale cancellation! It’s absolutely ridiculous that it is so easy to cancel a sale, sellers have no sense of commitment and aren’t punished for this behavior in any way, YOU CANNOT EVEN LEAVE A REVIEW\/RATING TO A SELLER. Can’t even report anywhere such behavior. NOT SHOPPING ON VC ANYMORE EVER AGAIN. It’s a waste of time.  And also will recommend others other platforms where this just doesn’t happen.","title":"Buying has become a nightmare","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-13","author":"Olena","text":"Dear all, \nItem 11670075 , the issue eventually was sorted and I just got confirmation I will be getting paid.\nBut my point on it as I put it on email to Laura M from vestiaire customer team : \nI want to know about your KYC process and due diligence regarding billing address and different shipping address.\nAs out of ten items I shipped via direct shipping two had an issue, so it is 20% percent which is high.\nClearly vestiaire should start confirming shipping address if it isn’t the same as billing address by due diligence.\nAs in both cases it wasn’t done , as one item eventually was sent to an office address, and the other to ups pick up.\nSo both addresses provided on the shipping label were wrong.\nAnd it isn’t up to seller, in my case who shipped all items within 24 hours and not a single return, to chase you and clarify addresses issues which takes and hour each time. It shouldn’t happen in the first place, should vestiaire do proper confirmations of the addresses.\nYour company is relying on good sellers as sellers are the ones who pay commissions. So addresses issues should never occur!\nAlso on the offers which a lot of people have no problems sending but not completing the transactions.\nIn few occasions I even had 30% offer then initial price but then buyers tried to renegotiate another 30% percent off !!! That after first offer was accepted.\nI have almost daily meaningless offers when accepted they don’t complete. These shouldn’t be allowed.\nPeople who make offers and don’t complete when the offers are accepted should be blocked out of the system.\nAs I said in the past I am both buyer and seller ,\nSo some sort of feedback system should be placed, so buyers know if the seller is reliable and the seller knows if buyer is reliable.\nBecause at this rate as I said I am your loyal customer of seven years you will be loosing reliable people on your platform as more competition coming to the market.\nRegards \nOlena","title":"Dear all","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-13","author":"Lorraine Palmier","text":"Sooooo annoying when one makes a purchase and sellers do not send items (sellers can't even be bothered to reply to messages) in return buyers have to wait 14 days for a refund - how is this fair?\n\nOut of 5 items that I have recently purchased only 2 received, 2 cancelled and 1 on its way (I hope).","title":"Sellers - what's wrong with you","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-13","author":"SC","text":"I first purchased my Birkin on September 30 and after went through all the custom import duty process, I finally received the bag and found out the dust bag is fake. Vestiaire told me to send back for second check , I told them if only the dust bag is fake, I would like to keep the bag, please send back to me.\n\nAfter super long 17 days of waiting, they finally told me the dust bag is fake (why didn’t they see it at the first check?) and then they just send me full refund! ( I specifically told them I want the Birkin back if it’s authenticate)\n\nNext day, they just relisted my bag, so I was so angry and bought the bag back. And now it’s been over a week , the bag still not ship yet which should be express delivery.\n\nVestiaire customer service  is not helpful at all, every time you contact them, they just ask you to wait 72 hours. If you contact again , the 72 hour reset, so there is never a deadline.\n\nIt’s really ridiculous, almost 1.5 months now, I still didn’t get the bag and the customer service will do nothing!!!!!! Then why bother to have a customer service!!\n\nAnd I have to say the quality control team quality is very low, 50% of my purchase have problem!","title":"Everything is delay","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-13","author":"Aleia Isoldi","text":"I need someone to contact me. I recently sold my first item with VC and still have yet to receive a payment. My bank details are on the app, and I received an email that the money has been released, but weeks have gone by and I still don't have it. I'm afraid that my money is lost. I tried asking for help through email, and instagram and now here as you don't provide a customer service # which is frustrating and unprofressional. My jacket is gone and sold, I want to speak to someone about my money.","title":"I need someone to contact me","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"},{"date":"2020-11-13","author":"Anna","text":"Avoid! At this point Vestiaire Collective has:\n\n- Sent me a defect (leather damages, closing damaged) and dirty Chanel shearling coat marked as \"Very Good Condition\" by their \"expert\".\n\n- Generated a wrong shipping label for my return. I was unsure if I should use the label, but Hank K at VC customer support, asked me to use it. It's now been 2 weeks where I've tried to get DHL to deliver this parcel (SF -> NYC). A week ago I alerted VC that there was problem, and Madeleine said she would reach out after 3 working days on the 11\/11. It's now Friday 13\/11 and I still have not received any reply to my last 3 emails to Madeleine at customer support. \n\nNeedless to say, VC is not worth your time. Their quality control does not work, and they have now had almost a month to rectify their mistake. \n\nAt the moment I've paid +1600 USD, and don't have the coat. I'm so sad and disappointed. Have been a customer and seller on the platform since 2017, and it use to be so good.","title":"Lost the +1600 Chanel coat I recently purchased?","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=90&stars=1&stars=2&stars=3"}]