[{"date":"2022-03-28","author":"customer","text":"This site supports the worst customer care center on purpose. It is so difficult to find it , let alone to deal with them. I have an account since 2013 and whenever i needed help or deal with a situation, they deliberately exhausting you to re-peating again and again your problem and after a billion of times you might solve your problems...it is totally up to you. If everything goes ok, then lucky you  you skipped the effort. I cannot accept that a site of their size cannot fix that the last ten years, so it is in purpose , it is their target not to be found, not to explain not to have any personal appearance. It is you against automated e-mails and procedures. As long as you know that you can use it , but dont ever compare it with other big respectful sites. Not in a gazillion years!","title":"This site supports the worst customer…","stars":2,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"Bella","text":"I used to really love shopping on vestiare, the authentication service always gave me peace of mind and the shipping always so fast, however I don't know why but 3 out of the 4 purchases I have made this year were cancelled\/never shipped by the sellers (and all different sellers at different times). I know this is not vestiares fault necessarily, but it has certainly put me off buying from their site moving forward, as I don't like the uncertainty. I think there needs to be more incentive for sellers to actually go through with the purchase\/more consequences if they don't as on no other site have I had so many orders cancelled without explanation!  The $20 coupon they give as consolation also expires within a few months so I have never been able to use it.","title":"orders often cancelled with little to no explanation","stars":3,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"Anna K","text":"Only spend money you can afford to lose.\nIf anything goes wrong, customer service is non-existent.\nLuckily I paid with Amex so I have opened a chargeback case to get my funds back.\nCustomer service is unhelpful, inattentive and frankly among the worst I’ve seen. Nothing will get me to purchase another item from Vestiaire again.","title":"Only spend money you can afford to…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"Mrs Gabeva","text":"Update:\n\nVC,\n\nThe rules and regulations are very clear and they certainly have not been broken. Below, you are, once again, NOT giving an asnwer, as well as you never never asnwered my mail where i am asking you for evidence that the rules of the chat have been broken. And this is because you cannot provide any. And now you cannot “verify” my account. How “convenient”. This is another ridiculous comment from your side. If there are “many humans” in your self-proclaimed “customer service” do the work and answer my email and  do not waste your time and my time with “official “ copy\/paste” meaningless answers which indeed do NEVER provide any actual answers.\nRules are to be respected but they are to be respected from both sides of a contract, partnership, whatsoever. If you decide to “punish” someone you should provide evidence or explanation why so. But as you cannot, this action of yours is again a display of your autocratic manner of doing “business”. Which is offensive and in breach of your own rules and regulations. Very typical and consistent manner of yours and a reason why more and more users are complaining from your company. Anyway. Nothing surprising when it comes to your company”\n\n….\n\n VC managed to “outdo” themselves once again. Today i noticed that they have banned me from the chat which came as a shock. I have only used the chat to answer questions (very rarely actually)  from potential buyers about dimensions or when asked to provide product details. Moreover, this is an option that VC is giving and even enhancing you to use. I Have never discussed anything else and this can easily be varified by them if they bother to check their records. But as we all know truth and facts are not something VC cares about as they are totally autocratic and dismissive to their customers and still do whatever and whever they want to do, without basing their actions on any grounds. and when i sent an email asking for an explanation, i received a template response what might be the reason - with a list of potential misdemeanors which i have never ever performed. Not a single one of them. And this can be proven. But as it is impossible to talk to or communicate with a real person from the non-existent customer service, lets just add to the list one more, ridiculous and illogical action from the side of the gimmick company. \nNot that this review will help getting the matter resolved. It never does. But it is an additional fact that can raise awareness to the malpractices and many scams that VC is performing while totally mistreat they long term customers.","title":"Abusive actions from the side of VC","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Titty Kardashian","text":"Scammers full stop 🛑\n\nRead review CANT all be wrong \nDon’t waste time or money","title":"Scammers full stop 🛑","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Ioanna","text":"Sold a Dior Columbus bag on Vestiaire, which on quality control was assessed as \"Very good condition\" and not \"Never worn\" as I had written in the description. Fine by me. The buyer cancelled the sale and the bag was republished by them. \n\nThe bag got sold again after the relisting. However was not shipped(!) After 4 days the bag was RE-RELISTED and they said in the description, its condition is \"Good\". Just like this. Their support is replying always as if they don't read my messages. \n\nI will never trust them again with valuable items and I suggest you don't too.","title":"Sold a Dior Columbus bag on Vestiaire","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Dimi","text":"Awful awful awful. In all my years as an online shopper I never have experienced such bad service. They out of the blue suspended my account without notifying me and then when I enquired what was the issue they just brushed me off claiming my account has been linked to other suspicious accounts. The fact is I have bought thousands of pounds worth of items. Net buyer paying by Amex. So really insulted by the treatment. Find an alternative website and stop financing them.","title":"Awful awful awful","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Amc","text":"I first had a bad experience with Vestiaire in 2020 but decided to give them another go. In my view their website is likely fraudulent and should be shut down. They are taking money from buyers and the goods ordered mysteriously disappear - at which point they launch an “investigation” .\n\nYou cannot speak to anybody you can only use chat on their website or email where you only get automated responses and no one ever progresses the case. \n\nI bought a 1000gbp handbag which went “missing” in January . Vestiaire have still not refunded me \n\nI also sold two items in the last month and both buyers have contacted me directly via the website to ask me if I have posted these as vestiaire have taken their money but now the goods are “missing” \n\nLuckily I have my Hermes slips as proof \nNow vestiaire is putting the responsibility  on me for the items not being received even though I have proof of postage ! And Of course they are launching another “investigation” for the buyers\n\nYet again the buyers money has been taken and I have not been paid\n\nThis website has falsely brokered these sales and kept the money without supplying the goods- pending “investigation” that never happens . Unless you have hours and hours to spare trying to talk to people on chat you will never get your money back\n\nI am amazed an investigation has not been made as this is likely fraudulent behaviour- and reading all the other reviews clearly I am not the only person so there is plenty of evidence. \n\nThey may not do this on every transaction but my suspicion is they  are relying on enough people not following up through their impossible customer service.\n\nNever use these people \n \nI have now reported this to the government fraud department .","title":"Vestiaire : suspected fraudulent website do not use","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Carmen Mahtab","text":"When everything goes well I do really like using Vestiaire Collective. The problem is the non existent customer service when you need help. \n\nMy parcel is said to have been dispatched and awaiting collection at the parcel shop I collected. However, the shop selected is saying they have not received it.\n\nI need someone to contact me from Vestiare Collective to resolve this matter, I have used chat but I keep going around in a loop with the digital assistant and I've also used their online email submission form, you can no longer contact them by emailing directly.\n\nThis has been an awful experience and I want to be refunded for the item and postage as I it hasn't been recieved.","title":"Non contactable customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"saimir rexhvelaj","text":"I had a order placed from this app \nI bought from a seller a great frog ring \nHe sand with the Hermes delivery company \nThe delivery person stole my item and just put the package empty I have sent them prove on email and no one have responded \nI have been ignored \nThe seller acted like a nice person in the beginning , he said don’t worry I will sort out he said that the Vestiaire team contact him and said said 5-6 weeks \nWhen I wrote him after 2 months of not receiving any response he said that they gave the money to him but me nothing \nNo money no item \nAvoid this app save time hustle and money\nAnd I have seen you replay I haven’t received any emails is all lies \nI have written to you lot more then 10 times","title":"I had a order placed from this app","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Jenna","text":"Buyers don’t pay and they’re not forced to pay for the offers they submit.\n\nTotal waste of time.\n\nIf Vestiaire wishes to waste my time with this stupid site, I’m done.\nAlways asking me to lower my prices but they don’t ever lower their fees.\n\nBunch of losers that want authentic items for nothing and still don’t pay.\n\nStay away.","title":"Buyers don’t pay and they’re not forced…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Denise Gough","text":"I just found out from Chanel that my bag is fake!! Cost thousands on Vestiaire. Nobody available to contact- I bought the bag six months ago and only found out it was fake when I sent it to Chanel to have a clasp repaired. DO NOT BUY FROM VESTIAIRE. They have become a huge scam- nobody real to talk to just bots. I can’t get in touch with anyone.","title":"I just found out from Chanel that my…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Anne","text":"I bought a pair of shoes on VS under ref 21214219 (order no 52282573) and the VS app says it has been delivered to me, but I have not received them. I have now tried to get in touch with customer service for 2-3 weeks but no one is responding. The chat robot is not working. I used to love VS but I am not interested in using the app anymore since there is no customer support if something goes wrong and I have now lost quite a lot of money on an item I never received from VS.","title":"No customer support service anymore…","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Tanya Harbas  from Croatia","text":"Dear Vestiaire Collective support team\n\nThank you for your response of 20 March.\nWe have paradox situation here.See below:\n\nMy account details are correct -you transferred two\nPayments.\nShipping labels were sent by you -items shipped next day.\nAuthentication was confirmed ok.\n\nSo on 30 March no payment - that is 14,300.00\nYou still owe me .\n20334126,  20334429, 20551968\nIf this is not sorted out I am afraid you leave me little option - legal action .\n\nMany thanks for your help.","title":"Dear Vestiaire Collective support team","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Mrs L","text":"Owed me money and goods so they blocked me of the site 🚨ALERT 🚨 High class scammers\n\nMASSIVE SCAM GOING OK SOMEWHERE WHEN YOU ARE BLOCKED FROM A SITE BUT OWED MONEY AND ITEMS🚨 impossible now to get through","title":"Owed me money and goods so they blocked…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Jeannie Cameron","text":"Vestiaire Collective is the worst company I have ever had to deal with.  Each of my last 4 purchases has a problem with shipping and both seller and buyer do not understand why they continue to cancel purchases. When each side of the transaction contacts customer service (via chat or email only ) as there are no real people, there are completely different explanations. The people on these chats have no insight or ability to sort things out and say they will refer to experts who never respond. It is a complete shambles and i have spent hours of time following up to locate parcels or sort matters. VC way to deal with this is to cancel el chat or just leave it while you are trying to work toward a possible explanation. It is so frustrating. One of my sales was cancelled and I don’t know why, but they still have my item!  The shipping labels given to 2 different sellers had the wrong postcode in a different part of U.K. on the labels - it is shocking. These things can happen, but the worst thing is the complete lack of any ability to talk to someone in customer service - and arrogant non helpful people on chat who do nothing but say an expert will contact. It’s truly breathtaking in its incompetence. Such a shame.","title":"Simply breathtaking in incompetence …","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Ella","text":"I stopped counting how many problems I have with them. So writing here is at least  save my time and I avoid communication with helpless and not professional customer service. My item is lost again with Hermes \/ ERVI.\nI bought the item and received the email it is ready for collecting. I went twice to the local Tesco Express to collect it. They state they never received. I Contacted customer service and again was fed up of answering stupid questions. Again ended up answering the same questions that were already asked. Like prove you did not collect it , repeat the nature  of your question and etc… But my favourite one check with your neighbour if they collected it. :)))) THIS IS A GOOD ONE REALLY!! Why are not ashamed of sounding stupid? Why my neighbour should go to the shop to collect my parcel ? So again they requested documents to prove my identity. But as I after many problems I simply pay by Amex I will leave it to Amex to sort it out. They simply refund money deducting from Vestiaire. Without nightmare. I always wonder where   do you find your customer service? 🤣🤣","title":"I stopped counting how many problems I…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Chiara","text":"Absolutely hideous prices for shipping the item, authentication, fees that you need to give to them to put your items online etc. If you take provision for sale (a high one!), at least cover the shipping costs. What do I get as a seller? You uploading photos online for me and that’s it! What do I get as I buyer? Overpriced items and ridiculous “authentication” that YOU decide which ones to authenticate. What a joke. Not to mention if I have a problem with my order (which is almost always the case!), no one gives you support. You wait and wait and wait until you give up. So in summary, Vestiaire is absolutely overpriced in every possible way, ridiculous fees, shipping and authentication costs but no customer support nor good customer experience provided in return.","title":"Absolutely hideous prices","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Tanya Harbas  from Croatia","text":"VC saga continues !\n\nRe:20334126 \/ 20334429 \/ 20551968\n\nReceived email from VC  informing me DHL has lost my bag- Hermes Birkin ostrich bag -20334126.\nAfter not paying me for two months now this information-that Dhl\/ups has lost  my bag which was supposedly sent to buyer .\nOrder .?\nOnce VC has received bags from me -you are responsible for them.DHL\/ UPS are responsible for them .But suggestions that DHL has lost item is absurd.They are one of most respected companies all over the world.Also they offer insurance for high value items.\nThat bag was around 9,800.00 euros sold for and never paid to me \nIn all honesty I do not believe anything said by VC\nAs I have had truck loads of untrue statements, innuendos and false promises.\nStill waiting to be paid approx 14,333.00 euros .\nOn top of everything photo of my sold Hermes ostrich Birkin  has been removed from sold page !\nI wonder why ?\nSomeone is covering their trucks perhaps !,,\nSomething smells fishy here.\n\nThis would make a real story in newspaper shortly .","title":"VC saga continues !","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Georgie","text":"NO STARS if i could!\n\nWhat a horrible company. Just want to pull the hairs out of my head with these people.\nI am both a frequent seller & buyer. So they make 15% on the sales and then again they make 15% on you buying on the seller + another 10€.\n\nEventhough you take a lot of time reasearching an item before you put it online.\nSomehow they ALWAYS manage to screw up your upload.\nWhat's the point of have marked pictures from 1-10 if they are gonna radomly use it? Pictures all over the place, no flow for the eyes.\nThen they f* up the description completly!!!!! \nWhich really grinds my gears.\nSomeone over there is making a sport out of it to change your description to \nnon-English sentences. As well as changing names of items, where customers could actually find your for sale item with! Imagine that!\nAnd then there's is the WONDERFUL customer service. They make me want to vomit for real. Whatta bunch of tw*ts.\nService 0. Customer who? What? What's a customer.\nWe'll Just take your money and then you can just p*ss off.\n\nAs a buyer it is the same. But as a seller is a absolute NIGHTMARE.\nAppearently their buyers are a bit more important but when you return a Chanel because the description was not correct, they want to know why you would DARE to return it?\nEventhough i buy for over 10K a year with these morons.\nIf there's ever a new site like this i am gone.\nThank God for Vinted to sell on, at least they are respectful of you selling YOUR goods.","title":"NO STARS if i could!","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=9&stars=1&stars=2&stars=3"}]