[{"date":"2020-12-13","author":"Athina Kollakidou","text":"Horrible customer service. \n\nLong story short, I paid extra for Vestiaire to check the item I ordered. They removed the beautiful packaging that the seller had and they added a brown bag which made the product squeeze one on the other and cause damages. I repeat the seller was amazing, Vestiaire caused this situation. Who on there right mind remove the covers off the shoes? If I bought a never worn, with tag description I want to keep it like that. \n\nThe worst part, the customer service is awful. I spoke with them and they send they will contact the seller ASAP to confirm he included those parts. Needles to say I contacted the guy 4 times and they still haven’t. \n\nThis is such a hustle they caused. Horrible customer service. Paying extra for them to destroy the items! This should be there moto!\n\nUPDATE!! You can understand by the response that this is an automatic reply as I already send all of the details about the purchase last week!!! They’ve should have already investigated it, looked at information that they’ve collected and come back with answers!! \n\nThis shows extremely poor service \n\nDONT BUY FROM VESTIAIRE","title":"Horrible customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-13","author":"Susan Stevenson","text":"I’m a trusted seller on their site and have been falsely accused TWICE of trying to advertise outside of Vestiaire or sell my product outside of there \nplatform. I feel like I’m being victimised here as I didn’t do anything of the sort. \nOne customer service assistant didn’t see anything wrong and another said I was permanently banned. I haven’t offered to sell privately as one customer lives in Italy and another in Spain. This is ridiculous behaviour towards their sellers I’m not getting any help and my emails are being ignored","title":"I’m a trusted seller on their site and…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-13","author":"Susan Stevenson","text":"ACCUSED BY WEBSITE OF SOMETHING I DIDNT DO\nive just been banned from Vestaires Chat Feature for no reason. Ive been wrongfully accused of trying to sell to a customer outside of Vestaire. Ive been told by customer service. Firstly the customer service couldnt see why and today they are blatantly accusing me of trying to sell items outside of their platform. Theres no one you can contact and Im apparently permanently banned from chat. This is bullying behaviour it is shocking that you should treat your sellers in this way!!","title":"Wrongly accused By Vestaire OF SOMETHING I DIDNT…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-13","author":"Magns dn","text":"Terrible place \n\nWay to High fees  25% plus other expences, makes sales almost imposisble \nUnless you Will give away your stuff 😬.\n\nBad service Also .\n\nMany copy products , Also .\n\nOffer direct shipping = possible Fraud","title":"Terrible place","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-13","author":"PM","text":"Will never buy or sell from this company again! They sent me a Saint Laurent bag which was supposed to be “Never worn, with tags” and I received the bag and there was a large scratch on the silver hardware. I reported this issue to Vestiaire and they were of no help at all. They didn’t cancel the sale and give me a refund as one would expect. They told me that I could relist the item!! Not only this but when I went to relist the item (which was supposed to be commission free) they only allowed me to list it for £80 less than what I had paid for it! Absolutely disgusted and will never use this company again","title":"Be wary!! Will never buy or sell from this…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-14","author":"Hajar ","text":"NEVER BUY FROM THIS WEBSITE \/ N'ACHETEZ JAMAIS SUR CE SITE.\nI bought a paire of shoes on 05\/12. It was mentioned during my purchase that seller had 7 days to ship the item. Seller is not shipping it and not replying to my messages. I contact the useless customer service via chat who asks me to wait till... 20\/12 !! No clear answer of when my order will be cancelled or if I will ever get a refund !! I’m an active online buyer but trust me It was my first and last order on this website. I want to get a refund for my order number 32063873!\n\nUpdate: I contacted today the customer service again who communicates me that refund can be processed on 21\/12 only (not even sure because they refuse to confirm this by email) Which is 16 days after purchase for the 7 days mentioned in my conditions and on my bill. This is total scam they block your money on their platform to pocket the interest.\nNever order from this website","title":"Total scam","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-14","author":"Yeffrey Ramos","text":"Worst experience ever! took my money TWICE and didn't deliver. To make matters worse, took them a week to even return my money!","title":"Worst experience ever","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-14","author":"Tina Cholla","text":"Horrible customer service part 2 \n\nUpdate!! \nThey are continuing to be disrespectful. \n\nThey have altered the content of the box something that is illegal taking thing out of the box from a purchase  (consumer rights act 2015) and they offer discount for the next purchase (who told them that this gesture is appropriate). Do they think after this horrible service that there would be a next purchase ? Or do they think that with an unnecessary discount that I would be satisfied? \n\nThey are so inappropriate. This guy is coming back with a line “we didn’t found the items that we removed from your purchase”. Who gave them the right to do that ? \n\n1) unprofessional \n2) not worth the hustle \n3) rude \n4) by the end they will offer only a discount even thought they are the one to blame \n\nDONT BOTHER\n\nNEVER BUY FROM VESTIAIRE YOU WILL REGRET IT!","title":"Horrible customer service part 2","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-15","author":"Hazeley","text":"I just thought it helpful to give some feedback on my experiences with this site.  Firstly, as a buyer its been remarkably its been trouble free.  However, as a seller its been a total nightmare! Vestiaire appear only to be interested in their buyers, and offer very little, if no support, to their sellers despite the fact that they take sizeable commission from each item you sell.  I have had buyers wear and worse still damage my designer items, then return the goods and Vestiaire immediately refund them their money, before you have a chance to report back as to the condition your returned items were received back in.    It's been an uphill battle.   The final straw has been trying to get them to send me a shipping label after their system failed.  So far I have spent 5 hours on the case and each time I contact them I get fobbed off with no solution in sight.\nIf you have the patience of a saint and money to waste on you designer items, then this is the site for you.  If not, my advise is steer clear as a seller!","title":"Sellers Beware ..... prepare for a battle!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-15","author":"Victoria Diaz","text":"3 months ago I've sold an Acne Studios sweatshirt (absolutely new, with tags). By mistake I've sent the wrong size. Instead of sending the item back to me they lost it.\nDuring these 3 months I've contacted VC customer service several times but no one solved, nor informed me where my item was. In fact I have downloaded a chat where one of your customer representatives  where this person (Bart) ensured me my item (11617815) was safely guarded at VC France warehouse. This is ended to be FALSE as other customer service told me they have lost the item. The mistreatment VC displays against sellers is outrageous. After 3 months VC refuses to pay for my sweatshirt as it shows to be lost.\nAs a user I feel mistreated and deceived.\nThey constantly push you to lower prices, to send in time, to take good pictures, to contact buyers and send messages of promotions to people that mark your products, but they delay payments, lost your things and NEVER take responsibility for lost items. \nI want a full refund for my lost. I need a person in this company to contact me with to solve this problem. After 3 months nobody takes responsibility and they don't want to refund me for an item THEY HAVE LOST.","title":"VC dont refund for lost item","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-15","author":"L Rodrigues ","text":"Had and I am having a terrible experience with VC.\nThe item got lost by La Poste, VC instead of giving the carrier a call to understand the whereabouts of the item (300€ item)... is more concerned in asking me to send them a handwritten letter and Id Card so they can open a case with the carrier.\nI have raised 5 cases with VC and there is no proper follow up. I have sent 8 chaser and total radio silence. There is no customer service number.. so its a great experience for the client.. you get stuck with hundreds or thousands of €.. and you have to wait for them to reply... basically.. when they feel like. This company is not set up, and  should be fined for making the clients to go through this terrible experience.. we are stuck with virtual chat boxes and emails. Unacceptable...\n\nMy next step is to write a handwritten complaint letter to the respective department","title":"Delivery issues - bad customer service experience","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-16","author":"F Abo","text":"Just had email that item 13363372  presented for sale on 15 Dec needs original photos. These are original photos. I took on my iPhone on white table and in my hallway and with my jacket, can you look into this issue, too many items being told need new photos, it makes no sense!!\n\nPlease provide adequate training to your staff as they are making the selling process nonsensical!\n\nI will be updating this review based on the response I receive.\n\nUPDATE 16 Dec, the response below from Vestiaire makes no sense and is a typical standard message from Vestiaire, how can photos that I have been taken with my iphone not be original. How much more original do photos taken from my iPhone need to be????  Instead of taking the feedback you are getting on Twitter and Trustpilot from sellers seriously and providing better training to your staff, you have instead decided to continue to churn out the same standard messages. Its making it impossible to sell, I have put this listing on other sites without any problems. What exactly is wrong with the photos? I know your site has had many issues with lots of fakes, but now it seems you have gone in the complete opposite direction and are now rejecting authentic items and items presented with original photos. It makes it very hard for sellers to trust that any of their sales will actually go through, so most are moving elsewhere where they pay no commission or much less and get better treatment. Provide better training!!!!!!!","title":"Original Photos being rejected!!!!!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-16","author":"Gabriel BASTIN","text":"Worst customer service i ever saw\nCan't destiguish between a fake and a real one\n\nEven with the answer they gae me, i contacted support service, and once again, no good responses. Their controle team is uncompetant, wouldn't trust this website for my other purshases","title":"Worst customer service i ever saw","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-16","author":"Jane Baker","text":"Christian Louboutin [ref: 12307622], \nI bought this item Christian Louboutin ankle boots. When I purchased them I got an email from VC stating that there was a difference in the description and they sent a small photo of the box which had a plastic covering the logo. When they arrived the plastic covering was completely stuck to the logo which when any attempt was made to remove it would have removed the logo. The box also had a Net a porter label on the side which was not shown in the photos. I filed a \"issue\" and returned the item and was informed that they could not refund becuase they had informed me the box was damaged. Nowhere was I informed that the box was damaged ( affecting any resale) nor that it was a net a porter purchase . Customer services gave standard responses and were very unhelpful. Very disappointed in this particular transaction.","title":"Christian Louboutin shoes","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-16","author":"Micci","text":"To be fair, there was a good product I was satisfied with in the past.\n\nHowever, what I disappointed this time was the response when the condition of the product I purchased didn’t match the description.\n\nThe item was described as a good condition, but in fact there were multiple tears in the silk fabric. This was not stated in the description or in the pictures at all, and the item was clearly eligible for return.\n\nI contacted customer service and received an immediate response, but what they recommended was to re-list this item. The guideline states that if the item description does not match the actual condition, customers can return it. They disregarded their guideline and I didn’t understand completely their customer services. \n\nI felt like their reply was just a template when they received unsatisfactory comments. I don’t think they investigated the difference between a photo of damaged areas I sent and the description and photos listed on the site.\n\nI also disappointed that their authentication team did not notice the difference between the product description and the actual condition during the process. What are we paying the authentication fee for?\n\nI sincerely hope that the company will respond in good faith and improve their service in the future.","title":"Multiple tears on fabric that were not mentioned in descriptions or pictures","stars":1,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-17","author":"Mai Do","text":"This is a warning!!!!!!!!\n\nPlease DO NOT spend your money at Vestiaire Collective. Your money deserves something much much better. \n\nI had very bad experience buying at Vestiaire. I bought a Chanel bag (unfortunately my first spending at Vestiaire is such expensive item) from a Trusted seller. I was expecting so much because in the photos the seller uploaded, the bag looks perfect without any imperfection. \n\nHowever, the first impression was so disappointed. \n- Right next to the bag lock is a terrible scratched area. Then I was so worried checking all of the bag. In the bottom part is another huge scratches. The surface of the bag is filled with uncountable small scratches, looks like someone used the nail to damage the leather. \n- The serial number, which used to be attached to a Chanel bag is removed. \n\nThose damaged things were totally not mentioned in the description. \n\nI contacted the customer support team. First she said “ I am happy to tell you that this return has been accepted“. Wow, “what a good service” - I thought. I sent the item back to them. And after a few days, I received an email from DHL. YES, FROM DHL. And NOT from Vestiaire, that I will receive a package sending from Vestiaire on the next day. \n\nNo NOTIFICATION, no EXPLANATION. \n\nAfter I received the bag, I contacted the customer service again and ask them “Why did you send back the item to me without any notification?” Should I deserve an explanation? \n\nThen I received an answer that they checked the bag and it is the same as the seller’s description. WOW. Where on earth stated in the description that the bag was damaged?????? \n\nI sent them the photo of the description, and asked them to show me. Where, where did they see that the seller wrote these problems? \n\nThey asked me to send the item again for a second check. Ok, I sent the item right on the next day. \n\nAnd after a few days, AGAIN!!!!, yesterday I received an email FROM DHL, that I will receive a package sending from TCG VG (definitely the bag, because the notification from DHL has the description of the item). I was SO SO SO SO SURPRISED. They did it again. They are sending back the bag to me WITHOUT ANY NOTIFICATION - AGAIN. \n\nAnd it is Christmas time. I supposed to visit my parents from this weekend, and I’m not going to be home in the next two weeks. What should I do???? Staying here and waiting for a mistaken happened twice? If not, what will happen to that thousands euro bag? \n\nThat is my money. I spent years to have that money. I put TRUST on Vestiaire. I was thinking a month before buying from them. What I received is DISAPPOINTMENT and DISRESPECTFUL. \n\nSo please please please, don’t waste your money to buy anything from this website. They receive the commission to have quality check service. But their SERVICE is only a FRAUD. There is no service provided by their EXPERTS.","title":"This is a warning!!!!!!!! Do not waste your money and time","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-17","author":"Sasso","text":"I have ordered an Hermes scarf on 28.11.2020 for a Christmas gift. I have paid an extra fee for the item to be checked by Vestiaire Collective. The seller confirmed that the order was shipped via UPS on 01.12.2020. We are now on 17.12.2020, the package has never been received by Vestiaire Collective. Both the seller and I tried to speak with someone from VC to have information; no answer. Finally on Monday, someone told me that they will reached out to UPS to check. 4 days later absolutely no news. My account was debited, I don’t have the gift and nobody from Vestiaire is contacting me. Such a shame. I would not recommend.\n\nEdit 31.12 - still no sign of the scarf. I have contacted Vestiaire Collective who told me that they are liaising with UPS. No one from Vestiaire Collective has reached out to me. It’s been more than a month. Worst customer service ever","title":"Hermes scarf never received","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-17","author":"Eva Gdn","text":"I sell and buy regularly to their website.\nThe last time I decided to keep a receipt for my own and sent the earrings ref 13174639 without the receipt. 4 days after I received a mail that my earrings are the contrefeight even though I’ve already sold twice completely the same earrings ref 13002787 and 11180248 and everything was ok with them! Ok i send a receipt to their pseudo “experts” to prove the authenticity but still no answer. Ok i decided to check if they are honest I bought the article ref13179240 and I decided to sell it from the account of my husband because this account was accused in selling the fake article, like a result I list this item 13179240 still with tags attached their own receipt of VC and I got a refuse of this item even being listed online! A result: Stolers, scammers! It’s time to speak about your activity on TV! It will be good to speak about you at BFM and France24 how you permit to treat the people like Dog without any respect and to destroy your website full of “pseudo professionals” FOREVER!","title":"The scammers!!!","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-18","author":"Rosalind Caplan","text":"I am utterly disgusted with Vestiaire Collective.I sold a vintage dress which the buyer returned,with false claims that the condition was not as described.After many emails ,Vestiaire said to send the dress back to them & they would sell it on their account & I would receive payment two weeks from receiving the dress.I have not been payed & whats more they are passing me from one representative to another.\nThis has been the most distressing experience I have ever had with any company. They obviously don’t care about their customers, \nIf by any chance I do receive payment I will edit this review.\n19\/12 I have just received an email saying that I will receive payment on 23\/12 so if this transpires I will be delighted! We shall see!\nIt is now 28th December & as yet I have not received payment, It was to have appeared on my bank statement within 4 days.!!!\nOnce again I was promised that the payment would be today,the 29th December & guess what!! It’s not!! There’s no excuse for this it’s just dishonest practice.\nI have now received a message that is basically calling me a liar & saying the payment has been made!! Unbelievable!!\nThe last email that I received today is now trying to put the blame on my bank! My husband went to the bank & there is no payment. I am so upset , I can’t believe that a company can behave this way\nThis is my last posting, having realized that they actually hadn’t sent my payment, as if by magic it was payed yesterday & in my account today.\nI can honestly say that I have had to fight so hard for anything that was rightfully mine in all my 78 years","title":"I am utterly disgusted with Vestiaire…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"},{"date":"2020-12-18","author":"Purchaser","text":"I had 2 cancelled purchases in approx 1 month, with sellers that do not proactively announce they deal with shipment issues. It caused me personal issues and lack of liquities.","title":"I had 2 cancelled purchases in approx 1…","stars":3,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=84&stars=1&stars=2&stars=3"}]