[{"date":"2022-02-01","author":"Mrs Gabeva","text":"One can wish at least a month to pass before VC does something outrageous again, but yes, it is way too much to ask for a low level company full of inexperienced, incompetent and lazy employees whose actions are obviously tolerated by the management to complete the  circle of idiocy. \nMy question is - why bother to give a detailed description of the items why nobody will even bother to read them. In this case - how do they find an item non-compliant as they have never read the description. In this case - a Chanel sweater, very good condition with one loose seam on a button. All this is explained in the description (even with the caption “attention” and there is even a picture of it. To be clear. I also have taken a screenshot of the description (i always do before sending my items and I recommend all of you do the same, because the sneaky ways of VC trying to cover their own incompetencies are numerous). Now, they sent a quality report that they “found” a tiny issue with the item - “loose seam”. Hello?!?! It has been duly described and shown on a picture. So, to say i am surprised- not at all, it is VC and their bunch of idiotic actions are always expected. But should we keep silent? Absolutely not. Their ratings are dropping and rightfully so. Because customers should voice their experiences and attract attention to VC’s multiple, constant, never ending and growing list of wrongdoings and the reapeting avoidance of  taking any accountability for their lack of professionalism and unfairness which has been ongoing and tolerated within the company. Seems like an official company internal rule.","title":"Totally disgusting","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"annC","text":"Just an awful and VERY expensive experience.","title":"Just an awful and VERY expensive…","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"Lara Trindade","text":"This application is not democratic:\n. doesn’t allow you to sell all type of articles\n. VC always crops the main photo, doesn’t allow to submit the original photo. And not always does a good cropping job.. many times I had to resubmit the item to get a decent and attractive photo.\n. VC charges high commission for the service it provides\n. VC has a terrible customer support. Sometimes you end up speaking with 10 different people to resolve your issue. It also takes quite some time to receive a response.\n. It’s terrible that you don’t have a contact number to call.\nIts also bad that you don’t have much information about how to present a formal complaint.\n.VC doesn’t allow you to edit the adds. Its a nightmare. If you want to change something in the listing.. you have to resubmit.. which doesn’t makes much sense\n. The items also take quite some time do be live. \n\n\n\nOverall I think other apps liked VINTED for example, are a lot more flexible and easy to work than VC","title":"This application is not democratic:","stars":2,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"Ye Li","text":"This is fraud website. I sold my designer bag on their website. They use an excuse that the buyer had compliant about the quality of my bag. I told them this is ok if the buyer want to return the bag. However, they neither pay me or send my bag back. Be careful of this website if you are a seller. I would rather donate items rather than dealing with a fraud website.","title":"This is fraud website","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"Sienna Rothery","text":"Very poor customer experience. Made my first order, received the package today; instead of receiving the designer leather jacket I’d paid for, I received a high street pink woollen jumper. No way to review the seller and warn others that they were a scammer. Have reported to Vestiare but they clarify it will take them 3 days to respond and it seems that the only thing they offer is relisting the item, rather than refunding it. Won’t be ordering from there again.","title":"Very poor customer experience","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"Hristina","text":"A fair update on my previous reviews: \nAfter long and unfruitful months of correspondence, finally, both of my two dissapeared parcels have been refunded. \nHOWEVER, receiving a payment with such a delay, more than two months after the sale, is calling for some amends , bigger than a \"we apologize for the inconvenience\". I have a good deal of my  time, nerves and energy lost, trying to sort out this mess, that your customer support has been so reluctant to resolve.\nPretty much pointless, I sold a worthy piece for far less, because I needed the money fast... According to your updated lower selling fees, I would have made 100 EUR more on this sale, even if I have kept the same price. \nI find it truly awkward, that you still have deducted fully your selling fee of 310.00 EUR from my bag, even though you have made no sale whatsoever. \nIt feels truly diminishing towards the whole \"customer experience\" horror story , that you put me through.\n\nI hope you find some useful constructive criticism in this review and you just might achieve in the future the customer satisfaction, that you claim to strive for.","title":"Update. Finally, refund has been made.","stars":3,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"Mrs Jean Butler","text":"Appalling treatment. I have sold over 420 items. All our items were were submitted in the usual way where it states our curators will check your submitted items fit within the brand standards. All were listed and therefore were suitable for sale and all of our items where the buyer had requested passed your inspection tests at your hub. Last week I had and e mail to say that my account was being removed on the grounds that several of our sold items did not meet compliance. That’s very strange as you approved them to go on your website once submitted your curation team will carefully check the brand standards and all had passed authentication. The infringement of your terms I am supposed to have breached is not on your website which is illegal. Neither was I invited to show proof of purchase to prove my case. I also notice that other sellers in France Austria Germany U.K. and France are selling the same items. Why haven’t you banned them. Or is this treatment just for me. I don’t understand at all what I am supposed to have done \nI was told my account was deleted so cannot conclude any business outstanding. My profile is still there and it states that I am temporarily unavailable which is a lie. Also since my ban you have let 2 sales go through that I cannot send as I cannot get into my account. You are using my items as bait to attract buyers that cannot buy. So 2 buyers that have purchased since my ban are left disappointed that is firmly on the Vestiaire and not on me \nThere are several outstanding cases that I need closure on. They have been outstanding for some time but I cannot see anything on my account as I am now banned so cannot see their progress. I am not going to accept that you just delete and keep my property I am quite happy to take either you or the buyers to the small claims court to get my money or items back \n\nItem number 19380526 out for delivery since January 12th please pay me or return my item I cannot see an update as I am not allowed into my account \n\nItem number 20203611 and item number 20203611. The buyer purchased 4 pairs of earrings. These two pairs were the same style but different colours. She claimed that they were used. That is impossible as I don’t have pierced ears and all our jewellery is new and authentic. It was a way of try before you buy. No report was sent to me and no evidence provided ie photos. Please return my two items or pay me. This is theft\n\nItem number19345203. Sold on 27th November. The buyer claimed they were broken upon arrival. They were well packed and sent out in perfect condition. Why would I send a broken pair of earrings? I was not given any report. So upon enquiries several weeks later as they had not been returned to me I was told she had been allowed to keep them for a further week to try to effect a repair. This was without my consent and illegal. When I got them back one earring was broken in two and half melted. The damage was made far worse as some one had try to solder them. Looking in the packaging there was just a lump of melted metal from a botched repair. Please pay me for my item as you allowed further damage to my item without my consent. These were sent out in perfect condition \n\nItem number 20267011 was at your hub when you banned me. Surprise surprise a tiny issue with them. But I could not see the report as you have banned me. Please return my item I will wait to see what the issue is as these were in perfect condition when sent. I cannot re sell them as you have banned me \n\nI cannot express my disgust enough at the way I have been treated. As I say I am happy to sue you or the buyers to get my property back. I am also happy to go to the media to tell them how I have tried and convicted. And how badly you treat people with no consistent policy. As others are still selling the same items. I find it amazing that you are using my items as bait and wrongfully telling buyers to check back later. On the day I was banned without explanation I found out I was seriously ill. So please conclude the above as quickly as possible so I don’t have to waste any more time on your ridiculous company that make the rules up as they go along. If my sold items did not meet compliance please refund the £6000 in fees I have paid. I cannot wait to part company\n\nThank you for your reply there is a further item that needs attending to. The item number is 20267315 these have been outstanding since 20th January. Please advise as soon as possible","title":"Appalling treatment","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"Michelle","text":"I'm a newbie to this company, just opened my account yesterday. I added a YSL 5 a 7 bag to my cart. But before purchasing I decided to check reviews. And boy, I'm glad I did. I have decided to NOT purchase anything from here and will be closing and deleting my app. THANKS FOR THE WARNING EVERYONE! :)","title":"I'm a newbie to this company","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"M_Gi","text":"I buy and sell across all major platforms as a side hobby and Vestaire Collective is one of the worst to use as a buyer (haven't successfully sold anything on it either).  My recent order was a used piece of luggage purchased from Italy to be shipped to the US.  They collected nearly $200 in tax and customs duties yet never actually filed them on the shipment (box would have had the paperwork on it).  AKA they just ripped me off $200, not to mention ebay sellers never charge you duties and just ship you the item.  The fees really rack up when buying on here.  They also shipped it atrociously packaged and the box was completely open when it arrived.","title":"Would rather buy or sell anywhere else","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"Susanna","text":"Had heard a lot of praise of Vestiaire, found my dream bag, but there are tech issues with the payment. Have been going in circles with chat bots and standard emails for a full week. I dont understand how such a site can have such poor service. Super dissapointed - and frustrated to not be able to buy the product that I want.\n\nThank you for responding (dont know where else to respond to your question). Honestly, I am not sure this is worth it, because I expect to be sent around in circles again........but here goes: the reference number is 9750044, you can see our attempts to buy in the comment section under the bag profile, my friend Maria has tried to carry out the purchase.","title":"Worse service ever, so dissapointing","stars":1,"location":"FO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"Christian Stanton","text":"Please DO NOT USE THIS SITE the service is ridiculous twice now I have lost out on items because Vestiaire has not provided the correct paperwork to get the item through customs and when you try and sort it out with them through their abysmal chat service they say it’s not their problem !!!! ITS LITERALLY THEIR PROBLEM !!!! The whole process of buying through Vestiaire is full of frustration","title":"Please DO NOT USE THIS SITE the service…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"Jamila ","text":"I purchased a bag from you just now received it and noticed a portion of the handle has been stitched? Not described by the seller in thier description as very good cond. The rest of the bag is fine. So I contacted customer services and sent in the relevant photos. To my shock they have checked it again and said it matches the description Crawley V.C which it clearly doesn't, also the V.C tag was not attached to the bag when I received it. They have relisted my bag without my permission when I clearly asked for it back. ? I'm in doubt about the bags authenticity also now. Should a genuine chanel Bag have a portion of its handle stitched in blue? I would like this looked into by a manger or supervisor as I love the bag and want to keep it but am concerned that a portion of the handle has blue stitching running across it. Shopped with V.c for years not had any issue like this before. Not happy at all.","title":"I purchased a bag from you just now…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-05","author":"Dawn O'Rourke","text":"Bought from Vestiaire.\nRef: 16659007\nMoncler\nSunglasses\nThese glasses are still available. Please read sellers reason for not selling them to me below...This is not acceptable. When your sellers agree to a sale. Then they should honour that sale. I am not interested in your voucher of £15 off if I spend a £100. I want this seller to be held accountable for withdrawing this sale after they had accepted price. They want more money for item...... If you allow this behaviour by sellers on your site, then I will make sure others know this.\n\nHi, my sincere apologies. I thought I wrote back to you! I won’t be able to send them anymore. After reviewing the prices, I’ve realised I’ve sold them for much less of the market value. I am really sorry about this, I know you would be super disappointed. I will cancel the sale.","title":"Bought from Vestiaire.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-05","author":"Denis","text":"Yes, I do know the time limit for a complaint, I already mentioned that, I missed it and that's why I resold it.\n\nBut still, even with no fees it would be impossible to resell it for nearly the same amount since the condition doesn't match the description at all.\n\nAlso doesn't change the fact that it is impossible to get in touch with you directly and to get justice for the insanely bad packaging plus the overall very bad condition of the product.\n\nThank you for the coupon for this but it still makes me sad that people dont care about correct packaging.\n\nI do understand that vintage clothing can smell especially when using perfume but that wasn't just a slight smell it literally was covered in it.\n\nAnd when something like thick silk clothing gets insanely folded in a way too small package by literal brute force the condition of the product gets way worse, there are also buttons and the zipper involved.\n\nAnd about the jewellery, it is a 50 euro (seller personal offer, not mine!) + 30 euro (fee\/brexit) ring with an artificial stone which is of course obvious but the bad manufacturing (the associated scratches and notches) were not mentioned at all.\n\nI can't post\/link pictures here but I can provide them if needed.\n\nI would say it was just a cheap buy but the quality is like its coming out from a gumball machine and not from your website.\n\nI am talking about this item: Ref : 18626260\n\nI did keep it since I paid half of its worth for customs duty\/fee (GB to Germany) and it is literally impossible for me to resell it without scamming someone else.\n\nThe seller of these products is (in my opinion) not legit, you can literally see it in his duplicated offers and products, nothing there is unique, with another price but the same pictures and you keep accepting\/listing them!\n\nLook at this new offer it is the same what I bought:\nRef. 20911377\n\nIf you allow people selling the exact same low quality products over and over with wrong\/misleading descriptions it has nothing to do with the standards you try to represent!","title":"issues with packaging and quality","stars":3,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-05","author":"Tanja Hill","text":"Will not stop sending me emails. Will not let me unsubscribe.\n\nAs you can see from the company’s revenue below. Not happy as that is a lie. I have never bought anything from them ever. \n\nPlease stop sending me emails immediately","title":"Will not stop sending me emails","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-05","author":"Kirsty Donlan","text":"I bought a bag in 2017, resold it recently through them to learn it’s fake. Refund took 3 weeks to process, I had to chase and chase and chase. No apologies, no assurance of improvements authenticity wise, just begrudgingly refunded. I carried around a bag I believed to be genuine for 5 years! How embarrassing! Be VERY VERY wary.\n\n**EDIT**\nThankyou for your reply but I have received no further correspondence from Vestiaire? Customer service really needs improving!","title":"I bought a bag in 2017","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-06","author":"Martin Moore","text":"I had on vestiaire a louise vuitton bag that was brand new and never used that I was selling. A buyer bought this from me but upon inspection at the vestiaire site they claimed it was marked showing blue colouring on the lock. This stopped the sale and was returned to me. There was no such mark and upon complaining they said they would investigate and get back to me where I am still awaiting a reply. Very disappointed and will not sell anything there again.\nreference-17129806","title":"Rubbish","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-06","author":"Chanel Amber Parker","text":"Absolutely awful, do yourself a favour and do not buy from this site! Save yourself the time, hassle and money \nThey took forever to send the item due to whatever they have going on, then DHL deliver it a month later.. then today I get a duty and vat bill for £406 months later, they didn’t mention any import charges about it prior to delivery, had they had mentioned it I would have most definitely declined the delivery! The coat I purchased from the seller for around £1k  certainly wasn’t worth it at all! Also I previously tried to order a coat with another seller only to be messed around and then refunded and ignored by the seller and Vestiaire when I was trying to re-buy it as that seller had some location issue, Vestiaire just stopped responding to me in live chat, when they did bother to reply it was ages after I sent my messages. The process they use is most definitely the cause of this! I have never had this issue with eBay, depop or Vinted!","title":"Absolutely awful","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-06","author":"Marija L. Lazarevic","text":"I purchased a bag, they took my money, canceled my order without mine or sellers consent. Told me they made a mistake and they already refunded me. I never received a refund, and the amount that they said they would refund was less then what I paid!!! SCAM","title":"SCAM","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"Mrs Gabeva","text":"Another scam from VC. Or proof how VC are totally confused in their actions and nothing in this company is actually structured and organize as it is claimed to be. Just the opposite. \n\nJust received an  mail - i have copy\/pasted below:\nBUT: i have not sold an item with this reference number. My items sold from last weeks, have been all already checked and accepted. \nSo,  this is NOT my item. But they sent that email to me, therefore attaching some whatever item to my account. Meaning, next step,they will mess with the badge and then will take 6 months of “looking into it” and “deeply apologizing”  etc etc till they fix the yet another mess they did. If they are not really not that stupid it means they just use new “tricks” to mess with people.\n\nOur authentication team have carefully examined your item, described as Blouson Chanel ref: 17131379.\n\nUnfortunately, in applying the criteria involved in this process, we have been unable to verify its authenticity.\n\nWe are therefore cancelling the sale.\n\nYour item can be returned to you for a payment of 12€ which covers our processing costs as wall a return postage.\n\nPayment can only be processed by bank transfer in the following ways:\nIn €: IBAN: FR7630004029990001018603673 Swift: BNPAFRPPXXX\nIn $: Routing Number: 021000322 Account Number: 483043545770 Swift Code: BOFAUS3N\nIn £: IBAN: GB05BARC20315243993647 Swift: BARCGB22\n\nIMPORTANT: the item reference number as well as the first and last name on your Vestiaire Collective account, must match the wording of the bank transfer reference.\n\nAs soon as we have received your payment, we’ll return the item to your billing address within 15 working days.\n\nWe’ll send you an email with the tracking number as soon as it leaves our warehouse, so that you can track your package’s journey.\n\nWe’re sorry that your sale couldn’t be completed, but we hope to see you back on Vestiaire very soon.\n\nWe’re here to help if you need any more information.","title":"Another scam from VC","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=19&stars=1&stars=2&stars=3"}]