[{"date":"2021-03-24","author":"MRS C DENHOLM","text":"I have several rabbit fur jackets on my site. I am UK based. A UK buyer was told that she was not allowed to buy because of customs restrictions since Brexit. Obviously nonsense. I cannot get VC to explain why these items are being wrongly blocked from being sold within the same country because there is no customer service to speak of. The 'chat with us' function is totally unhelpful and there are no other alternatives offered. I am about to move all my items elsewhere but they couldn't care less. Used to be so good.","title":"Incorrect restrictions being applied post Brexit","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-25","author":"Lucy","text":"There customer service is practically non existant, I contacted them as to why they had canceled my sale and now demanding why I pay €12 to return the item back to me. Me as the buyer and the seller are very confused as to why they haven't passed it as they have already confirmed the item isn't fake. \n\nThe buyer still wants item and I still want to sell, When I asked to speak to manager or the control team who deals with checking items I was told they would email me which I know isn't going to happen.","title":"Have cancelled a sale due to authenticity but won't give a valid reason why","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-25","author":"Sally  Mcternan ","text":"I am now waiting for almost 2 weeks for an IT fault to be fixed ! The VC system has suddenly decided it doesn't like my post code, I have a dress and a bag caught in cyber limbo. I keep being told by the CS team that I must wait 24\/48\/72 hours for some sort of miracle to happen. Totally hopeless - no bag, no dress & money passed over - not good enough!","title":"Terrible time with VC & their IT problem!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-25","author":"Camille","text":"If you buy and sell on VC and don't encounter any problems (sellers not responding or sending out your item, authentication issues, etc), then VC is a great platform for buying and selling.\n\nThat being said, if you do encounter serious issues, don't count on customer service being helpful. I had what should have been an easy problem to fix: a week had passed without the seller shipping an item I bought, which is the deadline given to sellers when they make a sale (this is very clearly written out in the FAQ's and in the instructions sent to you with each sale). I explained this a number of times in the customer service chat and literally attached screenshots of VC's own written policy from their FAQ's, and the agent kept insisting on me waiting as they tried to get a hold of the seller (which I got notifications of them doing throughout the week - the seller in this case was just seemingly inactive). I insisted that this made no sense, as it meant that either the solution I was being given was incorrect (to wait 2 more weeks before my order being cancelled), or that VC's FAQ and policy of sellers having one week to ship an item is a lie. The agent tried to give me explanations that contradicted their FAQ, and when maybe it became very clear that I was the correct one in this exchange and that I was not going to stop messaging, I was KICKED OUT OF THE LIVE CHAT. I didn't even know companies could do this! I thought maybe my wifi went out, but that wasn't the case as I was able to open other tabs and windows and sites just fine. The \"Live Chat\" button was greyed out, and when I tried clicking the sticky question mark help button at the bottom right of the page, which normally brings up the live chat modal, I was prompted directly to just fill out an email form rather than speak to a rep! Truly a mind boggling exchange.\n\n1\/5 stars for my recent experience, 5\/5 for my usual buying\/selling experience. I hope to never ever need their customer service ever again.","title":"Great if you never have any problems, terrible if you do","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-25","author":"Manila","text":"Nice app, and a really good place to find cool vintage products :-) Unfortunately if something goes wrong, it seems almost impossible to reach an actual person for help \/ answers. \n\nMy address was registered incorrectly (My own fault) So after my package had reached Denmark (Shipped from France) It could not be delivered and was returned to France again. The app asked me to refresh my address so they could resend my package, and after doing so several times and trying to reach customer service, the package was once again sent to Denmark with the wrong address label, and can not be delivered. I guess I'll have to wait until its returned back to France once again, and maybe if i'm lucky it will be possible to registrer my correct address, but at the moment I think it will sent back and forth with the wrong address. \n\nSo be careful to registrer the correct address the first time! Otherwise it seems impossible to have it changed. \n\n1 star for lack of availability of customer service, otherwise great app :)","title":"Non existing customer service","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-26","author":"Antonella","text":"I bought a pair of sneakers. They went through the authentication control with a positive result. I received the shoes but they were fake. I sent them back with a letter explaining in details all the points. I was totally reimbursed. \nLater on I checked the seller page and those shoes are again on line for selling!! My question is: How VC protects us from frauds?","title":"Fake","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-26","author":"Verity Bradley","text":"Truly awful customer service. Having waited a month for my delivery, I have been passed from the courier to Vestiaire several times; Vestiaire declined to open an investigation into the missing item until there was 15 days with no update from Chronopost and then still failed to investigate for another week. There is still no understanding of where my order is, despite the money having been taken from my account.","title":"Truly awful customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-26","author":"Simona Todorova","text":"Shopping through it was good for me but I'd like to leave some really bad feedback for the website and app functioning instead. It is so hard to find what you're looking for. I search for a brand in the search tab or for \"blouse\", \"kimono\", etc. and so many unrelated results appear. I really don't understand why it's not made to function properly. It wastes my time and I just dislike using it because of that. How do you want me to buy something when I can't find what I'm searching for? Terrible. Example: Koana is a brand of swimwear. Even after adding filters it's dysfunctional. It says there are 6 results from the search and then shows none. If I search for kimono, out of the 999+ results, I guarantee you there will be 200 max that are actually kimonos.","title":"Terrible app and website functioning","stars":2,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-27","author":"Ricardo","text":"HIGH FEES! POOR Customer Service. I sold one used pair of shoes and the amazing Quality Control Team refuse my item because I didnt send the shoes box. I tried twice to explain to CS that if I didnt write that the shoes comes with box is because is not included... answer from CS representative: \"If you buy a pair of shoes in a store you will receive a box\" lol after this answer what can I say more???","title":"HIGH FEES POOR CUSTOMER Service","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-28","author":"Olivia Burke","text":"I have bought 2 dresses off vestiaire that were both advertised by the sellers as UK size 14. When they arrived, they were UK size 8 - both had 30inch busts (even with designer clothes being slightly smaller NO size 14 dress has a 30inch bust). I was asked to provide evidence, showing the dresses next to a tape measure- I provided this evidence in both instances. In both instances, vestiaire came back and said 'no refund but you can relist with no seller commission' - incredibly frustrating. I thought, what a strange coincidence - 2 very different dresses, 2 different sellers, same issue...\n\nSo, I go to relist the items and whattayaknow - you can only relist them with the same details as the previous ad. you can add a 'comment' but this won't appear in the filters - in other words, no matter what I 'comment' on my ad, if a buyer searches for 'size 14 dress' my size 8 dresses adverts will be in the results. My choices are - take the financial hit, or lie to the next unsuspecting woman. I strongly believe both of these dresses are bought and sold multiple times across this platform, then vestiaire forces the disgruntled buyer to incorrectly advertise using their platform. The dresses never get worn and platform keeps taking commission over and over again off the new buyers.\n\nIts a scam.\n\nDo not buy any item off this website unless the seller has sent you pictures of the item next to a tape measure...to be honest, even then I wouldn't trust it.","title":"A Scam- and here's why","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-28","author":"Mya","text":"Very bad customer service everyone that joined the live chat left without even helping me. You don’t even get paid straight away you have to send the item to the customer and if your lucky 2 weeks later to might get paid. Just use Depop!","title":"Very bad customer service everyone that…","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-28","author":"Suzanne MS","text":"Misleading advertising led me to close my VC account last week. After some days VC apologized and I decided to give them a second go. My account was re-activated - well, not entirely, because all my items for sale were not included in the re-opened account. A number of contacts with VC Customer Care resulted in nothing but frustrating waste of time and insight into an organization scarred by an overwhelming level of incompetence. I am out!","title":"MASSIVE INCOMPETENCE","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-29","author":"Namrata","text":"I purchased a Celine trio mini which was listed as “Hibiscus” inaccurately. When the bag arrived it was bright bubblegum electric pink from a random cruise collection and not the classical traditional deep velvet red pink color that Celine do called Hibiscus. Vestiaire got the listing wrong and we’re trying to deny the mistake,  refusing to admit their error, and just too egotistical to admit it. I called their customer service 20 times, sent many emails but to no avail. The team on the phone could barely communicate or understand English-  seemed untrained amateurs. They REFUSED to escalate my complaint, and I got stuck with a bag I didn’t  like despite the error being with their website listing? If you authenticate a bag part of that is to ensure the accuracy of the item down to the smallest details.  IT IS DEEPLY UNPROFESSIONAL TO REFUSE RETURNS that too for a luxury item? - when the listing was not factual . Will never ever shop here again and have warned friends- have no idea how they even authenticate, could also be sketchy.","title":"Poor, poor customer experience- also please find a team that can understand English.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-29","author":"Chi Kei Fok","text":"Hi all\nUsually I dont give negative feedbacks, but I am so upset and disappointed about vestiaire collective recently. \n\nI used to love this platform. I purchased few items from the vestiaire collective app before, sellers were nice and shipped my items within 3 days.\n\nHowever, my recent experience was terrible, I place an order in 21st March, the seller did not ship the item within 7 days. I advised customer care team and seller to ship the item in a polite way. They just gave me the same reply saying 'please wait for our updates, the order will be cancelled after 7 days if not shipped'. \n\nI waited 8 days but the order is still not cancelled. Also, the seller did not answer my reply anymore.\n\nTherefore, I asked customer care to help me for cancellation. But they just asked me to be patient, will get me update shortly. Same generic reply everytime I ask them. I am so sick of that.\n\nIt is not my fault the item is not shipped, and the order should be cancelled and get my money back. Why keeping my money and ask me being patient?","title":"Terrible customer care, please stay away from vestiaire collective","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-29","author":"Nadezhda Dzhalazova","text":"If the seller or the product is a scam, damaged, not as described etc. do not expect trustworthy methods for receiving a refund. Never buy with Direct Shipping! In general, never buy from this site as if you are in need of refund - it is not gonna happen.","title":"Never trusting again.","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-29","author":"Daria Kr","text":"I bought YSL heels advertised as new in box. VC team when checking them pointed out that the heels have signs of wear providing one photo with some marks - looking like dirt, offering to discount an item by £13 if I still wanted them. Trusting them that marks presented on photos are accurate I accepted the offer. Heels arrived and they are brand new with no signs of wear BUT with DEFECTS. Marks assumed to be wear are in fact discolouration - heels caught dye from something. Any attempt to remove the dye results in paint coming off - they already arrived with white patches with no paint. Heels also came with dent sole and only one dust bag - YSL provides 2 dust bags, one is not big enough to fit both shoes. I contacted then VC both on a chat and by email and they don’t think they’re at fault. £13 was also provided in a form of voucher to use a on VC website and not a refund, it does not compensate anything. It seems like misadverting the item is completely fine. Now to fix the heels and repaint them will cost a lot of money, and additional time and effort. On the photos used by the listing heels seem to be in a perfect condition. On the only photo provided by VC with caption “wear” one can see few dirt marks. Upon arrival it’s clear they’re defected, and dark discolouration marks are all over the heels. Paying over £200 for misadvertised item is a SCAM. There was no mention of white patches with no paint, discolouration marks or dent sole.\nUpdate: I received a response from VC asking for a quote from shoe repair. I spent multiple hours to look for open shoe repair in the middle of pandemic. I’ve send them a quote TWICE, they never got back to me.\nNext pair of YSL shoes came with a scratch, marks and dirty sole covered in glue, with only one dust bag instead of two. At this point it’s a joke.","title":"I bought YSL heels advertised as new in…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-29","author":"Arianna Smith","text":"Absolutely appalling. I never usually post reviews on anything but I am so upset with my recent experience that I had to share. \n\nI purchased an item advertised as in new condition. It arrived, damaged, scratched and with jewels missing. This item had supposedly gone through quality checks and passed but was still sent to me in an awful condition.\n\nIt has now been a month and Vestiaire still refuse to help me. It is impossible to get a response from anyone through their customer service options and their chat service refuse to help, as it has been over 72 hours since the item was received. I had read the bad reviews on here and stupidly chose to put them down to independent sellers. They are not. Do yourself a favour and avoid this company.","title":"Absolutely appalling, avoid.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"},{"date":"2021-03-30","author":"HailzJaf","text":"I have used Vestiaire for years - as a seller and a buyer - and loved it (even with the high fees) as the service and customer support was great, however, over the last 6 months it has gone dramatically downhill.  The customer service team are rubbish - they don't answer your questions but give vague answers in the hope of fobbing you off and getting you off the call\/chat as soon as possible.  They also refuse to acknowledge formal complaints and requests for escalations.\n\nMy issue relates primarily to their courier pick up service.  They issue you with a DHL website link for pick up and a Waybill Number to arrange the pick up.  The waybill is NEVER accurate......every transaction requires hours of wasted time on the chat\/phone to customer service agents who don't care.  \n\nIt is so frustrating and disappointing and I wonder if this is all a rouse to get rid of UK customers (after Brexit) by making the service so poor they won't use it again.","title":"Rubbish Customer Service & Exorbitant Fees","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=65&stars=1&stars=2&stars=3"}]