[{"date":"2021-06-30","author":"Emma","text":"I do not recommend direct shipping. Someone purchased my dress, ripped the seams trying it on, and then said it was faulty. There is no protection as a seller, they offered me £20 compensation!!!\nI also am suspicious about the new functionality that sends you a notification that a seller is accepting lower offers and have noticed as a seller that I receive a lot of offers but no purchases!!!!!!","title":"I do not recommend for a number of reasons","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-06-30","author":"Sophie","text":"Bought an expensive brooch from Chanel. Seller wanted to add 2 gifts. Before shipping she notified customercare, to leave the gifts in!the box, I did the same and notified customercare…guess what? No gifts…I contacted customercare. They acknowledged they took the gifts as they are not allegedly able to report the gifts to the carrier, such nonsens! I live in the EU! Anyway, This was definitely my last order as I do no longer want to buy from a company who steals from their own customers!","title":"Bought an expensive brooch from Chanel","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-06-30","author":"reena mistry","text":"Customer service is SHOCKINGLY BAD!! Christelle P you wanted me to rate our chat. Well I give it 0 stars! Beware buyers, if you place an order and then cancel it before it even ships, then Vestiare will rather continue to have the item ship to them, then ship to you, then you ship back to them, then they ship back to the seller. All the while you’re waiting for a refund and anticipating receiving the item you no longer wanted. The seller has had to ship the item they know full well that you will not be keeping. In that whole process- time, packaging, carbon emissions and no doubt salaries are wasted!! And all because Vestiare wash their hands of any actual customer service and the ability to intervene once you place an order.  My advice for this company would be to actually invest in customer service and a digital platform that works better!! Go Vestiare Collective for being such a ‘green\/eco friendly’ company! \nI’d rather take my business elsewhere!","title":"Customer service is SHOCKINGLY BAD!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-06-30","author":"Clare","text":"Customer Service is a joke. Serious technical issues with the website post brexit which no one seems bothered about resolving. I’m done with Vestiaire Collective now. Closing my account.","title":"Customer Service is a joke","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-06-30","author":"Sasha","text":"I bought a T-shirt from an EU seller with control and authentication and paid an import tax for the item to be delivered to my UK address. Since the item has not even yet reached their warehouse for authentication process, I thought I would write and request for a change of delivery address to Ireland and hoping to get the tax money refunded. But the reply is no, I cannot change the address once the order has been made. \n\nThere is absolutely no flexibility here. I would imagine it would be a matter of reprinting the label and start the process to refund me the import tax money once they have authenticate my item and ready to ship it to me. \n\nI'm the least impressed with the customer service and the company for that matter. Naturally, I have now deleted my account.","title":"Added costs of second hand items","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-07-03","author":"Li","text":"Customer support do not know our need. A good platform but worse support. They did not even put in effort to assist on the issues instead they just brush me off and left me to settle the issue which is not caused by me but due to other party cancelled their order.","title":"Customer support do not know our need","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-07-04","author":"Jennifer Keyes","text":"This company is trying to steal my items. I sold two items and they approved them but will not pay. I contacted them and they first claimed that they had already paid and then, when I asked for proof, admitted that they had not. I have contacted them five times and they keep making up different stories to avoid paying. Disgraceful","title":"This company is trying to steal my…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-07-04","author":"Cindy Capo-chichi","text":"The authenticity checks are very questionable.\n\nI sold a pair of sneakers, which I sent with the receipt from when I bought them but VC says that they are not authentic. I literally put the receipt inside the box to prove their authenticity! They don’t give you a clear reason why they think that your item isn’t authentic. They just go ahead and cancel your sale.\n\nNow the process to get the item back is archaic. The seller has to pay the shipping fees (fair enough), but the payment can only be done by bank transfer and they don’t even send you a confirmation email or anything to confirm that they have received the payment . If you don’t reach them directly to know where your item is, you will wait for it a long time.\n\nLastly, their recommended prices are also very questionable, always way under market prices and again no explanation for that.\n\nI don’t recommend this platform, there are a lot of improvements to be made for it to be good.","title":"Not A Good Place To Sell","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-07-06","author":"Gazou Lette","text":"Wow. So they charge duty taxes for items that are under £135, pocket the money as in fact there is no duty to pay. I contacted their customer service and they told me they would refund me the the undue money after I receive my order. When I contacted them to get my refund a few days later they said they changed their policy. Just plain lying and stealing money.\nReally backwards and unprofessional. VC your site is so bad compared to others.","title":"Wow worst Cs in history","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-07-06","author":"Karin","text":"Premium membership is partial worthless, they don't do as they promiss. Be careful before buying this, you're not getting what they promise!\n\nYou pay for getting e-mails (or notifications by app) when new bags come onto their website, before normal members, but they don't do that. \n\nSo that part of the paid premium membership is worthless :-(.\nI asked the chat center about it, it was Seph P. and they didn't solve it at all. So I still don't know how to get this and I think it's not even possible.\n\nBe careful before you pay for premium membership!","title":"Be careful before you pay for a premium membership! You're not getting what they promise!","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-07-06","author":"Karin","text":"Premium membership is partial worthless, they don't do as they promiss. Be careful before buying this, you're not getting what they promise!\n\nYou pay for getting e-mails (or notifications by app) when new bags come onto their website, before normal members, but they don't do that. \n\nSo that part of the paid premium membership is worthless :-(.\nI asked the chat center about it, it was Seph P. and they didn't solve it at all. So I still don't know how to get this and I think it's not even possible.\n\nBe careful before you pay for premium membership!\n\nExtra info after the answer of VC: another bad chat of VC with Evangeline H. Nobody is helping you when you have a question, they're just referring to website articles that don't help at all. I just asked about the space that you're talking about, but she couldn't help me...\n\nAnother 2 chats and an e-mail conversation later and no one can tell me where this special space is. They're all only referring to the FAQ, which of course I read. Very bad company, with very bad customer service :-(.","title":"Be careful before you pay for a premium membership! You're not getting what they promise!","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-07-06","author":"Beatnik","text":"This service is awful.  You should note it does not have a phone number or email to contact them.  Customer service default is an automated chat. After that you may get a live chat or through website email form, which is time consuming. My experience is as follows.  I sold a skirt on June 23rd. It had it listed in assessment for over ten days with no changes or updates.  I contacted Vestiaire through chat.  No update.  I contacted through website email form. No response.  I just did another attempt. It has been crickets. Not worth the hassle. Going two weeks with item listed as assessment progressing.\n\nUpdate 7\/7\/21;  I finally heard back from Vestiaire after initiating another chat.  All the work is on my end to get in touch with them.  I am told they can’t assist me unless I provide a picture ID.  This is unheard of. What type of company wants you to email them your picture ID with so much identity theft taking place. Amazon, PayPal, not even my bloody bank requires this when communicating with them.  Baffling and worrying. So, still no help because I am waiting to see if they will take my gym ID.\n\nUpdate 7\/21\/21: Vestiaire you request that I send you information on the item but you don’t provide information on where to send.  Is there an email??  Also why do I have to provide a picture of government issued ID when not changing account info. I was just asking about information about item that indicates Vestiaire received but no progress. I did not ask for Vestiaire to change anything on my account or use a number or email not affiliated w my account. How is gov issued ID relevant to that. If I call Amazon and state I did not receive a package, they don’t need this info. If I call my bank and state I need a Password reset, they send me an email link at registered email.  They don’t require a copy of government ID. Also, if this information is being shared w customer service abroad you are increasing identity theft risk. Pictures of passports and driver license are not something you give out willy nilly.  Your explanation still does not justify requesting pictures of those documents. Also I am none of these;\n\nA professional seller\nAn individual seller who receives €2,500 (or your currency equivalent) within a year of receiving your first payment via our new payment system.\n\n7\/29\/21\nSo Vestiaire confirmed receipt of my item on its website but seems to be hung up on some technicality that the item was never scanned for tracking. I am confounded. I mailed the item and Vestiaire confirmed receipt two days later.  Now, they are focused in mail carrier which should not even be an issue. That would only be an issue if they never confirmed receipt of the item.  It is an internal issue with Vestiaire.  Stay far from this company. Apparently received does not mean received with this company.","title":"The customer service is awful","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-07-07","author":"Anne","text":"Every time I buy something the product all of a sudden is not available anymore. It does take the seller a few days to find out though. After negotiating about the price….. Very dissapointing.","title":"Never available…","stars":2,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-07-08","author":"Natasha","text":"painfully to many emails. even AFTER u unsubscribe there's still daily emails regarding newsletters.\n\nits like a robotic response every time u explain I have clicked and unsubscribed to all newsletters but im still receiving so many. \n\nVERY off putting.","title":"painfully to many emails","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-07-08","author":"CM","text":"I'm writing a review as a customer. I was shopping for a Chanel bag and came across a listing. I could see that the interior did not match the exterior color so I asked the seller if the item is authentic or maybe if it had been repainted? I then was BANNED FOR LIFE from the chat function. That's it. From two questions, one chat. I have asked customer service about what happened and they apologize and start a case but they don't care. You would think that VC would question the seller about questionable goods but nope","title":"I'm writing a review as a customer","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-07-08","author":"VZ","text":"Isn’t it amazing how VC has no email or contact telephone number? Instead they make you deal with bot chats that are invariably pointless, and customer service assistants who are equally useless. Where do I start: poor command of English. Irrelevant replies, copy and pasted answers. I am going to message their CEO, CMO, any director I can find on LinkedIn and send them screen shots of the utterly useless threads of « customer service » I received.","title":"Utterly useless and clueless customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-07-09","author":"Claire Gavin","text":"Dreadful customer service.  No way of speaking to anyone directly. The chat is largely conducted by bots. I have just deleted the app and won’t be shopping there again.","title":"Dreadful customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-07-09","author":"Donata van Denzel","text":"Am I the only one who is being spammed by their emails? \nFirst of all - I have never subscribed to their newsletter, when I press the “unsubscribe” button it just simply brings me to their web page and there is no option to unsubscribe, I have changes all the settings in my app, and even blocked their email addresses on my gmail, yet still I am receiving spam from them 🤯🤯🤯\nSo so sooooo upsetting....","title":"Spamming with their newsletters","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-07-11","author":"Jennifer Panagopoulos","text":"This app is ridiculous. I put all my personal information in the app then I put things up to sell and then they get refused without an explanation and the customer service is useless. Never again.","title":"This app is ridiculous","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"},{"date":"2021-07-12","author":"BARDSLEY74","text":"A very frustrating company unable to manage its systems. Very disappointed","title":"A very frustrating company unable to…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=54&stars=1&stars=2&stars=3"}]