[{"date":"2021-09-27","author":"JS","text":"Written multiple times about this:\n\nIn negotiation with a prospective buyer, I made a counteroffer of £135. Vestiaire presented the offer as €128.57, changing my offer without my authorisation or consent, effectively robbing me of £6.43. That was Saturday, they did it on another foreign sale today but for less money.\n\nSince then I've got nothing but assurances that they're directing this to the 'experts' attention... except a message from Laura which babbled about commissions. So far afield to be laughable.\n\nExcept it's not, it's unlawful and Vestiaire is in breach of contract.","title":"Unauthorised Offer Manipulation","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-09-28","author":"Louise Cederin","text":"I where suppose to sell my first bag through this company. Did exactly as the description and did send it after 4 days. I did not no or read this anywhere but you have to write to their chat as soon as you have made the shipment. Because I didn’t, they canceled the order AFTER 6 days (Even if I did send it after 4 days) and banned me from the chat with the girl that I sold the bag to. The bag disappeared (could ofcourse be the shipping company) and I did not get any clear information from them of what and why this happened (not that it disappeared but that they cancel after 7 days, even if I did send it after 4 days) . If you send something, give them the tracking number directly afterwards. Did not have a great experience with them even if I have heard good about them. Plus I lost my bag worth 1700 euros.","title":"I where suppose to sell my first bag…","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-09-28","author":"Natalie G","text":"Woeful customer service and no protection when things go wrong. Purchased a Burberry trench coat and paid for authentication. The item was described as the ‘long version’ however when it arrived it was 10cm too short. I raised this with Vestiaire seeking a refund and was told twice that the “expert team confirmed it matched the description and that it was the long version”. Upon sharing an exchange with Burberry which confirmed the jacket was indeed too short to be the “long version”, Vestiaire agreed that they would take a second look at it. Having lost all faith in Vestiaire’s authentication process I took a closer look at the jacket and noticed the stitching was shoddy and the check print underneath the collar does not align to Burberry’s standards. I then also raised my concerns that I believed the coat to be a counterfeit. Vestiaire have this morning re-listed the coat for sale on my behalf claiming it matches the sellers original description and meets the brand’s standards, however conveniently they have amended the description to remove reference to it being the “long version”. I feel completely scammed and have asked repeatedly for this to be raised as a formal complaint and to be refunded to no avail. I am currently out of pocket for customs and authentication fees when the coat should never have been posted to me in the first place.","title":"Avoid avoid avoid","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-09-28","author":"Soosan","text":"A very frustrating platform with woeful customer service. I sold an item and shipped it immediately using the provided pre-paid label. It should have arrived within 5 days but has now been stuck at customs in Greece for 2 weeks. Customer service take forever to respond to emails and there is no sign of the item being released or me being paid any time soon. I am insisting to be paid because I have proof of postage and followed all the instructions given by the platform, but they say they won't pay me until the buyer receives my item, even though I have no idea when this will be. I would not recommend using Vestiaire Collective.","title":"A very frustrating platform with woeful…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-09-29","author":"nadia dale","text":"I sold a Balmain scarf to a customer in NY who requested for me to ship to UPS in Manhattan. The customer never picked up the scarf and the shipment aged out. UPS then returned the scarf to Vestiaire Collective in NY. After several days of not receiving my item back, I spoke to UPS who confirmed that since the label was created from Vestiaire’s account, they are on record as the shipper, the scarf was returned to them. \nI can see clearly on the tracking that my scarf was delivered to NY and signed for by someone with initials “FD”. However Vestiaire is claiming to have no knowledge of this policy by UPS and is stating they cannot locate the item. \nThey are requesting me to open a claim knowing that since I am not on UPS’s account as the shipper, I am not able to open a claim with UPS. They are on account as the shipper since they generate all the labels. \n\nNeat trick to have undelivered items shipped to Vestiaire’s warehouse instead of back to the sellers. Then claim not to have knowledge that the item was returned to them. Refusing to communicate with UPS directly. Telling the seller to open a claim that they know we cannot open because “we are not in UPS’s system as the shipper”‘. \n\nVestiaire confiscates undeliverable expensive items and resells them. It’s a scam and it’s really disgusting to believe a company of this size is doing this to everyday hard working people. \n\nI have reported them to BBB, Consumer Affair ect. I believe this company should be shut down. Their business practices are unfair and illegal.","title":"Vestiaire is scamming sellers","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-09-29","author":"Simona Montella","text":"Absolutely awful. My item has been lost in transit for over 12 days. I started a litigation with Hermes and they confirmed they parcel is lost but that I will need to contact VC for a refund. I contacted them twice and I received no reply whatsoever. I am livid I want my money back now.","title":"Absolutely awful","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-09-29","author":"Nilperi Franko","text":"I am a seller and a buyer of this platform for some time now. I had some issues as a buyer but i am not gonna mention them in here. However, as a seller, I have to tell everybody that I am sick of their dysfunctional and unprofessional customer service which never provides with useful information. All they constantly say about all different topics is « we are sorry, we forgot to update this » or « we are escalating this issue blablabla »…. And then they never come back to me. \nMoreover, they are ripping sellers off with their constantly changing commission fees. And when you ask about it to the CS while providing them with their commission chart from the VC app, all you get as a response « ooo sorry we couldn’t update it yet in our app ». SORRY!!!??? Almost all your customers are using your app instead of your -again- dysfunctional web site. How come you cannot update such an important info on your app?! VC is also advertising about their commissions going lower. NO! This is not true.\nAnd about the counterfeit products, few weeks ago I stumbled upon a grey Chanel double flap classic bag, which was FAKE and a very very bad one, with the VC “we love” label. The fakeness of the bag was obvious from the very first picture. People were also commenting about it under the post, everybody saw that it was fake. VC was keeping deleting the comments (instead of deleting the bag). So yeah, very professional….","title":"Inaccurate commission fees etc…","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-09-29","author":"Marjorie Chen","text":"I sold a CD necklace and sent the item to their hub and they said they couldn’t verify the authenticity of my item which is nonsense, now i have to pay 12euro to get my item back. Totally a waste of time and money. Definitely don’t recommend this app and site to anyone.","title":"I sold a CD necklace and sent the item…","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-09-30","author":"wonderall","text":"I bought an item here on Aug 31th but as of Sep 30th I haven't received it yet.\nI thought I would protest. However, the custom support told me that the product would be sent to me, so I decided to wait for the product without replying.\nHowever, on 9\/9 I found that the item I was trading with was being relisted on Vestiaire. The custom support said the transaction was still ongoing. Was it canceled? Even so, there is no contact from the support center. Of course, no money has been returned.\nMy number one request is  the support center will encourage the seller to ship the item to me. Or Vestiaire will properly contact me for cancellation and refund. Either of these.\nI just don't know why the seller relisted. Did the seller get a notice of cancellation? If so, why is Vestiaire not contacting me who is paying?\nThe website says that if it does not ship within 15 business days, they will refund me.And the custom support also said same thing to me.\n\nAfter that, I contacted the support center again on Sep 24th. They say they have contacted the seller and she has sent the item.They say refunds will be given as soon as shipping failure is proven. I was informed that they decided to leave this matter to their expert team.\nAfter that, I received the following email from the expert team on Sep 26th. \n\n>>Hi {ticket.requester.first_name}},\n\n>>We've not forgotten you!\n\n>>Our teams are still working on a solution for you, and we're really sorry for the unusual delay in getting back to you. We will be in touch within the next 24 hours to resolve your enquiry.\n\n>>We understand it's frustrating to wait, but please don't submit your enquiry again as this can add to the waiting time.\n\n>>Thank you for your patience.\n\n>>The Vestiaire Collective team\n\nAs of Sep 30th, they haven't contacted me at all.Apparently they don't even know my name.I received this message twice.Ah thanks a lot.\nThey're really experts.\n\nThe seller first sends the package to Vestiaire Collective, so they can know immediately if it arrived.But nothing progresses.If they ask the seller to submit a proof of shipment, they will know immediately if it has been shipped, but nothing progresses.\nTheir management ability is low.\n\nFortunately, I run a popular blog in Japan that reviews shopping on overseas sites, so I can tell people who don't know Vestiaire in Japan about this email exchange with Vestiaire. Vestiaire is an e-commerce site that is mainly developed in Europe and the United States and is completely unknown in Japan.\nSo far the state of the transaction is also not explained. It may be good to convey these facts to my readers. It's not a lie, so there's no problem.\nVestiaire is a very good site.\nI'm excited to think that I can convey the wonderfulness of Vestiaire to everyone in Japan!","title":"My transaction and my money seem to have disappeared by magic","stars":1,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-09-30","author":"Louis Skaigen","text":"There is a reason they have over 30% + bad reviews. They all resonate with my experience.\n\nHorrible company with horrible customer support. I purchased a €6500 lady dior bag that they basically lost. First they sent me an email saying that there was an error with my tracking number then they send me a tracking number to a cheap Bally wallet being shipped to Ohio, USA…. I live in Spain. I’ve contacted them and have received robotic replies with generic links.\n\nIt has been 10 days since the bag was “shipped” and they have no idea where the bag is nor have provided me with an appropriate tracking information.\n\nNow I have to contact my credit card and possibly get an attorney involved.\n\nDo not buy from this site.","title":"Horrible company. Lost my purchase","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-09-30","author":"Catalina","text":"Most ugly human beings ever! They all are like robots, no one is helping you in reality with nothing, very big comissions on your stuff! I don't reccomend!!!","title":"Most ugly human beings ever","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-10-01","author":"Jarek","text":"I recommend avoiding this place. Their \"verification team\" is a joke. Tried to sell 2 LV bags bought by MYSELF from flagship stores, provided them with all photos taken by me, tags, receipts and yet the items were refused under assumption that they were not original and that I have used stock photos. Not to mention that they will price your items well below the market value and commissions are 20-25%.","title":"Avoid","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-10-01","author":"Marjorie Chen","text":"So I would like to pay the $12 in order to get back my item, but they only offer payment by bank transfer which is really inconvenient for me, so I asked if they could provide another way of payment like paypal or payment invoice so that I could do it online by credit card. Sadly they couldn’t even make the effort so now my genuine item was hold in their hub….","title":"So I would like to pay the $12 in order…","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-10-01","author":"vintagelover","text":"As a seller I have had a good experience. As a buyer, my experience has been extremely frustrating and stressful. A total of SEVENTEEN of my orders have been cancelled this year. This is because other users have contacted the seller after I made a purchase, and have persuaded the seller to cancel the sale and sell it to them for a higher price. This is extremely frustrating!  I understand the demand for certain items but once an item is sold, the sale should be final. \n\nCurrently, the site enables all users to look through 'sold items'. I would like to suggest to this company that when items are SOLD, the item should be removed from public view completely. This should avoid other users being able to contact the seller after an item is already sold. Currently, the system is very frustrating and creates a very unfair experience for buyers when this happens.","title":"17 ORDERS CANCELLED BECAUSE OF USERS OFFERING SELLER MORE MONEY AFTER ITEM IS SOLD","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-10-01","author":"vintagelover","text":"As a seller I have had a good experience. As a buyer, my experience has been extremely frustrating and stressful. A total of SEVENTEEN of my orders have been cancelled this year. This is because other users have contacted the seller after I made a purchase, and have persuaded the seller to cancel the sale and sell it to them for a higher price. This is extremely frustrating! I understand the demand for certain items but once an item is sold, the sale should be final. \n\nCurrently, the site enables all users to look through 'sold items'. I would like to suggest to this company that when items are SOLD, the item should be removed from public view completely. This should avoid other users being able to contact the seller after an item is already sold. Currently, the system is very frustrating and creates a very unfair experience for buyers when this happens.","title":"Multiple orders cancelled because of users offering more money, pointless","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-10-01","author":"Thriftshopper","text":"I hate that I continuously end up buying items on Vestiaire Collective but I love second hand, their awful customer service is both ignorant and disrespectful. \nI’ve purchased a lot of items and even fallen in the trap of fakes. But they refuse to help or answer any inquiries. So don’t be fooled by the authenticity of all items because fake items do come through. And you have to be your own professional to know if it’s fake or not. So if you have a good eye Vestiaire is a treasure chest, but beware of their customer service\/employees.","title":"Beware of their employees","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-10-01","author":"Mard","text":"It’s a scam I ordered an item and they sent it with a carrier that they chose the item was lost I never received my order they know that I didn’t get it they told me that they would investigate it it took more than three weeks do investigate it  and even though they knew from the beginning that I didn’t receive my order until now they didn’t refund me they hold my money and they say every three days that they need some more time to investigate it they are a scam!!!!Be careful","title":"Big scam","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"},{"date":"2021-10-01","author":"Alex","text":"Took my money and didn't reserve the item I wanted to buy. Would strongly advise avoiding their platform. Terrible design, broken systems, lengthy refund process.","title":"Took my money and didn't reserve my item","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=43&stars=1&stars=2&stars=3"}]