[{"date":"2021-11-08","author":"Meka","text":"Bought a pair of earrings my first purchase and all went well. Then i bought a 400 belt bag that was delayed by almost a month.. should've known..the bag was terrible. I can't even verify its authentic. I couldn't return it because of their return policy..why would I feel comfortable reselling it as they recommended. Never again","title":"Bought a pair of earrings my first…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-08","author":"EN","text":"I really dislike using VC because of the poor customer service and unreliability (I only receive my parcels 50% of the time when I shop with them), but for this particular item I had no choice as I couldn’t find it anywhere else. \n\nI typed in the correct address (and have proof on my order confirmation) but somehow they messed up the address and caused the delivery to fail. Now it is being sent back to the seller to inevitably be sold to someone else. When I explained to Customer Service that it should really be redelivered instead of cancelled (especially since this was the fault of VC not me), both customer service assistants” just repeated the same words again and again )in very poor English) and left the chat before I was finished chatting to them. Of all the customer service experiences I have had, this is the first time I have had customer service exit the chat because they just didn’t feel like helping. They said I had to sign up (at extra charge) to Premium and then I can see in advance when it goes on sale - but not even this guarantees I get my item. And this is an item I have paid for!\n\nTl;dr: If you shop with VC, there is only a small chance you will get your item.","title":"Refused to deliver item that they made a mistake with","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-08","author":"Ws Yap","text":"I have been in touch at least 10 times with their online chat agents about the return of my Burberry trench coat 18298969 and each time they gave me a different response. All I want is for the return of my item and I am appalled by the number of times I have contact them and yet, I have not received any updates as to when my item will actually be shipped back to me. Seriously, save yourself the hassle and stress - do not sell with this company!!","title":"Do not sell with this company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-08","author":"tony jimenez","text":"Customer service non existent so basically I'm now stuck with nothing after paying for an item, pretty much only a useful place to buy from if you live in EU","title":"incompetent at shipping and customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-08","author":"Kim N","text":"SCAM! They deactivated my account so I cannot get my refund. Talked to customer service 10 times already and every time they promise refund. But I've not received any money! Item number: 17931264\n\nVestiaire, step up and solve it! Will escalate to my credit card company if you don't. How this shi**y company still in business is beyond me!!!\n\nIf you are thinking of selling or buying here, look elsewhere!","title":"SCAM","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-09","author":"Amy Hawkyard","text":"I sold an item online, shipped it to the buyer and when I had not received my payment, I reached out to customer service to help solve this. They said that they had sent the payment and showed me the account details they sent the payment to which were not correct (granted this is my fault). I told the customer service rep that they were not correct and she said I had to reach out to my bank and it was for them to investigate. I did this and my bank then informed me of some information I needed to gather from the sending bank to allow them to investigate, so I reached back out to Vestiaire asking for this information. \n\nIt has now been 5 days and I have not so much as received a response from Vestiaire providing the information my bank need to investigate the issue. I have sent numerous emails but I am not getting anywhere. \n\nThis means I am without my boots AND without my money and the company are doing NOTHING to help. \n\nTheir customer service has been awful.","title":"Awful Customer Service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-09","author":"Eugene","text":"Most garbage customer service I’ve ever had taking the people that work in government department as well. Clearly got scammed and you guys have been escalating my problem nonstop with no actual outcome. Get me my refund asap you losers.","title":"Most garbage customer service I’ve ever…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-09","author":"Im._.Dead_","text":"I have been selling on VC for 9 years, and was an expert seller. This lovely chap called Tarryn bought 6 items. All o.k , till he raises a complaint ..the expensive D and G jacket was a zara dress! \nPlease , please , please don't use VC to direct sell customers . They're thieves ! You have been warned.\nVC response to me ..You've lost your expert status and your money ! Thanks VC.","title":"ITEM STOLEN BY TARRYN","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-09","author":"Im._.Dead_","text":"D and G direct sale jacket was received by Tarryn and he told VC he received a Zara jacket.\nGreat way to scam you folks.\nResponse from VC \" You have lost your expert status and your money \".\nThanks VC . Enjoy working alongside thieves . I am closing my account for GOOD.","title":"Item stolen by Tarryn","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"Soph","text":"Terrible service!\nI ordered a reformation top from Europe to HK, and I didn't do any research about what shipment service they will use. They use Chronopost. If you do a little bit of research, you would know how bad Chronopost's service is. My shipment didn't get any update after the first day it's dispatched, and I'm trying to contact customer service of VC or Chronopost. (Of course it's impossible to contact Chronopost customer service!)\n\nI contacted VC customer service. Now they are asking for a photo id of mine and a handwritten statement, stating that I didn't receive the shipment. I had the following question:\n1. I ordered my stuff from VC as an identity of VC customer, an identity as an email address, why when it goes to tracking my shipment, I have to provide my real identity behind this email address?\n2. How will they handle my photo id and other data after they process my complaint?\n\nAnyway, terrible service up until now, and if you google VC or go to Youtube, you will also see a lot of negative reviews. Avoid Vestiaire collective!","title":"Terrible service!","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"Victoria Filonova","text":"Dear Sir, Madam\n\nOn October 5, 2021 my item Dsquared2 Jacket - 18157061 was returned back to me and got lost in delievery. Upon talking to 7! different people in support team, we finally filed a complaint against delivery service on the 10 of October. It’s been more than a moth and parcel still not found. For more than a week I’m trying to get any update on the situation, but not s single response from the team. Moreover, I contacted the support team on the website on 8 of October, who assured me, that they will sort the situation out asa and get back to me. Guess what, still no response. \n\nI would like to hear back from the team and if they cannot locate my parcel a reimbursment for the item. Otherwise I will  have to take it to court and report it to financial ombudsman for theft.","title":"Order 18157061 - LOST, NO COMMUNICATION","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-11","author":"Andrea Kozlovic","text":"First time buyer. I bought FOUR items aftee a lovely seller helped assist with measurements on her pants. I see a message from her this morning saying she doesn’t have my order? Odd. I click my order and all four items have been marked as cancelled by sellers. This doesn’t make sense as the sellers want to sell Their items and even asked me about my purchase. \n\nThe chat function is a robot Snd ive requested to speak to agent with no luck. Now I’ve emailed and wait for a response and if these sell, I will be pissed. \n\nI use Poshmark, Tradesy and the RealReal and have had ZERO issues WITH THEM. \n\nContact me immediately re: order 47252418\n\n\n*in response to Vestiaires response. My original order was completely cancelled by Vestiaire. Then the discount code for your first order wouldn’t work because I had already made a first order, even though they cancelled it. I ended up reaching out repeatedly, which was a waste of time. \n\nI had to make a new account with another email address and re-ordered the items. What a PAIN.","title":"First time buyer - horrible experience.","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-11","author":"Dani","text":"Hi \nI am having a problem with VC. After it, I started to search for company info and read reviews from here. They have an ashamed reputation. If I had read it before, I would not require their services. My channel bag is LOST. \nI followed VC instructions to send my channel bag to France -  Office address. One of the instructions was to download a label, print and stick it on the parcel. \nBut, I did not expect they would ask me to download a label that does not correspond with my info.  Yes, my name was on it, but when I called DHL to give updates, they said the tracking number that I have  (a number that was on the label given by VC) did not correspond with my details; it shows info from another country, another sender... How could it happen? Probably it was a mistake from VC that sent me the wrong label... They sold the bag, now they have cancelled it, and I still have no updates about my Chanel bag. \nIf I do not receive it soon, I will go to court to sort that issue legally. \nMy advice is to search or ask for more info about a company that you are dealing with, especially with a company that sells luxury items but did not offer the support that we all expected to have.","title":"VC gave me the wrong label to print - the parcel is LOST","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-11","author":"CS","text":"Lie after lie after lie !!!!!!! As I have said in a previous review I bought a coat through Vestiaire that was stopped in Spain by DHL as didn’t have right paperwork , after getting through to someone at Vestiaire who assured me they would help I waited and waited then emailed to find out what was happening and they assured me that they were on top of it and were in contact with DHL to sort the problem out and so so sorry that I was having this problem as such a valued Vestiaire member !!!!! After 19!!!! Emails to Christelle at Vestiaire (prob not a real name) where I was constantly told they were chasing DHL and were trying their hardest to sort the matter I decided to contact DHL and guess what DHL came back to me within an hour to tell me Vestiaire has never contacted them and they have already sent the item back to the seller over a week ago !!!! DO NOT USE VESTIAIRE IT IS A TERRIBLE SITE","title":"Lie after lie after lie !!!!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-11","author":"JS","text":"On opening the package, it was immediately clear that the Loro Piana cardigan - Ref # 17694453, passed by Vestiaire's quality control as compliant - had been shrunk. The texture was felt-like and the knit was very tight. A noticeable scent was also present. \n\nI spent at least 15 minutes on the Chat, took photos and filled in the online complaint form, all told at least 30 minutes. Never heard another thing until I got an email saying I'd received a refund. \n\nAlthough I received the refund, this is meaningless without acknowledgement of the time wasted or obviously insufficient quality control.\n\nI'd like an email with explanations of:\n\n1) how an obviously shrunk cashmere sweater passes inspection and is sent to the customer. \n\n2) Why no acknowledgement was made to the customer of their complaint, of their decision nor of what will be done in the future to prevent this happening again.\n\nVestiaire's attitude is always - always - cavalier and the only thing they ever do is apologise for the inconvenience. Despite their Chief Executive's ambitions, they'll never be world class until they start admitting their mistakes and being accountable to their customers.","title":"Shrunken Quality Control","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-11","author":"Sabrina","text":"I am going to submit my files to the court!\nNever received payment for my item. I am the seller, and the order got cancelled the same day the package was delivered. I reached out to Customer Service team, and they told me it was only a technical error. After two weeks and numerous email negotiations, Vestiaire refused to pay me since they said they can't confirm delivery. But USPS tracking site clearly shows the item was delivered. I don't have my item now, and I didn't receive any money. They are thieves. Don't ever sell with them.","title":"They are thieves. Don't ever sell with them.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-12","author":"Sophie","text":"I m sorry to post a negative review once again, but this is due to the incompetent  customerservice. Mind you, it depends who is helping you ( Abigail is fantastic!)\nNow why haven t you shipped my order 46202747 yet? You ask us members, to ship our sold items ASAP, I suggest you do the same, unless my order is lost??\n\nReply\n\nYes I received a trackingnumber from Miss\/Mrs Trinidad. Guess what? Trackingnumber is from a delivery from last month! Unbelievable!\nI have filed a complaint with PayPal.","title":"Where is my order?","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-13","author":"Deborah","text":"Made my first purchase of a vintage Chanel bag. Very disappointed- bag was misrepresented not only by omission of pictures showing cuts in the leather that were not mentioned in the description by the seller but also in the sellers photos. She indicated she never used the strap which does show wear, she omitted that she had cut the attachments off so the strap cannot be attached. It can only be used as a clutch. Vestiaire  customer service felt it was not worthy of a refund or any extra cost reduction. This goes to integrity snd honesty in selling. Buyer beware and assume there may be more than what you are being told or what you are seeing. Will never buy from this seller again.","title":"Disappointing first purchase! Beware…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"},{"date":"2021-11-13","author":"Tully","text":"SO I FINALLY REACHED 69% TO GET THE \"TRUSTED SELLER BADGE\" ONLY FOR ME TO SEE THAT IT HAS DROPPED TO 42% A FEW DAYS AGO FOR ABSOLUTELY NO REASON. I HAVE SPOKEN TO 5 DIFFERENT VC REPRESENTATIVES ABOUT THIS AND NONE OF THEM COULD FIND A SOLUTION OR AT LEAST EXPLAIN WHY MY BADGE STATUS DROPPED. THEY TELL ME SOMEONE WILL CONTACT ME THROUGH EMAIL AND I DONT GET ANY EMAIL. \n\nI HAVE HAD A LOT OF BAD EXPERIENCES WITH VC AND I LOOKED AWAY, BUT THIS ONE... I CAN NEVER LET IT SLIDE, \n\nI AM READY TO PUT IN A LOT OF MY TIME TO LET THE WORLD KNOW HOW TERRIBLE VC IS, THEIR SYSTEM IS A TOTAL MESS, THEIR REPRESENTATIVES ARE BIG LIARS, I HAVE BEEN LIED TO WAY TOO MANY TIMES, JUST IMAGINE HOW MANY PEOPLE THEY LIE TO EVERYDAY, THE NUMBER OF PEOPLE THEY LIE TO AND STILL TAKE THEIR MONEY. \n\nNO ONE SHOULD ACCEPT THIS, I WILL\nNEVER STOP WRITING ABOUT VC ON MAJOR SOCIAL MEDIA PLATFORMS,\n\nIF VC HAS STOLEN FROM YOU OR LIED TO YOU, DO NOT ACCEPT IT, \nCREATE AWARENESS BY WRITING ABOUT YOUR BAD EXPERIENCES ON WHATEVER PLATFORM YOU HAVE SO PEOPLE CAN AVOID THAT SITE...","title":"⚠ STAY AWAY FROM VESTIAIRE COLLECTIVE ⚠","stars":1,"location":"TR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=35&stars=1&stars=2&stars=3"}]