[{"date":"2021-10-14","author":"K S","text":"I sold an item, and sent it via Hermes, and it was never delivered to the sender. The tracking showed that the package is with the courier for almost 3 weeks, and then suddenly it shows that it is being returned to the sender. A perfectly fine sale ruined. I will have to appeal to small claims court for VC wasting my time and money and stealing my item.\n\nPS instead of replying to my complaint, they suggest I lower the price for a SOLD ITEM! aren't they funny, those people? I am taking them to court.","title":"Fraud again","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-15","author":"Jules","text":"Absolutely disgusting shocking service!! I am a first time buyer. I bought a bag 7 days ago. Firstly I was sent a £20 voucher as a welcome to use which I applied. Just before I sent payment which showed the full balance and delivery address I took a screenshot. After I sent payment VC took the full payment and didn’t apply the discount and then the delivery label had a random delivery address on. I have been contacting them solidly twice a day for 7 days to get this address changed to my home address and to the address on the invoice. They sent through a new invoice to the seller which again had a random incorrect delivery address. I keep getting told this will be resolved within 24 hrs. This is still on going and have just been told it will be another 3 days!! It has been flagged to their expert team… what a joke that team are. Expert on winding people up and lying and been incapable of sending out a shipping label. It’s not rocket science it is basic admin!! I have never ever dealt with such an appalling company in my life. They have rang me and then didn’t speak & then emailed to say nobody answered or that I hung up!! All I want is the bag that I payed for!! It looks like the only option for me is for me to have the bag delivered to a random address, travel there which is not a safe area and hope that they are honest enough to give it to me. I don’t even know who actually has my money!! I am now convinced that all communication is a robot and there is nobody human on the chat. This will not be a company that I will use again. VC I just want my bag that I have payed for!!! How dare you treat customers in this way!!!","title":"Absolutely disgusting shocking…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-16","author":"Constantinou, Constantinos","text":"There should be 0 stars! Sold an item for a month now! The buyer did not go to DHL to pick it up. My item is sitting in another country for a month now. Vestiaire is paid and I contacted their chat 5 times in total, said they will contact me through email. They obviously never did. So they got their money and don't care about their buyers! I cannot ask DHL to send my item back, Vestiaire has to do it and they could not even do that! Be aware of this website and if possible stay away! So I lost my Giuseppe Zanotti sneakers + my money! That's what I call a bargain!","title":"I would give 0 stars if I could","stars":1,"location":"CY","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-17","author":"Christelle G","text":"Vestiare used to be so much better. Every time I order an item now my item gets cancelled and reappears the next day for 10 times the price. This has happened 6 times in 6 months. The problem is that VC still allows buyers to message sellers AFTER an item has been sold. I know a lot of people messaging on chat after an item has been sold still manage to persuade the seller to sell outside of vestiare collective. The point is the chat function should not be allowed after an item sells. It's not just the buyer who misses out but VC too as buyers use all sorts of techniques to persuade sellers to sell outside of VC for high value items. Just get rid of the chat all together.","title":"Get rid of chat after an item has sold","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-17","author":"Mrs Gabeva","text":"Update:\nVery surprised and glad to share but this issue was also resolved by VC. Which is good. I hope one day they actually improve the CS where actually one can talk to a real human being who knows their job well and not only resolve issues after customers are frustrated to the point when they have to post on trustpilot.\nThat is why i am raising my rating by one star only. \nThanks.\nRegarding my last comment regarding listing item Ref. 18433667. Somehow VC does not grasp that just posting polite promises on trustpilot, will not stop customers of calling them out on their nonsense. VC, polite answers mean nothing when they are not followed up by actions. Nobody expected you to keep your promise in the comment in reply to my last comment about yet another ridiculous experience with you, but i would say - would be much more dignifying if you just stop publishing lies about the actions that you would take to fix the problems that you create. Just empty words are not going to bump up your ratings, because luckily truspilot offers a platform where people are free to share their experiences with VC. And as all can see, there is a pattern of repetition of the negative experiences the customers have. Worse and worse and VC totally unwilling to improve. Just the opposite- the “quality “ of their service is sinking down together with the trust in the company.","title":"Resolved as well","stars":2,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-17","author":"Hebah Bibi","text":"Worst customer support. I bought an item a month ago and until now haven’t received it. And their support aren’t doing anything, just say will get back to the courier.\nWorst ever, never buy from them","title":"Worst customer support","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-17","author":"Hebah Bibi","text":"Worst customer support, bought an item which never arrived, for a month now they have not issued a refund just say will contact the courier.\nNever buy from them","title":"Worst customer support","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-18","author":"Ann Ann","text":"Very irresponsive, they promised me to refund a commission, but then try to use different excuses to evade their responsibility and refuse to give me a refund. Their system would delete your item and blame you for deleting that! I talked to more than 5 people in their customer service, more than 20 email exchanges and 5 times online chats. A lot of unhelpful staff, especially Vanessa Nacion, Romeo N., Julie. Their staff would also blame the customer! Worst experience ever! NEVER USE THEIR SERVICE AGAIN unless you have plenty of time and money to waste!\n\nTo Vestiaire: I am shocked to learn that you would reply to me here on an open platform faster than replying to my email, if you really care about your customer, please check your email instead of replying to me here haha - do not pretend that you are helpful while you are not","title":"super irresponsible","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-18","author":"Sonia Weston","text":"Extremely unimpressed. I wish I had checked TP before using VC again. I have only ever sold on VC and I was extremely impressed when I used them in 2018. I just sold 3 Mulberry bags, one went temporarily missing with UPS (eventually located thank goodness and the buyer has it) but the VC Customer Service was wholly useless. And now, even though supposedly there is a 72 hour window, 11 days later, another item I sold is being returned to me. How did I find out? An email from VC, as you might expect? No. Via UPS telling me a package is en route. Apparently my sale has been cancelled as the item is not as described. It is exactly as described and so now I am anxiously awaiting to find out if my bag is being returned to me (in whcih case I will breathe a sigh of relief) - or - as had not even occured to me during the sale, as they now offer direct shipping, goodness knows what the buyer is going to send back to me. Another review on here suggests that they can damage or swap the item and return! SELLERS BEWARE - I would insist on going via their authentification at least so there is no risk via direct shipping. I hope to goodness I get my item back or I will be taking VC to small claims court! In any case the premise is now risky, and their customer services is atrocious.","title":"Extremely unimpressed","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-18","author":"sinead","text":"The worst app I've ever used. My items have been stuck in lockers without being picked up and the customer service team (all two of them) don't help or respond to messages and when they do its automated. its a joke app with joke employees.  AVOID \/ con app.","title":"The worst app I've ever used","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-18","author":"Catherine","text":"DO NOT USE THE VESTIAIRE APP.   I had thought I was buying through a solid and reputable platform.  The item I purchased has been confirmed as lost by the carrier UPS.  \n\nI cannot get any satisfactory response from Vestiaire customer service.  They block mails and send back standard template replies. \nThis now feels like fraud!  I wish I had checked Trustpilot before purchasing.","title":"DO NOT USE THE VESTIAIRE APP","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-18","author":"Paige Barratt","text":"I purchased an item, then the seller didn’t respond or post it. They then re-listed the item so I could re-purchase it. They said they couldn’t locate the item so again the shipping time lapsed.\n\nFinally they located the item. I purchased it. They shipped it. 7 days later - no shipping updates. Contacted Hermes via phone and email which confirmed my order was lost. It took weeks to get a refund. Kept getting the same template responses and one that said “If we don't hear back from you in the next 3 days, we will have to close this enquiry.” Pretty poor experience.","title":"Pretty bad experience","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-19","author":"Mrs Gabeva","text":"Update: what is fair is fair - VC resolved the issue. This is a good sign. The bad part is that we have to share what is wrong here instead of just having a normal customer service that can be contacted and have a fast resolution. But the truth is that this time they reacted although i never contacted CS and resolved it. Thanks. I will even change the title of my review and give two stars. Two because there is still no normal way to contact CS and one has to go through trustpilot. I hope this changes in the future.\nGiada (Support Vestiaire Collective)\n19 Oct 2021, 11:37 CEST\nDear Sophia,\n I'm contacting you about your Cashmere jumper reference nr. 18645100.\n I'm very sorry for the incovenience. I would like to inform you that your article is on sale.\n We are working to solve the case linked to article with reference 18433667, we will contact you at latest tomorrow.\n I would like to thank you for your understanding.\n\nVC has officially lost all credibility. After my last two reviews about refusal of an item that has previously been listed and of course no actions taken from the side, despite their promises (not that actions were expected having in mind their totally disgusting performance), last night i tried to list another item, a jumper from the cruise 2019 collection, brand new with tags. I submitted the listing at 10 pm last night and early this morning the listing , after “careful examination “ of their “expert” team has been refused. As if their “expert “ team is working during the night to review listings. Ridiculous!!! Also - brand new item with a tag and they refuse it? Maybe this is the new policy of VC, which is not even going to be surprising - they obviously do not accept brand new items anymore as they are surely going down the lane of listing obvious fakes and selling them fast to generate bigger turnover. Moreover, i checked that several same items from same collection are listed there at even much higher price. Anyway. It only reconfirms how totally out of touch with reality this company. Totally disgusted.\nRef no 18645100","title":"Problem resolved","stars":2,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-19","author":"Janine","text":"Good God! A con operation masquerading as a luxury clothing site. I have bought 2 bags and for 3 weeks it states delivery in progress. Chat and customer service appalling …just lie after lie to get you to go away. I cannot believe I didn’t check trust pilot first. Ebay is very professional in comparison to this scam site. Please do not use them! VC….where is my refund?","title":"Order 43638506 God awful!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-19","author":"K S","text":"Dear Sir, Madam\n\nplease take this letter as a letter before action. On September, 27 2021 I sold an item ref. 10048295. I shipped it on September, 30, well within time. The carrier seem to have lost it as there was no update on the tracking and I contacted you. However, you just cancelled the sale without even informing me. From this I assume:\n\n- as the item has no sender address printed on the label, it must have been either sold or returned to you as the owner of the account\n- you have stolen my item.\n- i have incurred damage - not only I wasted my time and money posting the item, now I do not have my item.\n\nI demand you pay me and reinstate my stats (the sale should not be cancelled, as I HAVE FULFILLED all the steps necessary on my side. If I do not hear from you till the end of October, I will take it to small claims court and report it to financial ombudsman for theft and fraud.","title":"letter before action","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-19","author":"Rob","text":"I sent three items, over a month ago, all within the time frames Vestiaire state in their T&Cs, to their respective buyers on the same day and none were received.  I've now sent over 10 emails to their support team requesting updates, escalations to senior management, and keep getting palmed off with the usual vague responses.  \nThey are incompetent, and should not be used!\n\nUPDATE: Vestiaire responded in 4 hours to this review. Much quicker than their support team to my repeated requests for help. \nThey asked for a reference number but should be asking for three of them as there were there items lost - did they actually read the review I posted! They did not leave a contact number nor a contact name as to who I should provide these reference numbers to. This, I’m afraid, is yet again another vague response designed to look that they want to help but in fact have no desire to do so.","title":"Vestiaire - DO NOT USE THEM!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-19","author":"christianne lee","text":"I really wish I read the reviews before I placed a order. Everyday I've been told my item was been shipped and today I find out it has not been shipped at all. I'll give it another week and I'll be raising a case with PayPal very disappointed with the service.\nEdit: I just want to make clear once the seller shipped it to be checked over i was told by vertiaire collective once it was with them and approved it will be shipped it was sit there for a while i did get it in the end just a shame customer services could not give me shipping sooner received and happy","title":"I really wish I read the reviews before…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-19","author":"Llazar Jorganxhi","text":"I sold an item on vestiare collective and shipped to vestiaire with dhl express. The package is delivered, according to both dhl tracking and official email of DHL with the name of the vestiaire employee who signed for the package. \n\nHowever, Vestiaire wont own up to their mistake, say they havent received it and dont take any responsibility. Their support is completely incompetent, and just sends the same email intending to tire you to death so that you can drop your claim (it has also been the case in the past with other issues, this is their tactic, they are trained like this)\n\nAfter 15 emails with vestiaire support everything is back to square one.\n\nI have never experienced or collaborated with such a deceitful company before! Beware of this company, when things are good its good, but god forbid they make mistake, it is always you who will bear the consequence!","title":"Vestiaire lost my package and does not take any responsibilty.","stars":1,"location":"AL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"},{"date":"2021-10-19","author":"Liv Whitehead","text":"Sent my item with their DHL prepaid shipping service and according to it's official waybill \/ tracking number it was delivered AND signed for by the buyer, which is proved by DHL themselves. Vesitaire then sent me back a tracking number which was completely wrong to what I had provided and what was on their systems, and tried to claim my item was never sent!! Absolute joke of customer service, I've been waiting for a resolution since the 8th of September. Suprised to hear other' experiences to be similar.","title":"DO NOT SELL!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=40&stars=1&stars=2&stars=3"}]