[{"date":"2021-01-16","author":"Rachel","text":"I have been trying to post a sold item from the UK to Vestiaire. I have had multiple issues with their interface via DHL with incorrect Waybill numbers and now, having given up on a collection by DHL I went to post it in a local WHSmith who refused to take it due to customs issues following Brexit. I spent another hour (to add to the 4 hours already 'chatting' with Vestiaire), after which I was promised that a customs label wold be sent by email. It hasn't arrived. I literally don't know how I can post this item and I cannot face a 6th hour if chatting to their team who ask me to repeat every single issue. The item will be received late and Im sure that will impact my ratings as a seller. I notice they have no 'customer service' making it even more infuriating. If I don't get a resolution today I am taking it to all over their social media. I am also removing all of my items from sale as I give up on this useless company.","title":"Impossible user interface and customs issue","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-17","author":"Jindan Seo","text":"i bought hermes card wallet from here.\nand it comes with  teased part on middle of wallet\n\nit doesnt appears on picture\n\nbut when i contact ( i contacted within 1 min from when i received parcel. )\n\ncoustomer center, they said\nthey cant refund or return. \nthey asked me to re-list to resell\n\nit is oubiously that they asked me to scam others by selling teased item with picture which not appears on.\n\nif u buy from this website, and it comes fault, they dont accept return and refund , and they asked to fool other people in their website \n\nand it goes on and on and on  among people who using that webstie.\n\nref 1987699","title":"i bought hermes card wallet from here.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-17","author":"Jindan Seo","text":"i bought hermes card wallet from here.\ni bought hermes card wallet from here.\nand it comes with teased part on middle of wallet\n\nit doesnt appears on picture\n\nbut when i contact ( i contacted within 1 min from when i received parcel. )\n\ncoustomer center, they said\nthey cant refund or return.\nthey asked me to re-list to resell\n\nit is oubiously that they asked me to scam others by selling teased item with picture which not appears on.\n\nif u buy from this website, and it comes fault, they dont accept return and refund , and they asked to fool other people in their website\n\nand it goes on and on and on among people who using that webstie.\n\nref 1987699","title":"i bought hermes card wallet from here.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-17","author":"Irene Aversa","text":"I am trying to download the tag needed in order to ship the package (a bag) to the client but every time I try to download it it says “no match for address input”. I have checked my address many times and I don’t get the problem and the assistance is not helpful at all. Now I have 6 days to send the package but without solving this problem it’s impossible.","title":"No match for address input","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-18","author":"malgorzata","text":"I've recently bought Gucci sweater which was sold as new, never worn and had an original tag. After receipt of the item I've noticed that it had a flaw which was not mentioned in the description. I've immediately notified VC asking to return it, provided pictures and explanation of noticed damage. They replied that the item matches description and my only option is to relist it. I have told them that I will be compromising my integrity by relisting damaged item under my name, but did not hear back. Left with no choice I've relisted this item. The VC relists the item by using original photos and description of the previous seller. Within few days someone has bought it. I've sent the item to VC as instructed and they are telling me that they will offer me less money for it because the sweater has a flaw!!!! What kind of scam is that? The sweater didn't have damage when I said it but all of the sudden does when they say it? It seems they are looking for ways to take financial advantage of unsuspected customers and will try anything to not reimburse money owned. What a dishonest way to run a business.","title":"I've recently bought Gucci sweater…","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-18","author":"Jindan Seo","text":"i bought hermes card wallet from here.\ni bought hermes card wallet from here.\nand it comes with teased part on middle of wallet\nit doesnt appears on picture\nbut when i contact ( i contacted within 1 min from when i received parcel. )\ncoustomer center, they said\nthey cant refund or return.\nthey asked me to re-list to resell\nit is oubiously that they asked me to scam others by selling teased item with picture which not appears on.\nif u buy from this website, and it comes fault, they dont accept return and refund , and they asked to fool other people in their website\nand it goes on and on and on among people who using that webstie.\nref 1987699","title":"i bought hermes card wallet from here.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-18","author":"Davina Chalmers","text":"Do not buy anything from here! Back in august I tried purchasing an item using Splitit.. the order did not go through properly and the item was never purchased. However I was charged the full amount of the purchase via Splitit. \nI am STILL , 5 months later, trying to get my money back onto my credit card through disputing it via my credit card provider, after being charged for a transaction that was not processed. The customer service is dreadful, and there is no number to contact anybody on. Do not trust this website as I very much regret doing so.","title":"Do not buy anything from here","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-19","author":"Chin Michelle","text":"You know you’ve got enough of Vestiare Collective when they finally banned you from the chat system. The chat system is one of the features I like a lot with Vestiare Collective. Unfortunately the AI IS UNBELIEVABLE. I told my buyer to google up the image of the same model on the chat system and I’ve gotten banned. Spoke to a customer service person and they said they can’t do anything. \n\nThe second time happens and I’m BANNED forever. And nobody can lift it up. \n\nAlso they have the audacity to maintain that because the Chanel jacket’s fabric felt rough it is considered felted. I am flabbergasted.","title":"LA HONTE 3eme partie","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-19","author":"AMSTERDAM","text":"Horrible high commission. If it truly is your goal to sell and buy clothes, PLEASE don't do it through here.\n\nThe commission Vestiaire asks is so insanely high.\n\nThey should take a look at: Grailed, eBay, Depop, Marktplaats, Vinted, to see how this business is done the right way.\n\nIf you want to sell a jacket for 550, because it is worth 550, they will only give you like 400. So you have to sell it for 800 to receive the 550. This is insane. I'm glad to see so many negative and 1 star reviews. Because this is the worst platform I have EVER used.","title":"Horrible high commission","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-20","author":"Mrs Gabeva","text":"As much as one wants to believe that sooner or later there will be an improvement of VC service the reality is that the service is going down to a point that low that is bordering of total lacking such. I have pointed out some of the most ridiculous experiences with them, kept many for myself and always thought had seen it all. But not. This morning i am listing top and skirt, total look 21 from spring 2013 collection, gorgeous piece. Pristine condition. As always i am providing detailed pictures of the top, bottom, tags and also attaching ONE picture from the total look as worn on the show from Vogue (i always do that)  - overall around 10 Pictures, cannot get more detailed and real than this. I always do that and is actually a very nice thing to do because gives the potential buyers the full idea. Not even 30 Minutes later i receive this ridiculous message (it is just too insane to try to describe it so i am copy\/pasting it). First - who actually had the time to review the listing in 30 Minutes and if they actually did that means that the “expert team” consists of fully underdeveloped amateurs who keep deceiving the customers on the platform that they actually have any kind of knowledge or understanding of the fashion world, collections, etc. If maybe it is actually the compuer system rejecting it , we can only imagine the so pompously advertised team of “experts “ is actually a computer system. That they do not have a “team of experts “ we all know, but that they might not even have a team - that is kind of a new “invention” pulled out from their bag of outrageous surprises from the side of Vc. Simply appaling. Like most of the time. Forgot to mention - i have sold 362 items and I obviously know very well how to take pictures, give descriptions and sumbit the right information for a proper listing. Sad part is that i guess when you get into the “hands” of a random bunch of not knowledgeable people to decide, all this does not matter. \nHere is the letter... 😂😂😂\n\n\n===\nQuote\n\nCHANEL \nDresses \nReference: 13959511 \nVery good condition \nOn the site: 680 € \nFor you: 510 €\nUnfortunately, your listing could not be published because the photos are not original (photos taken from the internet are not accepted), do not sufficiently enable us to verify the item, or do not meet our criteria. \nPlease try listing your item again with photos that accurately represent it, and give potential buyers as much detail as they need!\nAlthough we have been unable to accept this item, please do submit more pieces you wish to sell to our curation team who would be delighted to check them out!\n====\nUnquote","title":"New day new absurdity","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-20","author":"F Abo","text":"Just been  told item 13342235 does not conform, even though its exactly the same as items sold previously 13245789, 12368793, 12291622, 12146509 and 11627765 which all conformed. How strange? The exact same item!  \n\nInstead of improving their service for both buyers and sellers, Vestiaire is now rejecting all items from all sellers who complain about their bad service!\n\nAll items you present for sale will deliberately be rejected, first you will be told photos are not good enough, then they will be rejected and any items you sell will also be rejected and you will be told to pay £12 to have the item returned.\n\nIf you give the item to another seller to sell, it will not be rejected, how strange?\n\nSellers you have been warned, this is why I have always felt its important to sell on multiple sites as the service with Vestiaire is going down hill fast, they do not take onboard complaints to improve for sellers and buyers. \n\nWILL BE UPDATING......","title":"Sellers who complain will have all their items rejected!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-20","author":"Amanda Lillie","text":"Wish I had read these reviews before ordering my item which 21 days later has NOT arrived. Tracking it its been sitting in the same spot for 8 days now and I have asked for help. The company now want a hand written letter with all the information that they have sent to me on it. What century are they working in. I will be calling my bank to cancel the payment for non delivery of the item- DO NOT USE","title":"DO NOT USE -Wish I had read these reviews before…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-20","author":"Denise","text":"Vesitiaire Collective provides, what I would describe, world-class bad user experience. Every external facing experience including its customer chat service, app and web UX, and listing process is counter-intuitive, debilitatingly inefficient, and on the brink of defunct. \n\nTheir tech issues are a joke. This is an ecommerce platform that cannot support basic ecommerce activities. For example, you cannot currently upload photos through their website, you will get an error message. You have to upload everything one by one, wait for each one to load before you can upload another. And after all that work? The changes will take up to 2-3 days for a team to arbitrarily approve the photos. Uploading your profile photo for your account is equal amount of fun. But for your profile photo, you cannot upload through the app. You will get an error message. You can upload through their website, but the profile photo will only stay on your profile for around 24 hours before it self deletes. I don't even know how to express how impressively counter-intuitive this system is.\n\nThe listing process is another laughing stock. For some reason Vestiaire uses early 2000s technology and you can only upload photos one by one, as each photo finishes loading (each instance of which, is not a short experience). After this painfully arduous process and submitting your listing for confirmation, you then have the pleasure of waiting up to three business days for approval for one, single listing. The listing gets passed onto a \"curation\" team. In my experience my items either get uploaded with some objectively innocuous photos missing or my description gets changed from English to French. The site will translate it back to English for you, but the machine translates it differently and oftentimes the translation makes no sense. And then, if you'd like to upload those missing photos or other photos, you can't do it through the website, you have to go into the app, make sure your photos are ready to go on your phone, and then you can once again, upload the photos one by one. Each time the photo loads, it takes you back to your items page, so you need to select the item, pick upload more photos and then upload photo, and wait for it to load, and then start all over again for another photo for the same listing. And that's only if your listing gets approved. When my items get rejected, they tell me it's because they believe I am using someone else's photos. But i have only been uploading original content that belong to me. And there is no way to argue this and your listing relisted. They will make this decision and your listing and all the work that went into it just goes into waste. If you go to customer service about this, they will simply tell you to resubmit the listing with \"better\" or \"enhanced\" photos, even though the problem was they were accusing me of using stolen IP. So, I have no choice but to resubmit listings repeatedly with no idea what photos they are looking for. And the truth is, they don't know what they are looking for. Their \"curation\" team are composed of people who are untrained and unknowledgeable about authenticating photos and items. Their decisions are completely arbitrary. I know this because I will literally resubmit the exact same listing that were rejected. No change whatsoever. Attributes, description, pictures, price point, everything all the same. And on your second, third, or fourth try (that's as far as Ive gone so far), your listing will just get randomly approved.\n\nThe experiences of the chat service are consistently inconsistent. Sometimes they can remove an image from a listing immediately, other times they claim they don't have that power. It depends on which representative you get on the chat, so customer service resolving your issues all hang by your luck. Competency is a serious issue there. The reps often ignore your messages and will ask you to repeat your request multiple times despite that it has already been communicated and it's still all typed there for them to see. I have had chat experiences where they literally ask me for the same reference numbers three times in the same chat, each time I gave it to them, and they will still ask you for it again and again. It is absurd. They will also blame the business' problems on the sellers, gaslighting us. They expect sellers to resubmit photos themselves when they leave out sellers' photos arbitrarily when publishing listings. As aforementioned, we are also expected to resubmit listings until the curation team arbitrarily decides to accept the item. I cannot fully describe how truly awful working with reps there is.\n\nReally hope Vestiare customers will just transition fully to Poshmark, where the technology makes sense and customer service is eons more professional.","title":"The Worst UX in Ecommerce - Vestiaire Collective","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-20","author":"Jectin","text":"I never post reviews online but I really felt I had to so that this does not happen to anyone else. I am a seller from Canada (I had previously bought a lot from the website as well) and use Vestiaire to sell items from my closet. I've been selling for over a year and had not run into any issues - I was granted expert seller status.\n\nHowever, it seems that recently Vestiaire has hired completely incompetent quality control staff. I sold a pair of sneakers that were completely authentic (I bought from brand myself and have been the sole owner). I also kept the receipt both in my email and a hard copy. I send the item to Vestiaire and it is deemed non compliant due to authenticity. They cancel the sale. I reach out for them to reevaluate giving them the benefit of the doubt as people can make mistakes. They already have the hard copy receipt and I send them an electronic receipt for review. They still reject the item. Now I'm stuck paying a fee to get it back and because I live internationally, it will have to go through customs and I'm going to have to pay large customs fees to get my item back (as the price of the item is high). \n\nSo you are telling me Vestiaire, that I sold over 100 authentic items and then all of a sudden decided to send you a fake? Does that even make sense to you? \n\nFor anyone contemplating selling on this platform, please don't. Save yourself the stress and frustration of randomly getting your item rejected for no reason other than the quality control team felt like it. You have been warned. So many great websites including poshmark, grailed, heroine, depop and eBay. \n\nBottom line: Vestiaire will randomly reject your sold items despite overwhelming evidence of authenticity and then never admit they are wrong. DON'T SELL HERE!","title":"Please do not sell on this website, please!!!","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-20","author":"Mrs P","text":"Update in response to VC reply:\nAll this link does is direct you back to their chat.\nVC if your reading this, the reason I felt the need to write on Trustpilot was because your customer service refuse to help. So no, I will not be once again providing you with the information you already have to progress this case. WE ALL KNOW HOW TO RAISE A CONCERN, VC NEEDS TO LEARN HOW TO RESOLVE IT.\n\nItem purchased 3 weeks ago still not arrived. \nAccording to VC flow chart in my account item arrived the same day they posted it from France ( what did they use a private jet !!) in reality the tracking states item has remained in same hub for over a week. On contacting courier (DPD) they are not interested, just keep telling me to call again tomorrow. Reached out to VC Today  asking them (as sender) to investigate but they refused stating i have to wait another 15 days. So I have no idea where this will end, I’m £500 out of pocket. Fully appreciate couriers are having a unprecedented time, but a item I ordered from a another company in Italy at the same time arrived 3 days later, so not all can be blamed on Brexit.  Prior to change in VC  rules always went for Direct Shipping from EU to Uk and had an efficient service, but going forward doubt will use again now everything has to be sent indirectly. Delays I can accept but customer service refusing to engage is sheer disrespect to the people who keep them in business.\nSellers - put your items for sale elsewhere, I will buy.","title":"Buy a season in advance given slow shipping","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-20","author":"Carly Beilby","text":"I purchased a Delfina Delettrez earring which said in very good condition.  It arrived and how it could have been passed by “The Vigorous Control “ system is totally unbelievable. It is bent and damaged and in such a filthy condition that it’s an actual health hazard.\nI have contacted customer service and completely hopeless. Sent 2 Emails which have gone unanswered.\nThis was not a cheap item and the lack of customer care is abysmal to say the least .\nI will never use this site again .","title":"I purchased a Delfina Delettrez earring…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-20","author":"THECOUNTESSZAPAK","text":"Wish I'd read the reviews on here first. I ordered 2 pairs of boots , one pair was mysteriously cancelled and then re-offered in texts and emails ..? never got to understand what that was about,The second pair never arrived, but I got a Dior purse ( not my thing but okay  ) 6 weeks later. Some other customer must be seriously upset!  I bounced around the website( there is no number and no email for customer service)  there is a bot that I tried to sort out with the and went around in circles,I sent 3 emails on the site,I could not get any customer service at all, no answer so far provided ref number and my email address.STILL WAITING despite Vestaire's answer on here.I do not recommend and will not be using this site ever again . Except you're not Vestaire  YOU HAVE NO CUSTOMER SERVICE WHATSOEVER  ( see below !) another 5 emails later over a  MONTH  WAITING  and literally haven't heard a thing  NOT ONE EMAIL, NOT ONE PHONECALL, NOT ONE TEXT ,NOTHING !! ! SCAM. ,,UPDATE ..OMG I just got a computerized email first asking for the return of the Dior purse they sent to me by mistake in the first place and   then another one telling me this 'ur Quality Control team have verified that your item matches the original product description made by the seller at the time of your purchase.\n\nFor this reason, we are unfortunately unable to approve your return on this occasion. ' You could not make the stupidity and incompetence of this company up. Poor wretch who spent at least £500 on the Dior, only to receive my £20 boots!   Epic idiocy does not even adequately describe the competence level of this sham operation !","title":"Wish I'd read the reviews first. NO CUSTOMER SERVICE LITERALLY ! ,BEYOND TERRIBLE","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-20","author":"Paulina Paulina","text":"I believe they are lying a little bit in their import tax calculations. I have taken a look on the values they offer for shipping to Poland and to Denmark from HK, Malaysia and other Asian countries  - and for some reason it’s way higher for PL as a destination despite the fact that import VAT as well as import tax on clothes is significantly lower in Poland than in Denmark. Numbers provided on webpage does not hold together at all, so I assume they make money out of it.","title":"I believe they are lying a little bit…","stars":3,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-20","author":"CK","text":"They have ruined two of my recent sales due to lack of understanding of new Brexit export rules. Their high commission is not justified. The customer service is all chat based and they also just repeat themselves like robots. Seriously considering closing my account. I feel VC has really gone down hill in the past year. I would sell elsewhere","title":"High commission charged for a poor selling experience…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"},{"date":"2021-01-21","author":"Fion","text":"(updated: I got a refund on January 25)\n I bought Hermes mini evelyne on Vestiaire collective website on Dec 26 2020.  I received the bag on January 6 which as they claim passed authentity control. Nightmare! I found it was a fake and returned it. I gave \nVestiaire some photos to indicate how was the logo shown wrongly. Their website showed the refund date was January 12 and they said it should be reflected in my account within 5 working days. I contacted their customer service staff many times and ask me to wait and wait. As of January 20, they told me the refund is still in process and no explanations from Vestiaire anymore. As of today, there's still no refund. I only got their standard template email reply as below. No action date, no commitment, Nothing I can do. I am still waiting for feedback from their \"Expert\". Can anyone help me get my money back from Vestiaire Collective?\n😡\nRef: 13423xxx\nHi Fion,\n\nWelcome to Vestiaire Collective and thank you for being our member.  I already send an email to our expert team regarding your refund.  I will send you updates if they replied.  If you have other concerns, don't hesitate to send us  an email.  Thank you and stay safe.\n\nKind Regards,\n\nJessan for Vestiaire Collective\nxxxxxxxxxxxxxxxxxxxxxxxxxx\n23 Jan 2021, 16:16 CET\n\nDear Fion,\n\nI am contacting you regarding your recent Trustpilot request about the refind for your order nr. 32263639 (Hermes handbag ref. 13423xxx).\n\nI understand your request.\n\nIn order to receive additional information about the refund, I have contacted our payment team.\n\nOur policy is to get back to you within 3 working days to update you on this situation.\n\nThank you for your patience and I remain available if you have any other questions. See you soon on Vestiaire Collective.\nKind regards,\n\nOlga for Vestiaire Collective\nxxxxxxxxxxxxxxxxxxxxxx","title":"A fake Hermes evelyne bag ....refund please!.....Is Vestiare facing financial problems?","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=79&stars=1&stars=2&stars=3"}]