[{"date":"2020-08-22","author":"Louiette","text":"very arrogant attitude from the quality control team and just goes round and round, listening is clearly not their skill! I don't understand where these excellent feedbacks are from but they are mostly invited ones so I seriously doubt the credibility of those! I will avoid this website at all costs","title":"very arrogant attitude from the quality…","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-22","author":"Lee Yoder","text":"Purchased a 1000 item from the Erika Jayne collection. Paid for four weeks ago, I notified company it had not shipped, they stated they will not ship to a post office (but accepted the order direct shipping to the post office and nowhere on the website does it say they don’t), and are refusing to refund my purchase. Customer service has been contacted seven times. After holding the order without even notifying me they don’t ship to P.O. Boxes, I have no product, and they won’t return funds nor will they ship the product. Will never order from them again. And apparently I’m out 1000 bucks or will have to file against the company. All potential customers, beware of this shady company.","title":"Do not order from here","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-22","author":"dagmara f.","text":"Fees are so high , for this reason I do not recommend .","title":"Fees are so high","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-22","author":"Lee Yoder","text":"Purchased a 1000 item from the Erika Jayne collection. Paid for four weeks ago, I notified company it had not shipped, they stated they will not ship to a post office (but accepted the order direct shipping to the post office and nowhere on the website does it say they don’t), and are refusing to refund my purchase. Customer service has been contacted seven times.  After holding the order without even notifying me they don’t ship to P.O. Boxes, I have no product, and they won’t return funds nor will they ship the product. Will never order from them again. And apparently I’m out 1000 bucks or will have to file against the company. All potential customers, beware of this shady company.","title":"Do not order from here","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-23","author":"Miss Silvia","text":"Hello\n\nThis is my first and last time that i purchase something on VC. Ordered a pair of Prada shoes amd they are still not sjipped. The seller is online but she does not reply to my messages. Very wierd! The customer team is usseless no help from them at all! I really want my money back.","title":"Hello","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-23","author":"Bengtsson001 ","text":"Do not buy anything from this company \n\nPurchased 2 items of two different sellers. Refund for one item and another item purchased one week ago and it still has not been posted and the seller ignores all messages \n\nUtterly disgusting service and a waste of time paying for items and not getting any response. Vestierre should be shut down for negligence","title":"Do not buy anything from this company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-24","author":"Lee Yoder","text":"This is my follow up. Funny, because I just received an email from David at customer service stating I was being referred to....customer service.\n\nI have never reviewed anyone online, let alone given a negative review. It is very simple. I paid $1000 for a product, you are unwilling or unable to ship it, therefore you have to refund the purchase price. Your customer service has not been responding to emails, instant messages or any of the other ways in which consumers are notified to contact you. Any potential consumer should understand what your company stands for.","title":"This is my follow up","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-24","author":"Laura ","text":"Customer service is shockingly bad - as in, it's probably the worst I've seen on any e-commerce platform, ever. I've had to chase them multiple times over an item I bought that never left its destination. Not only did I need to drag answers out of them as most of their replies are one-liners riddled with typos, but they kept brushing me off, telling me to contact them again in 7 days\/24 hours\/etc. I kept receiving contradicting information. (Update: only one team member out of the dozen I've chatted to, Brian, has been polite and helpful so far. My refund has finally been processed, but given how painful the process has been, I'm not holding my breath until the money is actually in my account)","title":"Customer service is SHOCKING","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-24","author":"Polly Allie","text":"Most negative feedbacks are from buyers. Let me tell you my bad experience as a seller. It’s entirely fine if a deal through the platform does not proceed in the end and the item has to be returned to me. But VC actually returned my item which is in new condition with a soft foldable box in ONLY A DHL MAILBAG. Anyone with common sense would know that it would mean the item would easily damage in transit. And alas! My item which was BRAND NEW when I sent it to them was returned DAMAGED. I tried contacting them but with NO REPLY AND IT’S BEEN A WEEK. So if VC can’t authenticate properly based on the buyers’ feedback here and they are damaging seller’s items, I can’t see where their value add is anymore in using their platform.","title":"DO NOT SELL WITH THEM","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-24","author":"Lee Yoder","text":"Another follow up. You have now been provided my order number twice per your request.  If you do not know the order number, how do you know the order has been moved to a “different department”? Potential consumers - they are still refusing a 1000 order yet will not send the product.","title":"Another follow up","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-25","author":"Sarah Jones","text":"I have purchased an item described as 'very good condition' and it arrived with a broken zip and undone stitching around the skirt. On sending it back to VC for a 'control check' there was found to be no issue and the dress has been sent back to me. Paid a fortune for a broken dress and the team are incredibly unhelpful. If anyone has a suggestion on how to resolve this please let me know. Don't shop with these guys you will get broken items and no refund.","title":"Isabel Marant dress","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-25","author":"MY GOOGLE BOX","text":"Never trust them.\nIn Europe they use the cheapest shipping company DPD.\nThey have sent my Christian Dior suit with DPD which is known with its fake delivery attempts.\nThey did not try to deliver but just dropped an email as if they tried to deliver, they're asking me to go to their pick up point to collect the package. This attempt is completely false because because we have records of every door bell rings and there are three people in the office.\n\nAnyways VESTIAIRE COLLECTIVE's customer service is completely useless in such a case.\n\nAdvising me to take and UBER for 15 Euros and go & collect the parcel from DPD's pick up point.\n\nUnbelievable !\n\nThe correct thing they need to do is that:\n\nAs the client of DPD, they should call them and fix it.\n\nPlus the customer service agent assumed that I am a man and refered me as \"Sir\"\n\nTotal failure ! Shame on VC!","title":"Never trust them \/ What happens when you order with them","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-25","author":"Elle","text":"UPDATE: VC got back to me and refunded me immediately after this complaint. Thank you for that! Because of this I'm updating my star rating. I will still leave it at three stars though because I think their staff should be better trained, and it shouldn't take a review like this to get their attention. Good luck everyone!\n\n\nReally crappy experience. I bought a counterfeit Realisation Par dress by accident on their website (from an Expert Seller, mind you!) and got in touch by their online form the day I received it, with pictures. When days went by with no response, I wrote via their app's chat feature, which worked (at least on the surface). A representative got in touch quickly and told me they had never received my contact form requests. Great! I would have waited forever not knowing what happened. He said he submitted my request himself and that they would be in touch later. Again, days pass with no further contact. I got in touch again via chat, and a different representative told me a prepaid return label had already been uploaded to my account. While I would have appreciated being informed about this in the first place, I thought fine, at least this will be over soon. The representative told me to let them know by email or chat once the return had been shipped, and they would process my refund. Finally some relief! Except it wasn't. I shipped the item and got in touch to let them know, as requested, but instead received very confusing messages from a person who couldn't type and could barely speak English. They said they were \"investigating my issue\" which made no sense since previously I was told that all I would need to do is inform them of my return. Anyway, fine, she said she would get back to me later via email. And then... crickets. Are you sensing a theme here? \n\nFinally, today, I got in touch again to ask what the hell is going on with my return and was met with a very snippy representative who told me that their team will need 14 days after the item arrives to decide whether or not it really is a counterfeit. !!!!!!\n\nOn the bright side, finally, a representative who knows how their return service works! Who is training these people?? At the same time, I now have to wait two more weeks to see if they're at all honest (not much faith at this point), and the person who sold me the fake gets to go on with their jolly lives (oh yeah, I asked, they don't ban sellers who sell fakes!). Seems fair and intelligent, right? Especially for a luxury resale company? This is why every third Realisation dress you see is a knockoff, if not more. They don't even have a feature to report obviously inauthentic pieces--it's apparent whose side they're on in this.\n\nDO NOT TRUST VESTIAIRE. If you absolutely have to use them, at least pay by Paypal so you're covered by Buyer Protection. I have half a mind to contact my bank, but will wait until they respond to me (God knows when).\n\nTruly pathetic.","title":"Crappy experience - but they helped in the end","stars":3,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-25","author":"Patricia Boswell","text":"I use the site for the first time and brought a Loewe bag for £167.00 the picture of the showed like it was a normal size handbag when it arrived it was the smallest bag ever. The picture of the bag was deceiving I have been in touch with to refund me my money I have been told that I cant have a refund\n I am so upset and disappointed with this site I will never buy for them again. Its is not a customer friendly site. DO NOT BUY FOR THESE PEOPLE.","title":"Dissatisfied and Disappointed Loewe","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-25","author":"elhadj bamba","text":"Worst experience EVER !!! \nIt’s been 4 weeks I haven’t got paid For my Travis Scott’s SB yet I keep chatting the same people they keep saying “ we file your claim to our experts when they give us an answer we’ll contact you directly like” it’s been 6 days now waiting \nDO NOT \nDO NOT SELL NOTHING On Vestiaire!!! \nEverything Suck that take mad commissions and service still Suck !!","title":"Worst experience EVER !!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-26","author":"Lee Yoder","text":"You have been given my order number three times. Three times I have been told it is in a “higher department”. Your chat box is not responding.","title":"You have been given my order number…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-27","author":"Sophie","text":"Where is my refund? You promised to refund me the costs for the repair of the Chanel vintage bracelet, which was broken during transportation...I have provided you the invoice of the costs, and according to a certain Damien the refund has been issued...clearly NOT, shameless....and no feedback anymore from customerservice!!\nAlso please reconsider giving members the status expert or trusted seller...most don t deserve it, and it is quite misleading for customers!!","title":"Where is my refund","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-27","author":"Cherry","text":"Guys, use another site to sell your precious items. Look at these reviews below and would you say you have enough faith in them? I don't anymore.\n\nVC, I used the link to send you a detailed email about my concern and issue with the sale and all I got back was the generic and very robotic like replies, how are these \"experts\" even hired to do what they are supposed to do? AWFUL","title":"Just look at other reviews and you will understand","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-27","author":"Lizo Professional Services","text":"I think the company could really do with an overhaul of the management as it is not that well run and does not give you as a seller the opportunity to succeed. I have been a seller of luxury goods since 2008 and it's vestiaire who contacted me asking if I would like to sell on their platform. I don't even know where to start with frustration I've had by being part of this. Firstly, there is a definite favourism towards some sellers who can sell an utter garbage on the site, but all their items no matter how bad the quality - get accepted. I've had items that are brand new and classic pieces that one could wear for years get rejected as they apparently \"do not fit\" their online catalogue. It doesn't take long to realise by looking at the online catalogue that this simply is not the case. The irony is that the moment I have listed these very same items on ebay  they have sold in short space of time. So no real financial loss here, but they just don't respect your time it takes to list the items and could not care less about it. Secondly, there is no seller protection and the users can make offers on items never actually purchasing the items after the offer has been accepted with zero consequences. Thirdly, there simply is not enough traffic and one is definitely better off selling on ebay. I could go on and on, but not sure whether there is actually anything that is going to change purely judging from the quality of their support staff who can never actually help and seem to have a deaf ear.","title":"Not impressed as a long term seller","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"},{"date":"2020-08-28","author":"Spiders Stars","text":"If I could give zero stars I would. I purchased Marine Serre tattoo top which turned out to be a knock-off despite their so called quality control and authentication process which we pay extra for. On the website the top looked like the real thing but thankfully I have the same top in a smaller size which does not fit me and is the reason I bought this top in a bigger size. Upon comparison you can see the stark differences between the fake they sent me and the real thing. Aside from difference in color, fabric and graphics, clear evidence that the top sent to me is a fake is the fact that the inner tag of the fake one sent to me says SS19, while the real one says SS20. The Tattoo Top was exclusive to the SS2020 collection and wasn’t even created in 2019.  I tried sending them pictures and my refund request but none of it ever went through. Seeing this, I tried talking with their help desk to obtain a direct email but was told one did not exist.  I am very disappointed that the Vestiaire team who charges a fee to inspect item’s authenticity and has seen many Marine Serre products could not tell this is a fake!  The top sent is 100% a knock-off. What’s more, the fact that you can’t even reach out to them and get a refund is beyond ridiculous. Don’t believe their so called “Vestiaire Guarantee” that if an item is non-compliant they will reimburse you for the whole cost. By not even making it possible for a customer to get a refund on a fake item that was sent to them, they are complicit in the selling of fakes!","title":"If I could give zero stars I would","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=100&stars=1&stars=2&stars=3"}]