[{"date":"2021-09-10","author":"Jenny","text":"Twice I have bought trainers from Vestiaire and the sellers have not sent the item. Then I’ve looked online some weeks later and the seller has been allowed to relist the item for a higher price! How is that allowed? All Vestiaire care about is the money they get from sales in commission and not the buyers who are being treated like trash!","title":"They allow sellers to cancel purchases and relist the item for a higher price!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-11","author":"Buddy Dog","text":"If you buy from this website be careful, I paid extra for authentication of the bag which arrived with a broken strap making it unwearable it was also in much poorer condition than described and was poorly packaged. I sent multiple photos and videos and requested a refund of the full amount, I was than told to send it back for \"reinspection\" I sent it back but was told it matched the description despite it being clear it did not. They than sent it back with the strap loupes missing when I complained they said that they werr not missing they than sent me pictures of the bag being packaged which clearly showed them missing. After losing faith in the process I was able to uses my evidence to claim chargeback through my bank. I would urge anyone to do the same if you are going to buy from here and I would recommend you don't, ensure you keep records and pay through PayPal or on credit card to ensure you have a good claims procedure with your bank”","title":"Very poor service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-11","author":"Repsich","text":"Worst services ever. As a seller I have 10+ sold items and after my biggest sell they hold my money and asking for personal information. They don't want to send my money and they will not return my items because they are already to the customers.","title":"Worst services ever","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-11","author":"Heather ","text":"It is the second time within 4 months I’ve purchased by mistake counterfeit items. Apparently their so called “curation team” cannot tell the difference between real and fake Prada caps. I obviously didn’t realize it was fake until someone questioned it after I received my first fake cap. Because I used direct shipping so the company does not take responsibilities after the 72 hours time frame to report any issues of your order. Therefore, be careful when you shop especially using direct shipping. This site is less reliable than eBay or other high end reseller sites. And remember to use only PayPal when check out for consumer protection cuz this site is no longer reliable like before. Hope you don’t get scammed like I did!","title":"Counterfeits on Vestiaire collective","stars":2,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-11","author":"Sandra M","text":"As you can see from the responses from VC, their customer service is verbose and unhelpful, yet optimistic you will return. I have been using them for a while and my experiences have been mostly good. Items arrive quickly and are as described. As a seller when I encounter a problem and need assistance there is none to be had. Yet, they happily take their commission. \n\nI continue to use albeit cautiously.\n\nEdit: I see their response to my review but I did contact them when I needed help and got no response. Hence, why I wrote what I did.","title":"When it works, it works","stars":3,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-11","author":"Just Reea","text":"This site is looking like dead.....Nobody buy items.... I am a seller and buyer too but on the last few months i see lots of fake items and nobody buy my items which are not fake...i think people is tired about this site....all so huge commision and as a seller i get notification every 4-5 days to lower price on my products to be visible by more people....Tired....I will take down all my items and delete Vestiaire.....","title":"This site is looking like…","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-11","author":"L.B","text":"This is now my second negative review as Customer services are even worse if that’s possible!!!\nThey lie about helping and then ignore messages totally unprofessional!\nThey refused an item but their so called experts can’t say if it’s a copy or not..\nHave had to make an International transfer of money to get my item back and now no response.\nI want my watch back as this is theft!!","title":"continued disgusting lack of service!…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-12","author":"Athina GreekBabe","text":"I did not think I would be one to write a bad review BUT I am extremely saddened about my recent Alexander wang rhinestone bag. The first seller I ordered from added a false tracking number to my profile after waiting ages I messaged the team and they said they would reach out to the seller, to cut the long story short seller said they can only post it after 21days of me ordering then the next thing is the order got cancelled after 1month of waiting. \n\nI found another seller (biggest mistake ever) I was excited, the bag arrived so quickly….then when I went out with a friend who has the same exact bag she commented how come your strap is longer and the writing is missed placed (utter embarrassment). I later went to investigate and found out the the bag is fake I watched YouTube reviews to inspect the bag I had. I know saw a AliExpress review and the state of my bag matched exactly to the speck.  Did some more digging this seller has to different profile selling the exact same items which the price is lower on one account and higher on the other (I brought from the higher) also to make matters worse this person has sold more than 3 of the bag on their pages. This was my first ever time using the site and I am definitely not going back. I am so update I have to come over here to check the review I really wish I did this before my purchase. \nNow I am £££ short with a fake bag and no sign of a refund……nightmare","title":"Do not be fooled and fall for fakes…I wish I was warned","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-12","author":"Huong Nguyen","text":"I have recently purchased a Vintage Hermes on VC. The way they handled the shipping (use DHL) is really bad. They did not handle the DHL who failed to call me (the recipient) to attempt to deliver to my hands (i live in a secured building that needs 2 codes to access: impossible to hand out codes to non residents). VC refused to help. I had to go collect my order in a depot of DHL , far, and VC do not bother to refund me their charged shipping fee! How awful it is! For a high valued item!","title":"I have recently purchased a Vintage…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-12","author":"Huong Nguyen","text":"Customer service of VC is very very bad, useless in a way. I had to deal with them at least 10 times over the shipping problem by DHL sent from VC. No follow up. Bad choice of Shipper, i waited for their “promises” to deal with DHL (as DHL refused to deal with me!), but none of VC promise has been done. A bag ordered from germany (seller in Germany) to be shipped to Paris took me 20 days! Imagine? None of VC bothered to question why I had not received! I sent at least 6 to 8 emails (countless of help chat which results in only promises but no actions done ), waited and waited! At the end, i called so many calls to different DHL hotlines , I had to go to a depot to collect myself the package!!! Hell nightmare of this stupid VC useless customer service! Seriously! Stupid, useless!","title":"Customer service of VC is very very…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-12","author":"Sonya Henshaw","text":"To preface this, I have bought over the years tons of items from secondary sites.  I am a big fan of most secondary sites.  Please believe me when I say, trust the negative reviews for Vestiaire Collective.  They promise to review for quality and fraud prior to shipping.  I received a damaged item, that varies from the advertised listing.  I immediately asked for intervention and they told me the seller did not allow for a refund.  What about the quality assurance? This is my first and last purchase there.  I urge everyone to please complain to the better business bureau, I believe they do have an office in New York. DO NOT BUY from them!!!!!!","title":"Horrible Company","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-13","author":"Petra Jelenova","text":"Thieves ! \nI’ve bought a dress but unfortunately my work sent me abroad for a few weeks so I was not able to pick them up. It is already 2 months and they do not bother to try to send them again or pay me my money back. I would not ever buy anything from this company  because of this attitude.","title":"Thieves","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-13","author":"Satu Lindroth","text":"Will NEVER sell on VC again. I have tried to sell 6 items on VC and with TWO of them I had an issue.\nThe other one was a Gucci handbag bought by myself directly from Gucci store and the listing was been refused. \nThe other case were my Dolce & Gabbana shoes which were sold. Still the buyer could return them. No explanation to me why the return was possible. Again, the shoes were bought by me directly from store and in impeccable condition (many pics were attached).\nI mean, my experience with this place had been Beyond bad.\nI contacted the customer service (ie chat, no possibility to call) and there was this annoyingly polite but oh so ignorant SA who repeated that my issue is been taking care of. The only thing I got was this: rest assure, our IT team (what??!!) will take a good look on this. In the other place it was their Management and legal department that was taking care of my issue. Rest assure. O-M-G!!!!\nPretty speechless after my experience. How to fight against the System??","title":"Will NEVER sell on VC again","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-13","author":"Belle Reve","text":"Very disappointed with a dress I ordered for a friend's wedding. It was described as in \"very good condition\" with no faults shown in photos. It has multiple holes and stains on the front, back and sleeves. I wouldn't even donate this to a charity store as it is so dirty and worn.\nA cardigan I ordered for my Mum also has damaged buttons. Again the seller described it as in \"very good condition.\"\nSustainable fashion is not about profiting from damaged goods that are misrepresented by the seller, that the buyer can't actually use. \nI no longer trust this website. As I still have other orders to arrive I am worried everything will be faulty and I have wasted all my money. I should have just bought directly from a local shop or from a new ethical designer.\nDON'T WASTE YOUR TIME AND MONEY ON VESTIAIRE COLLECTIVE.\nEdit: VC have responded to my request for a refund by saying the item is \"compliant\" and I can relist it for sale. How can I resell something damaged with holes and stains? They then sent another email saying I had to take up the relist offer quickly and respond. When I responded the email bounced twice. I forwarded this to them and was just met with more frustration.\n2 other items arrived, one was listed as wool but was actually cotton and very worn. One was a size M jumper that had clearly been washed and shrunk. Another item was cancelled as unavailable. Altogether disappointing.","title":"Shocking damaged and dirty clothes","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-13","author":"NA","text":"Horrendous service! I sold a genuine item and sealed in box and tissue paper from store as new. I received a message from ‘quality control’ to say that the item was without a box and they had messaged the seller. This was completely untrue and customer service is non existent! DO NOT USE you will be scammed!","title":"Horrendous service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-13","author":"Sheila Giada Ciervo","text":"Don't be fooled by the flashy appearance of this site and the promise of selling your item fast or buying quality second hand, please read the many negative reviews on trustpilot about Vestaire Collective before you engage with them, at least you will be prepared for the many likely issues you will have to deal with if you decide to use their poor quality services!\nThe one time I purchased something from this site the item was faulty and did not reflect the description. Selling items on this site instead is unbelievable hard, they push you to reduce the price of the sale every week to the point that even brand new items unused or even with the label attached end up selling for little and they take a fixed rate cut of £13 up until about £110 sale price (which is only convenient for them because they can get their money worth no matter the final price of sale), if the price is superior than they take a % instead (again because at that point they will make more as a %). And if you have a problem they make you wait forever to get back to you and they don't own up to their own mistakes. I sold a basic man Armani suit that was only worn once for a wedding, which took nearly 1 year to sell. The item was returned from the quality control with faults that the suit did not have when I sent it. When I received it back the trouser had 2 massive holes and the buttons of the back pockets looked like they had been torn out. All this was not reported in the description of the quality control report. The trousers also looked like they had been worn by someone that obviously did not fit them which must have happened while they were undergoing the quality control which took so much longer than usual. After waiting for over 1 month with absolutely no communication or update from them regarding the issue, a few days after soliciting a response they ultimately decided to refuse to refund the repair work cost saying that they received the item in that condition, hitherto blaming me for somehow ruining while they were not even in my possession, since I checked the item before sending it and it had no faults. \nThat is it, I am not using this site ever again, the cost of selling\/buying and the poor customer service are just not worth it!\n\nReply 17\/09\/2021\nMy item reference is 11700941, I am extremely disappointed of the service I received which left me feeling mistreated after causing me damage instead of supporting me in the process. I sent to Vestaire an Armani suit in great conditions (no rips or any damage, the suit had its original hanger and suit bag) and got back a ripped one. Additionally, the damage was by your customer service own observation \"unlikely due to transport issue\", so the only thing I have left to believe is that the damage was inflicted at your \"quality and control\" facilities since I inspected the suit myself before shipping it and it had no damage. I have been selling and buying second hand fashion items online for over a decade, I am aware of what standards are expected for an item to pass quality control and would have definitely spared myself all this trouble if the item had had any damage at all, let alone one so evident as ripped seams.","title":"Poor customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-14","author":"Susan Farrow","text":"Horrendous customer service. Do not use this site! I ordered (and paid for) two items within a week of each other and have not received either. They asked for lots of information, including ID, invoices, a hand written letter explaining what had happened and tracking information. They then said it could take up to 30 days for a response. I have heard nothing since. I’m now putting this down to a bad experience but will never use the site again and will use every opportunity to bad-mouth them.","title":"Zero customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-14","author":"Sonya Henshaw","text":"To reply to this company, earrings were marked Brand New, no flaws were mentioned in description. Only company that would rather fight then make thing right.","title":"To reply to this company","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-15","author":"Pathos","text":"AVOID! \nThis company sold my item at a lower price that I never approved (all the screenshots are saved). Somehow, the negotiation with a buyer ended up without my participation: VC just sent me an update that my item was sold and the price which was the first low offer from a buyer (it was rejected by me and later that person offered better price, but VC “decided” that the first low offer was good enough to sell).\nThen there were multiple attempts to get it fixed through their virtual support team (isn’t it ridiculous that such a big company doesn’t have any more a help-line? Instead you speak to robots...). VC told me that there was a technical mistake and that they would relist my item again. Here how it shows in my profile: you can see that I already sold this item (!!!😲) and the second exactly the same they posted yesterday with the price that they (VC) “sold” it and the one that I argued about... Just no comments... It’s not the end. They told that they don’t see any issue and that that was an original listing (NOT 🤬! Also, pay attention- they change the description you provide with the item for sale, which always made me super frustrated.). I removed the item from sale as it made me upset to deal with not a trustworthy company. Today I found an email that I lost my “expert seller badge” and the benefits. Great! Super attitude and fantastic skills to fix the problems!\nPS: not to mention that as a seller you are not protected at all (!) if your item is below 1K (I guess).... you have to ship it directly to a buyer and hope\/pray that a person is not a scammer. In this case VC doesn’t back you up at all (just takes a great chunk of your money for doing nothing). AVOID!","title":"AVOID","stars":1,"location":"MY","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"},{"date":"2021-09-15","author":"Afroditi Katsantoni","text":"Overall great finds but they lost my item! I purchased a gold ring for over 200 euro and it was supposed to be delivered by chronopost! I tried multiple times to contact them and vestiaire with no luck! It’s risky to order from vestiaire don’t trust them","title":"Lost 220 euro item and no refund","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=45&stars=1&stars=2&stars=3"}]