[{"date":"2022-02-07","author":"Emma","text":"Really frustrating experience.\n\nFirst, I could not purchase an item because the website would not connect to the two factor authentication page for my visa credit card. After a week of contacting them and getting nowhere, I gave up and purchased using my mobile (which I don't like to do for reasons of security).\n\nI then purchased a bag for just over £1K plus £25 in shipping and verification. For 7 days nothing happened, the seller ghosted me and then on day 7 I was informed the item was 'no longer available'. Beware, basically a seller can pull out up to 7 days after you have bought an item and just cancel without any apology or consequence. \n\nFinally, to add insult to injury, I received an email stating I would receive a refund for the list price but excluding the shipping and administration costs. Allegedly I will receive a second email (at a later date) for the refund of shipping and admin costs, but frankly I do not trust this.\n\nHorrible experience all round. Did not receive the item and have yet to receive a refund. Customer service was far worse than Ebay, which is very disappointing given their positioning as a luxury reseller platform. Avoid!","title":"Really frustrating experience.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"MarKo","text":"Although I have used Vestiaire a lot of times as a buyer, as a seller the service is not up to standards. I am also an expert seller that has sold many of my luxury personally bought, used and collected items so I am no stranger to the luxury fashion market.  I recently sold a pair of vintage Gucci sneakers bought from the boutique and the “authentication” team deemed that they could not verify the authenticity and automatically cancelled my sale. I had to raise a dispute and request a second check but had I not I would just lose my money and my item. The verification team should know better and this makes me wonder whether what I bought previously as authentic could be also falsely checked.","title":"Authentication team not experts","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"S.Lovely","text":"Purchased a pair of Dior trainers -\n\nMy first order was cancelled for no reason and no explanation. VC gave me multiple excuses, and the shoe I bargained down was given to someone else. Despite me purchasing first and VC confirming an issue on their end, the shoes were gone!\n\nAntagonised me by sending me tracking updates regarding the order they cancelled. I should've gone back to Ebay at this very moment. \n\nPurchase number 2:\nDior trainers, the sole cannot be cleaned on this particular style, and it's tough to get marks off as its a delicate fabric\n\nThey authenticated the first pair I ordered. I have pairs already of this shoe; I wanted to ensure it was a legit site.\nThe shoe came filthy! Poor condition, although stated as good. The shoe size wasn't for me; they had been worn so much clearly by a wide foot. So I have to resell. \nThe second shoe was perfect. just as described in good condition, much like the pairs I have ( these come in various colours) \n\nThe most recent pair (3) is horrible! The shoe has the fabric colouring on the sole, bleach marks and meaning this cannot be removed. The seller advertised them as gently worn and had no clear pictures of the soles.\nUpon receiving the shoe - I made a claim\/report instantly.\n\nI contacted them the next day due to no acknowledgement of the first report. \n\nWhen speaking with an advisor called Reyanne B - she said my report wasn't received and I have to make another one, which I did with her on the chat,\nShe confirmed receipt and said that I'd get an email regarding this inconvenience as soon as.\n\nStill nothing. \nI contact again as the window is closing to make a report. The lady named Cathyrine M says I should make yet another report because they didn't receive it; I'm exhausted with the horrible customer service that this company proved.\nI made it clear I wouldn't be making any more reports as I have made enough- If this isn't rectified and they note that this shoe style cannot be cleaned, they need to mark all as fair and price accordingly.\n\nI will contact my bank as a last resort if this isn't sorted out; I'm tired and worn thin with them.\nI've never been so stressed talking to people who don't care about the customers! \n\nYou can't expect people to be out of pocket with items that aren't wearable. If I wanted to thrift for vintage worn through things, I would go to places that provide this. Theirs meant to be a level of quality provided.","title":"Purchased a pair of Dior trainers -","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"Alison Power","text":"Have had a few genuine offers and able to sell well, despite the huge commission. \nAlso they refuse to list many items from great UK designer brands and even brands like Michael Michael Kors where you only just get an option to list as an \"unknown brand\" or they otherwise they won't take it all. This is \nIncluding premium brands which they fail to recognise.\nBut worst thing is so so many fake offers - which means you can't accept other perhaps genuine offers until nearly two days are up for the fake offer to be invalidated!!! By that stage the othe purchasers have lost interest.\nSometimes multiple fake offers are made  from the same site but the only recourse is their fairly useless WhatsApp customer service area which takes ages and says it'll take action but nothing seems to happen. The spurious buyers just keep on bidding and takes some time to realise they're fantasists...\nAlso if you spot a small mistake on their international sizing system - ie you list something in one country's size and it appears wrong on another market's size - you can't seem to revise this but have to go through the interminable customer service chat - if they actually answer -  where many of the operators just don't seem to understand what you're trying to explain. Can take half an afternoon so not worth the trouble.\nI speak French so have been able to reply to some potential purchasers queries in French person.\nHowever the main problem is that  some of these so called buyers are more like time wasters and never banned.\nAfter reply from Vestiare...\n\nBtw have just had a very nice reply from Vestiare - below - but illustrates how  customer service doesn't keep tabs on what the app uploading system is saying.\nThey claim they list brands like Michael Michael Kors but I've literally just grabbed another screenshot of their site saying they no longer take orders from Michael Michael Kors! I still find this strange given MK's popularity.\nWould upload screenshot but there's no facility here on Trustpilot for doing so! \nBut generally his is what I mean about frustrations dealing with this site - although a few great sales achieved - and getting different replies when looking at potential listed brands accepted, messaging customer service etc and getting different answers for queries if at all!","title":"So many fake offers and bad customer service …","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"SM","text":"So far I’d be giving 0 if I could. This company has sent me a fake designer bag despite having ‘authentication’ checks. I even paid customs and am out of hundreds of pounds! The support team don’t read the messages properly and reply with something totally irrelevant and they are making it impossible for me to return the item, and haven’t even guaranteed a refund! I don’t have a printer for their return form, I went to a parcelshop they confirmed was correct but the return is invalid, therefore they don’t care to help further and it’s now been 5 days since anyone last wrote by email. Avoid this business, they have stolen nearly £300 off me and don’t seem to care at all! It’s a scam and there are no ‘experts’ because the differences between the bag I got from them and the real Thing is worlds apart in differences. I wouldn’t have known either if I didn’t buy the same bag in another colourway directly from Telfar myself. The logo, the size of the bag, the shape is all different but same name! I requested a manager to contact me also, still nothing a week later, I wrote about this in January!! Shocking!!!","title":"So far I’d be giving 0 if I could","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"Natalia Ferreira","text":"It's impossible to unsubscribe to their e-mails! I have tried several times and they keep sneaking up to my inbox. Very weird in times of GRDP... Your emails are going straight to spam now.","title":"SPAM EMAILS","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"Christian Stanton","text":"I cannot believe Vestiaire has 3 stars when all the reviews are terrible!!!!!! \nI have never had such a terrible service from a so called “company” in my life someone in their “customer service” department “Andrew E” blatantly lied to me !!! Vestiaire had not provided the correct paperwork to DHL to get my shoes that I had bought out of customs but I was told that Vestiaire had spoken to DHL and my shoes were on the way and would be with me within 4 days , when I chased this through DHL i was told no one from Vestiaire had ever contacted them and because they had not provided the correct paperwork they had been sent back to the seller !!!! Despite numerous emails I have not heard anything from Vestiaire regarding what’s happening and if I will be refunded LIARS WITH ABSOLUTELY NO CUSTOMER SERVICE DO NOT USE","title":"I cannot believe Vestiaire has 3 stars…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"Tracy Melling","text":"You state you will help if I provide details of my account, you have had all the details for a month and you have done nothing except send me emails saying you will get back to me in the next 24 hrs!","title":"DO NOT USE THIS COMPANY","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"George","text":"First time buyer : Bally shoe made in China and charged for £170 that’s made in China ! Terrible experience !!! \nAnd you can only relist it cheaper price sell to other buyer like me . I wanted full refund .\nNever ever buy anything from Vestiaire.","title":"Fake product made in China don’t buy in this website","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"Seth Evans","text":"I placed multiple orders, of those orders all of them had issues: \n\n1) Not as described - seller said that the shoes were brand new unworn, when they arrived they had clearly been worn and had gold pen written on the sole. VC suggested that these should be reposted to their site with the original description and photos. Which in my opinion is disgusting. Then another person will have my issue! I centrally after threatening trading standards I was offered the option to send them back, but only if I was able to print a returns label they provided (which thus far I have been unable to do, they gave me 3 days to sort this! WHO HAS A PRINTER AT HOME IN 2022 and also, we’re in a global pandemic. Utterly disgraceful. \n2) Item never arrived - I purchased a top that just never arrived. VC asked me to write a handwritten statement and a copy of my passport just to be able to investigate?! I spoke to a lawyer who told me explicitly not to send my passport via email and they shouldn’t be asking for this information. But I was told without a copy of my passport they couldn’t help, evenetslly I had no other option than to send a redacted version of the passport, I’m waiting for them to tell me this isn’t acceptable and to require my passport details. The whole thing seems very fraudulent. \n\nI have reported them to the relevant authorities and to my card issuer in the hope they can get this sorted, if not I will be out of pocket hinders of pounds. \n\nI am beyond disgusted with this company and if I could give less than 1 star I would. If I can save just one person the stress and anxiety of shopping at Vestiaire Collective by writing this review then it will be enough. \n\nI cannot stress enough. \n\nAVOID AVOID AVOID.","title":"AVOID AVOID AVOID","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"Ta","text":"Every time that I’m selling clothes I have problem with VC!! \nAll my clothes are authentic (with receive), but they are rejecting, probably all workers worked before in Zara. \nOne time they kept my sweatshirt for 3 months because they said it’s fake , but probably workers are using all clothes and accessories all this monthes. After payed 12€ for shipping back and 50 calls  to VC support they gave me back my sweatshirt!!!!! \nRidiculous","title":"Every time that I’m selling clothes I…","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"customer","text":"incredibly bad customer service","title":"incredibly bad customer service","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"Trisha","text":"I sold two expensive items, printed the shipping labels provided and sent the items as per instructions.  This was done on 1 November 2021.  Since then I have tried to contact customer service several times by email and chat.  I cannot get any service whatsoever and I have received NO payment whatsoever for my items.  It is truly appalling and it amounts to theft.","title":"Two expensive items shipped and no payment or customer service","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"Siel M","text":"ORDER NUMBER 20258796, order date 14\/01\/2022\n\nIf I could give zero stars I would. I decided to sell valuable Chanel earrings with them. I get a message the item is declined because of a broken clasp. The clasp was NOT broken when I sent them out and I have picture evidence. The earrings get returned to me with not only the clasp snapped off, but also the pearl came loose. I have reached out countless times to their customer service who keep telling me they will “escalate to their expert team” and nothing happens. Absolutely insane. Do NOT sell with them, be smart and use a different retailer.","title":"Ruined my Chanel earrings","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"Ella","text":"Another awful experience with Vestiaire. \nThey keep using “ Hermes “ the courier that looses, damages or simply leave expensive items everywhere. \nLast week they damaged expensive white dress that impossible to clean. \nNow again. In 2nd of February I sent Dior heels to the buyer. Who never received them. As the parcel got lost. I contacted Vestiaire. Several days ago, up till now they have not done a single thing. So the buyer paid them , and I lost shoes. \nI myself contacted Hermes , the started investigating the Depot. \nToday Vestiaire requested my passport scan and proof of sending the parcel. \nPassport? Who are they to require the confidential information, that can be used anywhere later without my permission. Later today I received a call prom USA number asking to provide the passport otherwise they will not proceed the investigation.The proof ? The proof is in their system as they sent me the label. Excuse me? \nIf parcel is not found and I am not refunded I will report them to any possible institution. \nJust unbelievable!","title":"Another awful experience with…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"susan collis","text":"I have been informed that my bag is sold, weeks have passed and no funds.\nI can’t sign into my account to enquire. Nor can I change my password. I’ve sent emails and no reply. All very frustrating. Would be great to have a phone number and an intelligent conversation to sort this out.\nI’ve now received my funds, so thankyou trustpilot. Still unable to change my password or access my Vestiaire account! I would like my remaining hand bag returned since I cannot manage my account. It’s impossible to request the return. Maybe you can help.","title":"Still unable to access my account or get my item returned.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-10","author":"Amanda Harrison","text":"Generally disappointed. They supposedly have a hub that checks authenticity but they failed to verify an original bag and cancelled my sale threatening my seller status. How then are they experts?? Then asked for receipts or proof of purchase when it’s a second hand item.","title":"Generally disappointed","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"Aleksandra Nadezhdina","text":"Humiliating experience.\nGot my sale cancelled and accusations in fallacious product descriptions because the buyer said \"there is a knot (!!!!) on the lace and sole (!!) with stains\".\nSole was not shiny indeed, because I wore those shoes, but nothing awful and unusuall for an item that was in use 3-5 times in the street (wish i could attach the photos here) \nI was not hiding the fact the piece wasn't new, I provided all the photos upfront. I asked for them 1\/5 of the original price. Platform is for pre-loved stuff after all!!!\nThe way the platform manages the process incl. buyers expectations is poor. The way the platform communicate, navigate and protect individual sellers is appalling. Deleted my account and will not ever use again, will never recommend the platform to anyone.\nRuined my day","title":"Humiliating experience","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"M Bartle","text":"I ordered boots on 17 January and the seller shipped them a week later. However, the shipping status never got updated and after the timeframe for delivery had elapsed I launched an enquiry with Vestiaire Collective. On 29 January I sent them my passport and a declaration I had not received the item and they confirmed they had launched an enquiry with UPS. I have not heard anything despite follow ups and now most recently I asked to cancel my order. It has clearly been lost and I don't want to wait months while UPS may or may not find it. It has been a month and I haven't received my item, so I want a refund. I was REFUSED a refund. Vestiaire claim they won't give me one because I made a shipping enquiry. So now I can't cancel? I've asked to receive a phone call from a manger because to date everything has been by email or chat and nobody has phoned me yet. This is appalling. NOBODY USE THIS COMPANY. I'm surprised people have not launched complaints under the Consumer Protection Act. I will be considering this myself.\n\nUPDATE on 19 February. Someone allegedly from the head office has emailed me with the exact same response, they are refusing to refund me even though my order was placed 5 weeks ago. This is atrocious.  I am now considering reporting this company to as many consumer protection agencies as possible. \n\nMy order reference is 20290953","title":"Refusing refund, never received item","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"Isssys Polyu","text":"I recently made a sale for my Hermes Kelly handbag (Ref : 20782374) and shipped my bag to the HK hub. They then file a quality control report stating that my bag is in poor condition with some photos taken on cracked corners and leather. However, I have taken some photos before shipping the item and they show perfect corners. I suspect that my bag was damaged by the staff during quality check. I contacted the help centre many times but no one is getting back to me through email. The damaged bag is now shipping back to me… I do not wish to receive a bag that was seriously damaged by VC staff… If VC does not give me a detailed explanation or refund me the amount I should get from this sale (HKD $60449.93) to my Paypal account, I will have no choice but to file a dispute on Paypal or take legal actions.","title":"Staff damaged my Hermes bag","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=18&stars=1&stars=2&stars=3"}]