[{"date":"2021-05-17","author":"mike armenakis","text":"Quick transfer with dhl. Very high commission. Their team have decided that my gucci belt is fake. I bought from gucci store in milan. Always they advise to lower prices. Most of buyers never answer to offers.","title":"My gucci belt considered fake","stars":3,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-18","author":"aleksandra perisic","text":"I won £150 off because I’m a loyal customer and because I uploaded more than 15 items for sale. I’ve sold a lot of items. Anyway, when I applied the code it didn’t work. I’ve asked if they can send me another code or possibly I can pay the full price and they can refund me £150, but they just replied with sorry we can’t help yo. Code is fine and they don’t know why it doesn’t work. I even sent the screenshots where it says code is applied but the amount Hasn’t changed. Anyway they didn’t get back to me. I’m just really disappointed. It’s really not fair. I don’t understand how can a company like that treat customers in such a manner. Also there is a lot of misleading messaging and benefits that later end up not being true. Not to mention they constantly push you to reduce your prices and the commission is just very high. I also had an issue with one of my bags getting lost, but they found it after 3 months of writing and complaining. I’m not saying don’t use it, I sold items on VC, but definitely be very careful.","title":"Very disappointed","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-18","author":"NAZLI","text":"I’m both a seller and buyer and i have experienced the worst with Vestiaire collective .\nThe first one was with my sold item , there was something wrong with my shipping item actually the website didn’t give me one it said my address is wrong which was impossible i sold other items with that address before.\nFor 7 days I messaged the support team  2 or 3 times a day and each time at first they tried to blame it on me and when they couldn’t do that they just passed me to the expert team which I doubt they even exist.\nAt the end the sell got canceled after 7 days, such a disappointment.\n\nThe second time , last week , i made a mistake and used Vestiaire again.\nThis time I ordered a gucci bag .\nEverything seemed well and i have waited for my item for almost 5 to 6 days. After that i received a message that my item has given to my guardian so I checked with the lobby but they didn’t receive any package for me , I waited for 2 more days and still nothing mean while I messaged the support group and they tried to blame it on me again.\nOne week past like that until they accept that my item is lost for real and they would investigate which i know they won’t and my money and the bag is lost forever.\nIt is not convenient to pass the problem on customers, they area platforms that we trust to sell and buy through them at least they have to take responsibility.\n\nI will keep my distance from Vestiaire from now on.","title":"I’m both a seller and buyer and i have…","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-18","author":"customer","text":"I advertised a brand new, never worn Burberry Amberford  coat, which sold quite quickly.\nThe coat was sent for review at their quality control.\nThey claimed the belt had a tiny stain on it.\nWhen the coat left my home it was wrapped very carefully and most certainly did not have any stains on it anywhere .\nThey have also got the name of the coat incorrect ???\nThe buyer has now refused the sale. \nI have requested the coat be returned to me .\nTotal waste of time...😡 \nI will NEVER use this company again...","title":"Disappointing Customer Service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-19","author":"roni","text":"Absolutely ridiculous! Terrible company, they can only thank their lucky star that they are still relevant here in Europe, because it’s inconvenient to use THE REAL REAL because of the high import tax ;\/ starting from the stupid, bad designed app, to the non existent customers service. I ordered 5 times and always had a problem!!! I am ordering DIRECT SHIPPING items and they always get by “some mistake” shipped to their authentication warehouse. Always. And when finally sending it to me after all this time and emails, they keep sending it to the billing address instead of delivery address. I need to email them constantly about the troubles and remind to double check. They email me that I should deal with the seller myself when clearly it’s their mistake. And there is not even a clear way how to connect to the seller once you purchased the goods. Omg. I hate this. This business should get canceled immediately","title":"Absolutely ridiculous","stars":1,"location":"CZ","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-19","author":"Chi On Lai","text":"Selling at VC is extremely stressful & frustrating so I decided to stop since April.   \n\nMy buying experiences VC is OK, there are many friendly sellers I like and they have great & rare items I can’t resist not buying.   \n\nIt is the sellers I love, not the VC platform,\ntherefore I continue shopping at VC! \nI bought 4 items last week from a seller I know well, had purchased many from him before, voila....today VC concluded 2 of the 4 non-compliant because of “odour”?   They are brand new and I trust the seller, VC didn’t consult me first but cancelled the orders......I only found out from the seller VC’s reject the items because of “odour” \n\nPerhaps VC taking revenge on my previous complaints here?  No matter what, VC is definitely a platform I should stay away!     \n\nI wish the VC sellers I like & buy often from would sell at Grailed which is far far more pleasant than VC!\n\nUpdates 19\/5\/2021:  one of my rejected items #16045362 is now on Express Delivery, don’t know what it means.  In case a VC staff takes a liking to these trousers & tries to snatch it?  I’m following up closely with the seller 🤨\n\nUPDATE  27\/5\/2021:  item# 16045362—Seller received the trousers back, re-listed it today & let me know immediately when it was online (item# 16366930).   I bought it right away, but when I proceed check out, the trousers are suddenly reserved by a premium member!!  Under VC policy, a Premium member can hold an item for 30mins only, but it has been holding for more than 3 hours now.    Don’t tell me this isn’t an internal dealing!!","title":"Selling at VC is extremely stressful &…","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-20","author":"Leah","text":"Awful service, not helpful at all. Block you even if you do not break any rules.Not helpful in the slightest","title":"Awful service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-21","author":"Taylor Rhodes","text":"Honestly do not buy from them. The authentication process is a nightmare, I wonder whether those ‘experts’ are actually professional. Purchased a Vivienne Westwood necklace and it passed the authentication check by Vestiaire, but when I took it to the Vivienne store have been told it is a fake one. How did it passed the authentication check by Vestiaire then???","title":"Honestly do not buy from them","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-21","author":"Chi On Lai","text":"Definitely internal dealing\nI have suspected VC internal dealing for some times.  I ain’t into “commercial” pieces, am only interested collecting rare items by several designers.  \n\nSome of my purchased items during the last 2 years were found non-compliant for ridiculous reasons, some disappeared & some sent back to sellers.   Sellers had them re-listed & informed me to buy again immediately, but they were snatched quickly!....and I found them listed at other platforms shortly after. \n\nVC please manage your staffs!\nWe collectors spend hours to find, to negotiate price, to get the pieces that meant to us dearly, you can imagine how frustrating we feel, can’t you?","title":"Definitely internal dealing","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-21","author":"Jacob","text":"Keeps sending mails after unsibscribtion","title":"Keeps sending mails after unsibscribtion","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-21","author":"Emma Bugeja","text":"My dispute is ongoing and I would like further contact from Vestiaire- the issue has not been resolved","title":"My dispute is ongoing and I would like…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-21","author":"CARMEN FRANCESCH","text":"They have items for sell in the UK, (direct shipping), I am in the UK, and I can’t purchase them. They response is: it has to cross the bother. \nAny way, I’ve been 1\/2 an hour on their chat, an they could not help me. \nThe customer service adviser said that the item could not be sold in the UK, neither could cross the border!! Kafkaesque!!","title":"Appalling","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-21","author":"Audrey","text":"PLEASE FOR THE SAKE OF YOUR MENTAL HEALTH DO NOT SELL ON VESTIAIRE COLLECTIVE. \nThere is zero customer service, chat is automated, when they put you through to an expert advisor that’s automated too. \nI wish I’d read these reviews before I attempted to sell. Right now I don’t know where the £4000 cardigan is that I was attempting to sell. The buyer has paid twice, without the first purchase being refunded. \nI got told it had been sent to her by DHL, she hadn’t been notified. Only to be told a few hours later that it hadn’t been sent. It’s shambolic and incredibly frustrating, a waste of time and effort.","title":"PLEASE FOR THE SAKE OF YOUR MENTAL…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-21","author":"Ray","text":"DO NOT BUY FROM THIS SITE!!!!!!!! They take way longer to authenticate than they say. The site and order process say 1-4 days, it took 7 days. Then instead of shipping me the Rolex I bought for over $4000 they shipped me random black plastic rings, not sure what they are. They then don't have a phone number you can call, only chat and email. If you want to spend tons of money and not get your items, this is the company for you.","title":"DO NOT BUY FROM THIS SITE!!!!!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-21","author":"Del Gaï","text":"worst customer service ever","title":"worst customer service ever","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-24","author":"M M","text":"As a member on VC I sold a skirt. To ship it I wanted to download the shipping label from VC. When the download did not work, I contacted the customer support. They told me \"Please do not worry. A new shipping label was sent to your mail address.\".\nInstead of a new shipping label the mail contained this: \"Upon checking on your concern with the Expert Teams, this error means the shipment of the item is not viable or available to the place or the address. For this one, kindly cancel the sale for this one to avoid any future delivery mishaps. Don't worry, our team will contact and inform the buyer about this as well.\"\n\nAfter 2 messages that VC did only reply to with a generic sentence, I sent this third message:\n\"Dear ladies and gentlemen,\na second time you have not answered my my legitamate questions:\n\"If I cancel this sale I will not only loose the won 100€voucher for having listed 10 itwms (the rule is to not cancel any sales) but it will also look bad on my VC seller performence. \nI do demand a response with a solution for these points so I can cancel the sale without loosing the voucher or seller status.\"\nYou told me in your message you had explained the cancelation to the buyer.\nThe buyer says however, she did never receive any message from VC explaining that VC needs to cancel the sale due to a system error.\nIn contrary the seller was just told by VC that I was expected to ship the item within the next 2 days!\n\nI will make public that VC uses their members- which generate their income- to cancel sales that need cancelling due to VC's error.\n\nI am expecting your explanation.\nKind regards,\nSarah (REFERENCE 16049116)","title":"VC uses members to cancel sale that need cancelling due to VC's error.","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-25","author":"Debbie Tan","text":"Initially I gave a good review for first time sale. But recently today the seller gave a marked up price for item and I Clarified on chat why price different from wat we agreed. For that I was given a ban for 24 hours. I went on chat to complain as I didn’t break rules but my payment got cancelled (hopefully refunded) and I can’t even go on chat. Very unfair and this company supports bullying!","title":"Bad service","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-25","author":"Bill","text":"Them administer they are unfair","title":"Them administer they are unfair","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-26","author":"LindsayBay ","text":"I had a Chanel Puffer Jacket Item Number 16110734-order number 39389273- that came from customs Monday May 24, DHL was contacted by me to arrange for delivery to my business address well in advance, because of the pandemic we close the office at 4 pm daily. I called DHL with my waybill number to make certain to provide them the office hours in advance and to provide my cell phone number to sign for the package and to make certain I was the only authorized signer. The package was put on the truck Tuesday, May 25th. Wednesday May 26, the package is stating delivered on Vestiare Collective's app. , I didn't receive my jacket, I didn't sign for my jacket and DHL didn't deliver my jacket, so I called them and a gentlemen said all three of my email addresses  do not match up and I am not a customer of them. I stated I purchased a Chanel Puffer coat for a lot of money and I provided the order number, he could not find me by the order number or the tracking number from DHL, he could not find me by my name. My email on the app. is a privatized email I do not understand, nor did I provide, nor is it mine. He asked me to submit some documents, which I did and I have not heard from them in five days, I have not heard from or seen DHL. I am out a ton of funds. Please please do not purchase anything from this company ,w hen I went to do a simple task like print my invoice for my bank, I could not do that. They keep it under lock and key. I am horrified at how this company has treated me, the lack of proper business protocols and processes, the lack of response. Earlier in the week, when I did speak to the rep, he stated if and when an investigation takes place it will be done by DHL and if DHL finds they did not deliver the jacket, DHL will reimburse me, the issue is it says my jacket is delivered on the app. I am sure they are not honest business people. Do not deal with this company, steer clear away from them. Shop anywhere else.","title":"Please do not trust this company I made…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"},{"date":"2021-05-26","author":"Jayte","text":"I always maintain that VC is great when things go smoothly but those occasions are increasingly rare. \n\nI recently lost one of my Seller badges, for no reason. I complained and the badge was reinstated. Approximately 24 hrs later, it was removed again. \n\nYet again, I wrote to VC requesting an explanation and was surprised to receive the following response:\n\n\"Dear Marina\" (I'm not Marina but I hope Marina, wherever she is, isn't also having a bad time with VC)\n\n\"As we checked, your Leather sandals - Cesare Paciotti was tagged as non compliant because the buyer wasn't accepted the negotiations for this item\".\n\nI'm sure Cesare Paciotti is great but I've no idea who he is either and I've certainly never owned a pair of his sandals.\n\n\"For your Silk straight pants - Dolce & Gabbana we failed to ship this item within the given time frame\"\n\nI've never owned a pair of Dolce and Gabbana Pants and I've certainly shipped all sold items within the given time frame.\n\nMy seller badge was reinstated after VC accepted their error. They then made a further administrative \nmistake which resulted in ...drumroll, loss of the badge. I'm now caught in a loop of having the badge reinstated\/removed due to clerical errors. \n\nSo there you have it - my account has been penalised, initially due to issues on a stranger's account, then due to further clerical error. If that's not incompetence, I don't know what is. I'd hope for better with a free service, I certainly expect better for the considerable VC fees we pay.","title":"So bad, you just have to laugh","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=58&stars=1&stars=2&stars=3"}]