[{"date":"2022-02-12","author":"Kelly Jones","text":"Codes never work, either in the app or website. Starting to think this is just a deliberate marketing tactic to get you to log on and attached to items.","title":"Codes never work","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"Viliam Babela","text":"Company doesnt have problem with listing fake products and when they get returned they relist them on their official account as Authentic . \nCustomer service is terrible \nThey used to use DHL which took 2 days but now they switched to Chronopost which takes forever because the packages never arrive","title":"Fakes & Flakers","stars":1,"location":"SK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"J  M","text":"Edited 14.02: after back and forthing Vestiaire have agreed to allow me to return the item and will (hopefully) grant me a refund. Though I am still waiting on a refund that was granted over a week ago to come through too… \nStill. Appreciate at least that the company is trying to make amends. My advice, make sure you check the tags on every item you purchase on the site and watch out for buying anything that is listed as wool\/ silk etc. \n\nOriginal review: \nI gave this company another shot after having to send back two products last month that didn’t match the description. I’m still waiting on the refund two weeks after sending back one of the items too…\nBut then I had one good experience, so thought ok, I’ll try again. I purchased a wool Ralph Lauren jumper (listing title was literally that) and the item that arrived was a cotton\/poly mix. I emailed customer support immediately, fairly peeved that once again the item did not match the listing description (if you buy an item because it’s wool, the least you expect is that it arrives with some percentage of wool in it..). I was told that I could not be reimbursed, but I could sell the product on their site for free??? No thanks. The item is not worth the price I paid, because I paid for a wool jumper, not a cheap poly\/ cotton mix. \nI am seriously appalled at this company’s customer service. If a product is listed as made of a certain material, that is the very least a client expects? How can you say this does not warrant a refund? \n\nSo yeah, after all this I have to say, this company is terribly unprofessional and should be avoided. Reading the reviews in every language, one thing sticks out. They are almost ALL terrible. Guys, wake up. Selling products that do not correspond to their description is just so not ok.","title":"Product listings different to what arrives","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"Kafetti","text":"Issue was resolved yesterday after months of accepting my order would never arrive.\nI ordered a couple times from them, no worries. THEN I recently got a D&G shirt, which got completely lost. They found it again and it got returned to Vestiaire because I need to \"update shipping address\" to which I did, even though the address had no prior issues for delivery. They since stopped communicating and just as I believed my item was lost to the void, out of nowhere, 5 months after I had ordered, the shirt showed up. Be aware of this if you use this company, because it may be the fault of either these guys OR chronopost if you have issues.","title":"Communicated Poorly, took 5 months to get order","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"Maria João","text":"Selling in the app for 3 or 4 years never had any problem, these days the app has many scammers and the live agents are not like a few years ago, when they heard us and really helped, now they help the scammers.\nA woman in greece (iliana1526769) reported a item and return a item that was not what I have sent and VC defended her and stayed in her side because I couldn’t prove that she switch the items, and after I open the live agent eyes and just asked to see if her bought that item before in the app and he didn’t replied to that… Sadly these days we can have a conversation in the chat, because I don’t want to believe that the live agent is that stupid, I rather believe that I’m having a conversation with a robot. She sent VC pictures comparing items, that I didn’t upload and a human can see that, it’s so stupid that I believe it’s dangerous to sell now on VC.","title":"Scammed and VC was on her side","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Manuzzy","text":"I bought a dress. I paid for it. VESTAIRE lost it. Ok, not a big deal but is a big deal when you have to send requests (4) for a refund, as normal as I did not receive my dress, never supported.","title":"I bought a dress","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Diana ","text":"I sold an item and shipped it directly to buyer chosen pick up point. I waited 3 days for her to pick it up. She didn't do that so I have contacted customer service. I was told that they will try to contact a buyer and I have to wait up to 3 days for reply. I waited, but nobody replied. Therefore I contacted customer service again and was told I have to wait another 3 days. I said it is a joke and such unprofessional service. I shipped item 10 days ago and till now haven't been paid. Vestatile Collective charges £12 for their service and is such low quality. I asked to talk to the manager and was told I can't and need to wait 3 days for some contact from them. They even don't have any infoline as they know would spend hours discussing complains. \nI sell on eBay since almost 10 years, earned more than 500 stars and never had such terrible issue with their customer service. In case of any trouble I always get a refund straight away, even before they resolve issue on the other side.\n\nEdited: Wow, VC how kind of you that you have replied to my negative feedback. Faster than on my emails and requests to complete transaction!\n\nThe reference number of the item I sold is 20340590.\nI hope you will deal with it straight away as I did everything right on my side and have nothing to do with buyer not confirming they received the item.\n\nUpdate: After a week of exchanging emails and talking to customer service my issue still isn't resolved. And today is 22nd of February. Their reply from below is just for show purposes to pretend how they care, but in reality they just cover one lie with another. Jolina Marie P. from customer service promised me on 16th of February that I will get whole payment and confirmation email on next day. I didn't get any email so asked again about my payment and Ma. Xandria Trinidad  from customer service replied that the  whole payment was already processed on Feb 17th. That means VC won't deduct any fee, as compensation for very poor service which I received and that waited more than 3 days for buyer confirmation. However, on 17th of February I received only part of my money. I sent email asking where is the rest. Today I received reply that they won't pay me any compensation. Vestatiare Collective is just a band of liars. I don't know how much time all together I spent writing emails and talking to customer service, but it isn't worth money which I received! If I won't get the rest of my money ASAP I am going to contact Customer Ombudsman. I have copies of our all conversations, so I have proof of how VC is lying, avoiding responsibility and treating customers like a fools.","title":"In case of trouble VC buries head in the sand","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Joseane Cabral","text":"I bought a flat sandal listed as 'good condition' in fact there were not so many pictures. Only two images showed the good parts of the shoes. To my surprise, I bought the item, and the sole is completely worn. I complained, and nobody has contacted me yet. Another problem is that I bought two more items, and the sellers are taking longer to ship the item. There are no easy links to contact the seller after purchasing an item on this website. I will never use it again, I have been using CUdoni, and I have no problems. Cudoni has excellent customer service. I don't recommend Vestiaire Colletive.\nShame, I should have read the reviews before, only bad reviews, so difficult to find one saying they a are good company.","title":"I bought a flat sandal listed as 'good…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Stuarta","text":"I dont know where to start. \nI spent my 150 e voucher on an item that arrived as FAKE. I clicked the profile and figured that seller “Alexandra” has the WHOLE profile fake (fake LV sneakers 19166500 with size stickers!!, fake Balenciaga sneakers 19269702, …. and so on). It is unbelieveable that they even posted those items, SOLD THEM and you can still SEE them there. \nI reported the case a week ago, they didnt even remove the fake gallery! \nNow JOHN M, working in support, refuses to give me new voucher which I earned and spent on something NOT AUTHENTIC. \nShameless fraudant disgusting company","title":"SELLING FAKES","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"jenna","text":"When you're supposed to order, it's easy, they're friendly. Then when you have a problem but start losing nerves. They did eventually respect the refund of the taxes aspect however as they said, they restricted the seller from communication. My order was supposed to be authenticated and they were described as brand new, never worn shoes. The state they came in was horrible, they were just thrown in the box like garbage and further more, the leather was damaged in one corner and it frustrates me because they were supposed to see that during authentication. Overall, I think it's very easy to be fooled and I regret the purchase.","title":"Unprofessional, easy to get scammed","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Beanna","text":"New Comment added in response to Vestiaire (they responded to my review 16.02).  Dear Vestiaire: I am well aware of import duties. Your response in anyway doesn’t correspond to UK customs import tax threshold which is £135. If you wish to place any other comments, please make sure they are relevant to UK customs after Brexit legal requirements which I copied in my original review.  They’re are stealing money from UK customers. They add illegal customs fee to the checkout when buying from EU to UK. Below is copied from UK.GOV: You’ll be charged Customs Duty on all goods sent from outside the UK worth more than £135. \nI wanted to buy item worth £80.I wanted direct shipment without verification from expert seller ( I took this risk on my shoulder). There was no option to opt out of verification fee even if their terms mention that within EU PLUS UK they are not obligatory.  In the end of the checkout I had £15 valuation fee added plus customs £22 (not legal hence why clearly stolen) so in total £37 on top of £80 paid for the item. That is additional 46% cost added, partly illegally added and partly in theory “optional”. I used their verification service few times in the past but the value of the items was much higher so it was worth it. I started chat on their website about it. After spending longer time corresponding with machine I had opportunity to chat with non virtual assistant. I was told that case requires higher management to look into.\nAnd that is the end of the story. I haven’t heard from anyone since then. I am experienced international fashion buyer. I shop often at Mytheresa, Yoox, Mybudapester, LuisaviaRoma. Before and after brexit. They are all decent. Not this one though.","title":"UK customers- don’t buy.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Nancy","text":"So this is my third review about the same issue I have which is being sent a DHL invoice for Duty despite my item being listed in the UK, and me living in the UK.  This has been ongoing since the beginning of December had still not been resolved, despite being told on numerous occasions and even on this platform that Vestiaire Collective would complete the necessary LOA form and settle this bill sent to me in error, but it appears that it has not, and all the replies I've received in email, via chat and on this Trustpilot forum are just not accurate and not reliable.  It is now 14th February and today I have received another DHL invoice for the outstanding amount that they are still waiting for.  This is despite me having assurances from Vestiaire that they were going to complete the necessary LOA form and settle the bill.  All I can say to anyone reading this is do not trust anything you are told by Vestiaire Collective.  They do not keep to their word, they do not do what they say they are going to do, and you CANNOT trust them at all.  This is the worst experience I have ever had with an online company and I will never ever shop with them again. I urge anyone contemplating selling or buying to think twice.  There is a good possibility you will regret it!!! Vestiaire Collective pass you from one person to the other, all saying something different, all making promises to sort out the invoice sent to me in error but considering we are now 2 months into this saga and nothing has been done, says it all.   You cannot communicate easily with them.  Their customer service is rubbish and you only have to check platforms like this, or go take a look at Twitter and see for yourself what an absolutely rubbish company they are.   Do yourself a favour and save yourself time and effort, just don't bother using this company.  Use companies that are going to give you great customer service and actually do what they tell you they are going to do.  There are serious flaws, and quite frankly I just don't know how they get away with it!!   Terrible management and customers are treated very badly.","title":"Two Months Later and Vestiaire still haven't resolved my problem!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"CarrieE","text":"Do not use Vestiaire Collective under any circumstances. I listed a coat on the platform in December 2021 which was sold at the start of 2022 after accepting a price offer a buyer sent. I posted the coat out the next day and the day it arrived the buyer flagged an issue with the coat. I started to panic the buyer had damaged it so they can send it back then the next day Vestiaire confirmed they'd cancelled the order as the item didn't match the description. \nI requested full information on what the buyer claimed and said how worried I was on the state I'd get my coat back. They came back showing me the photos the buyer sent in and it was of a yellow dress! The buyer claimed I sent a New Look\/Asos dress instead of the coat so I go into full panic as I realise the buyer is in fact stealing my coat.\nA few days later I receive the dress through the post, my £395 coat nowhere to be seen and stolen by the buyer. I go un-paid as the order was cancelled due to it not matching the description...\n\nVestiaire have spent over a month and a half 'investigating' providing copy and pasted responses to the emails I've spent hours writing and collating photo evidence to prove what's happened.\nThey've given me absolutely no re-assurance I will be paid and it seems the buyer is free to go on stealing from others. \nI hope nobody ever has to go through this experience, it has been upsetting and never-ending.","title":"Buyer Stole My Item","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"Tricia","text":"I have just fallen victim of fraud from this company.  Received item fit for landfill.  They condone sellers lying and support their fraud. Item described as very good condition.  Actually seller deluded.  Item would not be accepted by a charity shop, it would be sent straight to landfill.  It cannot be relisted as it clearly isn't fit to be sold even under fair condition.  I wouldn't do that to another person, and I felt very strongly regarding the situation. I actually volunteer in a Charity Shop two days a week.  We would not be allowed to sell items in this bad condition, any donations like this we would have to send it for landfill as it would not meet our standards, and management would not deem it passable even in a charity shop. So that gives you an idea of what is been classed as very good condition on Vestiaire would not be up to the standard of items sold in a Charity Shop.  They state on the Website, 'always on customer support'.  This is not the case.\nItem number 20306054.   I cannot relist it as there is not a category for items fit for landfill.  I would then become  someone who is abusing the system and selling rubbish.  I am not that person hence the reason to be lied to is complete unacceptable.  Also extremely upsetting. \n\nA returns label was issued the same day 15 February and was with Hermes within the hour.  The return was sent within the hour, Tuesday 15 Febuary same day it was delivered.  It was with the seller on Friday 18 Feb by Hermes P6985587 to her home address and Hermes clearly shows the  delivery.  Four times after asking where is the refund is, I am asked by Vestiaire have I have posted it??   You can track it all the way back to her by Hermes. Of course I have posted it.  It is clear She has it!  Obviously, the seller has it in her possession.  If I can trace where the parcel is, why cannot Vestiaire do that.  8 days later they are still saying have you posted it???  YES.  And the seller has it back!   It was out of my house the same day it was delivered it was so disgusting.  And they still will not refund.  |Just the same question, have you posted it?  Trace the parcel Vestiaire.  I did.  How is it they cannot comprehend and trace a parcel back to the seller and I can.  Go to hermes type P6985587 then type in the postcode and you see it was delivered Friday 18.  So what is going on.  Once I have the refund I just want to close the account.  Why this continually circle of roundabouts without any end in sight.  One big nightmare from the start.  I am told you will receive a full refund, then repeatedly asked over and over again have you posted it???   What part of YES the seller back has on Friday 18 February, cannot not be understood Vestiaire.  Do they have any intentions of refunding?  You’ll receive a full refund \n\nThe following is part of the email I received from Vestiaire. \n\nDear Tricia, \n \n\n\t \nRef : 20306054\n \nMiu Miu\n\nWool cardigan\n \n\n\n \nThank you for shipping your item back to the seller.\n\nAs we agree that the item you received does not match the seller’s description, we will issue a full refund for your order. You should see the refund reflected in your account within 5 working days.\n\nThe seller’s rating will be negatively impacted, and any seller badge they hold could be withdrawn.\n\nThank you for your patience while we investigated this issue.\n\nWhy do they find it impossible to understand and comprehend the seller has it back in her possession for the last six days. \nYou are making yourself ill trying to deal with them. One big nightmare from the start.  From the beginning and at this stage I cannot see an end to this nightmare.  Just excuse after excuse .Dreadful.","title":"Horrendous to deal with.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"Lily Ild","text":"They've lost 2 of my items which were expensive and keep promising that the issue is going to be resolved. No refund, no action was taken. I keep chasing them. Customer support is non existent. Chat support is just some inexperienced advisors who don't speak English. You need to give my money back!!!","title":"Lost Items - No refund - Extremely Poor Customer Service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"Aracely Alvarez","text":"I don’t even know how to describe my level of frustration, with this company. After spending thousands of dollars in this app, I was treated like a criminal. UNFORTUNATELY, my package was never delivered to me, even though it was marked as delivered, by fexdex. 1- it’s extremely difficult to get a hold of customer service. 2 in order to get my refund back; I was asked to send a handwritten letter + my passport information, in order to investigate and get my refund back. 3 After I request a copy of their investigation procedure, which I never received and never clarified to me the need of passport inf; Which I think is extremely crazy to request; this kind of sensitive information.  4 I consult with my attorney, and asked not to send passport inf.  Anyway, i decided to take legal action. This is a scam… they just want to make it so difficult to keep your MONEY 💰 #2037115","title":"I don’t even know how to describe my…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-16","author":"DP","text":"Absolutely DIRE   bought a bag which was sold in VERY GOOD CONDITION, had a broken clasp which was not mentioned in description or photographs, complained, sent back, they inspected and said it matched the description they would sell minus their commission.\ntheir description of VERY GOOD CONDITION states   \nAn item in \"\"Very good condition\"\" is a second-hand item that is hardly worn and is very well maintained, although it may have slight defects from wear. If the item has defects, they must be mentioned in the description and be visible in photos. No missing parts (eg. belt, strap etc.)\n\nUpdate 17\/2\/22:  sent an email requesting a 2nd review and provided my order number (Order # : 50547324). Lets see if they resolve or continue to charge each seller another authentication fee...\n\nUpdate 19\/2\/22: 2nd review not upheld (apparently it matches sellers description) which it does if you take literally but does not match the criteria for VERY GOOD CONDITION (ie broken clasp). VC have sold this bag 3 times in 3 weeks and each time are charging the NEW BUYER another authentication fee (i even left the CV tag on). This feels like absolute theft.\n\nTo put the review into perspective i have bought and sold many items on VC over the last 5 years and have always been relatively happy with the service and products.   It appears there are some significant changes (either leadership and\/or process) which is clearly creating a very poor experience, certainly looking at the recent reviews.\n\nVC need to review their service offiering if they want to continue as a professional authentic retailer of designer goods.  \n\nRe sold the bag 4 days ago.  The bag is with VC and they are still asking me to send?????\n   \nBe careful.as per the reviews the reputation they once had is certainly not the one they have now. Look  at HEW or Jolis closet which has a far superior service\n\nREAD THE REVIEWS BEFORE PURCHASING","title":"Absolutely DIRE   bought a bag which…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-16","author":"Nancy","text":"Your explanation doesn't actually add up or make any sense.  First of all the item I purchased was listed as being in the UK.  In your reply you are saying something about your warehouse not being open and everything coming from France.  If that's the case why is this the first time I've heard this?  Why did you not list the item as being in France then, and why did you lead me, the customer, to believe it was in the UK?  Secondly I have been told since the beginning of December that the LOA form was completed and that I should disregard the invoice.  I have numerous screen shot replies from different members of your customer service team all telling me to do this.  Even yesterday I was told the bill was settled on 29th December (not that I believe this) by Harjay Y., but your reply is very different to what I have been told by VC.   You clearly don't know anything about this matter as what I was saying is that I have received the invoice AGAIN the other day, so this leads me to believe you haven't actually completed the LOA form as I've been told you would do, nor have you settled the bill, again as I was told you would do and in fact had on 29th December, but the reality is in fact nothing has been done, and THAT is why the bill has been sent to me AGAIN.  Your reply is an insult, at least take the time to check out my complaint rather than give me all this nonsense that you've copied from somewhere, and hope it fits as a response to my complaint.  I've tweeted, emailed several times over the last 2 days and spoken to customers services, plus left another review here to try and get a response.  Not one member of staff has addressed this matter and done anything about it.  Based on the ridiculous lack of action over 2 months do you really believe I am going to pay this invoice and expect to be reimbursed??? I don't think so.  I need to speak to someone who can actually sort this matter out, instead of fobbing me off with promises that never happen, oh and by the way my reviews have been read 950 times.  I will keep leaving a poor review until someone actually sorts this matter out.  It is impossible to email and NO ONE actually replies anyway.  Hopeless and useless company, I regret the day I ever got involved.  Never again will I purchase anything from this company and I urge anyone considering purchasing from Vestiaire Collective to think twice.  It really is not worth it.","title":"A reply to Vestiaire Collective","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"AF","text":"This company is run by boots. Worse quality service that you can imagine. It is even dangerous to buy or sell something here. I sold the item 16765094 almost one week ago and did not receive the label to post it. Contacted them multiple times from different ways ' chat and email, but they just do not reply. The terms and conditions says that they provide the sellers with labels to post the items. But they did not provided me with one. They just send me a pdf with their address. So, they are perhaps expecting me to pay for the post costs, which they are charging to the buyer. I already wrote on the comments an apology for the buyer, who must be anxious waiting for the delivery. Keep waiting. What is more, all of this mess means that I take great prejudice in terms of seller evaluation, as they give more badges to the sellers which dispatch promptly. The whole thing is super fake. This is the worst website that I have ever worked with.","title":"This company is run by boots","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"Holly","text":"Please go back to using DHL two orders I’ve sent both have had problems with UPS. One has been in transit since the 28th of January and I’ve been told you’ve contacted the buyer to update their address information but the buyer has now asked why the item is being sent back. I contacted twice about this issue. Now I’ve sent a Louis Vuitton never full and it’s UPS again and suddenly the delivery date which was for Monday now is saying will be updated. This is what happened with the last item. I have photos showing I sent this item in case but seriously go back to DHL I’ve never had an issue always collected and delivered in a timely fashion.","title":"Stop using UPS go back to DHL","stars":2,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=17&stars=1&stars=2&stars=3"}]