[{"date":"2022-03-21","author":"fion","text":"I had communicated with a customer service regarding taxation problem. One of the colleague replied me that the tax could be refunded. Then I purchase my order and request for a refund on my tax. Another colleague voiced out that the tax is no refundable. He even denied that his colleague had a fault reply of information to me. They refused to check the conservation history until I posted a cap screen. They still refused to refund with their own reasons.The customer service says 'i am not allowed, 'i cannot do that' all the time without giving a proper reason!!","title":"Customer Service provides wrong information and denied his fault","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Nathalie d'Orleans","text":"RE My 2000 USD dress got stolen or lost by Vestiaire Collective staff in Crawley.\n\nEven after giving evidence that the parcel is dropped at their center and the receptionist signed off on it. They still claim the courrier lost it...\n\nDon't send your items to them better use EBAY or other websites. VC customer service is terrible. They don't reply back in time. Closed their phone number, no live agents basically they loose your items and then thats it.\n\nSee below my letter to them, which they ignore \n\n\n\nDear Support,\n\n\nRegarding the status for item Lace mid-length dress Dolce & Gabbana (réf. 210166**) that you (Pinky) claims was never sent.\n\n\n\nOn the 3th of March VC sent me a shipping label (GBR 807 6-00)\n\nOn the 6th of March at 11AM, I dropped off a dress at Hermes with a shipping Label that was sent to me on 3 March. (Hermes Code P94661**)\n\nOn Wednesday 9th of March 18:32 the dress was delivered by Hermes at Crawley VC center, signed off by the receptionist. See attached confirmation on Hermes courrier website with the code P94661**. The parcel number barcode is T01Y5A00004430** and clearly refers to VC Crawley with shipping label (GBR 807 6-00)\n\nThere is evidence from Hermes that it was dropped off and received by your receptionist especially as parcels are tracked with barcodes. It is therefore rubbish to say the parcel was never sent or lost in the mail. Feel free to check on Hermes website and you can clearly see it was delivered and signed off by VC reception.\n\nIt seems VC Crawley lost my 2000 USD dress. There are some reports online that staff at VC are stealing items but that is not my issue. You have my dress and lost it. \n\nI am particularly very upset that you claim your clients lost it or Hermes did, which are un based hurtful allegations which are very bad for your business and trust in Vestiaire Collective. Your company should be trustworthy as you store many expensive items from clients and if VC employees are stealing, send items that are a massive breach of trust. I will never use your company's services anymore and if you don't pay me back. I will ask my social media to publish these details online which will cost you many clients.\n\n\nIf someone at VC is contacting me again please make sure its management as sorting these minor issues is taking weeks and I am not used to people taking me for an idiot saying items are not sent or lost when the evidence is there.\n\n\nSee attached all confirmations.\n\n\nI await your reply and payment.\n\n\nBR","title":"RE My 2000 USD dress got stolen or lost…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Zara Egan","text":"I ordered 3 things from VC in one go. Two of them were cancelled for no reason, despite the 2nd item's owners contacting me directly to say she had dropped it at the collection centre. Now it seems to have gone missing. In addition, for the first cancelled item I've received 3 emails with a different amount of the refund on each! They are all over the place and I'm sorry I didn't check Trust pilot before ordering anything :( Items with direct shipping seem to be ok but I wouldn't risk anything worth decent money.","title":"Seems to be dodgy","stars":2,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Guy Fagot","text":"Yesterday, I stumbled upon their website through a google search for a jacket I want. I registered on their website, and initiated a chat. Without even having typed a single word, in chat, I was banned from chat, for \"breach of their terms of service\".\n\nSecond. Their description of the jacket says \"never worn\", while the google thumbnail and its description say \"used\".\n\nI wanted to have certainty about the jacket's condition, so I had a chat session about this with Jerald. This is a different chatline from the one I was banned from (the chat I was banned from is a chat line with the owner of the jacket, if I understood correctly). Jerald told me that, in order to determine if the jacket is new, or used, I have to buy it, pay for it, so that it then is sent to their warehouse for inspection. Which is ridiculous, all the more since the item description on their webpage includes that \"it has been verified and authenticated by their experts\".\n\nAfter all this, earlier today, I noticed, which I didn't before, that the photo clearly shows creases at the elbow, proving that it HAS been worn, and is not \"never worn\". So google was correct, and the \"verification and authentication by their experts\" a dodgy affair.\n\nI made a substantial offer on that jacket prior to noticing this, but there's of course no way I'm going to pay the amount I offered for a second hand jacket.","title":"I stumbled upon their website through a…","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"Louise Payne","text":"I am awaiting a refund for goods paid for on 25th February 2022 , lost by Hermes on 2nd March and despite numerous emails from Vestiaire & me replying asking for a refund - nothing.  As the customer I should not have to wait while they sort this out, I should be reimbursed immediately.  \n\nI have used Vestiaire on many occasions previously but I will not be using them again.  I am very dissatisfied with their customer service.  No one rings you & there are no numbers to call just emails.  I had to write a letter about what had happened, send my ID, they don’t make it easy.  \n\nIt has been weeks now & nothing,  if this was a really expensive item I would be very very annoyed.  \n\nI would say to anyone going to use this site to be aware of the problems if the goods go missing.","title":"Lost Item - trying to get my money back!! …","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-23","author":"Tanya Harbas  from Croatia","text":"Dear Vestiaire support \n\nIn response to your email 3 days ago please see below:\n\nMy account details are correct as you have transferred two payments already.\n“Payment done last week “\nBig lie .Where is conformation number  !\nNormal practice is to send a client details of transaction\nIn this case nothing as it has not been done !\nItems reference :\n20334126, 20334429 ,20551968 stollen from me as they were not paid.\nThe amount is approx 14,000.00 euros.","title":"Payment not received two months","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Giannina Faktor","text":"In December 2021 I purchased a Celine classic bag via Vestiaire Collective, advertised as \"very good condition\". It cost 2.200 Euro! It arrived 2 months late with torn leather and old, scratched hardware. Since the arrival, I have emailed the Vestiaire Collective team about this issue several times- no reply. I have sent them my number, as requested, via chat, as they wanted to call me to settle the problem- they didn't call. Also there is no tel. number to reach anyone from Vestiaire. This is beyond unacceptable and feels like a scam!","title":"Bag came with torn leather and old hardware","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Fatima","text":"Very poor customer service. Wrong item sent to me despite so called ‘checks’ by ‘expert’ team.\n\nNow I’m waiting for a return label so that the correct item is sent to me. No response. Customer agents Fanni, Max and Catherine are very unhelpful. Catherine told me ‘she is too busy’ to deal with my complaint. I have a chat transcript.\n\nSo disappointed with this ‘luxury’ and ‘trustworthy’ platform. Never again.","title":"Very poor customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Jenny","text":"I used this company for the first time, order placed and paid for, a week later order cancelled with no explanation. However monies were refunded.\nVery disappointing.\nStick with other luxury pre-loved websites with proven track record or eBay!","title":"Stick with other websites for your luxury goods","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Kate Evans","text":"Please be aware that if you buy anything on Vestiaire and it is lost in transit, Vestiaire require you as the buyer to take part in an investigation that includes a sworn statement that you do not have the item (regardless of the fact that tracking states clearly it is not with you), giving all of your personal details including id documents to aid in their 'investigation'. I'm not sure what the seller has to do but as I buyer surely you are protected by Vestiaire, and with such clear evidence of non receipt. Here are their requirements.....\nA sworn statement, in which you clearly state that you have not received your package. Please include the following information in the statement:\nThe date\nYour full name\nThe delivery address\nYour item's tracking number\nYour Signature\nA photo or scan of a valid ID.\n\nIn the meanwhile, Vestiaire will hang onto your money, so no goods, no money and you're the one doing the sworn statement for an item that shows on the carriers site as still in the parcel shop after three weeks.\nDespite promises from Vestiaire, I still had to get PayPal involved. PayPal refunded me.","title":"If it get's lost, it's down to you, the buyer","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Michelle","text":"The chat is HORRIBLE \nbeen waiting all evening. Been in contact with the same agent 2 times now. The first time she doesn’t answer. After waiting a long time I have to close the chat. The second time she keeps asking me to wait and wait and wait and wait. And after LONG time she writes she will fix it and ask me to hold again, and while I look on the screen she tells me I’m no longer active and she will close the chat. Before I even get to answer the chat is closed and there comes a rating system, BUT the BAD rating doesn’t work!!!! Nothing happens when I click that button","title":"The chat is HORRIBLE","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Hannah","text":"Absolutely horrendous app and service.  I tried to make a purchase for an hour but due to the incredibly poor quality of the system it wouldn’t go through. The person on the chat wouldn’t do anything in terms of compensation. For such a big site selling high end items this is actually shocking.","title":"Absolutely horrendous app and service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Friedhelm Eronat","text":"My first sale was on 3 October 2021, next day was shipped and confirmed.\nToday is 25 March, I still didn’t receive money.\nI sent so many messages to customer service and never got any replies from them.","title":"My first sale was on 3 October 2021","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Sandra  ","text":"Sold a vintage bikini that was used but in good condition. The buyer raised complaint and claim there are some stains on the bikini which is 100% false. Both me and my husband checked it very closely before we shipped it and there were no stains. I been in contact with the customer service and still no respond and this is 15 days ago… Please not that I am an expert seller and have never experienced something like this before!","title":"Sold a vintage bikini that was used but…","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Jade B","text":"Don't waste your time. Read the terrible reviews and avoid. \n\nOrdered an item on 13  Feb. To cut a long story short the UPS tracking stated it had been delivered to the collection point and it hadn't. For 5 days I tried to collect it but was told UPS hadn't delivered anything and they had no log or way to check what parcels had been delivered. \n\nI contacted vestiaire customer service on several occasions for them to tell me to collect the item, I cannot collect an item that is not there. \n\nOnly just now are they investigating and waiting for the couriers response. But I've missed the event the dress was for and am £140 out of pocket with nothing to show for it.","title":"Never again!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"Designer","text":"First order was cancelled after 6 days of waiting and now i’m trying again if this doesn’t come in time i’m gonna get mad","title":"First order was cancelled after 6 days…","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"Nadalina Kas","text":"If I could I would rate this company with negative points. I am frequent seller and buyer at this platform - at least I was. I recently sold one coat and the delivery driver could not find the address so the company required address update. I contacted vestiaire 11 times, and all 11 times I was lied to. Their agents promised they contacted the delivery company and updated the address which never happened. When the coat was returned to me vestiaire agents apologized and promised new shipping label to send the coat again. That never happened. So they lied again. In the end they cancelled the sale and the buyer was not satisfied and I do not blame her at all. She actually asked if we could deal with this outside vestiaire. For 25% they take from each sale, vestiaire is a providing 0 support and not to mention a word respect, as they do not know what that means. Truly a shame","title":"If I could I would rate this company…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-27","author":"Ludivine ","text":"The site could be better if people can report an announce as some bags are obviously fake and people can buy them (though I hope it won’t pass the authentication step) and let their opinion on a seller profile \nBesides, my first experience was good","title":"Advices","stars":3,"location":"RE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"Fanny Ann","text":"The person who reviews excellent customer service is a bare faced lier or only dealt with them once or works for them, they are totally useless! \nThe fact he says excellent customer service when it’s a chat bot is hilarious\nOne multiply occasions I’ve found them, completely useless, uninformed, oblivious to what is actually going on and just a waste of timer. Very dishonest, greedy and money hungry and no sense of good customer service to be found. Literally the worst site I have ever dealt with in my entire life.","title":"The person who reviews excellent…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"},{"date":"2022-03-28","author":"Jess Palmer","text":"Awful communications \nCant get complaint heard\nUnpaid money and holding items\nDisgusting workmanship complaining to trading standards\nAVOiD!!!!!!","title":"Awful communications","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=10&stars=1&stars=2&stars=3"}]