[{"date":"2022-04-13","author":"Karen","text":"Awful company. They lie and thieve and have stolen my money and are now just refusing to communicate. I’ve removed anything for sale with them and won’t ever use them. Please avoid them.\n\nTheir response offering to “help” is just lies too - they’ve been ignoring my emails, messages and contact for months.","title":"Awful company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Rehana ","text":"I sold a bag via Vestiaire Collective in February, this bag was lost by their courier service so I opened up a case for an investigation, since then I have had no resolution whatsoever and keep receiving the same email response from their customer care. On their website they state an investigation can take between 15 days (average reply time) and a maximum of 30 days. However this is not the case i have been waiting several months.\n\nI am at a loss bag was sold for £400 but I paid more originally. The item was brand new never worn. \n\nThis is supposed to be a reputable online selling platform, but I feel scammed. I put my full trust and in Vestiaire as they also state on their terms clearly visible they would reimburse should any item be lost this is why I went ahead and used their service as I had protection and ease of mind selling such an expensive item.","title":"Bag lost through Vestiaire, no resolution at a loss.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Christoffer","text":"I still haven’t received my Prada bag a month after I paid for it. On the tracking status, it says that they accepted the item for authentification, but they haven’t shipped it yet. When I contacted customer service, they didn’t answer, until 3rd time I reached out. And now they want me to prove that I or any of my neighbours didn’t receive the package.\n\nThis site is a scam. You will never see your purchases. Stay away!","title":"I still haven’t received my Prada bag a…","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Magns dn","text":"TERRIBLE EXPERIENCE AGAIN AGAIN \n\nKEEP AWAY \n\nAPP DONT WORK \n\nPROMIS DISCOUNT AND WHEN YOU spend 1 hour shopping code\nDont work \n\nWhat a joke site \n\nKeep away","title":"TERRIBLE EXPERIENCE AGAIN AGAIN","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Fanny Ann","text":"Liers useless scammers very cruel treatment with no empathy for ruining sellers experience and   wasting valuable time, took a month to sort lost shipment blamed innocent seller who was at a lost messed up so many things truely sickening . Deleted seller chat so couldn’t contact. They need a competitor to put them out of business they don’t deserve the buyers and  sellers they have.\nCan’t wait for competitor to open and it GAME OVER FOR THESE COWBOYS","title":"Liers useless scammers very cruel…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"Lilian Carré","text":"It's a SCAM!! Terrible communication & they stole my money!\n\nI bought expensive shoes that were completely damaged. They genuinely kept requesting that I would re-sell the broken shoes, even though I kept explaining (even with photo's as proof) that they were beyond repair, according to the shoe maker. EVEN AFTER THAT they kept suggesting I would relist and re-sell the broken shoes. Terrible, to treat people this way. They don't care about their clients at all and I have sent countless emails to contact them about this. They kept giving me the same copy-paste bullsh*t answers about re-selling the shoes, which I'm pretty sure is illegal. I've manages to file in a complaint with Klarna and luckily they will make sure that Vestiaire will refund them fully. Vinted would NEVER treat buyers or sellers this horrifically. Vestiaire is discussing and the people that work there should be ashamed of themselves. They are nothing more but thieves.","title":"It's a SCAM!! Terrible communication & they stole my money!","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"Chaos Souled","text":"USELESS\nSCAMMERS\nUNPROFESSIONAL \nLITERALLY THE WORSE SELLING EXPERIENCE EVER\nUNBELIEVABLY USELESS THEY DONT ACT WITH HONESTLY OR INTEGRITY THEY MORESO CORRUPT","title":"USELESS","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"Kate Evans","text":"33 DAYS since parcel posted and still no refund despite promised on 3rd April (11 DAYS ago)... watch this space. I intend to post everyday so at least people can see (not that they really need to; reviews speak for themselves) that they are doing nothing to help sellers (News flash..... it's the sellers that pay the commission to you).........","title":"33 DAYS since parcel posted and still…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"Jessica Deare","text":"I've sold a good number of items on Vestiaire Collective and everything has always been 100% authentic and compliant.\n\nMy issue is that I successfully sold an authentic black Gucci Marmont GG flap bag (Ref: 21546055) on Vestiaire Collective in March this year, and I subsequently sold another authentic yellow Gucci Marmont flap bag in the same size this month. However, the recent order was unexpectedly cancelled by Vestiaire saying: \"Our authentication team have carefully examined your item, described as Sac bandoulière GG Marmont Flap en cuir Gucci ref: 22245053. Unfortunately, in applying the criteria involved in this process, we have been unable to verify its authenticity. We are therefore cancelling the sale.\"\n\nUnfortunately they are not clear as to exactly why this bag was not deemed complaint. What criteria are they even using? I had to contact customer service for clarification and was told by a Rascelle A., \"It is declared not authentic that is why the sale got cancelled.\" Oh really, thanks for the reiteration of the vague e-mail I already received, Rascelle. Which so-called \"expert\" authenticator deemed my previously sold brand new Gucci bag as \"compliant\" and this one as \"inauthentic\"? What wildly inaccurate and arbitrary authentication methods are Vestiaire even using? When I asked more questions the customer service rep simply ended the chat. At least tell me before you go EXACTLY what was deemed false and inauthentic about this bag and not some vague blanket term. \n\nThe two Gucci Marmont bags are from the exact same places and are both authentic. Unfortunately I am now forced to pay €12 to have my item sent back to me, which is even more frustrating knowing without a doubt that my item is absolutely authentic and should have been deemed complaint if the so-called authentication team out in France knew anything about authenticating Gucci bags. This tells me that Vestiaire's authentication team is not at all careful or conscientious when authenticating items as they would like buyers and sellers to believe. \n\nThis recent episode has seriously eroded my trust in Vestiaire Collective and my trust in their authentication team. If they can simply judge authentic items as inauthentic, I have my doubts that they are experts in authentication at all and are really just random amateurs posing as experts.","title":"Vestiaire Collective's Authentication Team is Garbage","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"Ruddi Boy","text":"Absolutely scam company, deleted my account for nothing.","title":"Absolutely scam company","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"Kimberley Denson","text":"I hate writing bad reviews but this is yet another one.  I purchased in January, was asked by the seller of the bag if they could ship it to be verified in march.  I said OK because I wasn't in a rush.  So I got word it was shipped, verified, but it had issues.  OK, well there was some scratching which wasn't disclosed by the seller.  we had a talk and I was like hmmm...ok.  its probably not that big of a deal right?\nwell maybe\n\nAnyway Vestiaire supposedly shipped the package March 14, 2022.  And, they kindly provided a fedex shipping tracking number.\nOK so I figure give 10 days because of covid and all.\nI contacted their customer service on 4\/2\/2022 because the tracking information changed and I could no longer see any information.  \n\nWhen I asked about the package they basically told me I needed to provide a driver's license to prove who I was.\n\nUh, no.  I have an account, I sent the info from my account, you can post it to my account page.  \n\nSo today is 4\/14\/22  I said enough and contacted fedex myself because these folks are not being helpful.\n \nI found out from FedEx mind you, that the package that they were to send to me was an empty package.\n\nEmpty.\n\nWhat I find interesting is that she never said the package was damaged because I asked.  She said \"It was empty\".\n\n\nFor those who packages are in so called limbo and haven't been delivered in weeks, take some time and contact whomever is shipping.  \n\nThe customer service portion of all this;  they need to do better.  They had the nerve to ask for a driver's license to track  this package.  Uh no  that info is dead to rights in my account page. And even fedex was like, we don't need that information.  So if you get anyone asking, no, they don't need that.  All they need is the tracking number.\n\nThis company has proven themselves to not be trustworthy.\n\nUpdate:  Now they're harassing the crap out of me, unbelievable.  Being bombarded with the daily emails.  I didn't lose the package, the package never made it to my house.  why they aren't following up with FedEx is beyond me.\n\n1.  They have the tracking number.  Which is the same tracking number they sent to me in email, the same one thats on my account.\n\n2. Shipper (FedEx) validated they got the box and it was empty.\n\n3. Shipper (FedEx) validated they don't send empty boxes and that the box never shipped to me, didn't ship to my neighbors.\n\n3. Shipper(FedEx) validated that Vestiaire should contact them to file the claim not contact me.\n\n4. Shipper(FedEx) is willing to show them the actual empty box.\n\nEscalated to Paypal to get my money back.  They are not willing to call fedex even after I told them multiple times I don't have their product, I never received a box, it never made it to me, its not in my possession, my neighbors don't have it, and I work at home, I would have been here.  They can check easily, they have the info but are refusing to do so (who does this?)\n\nWill never purchase again from this company.  they are awful.","title":"I hate writing bad reviews but this is…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-14","author":"El R","text":"Here we go AGAIN\nDELETED PAGE RANDOMLY after i asked about an item I sold  and wasn’t paid for up until 1 month after, they even accused me of not sending it whilst having the receipt. So frustrating! \nMy page got deleted! Then there realise mistake and put Page back minus but ALL MY 600 plus items for sale \n\n put in daily effort to communicate to buyers constantly trying to gain likes and they remove them all likes\n\nEach time I speak to someone it’s a different scenario abd more time wasted AND FRUSTRATING!!!!\n\nSO MUCH HASSLE WHEN IVE DONE NOTHING WRONG, they should of been commending me for all my efforts and dudication but not MORE HASSLE & NO ONE LISTENS OR UNDERSTANDS YOUR COMPLIANT JUST READY TO CAUSE MORE HASSLE \n\n\nI did deleted all previous bad reviews when I assumed and thought they got my accounts sorted out again. \n\nThe fact of  losing over a month with unnecessary stress plus a loss of potential sales\n\nI month later after going around and round in circles I Uploaded lots of new items and tonight made effort to upload vintage silver \/ trainers and designer bag & they are refusing everything !!!!\nI listed, even things that don’t need authenticity , ie - hall marked silver!! REFUSED, it madness, someone it just making up problems with NO BASIS!!\n\nTO top it all the last 10 sales before the drama had all sold successfully and where sent next day in many cases( I PUT IN THE EFFORT) \nBUT they wiped the history of this wiped and AGAIN no badge received-  given that there was no problem before   they randomly deleted  my page abd items MADNESS \nwhy all this rubbish refusing EVERYTHING I TRY AND UPLOAD \n\nVC seems to be going on a fast decline and I’m SO tired of the constant agro &!nonsense I’ll give a few days to see if any thing rapidly changes then its Good BYE as I’ve reached my limit it’s been an appalling and terrible way to treat someone who’s put in huge amount of dedication enthusiasm and obligation and given then I’ve not been aloud to sell without some misleading drama or hassle, I figure my  efforts will be appreciated  elsewhere it’s like talking to malfunctioning robots who ruin all the effort you put into making them sells. TAKE HED NOT ALL THESE BAD REVIEWS CAN BE WRONG- infuriating at the least.\n\nUPDATE I CAME BACK ON TO GIVE ANOTHER GO…\n\nI came back on and someone’s deleted my picture changing my name\n\nAfter you  lost me customer for over 1 month i delete account in natural frustration, can you put account back active and stop messing it up?????? I’m giving it one last go as someone want to purchase something via this account! \n\nCan you put the account back active and cut the unnecessary drama and let me sale","title":"Here we go AGAIN","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"caroline sinclair","text":"I like Vestiaire. But £15 checking fee is too expensive and I would like to be able to speak to a human.  This is very important","title":"I like Vestiaire","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Jean b","text":"I am so disappointed with the Vestiaire. I sold my item 21539506 and shipped the item on the 7th of March using the Vestiaire label evri\\hermes (new name same rubbish service). The buyer chose to have it sent to a London co op pick up point. These arrived on the 10th March. A week or two went by and the item still was not collected. I then had a message from the buyer to ask the postcode of the pick up point as she had been to collect the item and they were not there. I assumed these had been sent back to me as per the terms and conditions of sale. I heard again from the buyer to say these were never there and they were either lost or stolen. Some time had passed by now and nothing had come back to me. I contacted the Vestiaire via e mail to explain the situation. I was told basically to get lost and conduct my own investigation. I wrote back to say I could not due to the fact that the legal contract with evri\\hermes was between the Vestiaire and them not myself. Also pointing out that that under their terms and conditions of sale the item should have been sent back to me by now. They were not with me or my local parcel shop. So today I had another e mail stating I should go to the parcel shop to collect them. The item is not at my local parcel shop it has gone back to London the parcel Schopenhauer chosen by the buyer. Please explain when I live in Bristol how I can travel hundreds of miles to get my property back from London? I feel so sorry for the buyer. I don’t know if she has her money back but I don’t have my item or the money. Please sort this frustrating and time consuming mess out. To date the Vestiaire have been less than helpful. I will have seek redress in the small claims court if this matter is not concluded shortly. You have breached your own terms and conditions by not returning my item","title":"I am so disappointed with the…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"email addy","text":"Can you reactivate my account asap and stop messing everything up","title":"Can you reactivate my account asap and…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Alejandra","text":"Item rarely matches the photo:\nI made a couple of purchases on the app, before realising there's something weird  about the way the photos are uploaded.  And is not the seller making  the changes, I believe is some kind of photo software,  background removal that changes  the entire color of the product.  I bought  a black dress that I thought it was blue,  a golden necklace that I thought it was silver, and I had to ask several sellers for the real color of things: it never matches. So be careful and talk to the seller  before anything...the selection of products is not half bad but considering you won't know what you'll get I'llg ive it a low score...","title":"Item rarely matches the photo:","stars":2,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"Viv","text":"WORST EVER SELLING EXPERIENCE!!!\nIt’s totally laughable the Reviews going up they do not match so many of the sellers experience. This is the most unprofessional site that I’ve ever used. The customer service is non existent. \nThere have no ideal how they are getting away with treating sellers so badly. \nThe customer service makes answers up on the spot or refer you to an “ expert” that takes weeks to get back, if at all. Seriously horrendous.\nAppalling operation and mismanagement.","title":"WORST EVER SELLING EXPERIENCE!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"Kate Evans","text":"36 days and counting..... Just spoke to the lovely Rosina (who may or may not be a real.person).  She has to send it up the line to her seniors...... Mmmm, haven't heard that one before...... NOT. \nNo belt, no refund, no surprise......","title":"36 days and counting....","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"Jon Oftedahl","text":"30 minutes after purchasing a €500 bag listed as Loewe Amazona 75 I had a closer look at the 8 photographs of the bag. Compairing with other listings on Vestiaire for Loewe Amazona 75 bags I noticed many differences. I immediately cancelled, but hours later they just shipped it. \n\nEven if the bag is still in transit from France to Norway customer support insist on getting pictures of the bag when it arrives. They absolutely refuse to use their own photographs of the bag, the very same that I based my purchase on, to compare with genuine Loewe Amazona 75 bags on Vestiaire. \n\nThe bag I bought is not a genuine Loewe Amazona 75, it differs so much. Shape, size, hardware, seams and bottom studs are different. Besides the bag I purchased does not have hardware provisions for a shoulder strap, nor a shoulder strap. The genuine Loewe Amazona 75 bag introduced in 2014 all come with a shoulder strap. \n\nWhy do Vestiaire insist on me sending photographs of the bag when this is not about a minor flaw, but about a bag sold as a Loewe Amazona 75 but being different in so many ways from a genuine? They already have lots of photographs of the bag, it just does not make sense! Googling I can find no photographs of any Loewe bags looking like the one I purchased. Either it is very vintage or it is a bad fake. I expect Vestiaire to solve this matter better than experienced so far.","title":"Customer support requirements does not make sense","stars":1,"location":"NO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"},{"date":"2022-04-17","author":"Poo Poo","text":"Terrible simple incompetent simple things made incredibly difficult","title":"Terrible simple incompetent simple…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=6&stars=1&stars=2&stars=3"}]