[{"date":"2020-12-18","author":"Ana","text":"I bought two items from VC page. When I received a quality report check for my first purchase, a Louis Vuitton bag, it didnt stated a flaw which was very obvious when I received the bag but I let it go because I liked the bag and it wasnt such a big flaw. My second buy was Valentino rockstud tote and everything seemed great, I took off VC card from the bag and wore the bag for two days (held it in my hand for probably less than an hour during those two days). It was very very lightly packed although it is a big bag. On the second day I have noticed the studs came off and also a buckle. I was shocked and wrote to VC immediately. The bag was obviously defected but camouflaged to look good. I wanted to return the bag because it seemed crazy to give 1000 euros for a defected item that started to fall aparat after one hour of wearing. VC told me that I couldn't get a second check nor a refund if VC tag was detached. And that is it.. \nno liability, no customer rights no nothing. I really dont have the time or energy to pursue this mater, I will find some expert to fix my bag, but I just want you to know that you cannot trust VC if you encounter any problem so please be extra cautious. Or better yet, find some more trustworthy service.\n\nUPDATE - regarding VC response, I have sent you an email yesterday (18.12.2020.) morning and no one answered. The link you gave me leads me nowhere so please just answer my mail.\n\nUPDATE - I was granted a second quality control check from VC after which they told me that the Quality Control team has verified authenticity of the bag and stated that the bag meets all of the quality standards of the brand. They did not comment on my main concernes - why there is no serial number on the bag and why it had started to fall apart after an hour of wearing it. I then took the bag to an expert and he told me that the bolts that came off were so deformed which indicates that the previous owner was unprofessionally trying to fix the bag. So my bag expert is unable to fix the bag and now I have a bag which I paid 1000 euros that cannot be worn. I understand that VC didnt see that flaw during first check because it was well hidden. But on the second check they could see deformed bolts and could have come to the same conclusion as my bag expert - but THEY ARE NOT EXPERTS. They are just frauds that can not admit their mistake and return the money for an item that does not match the description. What can I do now..engage legal expert? Horrible HORRILBE experience","title":"No care for customer rights","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-18","author":"11433102016201531E9","text":"I am very disappointed with the way you operate. I sold  the Prada jumper ref 6021063 on your website. I got the email from you on 1 Dec that 'the buyer hasn’t flagged any problems and the payment will be issued next Wednesday'. I didn't got the money 'next Wed'. I contacted you through the chat. I was told that the buyer had doubts about the originality. How come?!!! You sent me the email conforming that everything was ok!!! Somebody promised me on the chat that I would get the money next Wed. Unfortunately I didn't get it. I contacted you again. I was told that somebody 'did not unlock the transfer.' I started selling my items somewhere else. I sell  it quicker for the better price than on Vestiaire. My friends whom I recommened you have a bad experience too.","title":"I am very disappointed with the way you…","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-18","author":"RO","text":"VC used to be good but now it changed completely. Customer service is almost not existing; they don’t have anymore email nor phone number in order to contact them. \nThere are too many fake items listed on VC and very often their quality\/authenticity team is not able to distinguish fake from authentic (so you end up buying and receiving fake items and then you have to get mad getting in touch with them in order to explain why the item you got is fake and you want your money back).","title":"VC used to be good","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-18","author":"maya","text":"Really liked selling and buying with VC until January this year! \nI am supper disappointed! I bought an item on VC on 31st of January and I've never received! My item was sent by VC on 04.02.2021 via post services and was never delivered! I reached out the support team and they started investigating my problem with the post service 20 days ago now. At first they replied to me but then they went absolutely silent! Now VC team is not responding to my emails and I still don't have my purchase and no MONEY nor refund!\nAn Update: still waiting for my delivery and still have not received a refund either! It's been almost two months!","title":"Not delivered item for almost two months","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-20","author":"초밥연어","text":"HORRENDOUS CUSTOMER SERVICE!!\nAPP IS NOT REALLY A USER FRIENDLY!!\n\nThis is super frustrating. I contacted the customer service and I did not get any respond for more than a week. I purchased few items and now I’m stuck at quality control.\n\n Why does it require to log in? I signed up with Apple ID and the app didn’t have the button for login with Apple ID. Then why did you even put that button when I first made my account?\n\nBecause I can’t log in, I can’t access to the quality control to check on the condition of the item and decide if I still want the item. The app will automatically cancel my purchase, which is quite forceful. \n\nI can’t even change my email address. Why are you asking for the pictures of my ID card? Shady as hell!!\n\nThis is ridiculous.","title":"I CAN’T LOG IN FOR QUALITY CONTROL","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-20","author":"Diana","text":"I had paid for an item, Vestiaire had taken my money and hadn’t confirm the order. So I contacted the support and I was told my payment was being checked for a fraud. I was assured that it shouldn’t take more than 48 hours. The order still was not confirmed after 48 hours. So I contacted the support again. I was told to wait for 72 hours. Still nothing. So I contacted the support again and I was told to wait another 3 days! One day later they sold the item to someone else. I have not been refunded and I have not been sent the item. I don’t know what to do... Think twice before shopping there...","title":"Worst service of all time","stars":1,"location":"CZ","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-21","author":"Mati","text":"Nightmare! I sold ref no.13189508. The buyer received the item, paid VC and VC has been holding the payment  and has not answered a single message sent to their support service and no help from the chat line.\nI asked the issue to be escalated and no help has been received.  I had no payments transfer problem in the past, but this time VC has held on to funds and has not issue transfer or answered why it has not done it.  It's illegal what VC is doing. It's pure stealing.  You can't hold on to funds that don't belong to you and try to make money out of it.\nI will not sell another item with them. The stress, the anxiety this has caused is not worth it. Some of us are selling our treasured items because we don't have jobs and need money to survive. VC is making money on interest by holding the funds from clients. Unbelievable that the once trusted business has come to this. Please escalate this. I am sick and tired of calling your customer service they are unhelpful. \n\nAvoid, avoid if you can.","title":"Nightmare.","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-21","author":"Frieda Ryckaert","text":"I've been a seller on this platform for several years and can say I was always rather happy with the result of my sales. Untill this year, not only Covid-19 makes the chances of selling more difficult than ever but screwing up my prices after their Anniversary celebration -more than 1 month by now-, they still don't seem to be able to rectify the damage they caused. Items that were discounted with nearly half  of their price since submitting, now seem to never have had any price drop. This results in people skipping my items because they want everything as much discounted as possible and on top they are not  eligible when VC implants their discount selection.\nWhat is supported these days are garments under and only under 150€, I understand there's a huge crisis going on but does this mean all the rest can wait till better times? As a seller you loose your status when not submitting as much as they want, they insist to bring your prices down all of the time, to contact potential 'buyers' to increase sales but shouldn't they first start fixing the mistakes they make?","title":"Please be sincere, correct and supportive","stars":2,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-22","author":"Rebecca Lee","text":"The customer service is not taking your email reply seriously. They just try to put the blame on the clients.","title":"Terrible and Unprofessional Customer Service","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-22","author":"Ft","text":"AVOID AT ALL COSTS\n\nI ordered a bag back in October, still not received! Stuck with customs, customer service keep telling me one thing and then the next person tells me it cannot happen. I cannot send it to another country, I cannot get a refund and I cannot receive it, over €2000 and no help from anyone\n\nUPDATE: Now they are giving me the solution of putting the item for sale under my account, where it could take months to sell. Of course I am not going to receive it, they will keep it at their warehouse, joke!","title":"AVOID AT ALL COSTS","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-22","author":"Annevo","text":"The worst customer service I have ever seen. They wrote me a rude email saying I need to pay 500.- within 48hours because in april they screwed up my order and charged me too little (i asked them several times where to pay the rest, they told me i had already payed everything). Answered them immediately on the email, wrote them 2 more times because they never answered and to this day havnt heard back from them...The only way to contact them is through a stupid chat, they dont even have a email oder phone, what kind of customer service is that!!!","title":"The worst customer service I have ever seen","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-22","author":"Jo","text":"To avoid. Use other similar platforms which are far more easy and stressless to use. Vestiraie collective refuses items all the time. Authentic items I mean. and they don't know how to explain the reason. You upload items and then they reject them and say \"please upload them again\" when everything was correct the first time but they reject anyways... Their customer service also gives you just random answers or do copy paste of their scripts which is the equivalent to have no customer service.","title":"To avoid","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-22","author":"Harguitay","text":"AVOID AT ALL COST!!!\nhere is my story. I purchased this item 32577608 for more than £700 on november 27. I begged the seller to send it to me before December 10 as it was for a birthday. After a week the item was still not posted. I kept messaging the seller (i have screenshot) and he told me he will post it. he kept postponing it, telling me all sort of stories. long story short seller never posted the bag and i got no gift for my daughter in law. \ni contacted vestiare and they told me they cannot do anything. seller can cancel their transaction. see, I would have been fine if he cancelled the transaction because I would have moved on. but NO, he kept me waiting again and again, holding my money hostage. I believed he sold it to somebody else. but he did not tell me truth. I was checking my emails everyday to see if the bag was posted and I could not buy a new one as vestiare could only refund after 14 days of postage delay\nplease avoid this website, there are so many other website out there.\nhere is the seller profile: @sabatino9611030\nfunny thing is that he is a \"trusted seller \"","title":"AVOID AT ALL COST!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-23","author":"Lynn","text":"I listed a few items that weren't too expensive just to get a sense of what Vestiaire was like.  I sold a tie within two hours of listing it so I was impressed!  Vestiaire sent me a shipping label (FedEx Ground, ugh!!) to send it to their office in New York, where it would be authenticated before sending to the buyer.  It took TEN DAYS to get it to NY!  I've sold online for years and I've never had such slow delivery because I use USPS Priority.  Then it took Vestiaire over a week to even confirm that they had it.  I shipped the tie to NY on November 30, Vestiaire signed for it on 12\/09, and I just got paid for it today, 12\/22.  And I paid for \"premium\" service!  What a waste of money that was.  Absolutely ridiculous to have to wait that long for payment. Needless to say, I closed my account today.","title":"SLOW SLOW SLOW Avoid","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-23","author":"Abi","text":"Worst customer service ever. \n\nI have bought and sold on Vestiaire and the customer service is shocking. My authentic items have been refused with no reasons given. After questioning their decisions, I am met with no response. On other occasions, I’ve been blocked from chatting to customers with no reason given. When I try and speak to them to find out why, I don’t receive a response. \n\nThe app is also difficult to navigate. \n\nIt’s honestly a joke of a service. \n\nAnd the commission is ridiculous. \n\nAll I will say is that the free pick-up courier service from your home is handy. That is the only upside.","title":"Worst customer service ever","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-23","author":"Mrs Gabeva","text":"Two months ago i decided not to bother any more writing reviews and not to sweat over the ridiculousness of VC. Plus i thought i have went over every single bad experience that one can have with them. But guess what? They really never fail to find a new way to disappoint. Obscene. I sold a Chanel skirt (12088659) more than two weeks ago. Supposedly when “checking” they found some little “discrepancy”. Whatever. I have long given up trying to prove them wrong when they usually are. They offered a price reductions, i accepted just to take this off my plate. More than two weeks later nothing happens. No info, no payment. I know this cannot be true as the buyer is not going to have his money blocked for such a long time so might have accepted or rejected the proposal, and simply VC did not update the system. So, very reluctantly i am left with no choice but to contact customer “service”. Surprisingly i am lucky to chat with Mark P, very polite and responsive gentleman, who assured me that the buyer has accepted the proposal and there was a glitch in the system which prevented me from getting paid and he will personally fix it immediately. So far sounds good. As nothing changed today i contaced them again. Surprisingly, Ida from customer service told me that Mark P lied and supposedly the buyer has not given a response yet. Which sounds very unlikely. What kind of system is that? Do they know what is going on or they are just saying whatever they decide to say depending on who you have the bad chance to get in contact with? To me this is a fraud. Many people have shared similar experience, i was somehow lucky till now not to have one of the kind. But as we know VC is always quick to give you any kind of bad experience one can possibly do. The worst part is - i am not shocked, i am not even angry. With them you just expect it as with the experience one has one knows that there is ZERO security, ZERO transparency, ZERO customer service, ZERO willingness to avoid problems and ZERO ability and desire to solve problems. And all of this is to be expected when you deal with them. And i have said before - they are using their position  of being the only ones with good concept in europe and exhausting the benefit of the monopoly till they can, instead of trying to do better.  Which is something that everyone who understands business knows does not work for long. Reputation always pursues you. And if customers are not even disappointed by their games but expect them, this speaks millions of how low they have reached.","title":"A new level of low","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-23","author":"Emily Stone","text":"I sold a few unused items on this platform. First of all, the commission they charge is really high. And they always recommend a very low selling price so that to increase the selling chance. If you don’t follow their advices price, then your item will not be promoted. Also, their QC team is full of unprofessional ppl that always pick on things that are even not a problem then to ask you lower the price. Moreover, they will directly cancel your items from sold list if they have doubt about the authenticity of items, and ask you to prove the authentic. Come on, who’s gonna keep receipt all the time for tiny little items? If you want you items to be send back, they will ask for 12 euro to be paid first and then it will take up to one month to get your items back!! Last but not least, the customer service is always absent! One person say hi to you and left, another person join the conversation said one sentence and then left!! \nTrust me, it’s a real pain to deal with Verstaire!!","title":"Super disappointed with Vestiaire …","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-23","author":"Miss MC","text":"I have been battling VC for months now over a pair of fake Valentino Rockstud shoes that they sent me. The shoes do not have a serial number (even though all the pairs I have do, as do those sold in Selfridges, Harvey Nichols and Valentino store) and the shoes have double stitching (again this is only unique to the VC pair). I have the same pair in a different colour but even the leather is not the same. \nI wrote to VC, returned the shoes to be rechecked but they stand by their verdict. I had these shoes looked at by two stores that sell Valentino shoes and in both cases they agreed with me. \nMy main issue is that VC offered that I relist the shoes, I argued that I cannot sell an item I know to be fake. I even pointed out that the seller had several of these shoes in different colours and sizes with the exact faults but VC ignored me because this seller is still selling these shoes - this is almost six months after I complained. What a shame because I did like their services and I have bought a several items from their site (watches, bags, shoes). Unless you know your designer items, I DO NOT recommend you trust their authentication process.","title":"NEVER AGAIN!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"},{"date":"2020-12-24","author":"Richard Bao","text":"I recently sold an Hermes Kelly 28 on your website. And the way the sale was handled left a very bad taste in my mouth. I'd like to give you a suggestion on the way your platform feature is handled before I decide if I want to take all my future sales to Real Real instead. \n\nEverything was fine up until VC has received the bag. After the authentication process I received an email from VC saying that you have detected a tiny little mark on the bag which was not mentioned in the description. I thought to myself okay that's fine and let me have a look at it. I saw the picture and the mark was so insignificant and it's located inside the bag that it's not even noticeable. But I was willing to offer the seller a 200 euro discount. And then I scrolled down the page to see where I could send such offer, that’s when I saw VC has suggested me to deducted the sale by 1050 euro!!! I thought to myself you must have lost your mind to have the audacity to ask me to accept such a significant discount so of course I rejected it. Only after the rejection, I was able to find out that VC has offered the exact same amount of discount to the buyer without my consent.\n\nAnd here is how it went terribly wrong for me - VC is a marketplace and your duty is to facilitate each sale, authenticate each item, make sure sellers get paid in time and buyers get their products in time in the condition that they expect. Negotiation on behalf of either party is NOT your job. Maybe a mediator at most, but a facilitator is most accurate. I am a real estate broker and my job every single day is to negotiate for my clients. The first thing you do in a sale like this is you ask the seller if he is willing to lower the price (after a discrepancy has appeared). And if the seller says yes then it is up to the seller how much he is willing to offer as a discount to his buyer. By having you suggest a price to both the seller and the buyer without the seller’s consent, you have taken away the seller’s right to a fair negotiation. Because you have framed the negotiation (intentionally or unintentionally) in a way that the buyer now has a much higher expectation on how much discount she can expect based on your suggestion. In negotiation it is called anchoring and by doing this the seller has been involuntarily forced into a biased negotiation. In addition, by not giving the seller an option to offer a discount on his own will on your platform, VC has diminished the power of what could have been a nice act of goodwill to absolutely nothing. The buyer could have received a 200 euro discount from me and instead now I just look like a cold-hearted seller who doesn’t care about his buyer. In fact when I tried to communicate to my buyer in the private chat that I was willing to offer a 200 euro discount on the sale by making a bank transfer to her (because like I said, VC doesn’t have the option for the seller to offer a discount through their platform), VC banned me from the chat feature for 24 hours, because they thought I was going to take this sale somewhere else outside the platform.  All of these nonsense made me feel like I was just a dollar sign to your company. You should not be worried about me taking this sale to somewhere else, you should be worried about me taking all my future sales to somewhere else.\n\nHow can you do better next time if a similar situation happens again \n1. Ask the seller if he is willing to offer a discount to the buyer\n2. If so let the seller initiate an amount to offer which the buyer then has the option to select either accept or reject (exactly like how a negotiation works during your pre-purchase negotiation stage on you platform)\n3. If accepted by both parties, the sale goes through at the new price\n4. If not accepted, then the product gets resisted or sent back to the seller.\n\nNEVER EVER suggest a discount to the buyer on the seller’s behalf - you are not the hero here so please don’t try to save the day by acting like one. Let a fair negotiation be the job between the seller and the buyer. Your responsibility as a facilitator is to provide a platform that is safe, easy to use and bug free. Therefore please spend more time on making these things your priorities.","title":"Dont Act Like a Hero","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=83&stars=1&stars=2&stars=3"}]