[{"date":"2021-08-28","author":"Mette Nyland","text":"I have purchased a bag and sent it through their quality control to make sure I was informed if the bag had malfunctions before receiving it. I received no observation points. 2 months later my bag is broken and cannot be used. \nI contacted the service centre (quick response) but they cannot help me at all with my broken expensive bag. \nThis is very unsatisfactory and I must warn other people of the very poor service of expensive bags. \nThink twice before doing any business with them.","title":"Very poor service and quality control…","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-08-28","author":"Jacqueline Standing","text":"Was treated very disrespectful ,sold an item ,honestly , received item back ,not in the same state it was sent ,was not given a voice ,treated very badly as a new customer ,took my other items off their site , will never do business with them again ,and intend to let my other sellers know this too , absolutely disgusting what they did and allowed this buyer to treat me and my item .","title":"One sided …","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-08-29","author":"Aleksandra Alex","text":"I sow a stuff what they selling and they have a prices bigger then actualy is on original shops . \nIm wondering who checked them items ,this side look like big fake .\nI Will avoid for sure !!!","title":"Louis Vuitton","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-08-30","author":"Michelle ","text":"I sold a brand new Chloe handbag on Vestiaire on 14 Jul 2021, and they said payment was sent on 27 Jul 2021 (#16938363). When I did not receive payment over the first week of Aug, I checked in with Vestiare, and they showed me the payment advice to a bank account that is not mine. I subsequently updated my Vestiare profile with the correct account number, and asked Vestiare to retract the funds from the incorrect account, and pay into mine. It is 30 Aug 2021 today, and I still have not received the funds. I am getting the sense that Vestiare is not really interested in paying me. Is this a scam?","title":"Is Vestiare a scam?","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-08-30","author":"Daniela Bogoeva","text":"So guys here is my experience about Vestiare Collective! I sold a shorts of Chanel . In the authentication they canceled the selling . I was fighting but eatherway maybe it was for nothing, cause maybe they were lying that was making second checks. The buyer has wanted to buy the shorts cause it was obviously that they are authentic ( from the photos i was making to everything). Anyway i paid taxes to returning back the item which is curios . So after that i put my item to REBELLE , the same buyer bought it. The shorts PASSED the authentication and now me and also the buyer are happy. \nShame of you Vestiare ot shame of the team that it s working there…\nAlso Vestiare they canceled my authentic bag even when i sent the bill\nOf shop that I bought it in USA!\nVestiare have some bussiness sometimes to cancel the selling and to take money from the seller! Don’t sell it there\nVestiare you have to pay me for the money that i lost it!!!","title":"So guys here is my experience about…","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-08-31","author":"No","text":"21 August 2021\nResponding to Vestiaire-Collective, who responded to my first review (here below):\n\nThank you for taking the time to get back to me. It is nice to read an answer that is longer than 3 sentences, which is what I had received so far when contacting you via your “Help” or “How-to-contact-Vestiaire-Collective”, which is also why I have no intention to use those options, so no need to send these links again in future answer. \n\nI also feel that answering you here is far more helpful to other VC users. \n\nAs written in my first review here below and as communicated with your “support” several times: the sale was canceled due to your mistake without even contacting the carrier nor myself. When I contact you (via your “support”), I provided with a proof that UPS and myself shipped the item on time. Moreover, the buyer did not cancel the sale but you did. She wrote me in a comment that she contact you because she didn’t understand why the sale was canceled. Strangely enough, you deleted these comments after the second time I contact your “support”. \n\nAfter the third chat with your “support” my item was sent back to me without any consulting nor mentioning the buyer. On the App however it is still “in progress — item assessment”. Strangely#2. \n\n\nI’m still waiting to your solution on this lost sale. To quote your motto and goal as written in your answer to me here below: “we will solve this issue because our staff has one and only goal: help our members until a satisfying solution and make you happy!”\n\nPlease solve.\nref. #11907221","title":"Vestiaire-Collective not responding","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-08-31","author":"Liana Mori","text":"Scammed. Bought a black chanel bag and receivd a navy one. Seller isn't taking responsibility and vestiaire apparently hires colorblind people.\n\nUPDATE: The company apparently saw my review and my photos. I now have an opportunity to return this item for which I am grateful. It just sucks that it takes so much work, but I appreciate the opportunity to present my case to Vestiaire. I will edit my review according with the outcome of this investigation. Thanks again","title":"Case on review, return opportunity","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-08-31","author":"Athina Kollakidou","text":"Hello Everyone, \n\nI am going through a horrible and frustrating situation, as a seller, with Vestiaire. I would strongly recommend not to trust your items with this company.\n\nI sold a new Valentino belt. Never worn, with tags and box. Most likely the lady who bought it was intrigued by the price and the condition that she didn't check the size. Long story short she didn't fit in the belt, tried to close the buckle and damaged the belt. She then claimed that the belt was already damaged which it was 100% lies since I never worn the belt as it was huge on me. \n\nI have the belt pictures of the before I sent it and how the belt looks now and she totally destroyed it. \n\nVestiaire don't even want to get involved, on the contrary they are so lazy that they said from the pictures she said the belt is obviously damaged due to wear and tear which is crazy that they come to this conclusion since they were the once approving the uploads in the first place (and they check the photos).\n\nSeriously it's better to go in physical stores to re-sell your good rather than trust this company. \n\nNow i have an item that I can easily throw out from the damage and I lost 200£ all because of Vestiaire.\n\nDon't trust them","title":"Do not sell your items on Vestiaire","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-09-01","author":"Mel","text":"DO NOT SELL ON THIS PLATFORM! YOU WILL NOT GET PAID!\n\nThis company is a FRAUD. They don't pay sellers despite you posting your item! Even if you follow their direct shipping instructions. Parcels sometimes are never picked up by couriers when you drop them off at drop-off points. The parcel will become lost, and you will waste your time speaking to 4 support reps who all promise you they will do something, but they don't. In the end, you will lose a lot of time, energy and your item which was sent off but never recieved. \n\nNEVER SELL on this website!","title":"DO NOT SELL on Vestiaire. You won't get paid!","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-09-01","author":"Tom Civilis","text":"They overcharged me commission on all three cases, when asked on the chat agent could not answer nor help. Stay away from these thieves.\n\nItem sold for  £375 they charged me 33% commission, ending up with £251; other one charged at 25% when even their website states should be 20% sold for £331 got £248.25 and lastly shoes I sold for 70 got 57.\n\nHonestly very unprofessional and just steals from you.\n\nOrders: \n\n5851795 - comission charged 25%\n6792944 - comission charged 18.5%\n5841597 - commission charged 33%!!!!!\n\nTheir website states all items under 500gbp should be comission between 10 to 20%, I only noticed now. Raised a claim as mentioned without any help.\n\nDo not use them.","title":"They overcharged me commission on 3 occasions","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-09-01","author":"Carmen Mahtab","text":"I asked for all my items to be delivered to a local store. Instead they are being delivered to my address and 1 to the local store. I dont work remotely so I have no way of recieving them at my home address ! The auto chat robot experience is awful and I haven't had a response from the query I submitted to customer services online.","title":"I asked for all my items to be…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-09-01","author":"Glenn","text":"Fees are way too high!! Sold an item for £22. Checked my bank account and was left with £9.00 after commission!!!! Vestiairecollective is a big massive rip off, disgraceful, they should not be allowed to do this. Never again. \n\nAVOID SELLING ON THIS WEBSTE AT ALL COSTS UNLESS YOU WANT THEM TO TAKE OVER 50% OF YOUR MONEY. COMPLETE JOKE!","title":"Fees are way too high!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-09-01","author":"mona brar","text":"Sold a hamilton watch, it took 6 months to arrive to us because the package kept getting lost and was damaged at one point. Eventually got it and the time on the watch came to a standstill around 28 days later. I was shocked of course and though its a slip of button. There after it became more frequent, now the watch cannot keep an accurate time at all and is slipping back hours. The watch was switched off when sent to me, which means it was not 'quality approved' for its mechanical mechanism ever. Surely this is the first thing you would check in a watch for quality insurance DUH! They said because its been more then 72 hours i can no longer return... hilariously sad. Goodbye to my husbands gift. LESSON don't buy from vestiaire. I read the bad reviews but thought id try it, boy oh boy did I learn the hard way.","title":"SCAM","stars":1,"location":"OM","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-09-01","author":"Athina Kollakidou","text":"Guys please please please don't use this company.\n1)Such a disappointment\n2) Waste of your time \n3) Will destroy your items \n4) I know several people who they bought items from there which they were fake\n5) Horrible customer service and as they do not have a physical store it is harder for you to take actions since you don't know with who you are talking to\n6) Several people of which i spoke to send an excellent item and the buyer destroyed it giving false accusations that the item was already destroyed (this is what happened to me)\n\nBest buy an item full price, from the store knowing that any damages the store will cover, have the full luxury experience.\n\nWith this company the only thing you get is a disappointing item and a horrible customer service. I am trying to close my account because i no longer want to associate with unethical people and they make it as hard for me as possible. Everyone english is horrible and everyone is saying different things.\n\nPlease don't waste your time. You can go to physical second hand store","title":"Never use Vestiaire collective (read reviews prior to purchasing or selling)","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-09-01","author":"Dy","text":"This company is a joke. I tried to list a Gucci bag (with the receipts and everything) that I bought at the Gucci store and Vestiaire refused the item saying it wasn’t authentic lol. Do not buy from them, if they can mistake an authentic item for a fake then I’m sure that there are fakes they will mistake for authentic items.","title":"This company is a joke","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-09-01","author":"Kayleigh Felstead","text":"THEIR RESPONSE IS RUBBISH, THE REFUND HAD BEEN ISSUED WHEN I WROTE THIS BUT IT ISN'T IN MY ACCOUNT. I STILL DON'T HAVE THE MONEY BACK WHATEVER PROOF YOU MIGHT WANT TO SEND ME, I'LL BE CONTACTING WHICH LEGAL FIR SUPPORT NOW!!!!  I purchased some shoes for an event and over a week later, bearing in mind I had paid them immediately so they had my money for over a week, they told me the order as cancelled as the item was no longer available. I assume the seller got more money from another platform. This is selling in bad faith. I am now still waiting for a refund. It has been processed but I haven't got it in my account over 10 days later. Customer services just tell me it has been processed, and they'll produce a report!! I don't want a report I want my money back!!!!!!","title":"Sell in bad faith, no refund","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-09-02","author":"Sophie ","text":"Worst online experience I’ve had. Do NOT trust their customer service. I ordered an item that was coming from Australia (where I am), but at checkout it added a huge amount of customs duties. I asked their customer service why this was the case and they assured me it was an error, and I would need to contact them after I placed the order to receive a refund. I ordered, and then when I contacted them I was told I do have to pay the fees. I had to speak to three people before it was explained the item is shipped offshore for authentication, then shipped back to me. At this point, I was offered to switch to direct shipping, so I said yes - but then was told sorry that’s not possible after ordering (not sure why they offered it in the first place!). I asked to cancel the order because with shipping, customs and authentication fees it was actually cheaper to buy the item brand new. I was then told that it can only be cancelled by the seller, so I needed to ask them (seller is actually penalised in this case - even though it was VCs fault). I ended up cancelling the order by going through my credit card company, as I kept screenshots of all the customer service interactions which showed multiple lies.","title":"Horrible online experience","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-09-02","author":"Olga Muffi","text":"Where to start actually......... 1 ) I sold new triple S  Balenciaga traineirs to girl in US , they got \"lost \" in Vestiaire Warehouse,  they asked me for passport etc details , but after 2 months haha. But before that for about 2 months they were saying that the item is been with their experts , who,according to them were verifying the authenticity.......... I never got my money or my shoes back  ( they were worth 725 euro ) and girl from US never got the shoes .                                   2) Any time I try to place an add for my handbags , they ask for new photos . I take very good photos with my Samsung,  never blurred etc. And I sent always at least 12 of them with all possible details . But same story again and again . Very strange that there are items ( like Hermes bags ) with only one photo or very few and not clear .....And that is ok  . ... I wonder how they decide that ?? It makes zero sens ....                                   3) Impossible to contact them . NO PHONE NUMBER to call to them , they say: coz of Covid restrictions  hahaha  I never heard such an absurd ......So there is option of chat with computer,  machine , asking few same questions , before a human join . But if you leave the chat for a while , there is no chance you get back to same person . Same questions are asked by machine before a human join but different than  you already spoke to . So guess ..what ....extra  10 or more minutes wate of your time . Another way of communicating with them is : the machine is asking you for your email adress and once you answer ,the chat is finished haha . Then you go to your mailbox and guess what ....there is something called \" noreply email\" haha . Amazing experience... defo for people with very strong nervs ....So if you want to complain about terrible servive of theirs you can not !!!!                                4) \" Premium member \" , another \"awesome \"trick of VC . So I payed for premium,  thought would give me some extra possibilities.  But any time there is an item in super good price is already reserved by another \" premium member \" . And owners do not like the system either as their items are reserved for hours and people who really would buy it straigh away can not .... Very frustrating .. .. .                                                   5) I really do not understand how VC can cooperate with Mytheresa ( and seems like it does) as Mytheresa is real awesome experience any time I use it and I use it a lot and very regurally .. ..So it all seems to be big mystery .. how such terrible website still exsists . Hope soon enough someone invents some good , friendly , logical , customer- focused , modern app so we all will be able to say Good bye VC","title":"Worst ever online experience","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-09-03","author":"Leni Guevara","text":"Same as what is everybody is saying here… a ‘prestige’ seller who ought to have a direct communication with their buyer\/seller is just insane. \n\nSold a Garden Party Hermes Amazonia tote and I shipped it straight out to the buyer in Sweden. According to the tracking records, it’s been there since Aug 25th and no one is picking the item in the front desk which is not my issue anymore. I am trying to contact the Vestiare but it is so funny cos it’s all robotic, and you wouldn’t be happy to any response that you can get out of this auto generated chat that they have! \n\nCould you please look out what was happening- I’m expecting that we’ll all be protected here and will enjoy the platform of Vestiare to give the seller\/buyer the outmost experience but where? \n\nI hope all the people who are writing here as well will get the kind of answers with any issues you are all facing on Vestiare, not having a direct customer assistance is already a red flag! Think about it ladies and gentlemen!","title":"Same as what is everybody is saying…","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"},{"date":"2021-09-03","author":"Amy D","text":"DO NOT USE VESTIAIRE COLLECTIVE!!!!\nPurchase a saint laurent coat that was sold as womens UK size 14.  When it arrived it felt odd, sleeves very long, body very tight.  I brought it to Saint Laurent who confirmed it was a mans coat and not womens.  Contacted VC and was told that because it was not reported within 72 hours i had no rights.  Under the distance selling regulations 2000 i am covered as the item was mis sold to me as womens and not mens.  The CS agent i'm dealing with will not escalate my case and i'm now seeking legal advice.  The savings you think you're making are not worth it!!! Avoid at all costs.","title":"DO NOT USE VESTIAIRE COLLECTIVE!!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=47&stars=1&stars=2&stars=3"}]