[{"date":"2021-07-23","author":"Mb","text":"International shipping works fine, although has many teething issues. Direct shipping option is terrible. I shipped multiple items on schedule and VC will not mark them as sent, delivered or process my payment, despite my tracking label generated by them tracking as delivered.","title":"Terrible experience","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-23","author":"GONCA GUCLUTURK","text":"Wish I looked at here before I used this website. They sent me horrible dirty shoes and when I complained and wanted a refund they say ok send us back we will give you a full refund and then their “expert team” decided the shoes are ok so they didn’t refund my money back. Every word is lie from the beginning to the end. I am going to small claims court to get my refund, if anyone has the same problem I am planning to start a class action lawsuit. Untrustworthy, low quality company","title":"Untrustworthy, low quality company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-23","author":"GONCA GUCLUTURK","text":"Wish I looked at here before I used this website. They sent me horrible dirty shoes and when I complained and wanted a refund they say ok send us back we will give you a full refund and then their “expert team” decided the shoes are ok so they didn’t refund my money back. Every word is lie from the beginning to the end. I am going to small claims court to get my refund, if anyone has the same problem I am planning to start a class action lawsuit.  Untrustworthy, low quality company.","title":"Untrustworthy, low quality company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-24","author":"Mrs Gabeva","text":"This is actually I continuation of my review from yesterday. After Contacting VC about their ridiculous decision to declare my item (previously bought from VC) non-authentic I received an email with the usual blah-blah and “terribly sorry” for the inconveniences and the usual BS. First - it is clear nobody is sorry and second - do not be sorry, just actually do your job properly … anyway … so what they do? Instead of fixing their mistake from yesterday, they decide to say that actually their team\nMade a mistake at first place back in 2018 when they sent to me a non-authentic item and they will refund me that order. Very “generous “… but let me tell you why this is a problem:\n\n1\/ because it only shows the total\nLack of any professionalism in this scam\nCompany; the item is authentic, i am a super big Chanel client, i can spot a fake from in a flash and this item is not fake!!!! So, they really do not know what they are doing and this is proven big time again and again.\n\n2\/ for me it is better to get a refund than to actually get the money from the sale as after deduction their commission for them doing nothing but creating messes, i end by getting more money . BUT, Here is the a problem. My buyer is disappointed. I am sure he will never buy from me again because he thinks i am selling fake items - which is actually an authentic item, declared from Vc as fake which three ago was declared from the same Vc as authentic… totally crazy story. Now i have a disappointed client thanks to VC rubbish “expert” team …\n\nSo, while keep getting fake apologies and assurances that the matter will be fixed … and then what happens .?! VC DEPRIVES me of my expert seller badge?!?! WhhhAattt? And why?!?!\nExpert seller - 416 items sold; all shipped on time; all declared comform; all but one - that one which is actually their mistake.\nConclusion- VC is a SCAM COMPANY which is HIGHLY DISCRIMINATORY against knowledgeable sellers. The people who are actually making them money. The people who are wasting hours to deal with their BS. And most probably my geographical\nLocation at the moment rubs them the wrong way. At the end of the day they are french and we all know how some french people\nFeel about foreigners. And as a result they DISCRIMINATE. DISCRIMANATE. DISCRIMINATE. Just to cover their own lack of knowledge and professional and to punish you to for actually noticing and being vocal about their mistakes.\nMy sincere recommendation: use Rebelle and therealreal to sell your items and do not waste your time, nerves and money with this RUDE SCAMMERS. They managed to go BEYOND any worst expectations one might have.\n\nUpdate: VC is like the plague. It keeps destroying whatever it touches. I received a super kind and apologetic email literally informing me that my badge cannot be restored although the mistake of taking it away from me is 100% theirs. But they urge me to sell more … seriously? Unfortunately when it comes to VC any kind of ridiculousness, unfairness and incompetence is totaly serious.\n\nSecond - the item that i sold and they considered non-authentic which is the item that i originally bought from them in 2018 and then was authentic, is finally refunded to me. BUT?!?! To my original card that i paid with 3 years ago and which is no longer existent and which I actually warned them not to use.\n\nSo, SCAM after SCAM, WRONGDOING after WRONGDOING, DESCRIMINATION after DESCRIMINATION, etc\nOf you want to be dragged through the mud and robbed, VC is the place to get all that.","title":"VC is a discriminatory company","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-24","author":"Maha Aljneibi","text":"i dont even know where to start: \n\nas a buyer: \npurchased a birkin on this website that costs a fortune, vestiaire delivered it to the wrong address and then the courrier company returned it to them, after waiting for 3 weeks for them to ship to the correct address they inform me that they cant locate the item in their warehouse so they will refund me. It takes them a week to process the refund and they send me an email saying that the refund is complete yet i did not receive my money back! i have not received a dollar back and still no response from them!! \n\nas a seller:\ni send them a dior bag after it has been purchased they reject it and send it back to me in a tiny box crammed and crumpled!! my bag lost shape because of their packaging! \n\nnever again dealing with them! customer service is soo bad and slow and dont even understand basic english!","title":"i dont even know where to start","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-25","author":"Sallie","text":"Frustrating beyond belief.\n1. The minute you put on something to sell they will begin telling you to lower the price, they compare your item to low end or out of season items that bear no resemblance to what you upload and then the emails …constant emails, telling you to lower the price.\n2. Nil support. The online chat is just a Bot which is not an online chat it’s a damn bot.\n3.glitches cost time and money. One in particular is the bug that prevents you replying to a potential buy when they ask a question. So frustrating.\n4. The price you THINK you are paying is nowhere near that price once you add their costs. I bought a $700 bag and the final total was over $1k!!! I had to retract from the sale and felt terrible about it.\n\nJust frustrating, low end, badly curated and a lack of support.\nNot worth the bother.\n\nIN REPLY:\n1. The seller might get to set the price but that doesn't stop the dozens and dozens of emails and notifications you send telling the seller to drop the price. \n2. I asked the chat bot to refer me to customer service. The Bot did Not. I had to email and they the proforma emails came which did not resolve the issue and were clearly written from a template.\n3. I did report to your IT team via email. There were 5 emails in total and never did you resolve it.\n4. Buyers do pay more than the advertised price. I purchased the bag for AUD 700 and the final price with shipping, taxes etc was over AUD 1000.","title":"Frustrating beyond belief.","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-25","author":"Sarah","text":"An item I ordered was not delivered - the courier did not attempt delivery and yet claims that I refused the item. I logged a complaint over 6 weeks ago with Vestiaire and they have passed me from person to person and are refusing to issue a refund. \n\nBeware when buying from this company. Their customer service is terrible and you have no buyer protection. I will not be using them again.","title":"An item I ordered was not delivered","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-26","author":"Kirsten Milton","text":"I literally just had a pair of DIOR earrings rejected for resale. I have: the receipt from Düsseldorf DIOR, the bag, the box, the protective pouch, and even the original ribbon from when they gift wrapped the item. They were worn for a wedding and like everything I own they are in perfect condition. So, how can they be rejected? \n\nI uploaded another item (accepted) and two offers came straight away. I looked at the profiles and accepted an offer from what Vestiaire call: “trusted seller”. \nNot been paid. Second offer accepted: not been paid. \n\nLastly, I used this APP last year and sold items that I dispatched ON THE DAY, and as I live next door to a drop off parcel delivery service it’s immediate dispatch from me. However. I got poor feedback on shipping times. When I looked in to this they were actually criticising themselves but blaming me!! The items I sold in Germany go to a collection point in Germany as per their instructions, which depending on when their driver collects and returns to wherever for processing can take a whopping 2 weeks!!! This is before they’ve even checked the item. I obviously have a dispatch receipt from DHL and it shows very clearly I sent the item the day it was sold and as soon as I received the returns label they were printed and the item sent. I work from home so this is no drama for me. As I said: I live next door to a DHL service. As a result of THEIR slow collection- guess what - I got marked down on my profile. I mean really??? I’m being penalised because they took so long to get organised! Funny. \n\nCompletely ridiculous APP. \nThere are other luxury apps on the market which I have researched. I will try one more. But I don’t recommend this APP at all. It’s way more problematic than it’s worth.","title":"I literally just had a pair of DIOR…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-26","author":"Christine","text":"As a seller.. I sold a clutch on 1 July 2021 after relisted it.. I haven’t received any payment as said in the information in the APP.. I’ve contacted them through the the chat room in APP.. all I got so far is they keep saying escalated my issue to their expert team.. but NO REPLY so far.. they even sent me a photo about the transaction of my item which says payment will be processed on 8 July 2021 when I asked about my payment issue on 26 July 2021.. which shows they definitely NOT HANDLING ISSUES and keep sending standard replies and emails on apologizing the inconvenience but nothing else.  Very disappointed.","title":"As a seller.","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-27","author":"Anna","text":"Broken tracking & horrible service! \nI am an \"Expert Seller\" on their platform have sold more than 50 items over the past 1.5 years as I have been cleaning out my closets. Generally, I really like the vision and idea, and strongly support the idea of circular fashion and not throwing away items. BUT - the execution with Vestiaire is horrible and not acceptable given the prestige and COST of the items being bought and sold on their platform. \n\nI thought maybe I had just had some bad experiences but as I read the reviews on here now, I realize that this is definitely a SYSTEMATIC PROBLEM! I have just retroactively reviewed all of my sold item data, and have now identified 7 items (!!!!!!) that their platform does not identify as having been shipped (even though I shipped every single one of item) and hence they have not logged a payment to me. So 7 items, that I bought and owned, shipped and sent to someone... For free! Because Vestiaire inaccurately logs and tracks shipment information and then CANCELS THE SALE and refunds the buyer - even when they receive the items from me! For free. Honestly, it is basically fraud. \n\nI have written them on chat. No response. I have tried contacting various email addresses, no response. The last response I got after managing to chat with a real person (not just a useless BOT) on their chat was in March 2021. I explained the issue and was informed they would raise this with \"the expert team\" and get back to me. Never heard anything again. \n\nI live in Germany and ship items from here and I saw in the reviews that another seller also complained about problems with the tracking of shipments from here. This is clearly an issue that Vestiaire has and that they are not fixing and rather punishing their customers for it. Multiple times, I have sold an items, immediately wrapped it and dropped it off at DHL the next day. Yet, according to the Vestaire platform and app, it is listed as \"Waiting to be shipped\" for days and days, sometimes even beyond the time when the buyer contacts me on chat to say the received the item and love it. It is ridiculous. In the end, I get penalized for \"inconform shipping\" (too late) or they cancel the sale and claim I never shipped it at all. \n\nLike I said, I really like the vision and idea of Vestaire and principle of expert resale but they need to work on their customer service and the general platform they use and stop punishing their customers in the process. It is ridiculous and sad that the only way to get a response from them seems to be public complaints. \n\nSort your stuff out. Or stick to selling €5-10 t-shirts from Zara.","title":"Broken tracking & horrible service","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-27","author":"Kirsten Milton","text":"Update on Vestiaire\n\nSent the actual receipt to the company for my DIOR Earrings and they have come back saying they can not confirm they are real and refuse to upload them. \n\nSeriously worrying if a luxury selling App can not identify what is real and what is not real. \n\nWhen I go to Dusseldorf next week, I will pop in to Dior to tell them how they sold me fake goods because someone at Vestiaire said they are not real.","title":"Update on Vestiaire","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-28","author":"Jess Palmer","text":"Honestly DONT SELL WITH THEM THEY ARE TERRIBLE JUST TERRIBLE. Years back they were great now you can’t even speak to anyone  in “ cusp service” there is NO CUSTOMER SERVICE! I’ve messaged over20 people who all promised to resolve my issue I CAN NOT SEND ITEMS BECAUSE DHL IS NOT IN MY AREA AND THE LABLES THEY GIVE DO NO WIRK , I’ve messaged and messaged each time promising to resolve and nothing . The worst experience ever and they are holding items that haven’t sold and want money so they can return it back to me. You will never get to speak to anyone the whole process waste times and has cost and lost money looking for another selling platform they are truly useless and don’t give a damn about customer experience or problems. I’ve sent items they have been damaged by customer and I’ve got no compensation for this . If your owed money you’ll never get through to customer service they don’t even have an number it’s been months of stress and Shri. They’ve got so big they no longer care about quality customer service. Avoid at all costs NIGHTMARE","title":"AWFUL HELL EXPERIENCE","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-28","author":"Jess Palmer","text":"COMPLETELY USELESS CUSTOMER SERVICE HORRENDOUS EXPERIENCE \nNO ONE LISTENS - avoid useless you want months of stress and to lose items and money \/TRASH experience","title":"COMPLETELY USELESS CUSTOMER SERVICE…","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-28","author":"Jess Palmer","text":"Useless \nLable don’t work to send items\nZero customers service\nUseless CHAT BOT (talking to self)\nAvoid\nWithholding money \/ items\nAwful","title":"Useless","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-28","author":"Mrs Gabeva","text":"I have been sharing my negative experiences with VC - the big ones, because if I have to go through every single time they messed up, I would be writing here every day. And yes, I receive super polite answers, some of them even they boldly put here,  but the problem is that all these answers are BLATANT LIES and sand in the eyes, given with the hope that I will give up exposing their wrongdoings. They did not guess right. \nThis is just the beginning.. :-)\n\n1\/ my sold item Ref, 10926161 - they sent a wrong shipping label; three days going through hell to get the right one; got it, shipped in day No 3, they got in day No 4, declared it comfort... but shows not shipped on time; still; why? because they are total morons first they send a wrong shipping label, second even with the wrong shipping label was shipped on time so..; but it is VC and the truth does not matter;\n2\/ Ref. 5670063 - the refund was issued to a wrong card, a card that does not exist anymore, which I warned them about and they still did it , ON PURPOSE, so that it can bounce and they can keep this money for themselves; 910 eur; this is actually FRAUD, FINANCIAL MISCONDUCT AND PURE ROBBERY; they are super wrong thinking they will get away this this;\n\n3\/ my badge not restored yet; despite their - \"deeply sorry \" blah blah and \"their it team\" working to solve the problem;\nso, as it is obvious, VC does tell lie after lie, but also is STEALING from us;\nI have decided to give them till tomorrow and if all of these things are not fixed, and they will not be, I will publish my email here and please everyone with similar experience who is willing to join me, to write to me, as we cannot afford anymore to be the victims of this FRAUD company.","title":"LIES AND FINALLY A ROBERRY","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-28","author":"Nilu","text":"Horrible, inexistent customer service and support. Vestiaire Collective is no longer what it used to be. The last two bags I sold were in great condition, without faults. The first bag got rejected twice for vague and questionable reasons. They shipped it back after more than two weeks. The second bag got stuck in their warehouse for eight days, without even being assessed. Their solution? They'll send it back after even if it was initially sold, without any further explanation. I really wonder what their excuse will be and what will they tell the buyer, as they're probably still expecting the bag. I'm speechless. It used to be a good platform, but now it's honestly trash. Not the mention the constant spamming, the useless bots, not getting a clear response when they say you will..garbage. Stay away from it. If the buyer happens to see this review, the bag's reference number is: 16445588","title":"Horrible Experience","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-28","author":"Daniela Bogoeva","text":"Hello, I sold a item with ref number 17131417 ORIGINAL CHANEL SHORTS.  Of course , the independent team of Vestiare want a help to proof if it s original with bill?!?!? The shorts is from 2018 how it s possible to save the bill!!! Of course they decided that is not original, I don’t know how! The most unprofessional is when they want money to pay to return me\nThe item back! What is this? I will not sale anymore item\nThrough vestiare cause maybe everytime i have to pay if some unprofessional guy decide that the item\nIs not original!","title":"No professionalism","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-28","author":"Amelia","text":"I think my experience with VC is painful and leaves a bitter taste in your mouth.\nI put on sale a Chanel Timeless bag with all the accessories, hologram and authenticity card.\nThe next day I sold it and sent it to VC for authentication.\nAfter they received it, the expertise team sent me an email to send them the purchase invoice.\nI replied that I received the bag as gift and I don't have the invoice.\nAfter another 5 days I receive an email again with the same request and I sent them the same answer.\nAfter a few more days, I received an email that the bag could not be authenticated and they canceled the sale, also to pay 12 euros to send my bag back.\nI made the payment, which I am convinced they received the money the next day, and they told me that they would send me the bag within 15 days after paying the 12 euros.\nOf course the bag was not sent, I asked them why.\nI send them confirmation of payment of 20 euros and to my amazement when I received the bag I found that the hologram inside the bag was peeled off and put elsewhere ....\nI did not receive any answer from them why they rejected the bag and to my questions why they detached the hologram they said that I sent the bag without a hologram, which was not true.\nI wrote to Chanel and I'll send the bag to them to resolve the problem.\nit is not normal what happened and especially that at Chanel I will pay some money .....\nAnyway, I won't sell anything to them either.\nTotally disappointed with their answers even if they are polite they are totally unprofessional.","title":"My bad experience with Vestiaire Collective","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-28","author":"CH","text":"I sold an item via VC on 10 July 2021 and the buyer requested Direct Shipping. I followed the steps provided by VC and went to the Courier's drop off points, however, it took me two days to find one that was willing to accept the parcel. The item was shipped on 16th July, I can see on the tracking that the buyer received the item on 19th July 2021. \n\nHowever, VC's system did not pick up the fact I have shipped the item and neither does it provide me the option to 'mark as shipped'. Therefore, they cancelled my entire listing on 17\/18th July and refunded the buyer in full.\n\nThe buyer received the item and also obtained a refund. I contact VC's customer chat multiple times, and I was informed that they will follow up with the buyer to get them to pay again. However, I received no update since apart from them claiming their 'expert team' is working on it. It has been 2 weeks since I posted the item and I am yet to receive my payment. \n\nI have not encountered that much hassle in selling an item, let alone having a plaftform automatically refunding a buyer when there is a flaw on their shipping system. \n\nPlease do not use VC again, it is better to sell via eBay or other reliable platforms.","title":"Horrible platform, do not use again.","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"},{"date":"2021-07-29","author":"Jodie Sandmayr","text":"I sold a Louis Vuitton Bag on the 18th of June. Payment said it has been processed however I have never received the money. I have tried contacting them however I have not heard back. Not only have I sent the bag that I only sold as I was desperate for money as an unfortunate situation had occurred I am now down the bag that cost me over $4000 and down the tiny bit of money of $900 that I desperately needed! Total scam I am really annoyed","title":"I sold a Louis Vuitton Bag on the 18th…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=52&stars=1&stars=2&stars=3"}]