[{"date":"2020-10-22","author":"Estelle Stella","text":"I have been a loyal customer since years and now im losing my mood with this site. I had to wait 2 hours in customer support, customer service ends chats before im finished typing. Im asking where my bag is located and get really worried. Once i recieved a broken bag and didnt get compensated. Im asking why shall i keep using this site? I spent over 40 000 euros and the lack of respect is ridicilous.","title":"I have been a loyal customer since…","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-22","author":"Kay","text":"Terrible service, impossible to communicate efficiently over Online chat, something that could be dealt in minutes took me over 30 mins and it was still not solved. First email received about the bag was to change a picture; I did. Then second email came and was told that the Louis Vuitton bag was not up to standard due to authenticity. It was personally brought by my ex boyfriend with me at the city branch! If their  curation team was reliable and professional enough then they would of checked it Carefully and realise it was real! Overall very bad and slow service.","title":"Terrible service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-23","author":"Lauren ","text":"If I could give 0 stars I would.\n\nItem arrived not matching description, was told I’m not allowed to return it and have to resell. Vestiaire reduced the price on resell for no reason, leaving me £200 out of pocket. I have been chasing them for this money.\n\nThey also inflate customs charges and take the money for themselves.\n\nThe customer service team are extremely rude and unhelpful.","title":"If I could give 0 stars I would.","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-23","author":"Joan","text":"I ordered a size 36 1\/2 Gucci shoe. A 35 1\/2 showed up. I know my Gucci size and always make sure when I order from any resale website that I print and save every photo and the sale information in case of any dispute. The seller had my sale posted with the correct size yet when I disputed it and requested a return and refund it was denied and they sent me a photo of the incorrect shoe size even though I had a photo of the correct shoe size that I saved from the post! Unbelievable false advertising. Will never buy from Vestaire again.  Do not trust these scam sellers!","title":"Gucci shoe showed up in wrong size","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-23","author":"Bengtsson001 ","text":"Utterly shambolic service with the sellers. Item number 30628671 seller is not even based in Hong Kong yet Chanel shoes are being sold as a size 5 and when received no shoe size and definitely not a size 5. This was also confirmed with Chanel and more of a size 3.5 or 4. Also paid for taxes on this ans seller is useless. This is the 3rd time in 3 months where sellers list items incorrectly, do not bother to respond and leave you hanging when you have paid and then vestierre never respond. Or refund immediately. Utterly shambolic service","title":"Utterly shambolic service with the…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-24","author":"marie","text":"Downloaded app and contacted Vestiaire with a query. I didnt post any items. Got a reply to say my article didnt get accepted!!! Lol was it an invisible cloak? Uninstalled straight away. A joke of a site","title":"Downloaded app and contacted Vestiaire…","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-26","author":"Bridget Goh","text":"I paid a total of SGD956.98 (including taxes) for a pair of Dior flats and was informed that my order was cancelled as \"its condition does not match the description given by the seller\". I was then sent an email informing me that I had been refunded SGD880 which is the sale price of the shoes. Less the authentication fee of SGD14.99, why are you charging me taxes of SGD61.59 for a sale that DID NOT GO THROUGH? I want the so called taxed amount to be refunded to me!\n\nThe emails sent to me also invite me to check the status of my refund on the app but I have been locked out of the app for some unfathomable reason - REPEATED attempts to log in indicate \"invalid email address\". This is a big sum of money involved which I am very anxious about. Is this a sham or some kind of a joke? I demand answers, and I want them quick.","title":"I paid a total of SGD956.98 (including…","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-26","author":"Harriet Mitchell","text":"Unreliable and poor service. This sets out my first and second time ever shopping through this company. Do not do it! Items do not match the description. Have been completely mis-sold, despite paying extra fees for VC to check the item conformed to the description and pictures. When I tried to complain, VC said that the information provided did not justify a return of the item to the Seller. There is no contact number which is appalling so you can not speak to anyone. I also ordered another item, my first ever purchase, with VC and its nearly a month and its still not arrived. I spoke to UPS, who told me the item is lost and that I need to get VC to call them to open an investigation, which I did and was subsequently told they would not do so until a further 14 days! Absurd! All the while VC are quite happy to take your money and not provide any service. They are a sham and frankly the worst company I have ever done business with. Do not shop with them. Pay extra and just buy the product from the brand, this behaviour and hassle is not worth the money and quite frankly I would give 0 stars if it could ! I have also heard this story repeated a number of times through my friends who also will never be shopping with them again.","title":"Unreliable and poor service. Appalling.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-26","author":"abdulrahman alomran","text":"Really really bad service i sold a couple of stuff through them I haven’t received my money till this day. They had issues with issuing shipping labels and i had to pay for shipping and it caused one of my products to be lost somewhere in the world. Customer service is the worst don’t even have a number to contact.  \n\nPSA. Dont use this company","title":"Never received my money this is a scam","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-26","author":"Sara","text":"Never experienced such bad customer service!!! I sold an item, and the item was unjustifiably returned to me (everything was okay with the item, and the buyer had no right to return it). I got an apology email from them saying they (Vestiaire) will buy the item, and they included a shipping label. Some of the information was missing, so I contacted customer service through the app. FIRSTLY, the agent was so impolite! He named me by my first name, and when I asked to be called Ms. (last name), he used MR.(last name) twice saying it's the same thing!!! He didn't even apologize, just ended the chat and left. I still did not get an update on my item, although I have been emailing them for 3 days already. Stay off this site and don't waste your time or money here. They don't respect women! The agent was named Alexander O. In addition, this was not the first time I experienced bad customer service. Worst. App. Ever.","title":"Worst customer service and misogynist company!!","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-26","author":"NKS","text":"Terrible customer service! \n\nI sold a pair of original Louboutin shoes. I had worn them for years and it was very clear that the brand name has worn off due to wear. The sale price was therefore only 40 euro. \n\nVC decided for some reason they are not authentic. It took them 6 months to give me an answer and claim the item is not real. \n\nI bought the shoes myself! I am a VIP seller with them, and won’t even know where to buy fake items. It’s absolutely terrible service!","title":"Terrible customer service","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-26","author":"Saeed Mirsadraee","text":"I bought a Chanel dress for over £1000 described as very good condition. On receipt I noticed several areas of snags in the garment and a big yellow discolouration on the white collar. I raised the issue with VC in less than an hour after I received the item. It took them a couple of days to get back to me to asked for photos and videos. After a few days they got back to say there is not a problem!! Also they said because it’s over 72 hours since the receipt of your item you can relist but they are charging £45 service fee!!!\nI mean how is this even legal in this day and age???\nHow dishonest and greedy!!????\nI have been buying from VC for years but I will definitely stop now and delete the app.\nSo unprofessional!","title":"I bought a Chanel dress for over £1000…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-27","author":"Daniella di Ambrosa","text":"I had shopped with Vestiaire for years and always loved the service and found some real gems. However, my birthday this year my partner purchased a pair of Valentino rockstuds as a gift. He paid for authentication but as soon as they arrived it was clear something was wrong. First off, the condition was not ‘very good’ as listed, but the shoes also had a terrible chemical odor. We immediately went online and found this was a sign of a fake item. Many other signs were also present including and incorrectly formatted authentication code in shoe and generally shoddy make. We told Vestiaire this but they assured us the item was genuine. So we took the item to a Valentino store, where we were told these things would not be expected on a genuine item. Vestiaire then allowed us to resubmit the shoes for authentication at their cost. We did, and they agreed with us and processed a refund. Three days later I received a notification from the Vestiaire app that the shoes were ‘back in stock’ and could be purchased directly from vestiare with free authentication. I reported via live chat that this must be a mistake, but had it confirmed to me that whilst this was the same pair of shoes, they had now passed authentication again. I made the assistant on the chat aware of the situation, but nothing is being done apart from a report being raised which will take at least 3 days to be addressed while the shoes remain on sale. This gives serious concern about Vestiaires authentication process as well the items that are already in their possession and pre-authenticated- how many of these have been returned due to inauthenticity? It is one thing to make a mistake and authenticate a fake, but to knowingly relist this fake item themselves as a pre-authenticated item and leave them for sale is fraudulent.","title":"WHAT WENT WRONG? STOP SELLING FAKES","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-27","author":"Louise ","text":"Appalling service & communication. Have kept my recently sold item for over two weeks & have not notified me or  seller that it’s still in the warehouse. What a disorganised & unprofessional company. And charging a high commission for a shoddy service? No thank you.","title":"Appalling service & communication","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-27","author":"Anna","text":"Dealing with this company had been nothing short of a nightmare. I sell more than I buy, whilst as a buyer it's been satisfactory so far fortunately, selling with them is another story. I have an authentic Chloe skirt that is held up at their warehouse somewhere because it was deemed 'counterfeit', in order to get it back I need to wire 12 euros to a foreign bank account excluding international handling fees. how is this even cost effective for international sellers to get it back? AND I was a given a bank account number over a chat, what happens after I wire the money if I haven't got a contact to reach afterwards? Wire you free money? Their customer service is HORRIBLE, everything you've read on trustpilot about their careless, rude and unhelpful customer service is true. \n\nCuration team- didn't have too much to complain about until recently over a span of three days, uploaded about 6 items and FIVE of them were refused. All of them authentic items in highly sellable condition-- Had there been some change with the selection criteria? Their chat bot\/human's response was simply because 'they could not confirm the authenticity', even if you upload giant close ups of the serial numbers, authenticity cards etc apparently it doesn't matter, and these are all big name brands which you would've thought these 'experts' would be able to determine a real from a fake. These guys had the nerve to come back to me after 72 hours (which is well over the 48 hour time span they promised) serially rejecting listings like they can't be bothered to look at it. After some pushback the chat guy finally ask the team to have a second look, and guess back, they've managed to accept SOME of the items & even slapped on a 'We Love' sticker?? How do you go from claiming that the listing doesn't look authentic to honoring an item as something 'We Love'? I'm currently waiting for them to have a 'second look' on the Saint Laurent bag which had a close up of the tag and barcode, but this is VC inconsistency at its finest, and to be honest I wouldn't even think about buying anything worth more than 100 EUROS on this platform given the level of incompetence of these so called 'experts'. What a joke.","title":"AWFUL TO THE POINT OF GIVING THIS SITE -1000","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-27","author":"Seda ","text":"Hello everyone I bought a big brand gianviti rossi boot which size is 37,5 my feet are 37 but this boots is tightly I sent many message for return I dispatched and they returned the item to me again so I lost my money..the company communication is not good, I cant get any help from them so I stopped to buy..my boots was checked 2 times for size but they approved the size 37,5 they are joking me..I said them \"you tried the boot on any 37,5 foot of women...I know they don't want to refund my money also they know this boot is not 37,5:)","title":"Hello everyone I bought a big brand…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-28","author":"Elizabeth","text":"If I could give less than one, I would. I received three items that weren’t as described. I contacted them and they refused to help me. One of the shirts I got was a white top that had been washed with blacks and was grey and completely damaged. They actually filtered my email and sent me a fake message saying that their support email was no longer in use but you could see they’d saved my email address, two of my friends emailed them and they both got a response, funny huh. It is actually abusive and manipulative to do that to someone. They accepted this item before they had even checked this issue and instead of rectifying it they avoid me, they’ve made a massive mistake accepting the item when it was clearly damaged and instead of fixing it the customer service team are avoiding it because they don’t want to get into trouble. \n\nYou are losing so many customers, I see this website have loads of issues similar to mine in recent days! The same customer service team who are being awful to me are also being awful to others. Sort this out! Clearly your team is not good if hundreds and thousands of people are saying the same thing. This is how you lose customers. I will tell the world not to use this site anymore! \n\nHonestly everyone who reads this, use the OUTNET, it’s authentic, it’s discounted and you can return everything! They are a legit company! To have a rating of 3.2 out for nearly 4000 reviews. Alarm bells! \n\nI will never use this again. The staff and company are awful.","title":"Sick. The staff are awful and what they’ve done is unacceptable.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-28","author":"David Eduard","text":"Very bad company, very bad services, DO NO TRUST. I’ve sent a Gucci hoodie in order to sell it. After 1 week, they’ve told me that they still did not receive the hoodie. I asked the delivery company and they provided me a proof of delivery. They got my hoodie for free without paying me the money for it. And I also had to pay the transport 50 euro. So i lost 50 euro + the sale price of the hoodie. \nI am going to suit them, but anyway, DONT TRUST AND DONT USE THEIR SERVICES!!!!!!","title":"Very bad company","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-28","author":"UNDLU","text":"Two bad experiences. \n\nBag advertised as very good condition, bag was very worn with loads of stains. \n\nCheckout issues, payment took twice but order didn't go through so missed out on an item.","title":"Two bad experiences","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"},{"date":"2020-10-29","author":"Renata","text":"Dear vestiairecollective team,\n\nplease change your courier company.\nNow when you ship items by CHRONO  its terrible, i have to wait more them week to receive my items. \n\n1. Have to wait few days maybe weeks when seller send item to you (you canot change, i understand)\n2. Control 1-4 days\n3. Shipment 1-2 days\n4. Have to wait for package probably 7days, if you are interest about your customers please think about it, its very imporatnt. Before by DHL i always had my package next day when you sent to me from France.\n\nI am waiting for your answer, thank you","title":"Dear vestiairecollective team,","stars":3,"location":"SK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=92&stars=1&stars=2&stars=3"}]