[{"date":"2021-02-16","author":"türkan yıldız","text":"Customee services is useless and never suggest real solution. They r just pretending they have customer service. Takes very high commissions and for nothing... I am not a member anymore","title":"Horrible customer service","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-16","author":"Sophie Garbers","text":"Unfortunately you cannot trust the \"authenticating\" process. I was so looking forward to the product I bought, and on the pictures it actually looked good and the seller had good reviews. Apparently all fake. I paid for the authentication process, but when the package arrived, even an untrained eye could immediately identify that it's a fake.. haven't heard anything from them since and paid a good chunk of money. If you want to buy second hand, do it at some other place.. this is not worth the stress!","title":"Fake product despite \"authentication service\"","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-16","author":"Jayde L","text":"0 stars. \n\nI just want to say before I start, I’m sure someone from Vestiaire occasionally reads these reviews and shrugs them off. What I’d like to say to the CEO is that little by little, bad reviews pile up, word eventually gets round, media and publications will stop working with you and mentioning the brand and then usually at this point a company will begin to go into administration. \n\nSo enjoy being dishonest and doing wrong by people because it might not make any difference now but it will. \n\nI have listed with them before but today I’m leaving a review as a potential buyer. \n\nI cannot stress this enough - stay away from this site. I don’t believe they authenticate anything and even if they are, I don’t believe they have the skills to do so properly. \n\nThey charge the buyer a control and authentication charge, (fine and understandable if you can actually trust they are doing that). Apparently this charge is optional (it’s not). \n\nUnless you have a genuine sales receipt, don’t go near it is my advice. \n\nSo I get to checkout on an item I’m not entirely sure about being genuine anyway, no assurances whatsoever apart from some random in a warehouse looking at it I’m guessing. I then see they’ve whacked on a £39 postal charge! \n\nConveniently, they only have 4 listed countries that allow direct shipping. For no logical rhyme or reason. I post items internationally all the time for work, it doesn’t cost £39 to ship a purse to the UK with any shipping company. \nRoyal Mail charge £7 international tracked. \n\nBasically they are lying and stealing the excess postage (which is illegal). \n\nThis company are untrustworthy and do not have the buyer or sellers best interest at heart. They really are not what they say they are.","title":"0 stars","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-17","author":"Fabrice","text":"For seller: very high commission.\nFor buyer: you need to be very cautious. VC claims they have expertise but they don't. I contact them about some false advertisement on the website i encountered, they insist that their team made no mistake. They don't even check it after i notify them with good intention?  \n\nFor example, Reference: 13057886, anyone with slight knowledge of fur can discern that the product is made of Rex Rabbit. (which cost 200-500 eur for a long coat like that).  It is so obvious, different color, different pattern, you can't miss it. But the seller insist that the product is Chinchilla. (which would cost 8000-10000eur). And the seller is completely lying to people in the comment section about the composition of the coat. People without knowledge about fur and who think they got a bargain will buy this. \nIronically, this seller is \"trusted seller\", lol, fooling people, and VC does nothing about it.\n\n\nImagine this fake coat gets sold, and the seller sends the \"fake\"chinchilla coat to VC, and VC saw that yea it is fur and it looks exactly like the picture, they will send it to the buyer and the buyer can't claim money back.","title":"Very high commission; insufficient knowledge from VC team.","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-17","author":"Ziva","text":"I have been a seller for over a year and have sold 40 items. Last month I sold a necklace and it got damaged ( I have provided photos to customer care as it was intact when sent to HQ) and later received a voucher and apology but had to seek an official report and explanation. It was sent back to me for free. This month I had a sale cancelled because it was stated that the Chloe bag could not be authenticated. Again no photos no official report which I have asked for and also a charge of 12 EUR to get my belonging sent back to me. Holding back someone's belonging is an offence. I have since tried to transfer via my bank ( which does not allow transfers low like that) and  via Western union which does not allow to send to companies. I am still awaiting for an official report and a different way of paying the 12 eur to get my bag back. Today the expert seller badge was removed and so was the trusted seller one and no email reply re that query. The bag where the sale was cancelled was deleted with no trace from my profile. I know for a fact that a same brand bag was refused from another seller previously and disputed as it was considered a private sale and was later cancelled, re-listed and sold on this sane platform both listings are still there. I feel that this platform has made nice money from my sales but would appreciate some clarity and assistance and no double standards. I am happy to provide print screens. I have read other horror reviews here and elsewhere and this is just terrible customer care service.","title":"I have been a Tursted seller for over a year but now I am scammed by Vestiaire","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-17","author":"Tina Cholla","text":"Horrible company... I will always say Never use this company unless you really need to sell your items !! \n\nThey changed the payment system so they can take your money !! I tried several times to add the appropriate information and it doesn’t work. I sold items and because the system doesn’t accept the banks name I am not getting my money back !! Don’t sell things here","title":"Horrible company..","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-17","author":"Tim","text":"So, having watched the process of an item we purchased go from UK to France (Get taxed) and then come back to UK. The item (which was sent to France for authenticity checks) Arrived to us in UK (taxed again) and guess what? totally fake! and now going through refund process. Not even the same colour item (was white, arrived Beige).........£1400 for Chanel suspenders, and they do not have a clue what they are doing!!","title":"Follow up.......Fake Item, sent back","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-17","author":"Sophie","text":"Bad experiences as a buyer and as a seller. 2 purchases in a couple of weeks are canceled. First cancellation was on the sellers demand, second was made by VC, the seller shipped the item, while VC claims that the seller didn t ship the item, why on earth would she lie about that? I got an email from VC that the seller has cancelled the sale ( after 5 days !) lies!! Because I know that the seller did ship the item but VC decided to send the item back because of the wrong format??? I also did use a promotional code to get an extra discount, so no order, bye bye promotional code!\nI sold a Burberry coat in very good condition. Shipped it to their warehouse. Received an email with an invitation to click on a link to get access to their quality report, apparently there was a small flaw dedected, so they decided to offer a 20 euro s discount on my behalf to the seller! Such arrogance! I never had access to the quality report so for all I know they could have been lying...why could I not see the pictures with the so called small flaw? Someone from the expert team was going to come back to me, guess what...waited for a week and decided to go ahead with the sale,to avoid all the fuss...\nYou re getting so many bad reviews lately and apparently you couldn t care less...you don t even reply to the reviews published here on Trustpilot anymore ...says a lot...","title":"Bad experiences","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-17","author":"Heather","text":"If I could give a 0 star, I would. I bought a sweater supposedly a size 6 (based on the pictures showing on their website). However, when I received the item, I found a completely different size label on it. The sweater is a size 40, which is an equivalent of US size 4, too small for me. Also, the brand label ( loro piana) is not the original label, meaning the sweater is a fake. When I try to ask for return and refund, and cancel my other orders, their customer service e mail account becomes unavailable. Lousy and deceptive business. I wish I read the reviews here before I placed my orders. Now I expected more nightmares to come because I have two more orders with them that I can’t cancel or get my money back. Don’t buy or sell anything with them.","title":"Lousy and deceptive business","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-18","author":"rachel","text":"scam company right here, PLEASE DO NOT BUY ANY TAXABLE ITEMS FROM VESTIARE. As i am in singapore, vestiare claims to \"make things easier\" for buyers by including all \"IMPORT DUTIES AND TAXES\" in the final payment. so i went and made final payment, having been ALREADY CHARGED for the IMPORT DUTIES AND TAXES through vestiare. I see this \"IMPORT DUTIES AND TAXES\" in my payment invoice, so i know for sure that it has been included in the final payment. I then waited almost 3 weeks for the bag, but i understand this is due to stringent authentication processes. however, when the bag finally reached my doorstep, i was asked to pay IMPORT DUTIES AND TAXES on it. AGAIN. i have also spoken with a few others who bought a taxable item off vestiare, and they have verified that they did not have to PAY DUTIES A SECOND TIME, when it was delivered to them, as it was already INCLUDED in the final payment. with this, i had to turn the bag away at my door and wait for vestiare's response and confirmation on the IMPORT DUTIES AND TAXES.\n\nwith this, i have emailed the vestiare support team multiple times, but i havent received a response. it has been THREE BUSINESS DAYS, and not even an email of acknowledgement from the vestiare team. this happened despite vestiare CLAIMING that i will hear back from their team within AN AVERAGE OF 24 HOURS. WHAT A JOKE.\n\ni have constantly been in contact with the courier company who was to collect the IMPORT DUTIES AND TAXES, and they have been trying to get in contact with vestiare as well, and they have only been ignored.\n\nI then got on the live chat in the vestiare app, and all the employee could tell me was 1) \"if the customs fees aren't paid, The package will be shipped back to us. Once we receive it, we'll list the item on your account for resale. Once the piece is sold, we'll ship it out to the buyer and you'll receive the proceeds from the sale.\" ; 2) \"To learn more about fees you can visit our Vestiaire Collective Help Center and search How much are customs fees for my order and how do I pay them?\" ; 3) \"go to Vestiaire Collective Help Center and search for How do I contact Vestiaire Collective?\". HOW INFURIATING AN EXPERIENCE!!\n\nOut of fear that the item will merely be sent back to vestiare to be resold, I DID NOT HAVE A CHOICE BUT TO PAY A SECOND ROUND OF IMPORT DUTIES AND TAXES.\n\nvestiare is a company that SCAMS, SWALLOWING our import duties despite supposedly \"making things simpler for the buyer\" by INCLUDING \"IMPORT DUTIES AND TAXES\" in the final payment.\n\nplease do yourselves a favour, and STAY AWAY FROM VC. I regret not seeing this page before going ahead with the purchase.","title":"DOUBLE IMPORT DUTIES LOL WHAT A SCAM","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-18","author":"Stella Glykanissou","text":"Do not pay more for a subscription!!\nThey promise that you have benefits by being a premium subscriber, at the end of the day you gain nothing, just extra cost.\nFurther, they allow sellers to list producsts with not the actual photos of the product, and you end up receiving something on a different colour that what you thought you order. AVOI AVOID AVOID","title":"Do not pay more for a subscription!!","stars":1,"location":"CY","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-18","author":"junqian Liu","text":"I have been using this website since very long time, they charge a very high commission but the over all service is ok till 2019. Recently I sell a balenciaga bag , which I purchased from my Theresa in Munich 8 years ago, of course I don’t have the invoice any more. ‘ expert ‘ from this website told me it is not authentic via email without proving any evidence and cancelled the deal, i doute their expertise and they simply abuse the power and shift all risk at seller side. Never ever!","title":"I have been using this website since…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-18","author":"Karen","text":"I sold an item on Vestiaire on Dec 29th 2020. By mid-Jan I hadn’t heard anything. I contacted them on their chat line and was told that the item hadn’t been accepted and that it would be sent back. It didn’t arrive, so about a week later I contacted them again. The ‘support agent’ told me I needed to collect the item from a UPS depot. In France!!! I’m in locked down Kent, UK.\nI contacted them again and, guess what?? My item HAD sold (as confirmed by the sold status on my account). The ‘support agent’ told me I would be paid. I waited. And waited. No money into my PayPal account. I contacted them AGAIN. This time I was told I would be paid by the end of the day. Still no money. I contacted them again and was told that the payment was scheduled for the 17th Feb. Surprise! No payment! \nI contacted them at the end of the day, the ‘support agent’ apologised and promised to do something. Still no money!! \nNow, I think they’ve blocked me - I can’t seem to get past that irritating Leo chatbot to speak to a ‘real’ person. And, of course no phone number to call!! \nThe money involved is £18 - absolutely nothing, but it’s the principle! And how do they know I’m not desperate? Effectively, it’s stealing! \nI know I’m perpetuating the ‘Karen’ trope - but I’m seriously annoyed.","title":"I sold an item on Vestiaire on Dec 29th…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-18","author":"Paulina Paulina","text":"So they refused my item, because pictures were too nice. WAT? How do you sell fashion well without proper photos? It’s like completely out of context - in VC understanding it’s “buyer protection” so fu*k that, I have lowered the quality, to protect buyers from HD. On the other hand, they let the sellers post indeed shi*ty pictures of items the sellers don’t have. Two times within two weeks I have paid for an item which never was send to me. Everytime I’ve lost 10€ on currency conversion  back and forth - so all together ca. 20€ wasted on nothing and no consequences to the dishonest sellers whatsoever. They are still there, selling the s**t they don’t have and I can’t even leave them the review. I’m as disappointed as one can get. It’s like high school science project, not actual business concept.","title":"I need an explanation here","stars":2,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-19","author":"Andrea Davies","text":"Firstly, the listing for the item I bought disappeared the moment I made the purchase, I cannot access it either through web\/desktop or the app, I can’t even see who the seller is. Which blocks me from this contacting seller and cancelling the item. I don’t even know if the original seller is getting paid from how freely you screw people over. Your chat help was not able to resolve this for me, I had to ask for pictures of the item. HUGE lack of transparency. Upon zooming into the pictures very thoroughly I noticed that the bag has a tear in it\/a white patch on the surface close to a corner. The description said light wear. This is NOT light wear. I can’t even provide you proof of that because I don’t have access to the listing, which is on you guys. I spoke to another chat agent, she told me various inaccurate things and refused to directly answer my question, such as the item had not been shipped whilst your platform said it had, that I had to contact the seller, which your site has blocked me from doing as I can’t access the listing OR see the seller page. She offered me no solutions. This item is non compliant and your customer service has been ABISMAL. The more reviews I read online the more they are supporting my suspicion that your authentication team is not qualified and sent dodgy\/fake\/non-compliant items on to buyers anyway.\n\nYour service has been extremely disappointing and the item clearly non-compliant, considering I have used Vestiaire in the past and have had no issues I am shocked, but I realize now that buying directly from a seller is one thing, buying through YOU, IS A SCAM. I am really quite annoyed at the lack of transparency from your team and platform. Your customer service’s failure to provide the right information is shameful, they block the customer support email when they don’t want to answer the query! They do not answer any questions directly! I’ve been told different things that do not address my query by different people, and then they just start ignoring you. some of the responses were so poorly written they didn’t even make sense. How is that acceptable?! This site is a scam. SO annoyed.","title":"Buying through them is a SCAM","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-19","author":"customer","text":"My purchase of a second hand LV bag went smoothly however there are taxes\/duties added to the shipping, I live in Australia and we do not yet charged extra taxes or duties for personally purchased items, therefor it’s just extra money for Vestiaire Collective. I probably won’t use them again just for this reason.","title":"My purchase of a second hand LV bag…","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-19","author":"Olivia More","text":"What a mess Vestiaire Collective is. My second time selling on this horrible site I was trying to sell a Saint Laurent bag with direct shipping and it was like pulling individual teeth out it was so painful. There are so many technical glitches and such awful customer service that will pretty much ruin your experience.  My buyer tried to buy it on the app and it didn't work, so VC told her to try it on the website. It didn't work both ways, so she tried paying by Paypal - direct shipping didn't work if she did this. Tried Klarna - didn't work. Tried paying with three different cards and she tried her husband's card - didn't work because of a 'technical error\" on VC. I lost out on a sale due to this because when I contacted customer service, Vestiaire kept saying that my item wasn't available because I was on holiday? I never put myself on holiday mode and didn't even know it was a thing until they told me! The kicker is that I haven't even been paid for my first sale (800euros), even though I have the tracking confirmation that it was delivered in January, the buyer was happy (I messaged her), and all my payment details are 100% correct. I contacted customer service and they just ended my chat halfway through - how lazy and unprofessional, they really don't care about their selers that are making them money (from the HIGH commission they take from your sales). Avoid at all costs if you don't want a big headache and unnecessary extra stress.","title":"AVOID AVOID AVOID","stars":1,"location":"NZ","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-19","author":"Stacy Warburton","text":"I have been selling on VC since november 2020, and what a farce!\n\nFirstly sent a new suede jacket to VC head office, was told either reduce or we keep it here due to a mark on front so buyer refused.  No mark was on jacket, it was brand new and immaculate\n\nSecondly sold dior vest have been underpaid complained 3 times still nothing done about it\n\nBarred from messaging interested buyers as i mentioned another site\n\nSold a dior bracelet, i only buy from selfridges dior boutique, harrods and harvey nics, rejected by VC authorisation team as fake.  Told pay £13 to get back\n\nSold joseph sweater, in very good condition , said couple beads loose, was told would be returned as very poor quality. Received back 22 days later signs of obvious wear, deodrant marks and reeks of cigarette smoke. I complained but fell on deaf ears.\n\nListed a bracelet, new, perfect still tagged, when they listed it live the title had been changed to pearl bracelet, i listed as bead bracelet. Pearls was not mentioned in description either just beads.  Item to be reduced as material wrong, some scratches, i have zoomed in on my pics no scratches, and oxidated metallic parts, again a lie.\nReduce by £6 or pay £13 to get it back\n\nTried customer \"chat\" as this is the only way to contact VC no help at all\n\nDO NOT USE THIS SITE UNLESS ABSOLUTELY NOWHERE ELSE TO SELL, THEY LIE!!!!","title":"Sellers beware they lie…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-19","author":"A K","text":"Before I start, let me just mention how ridiculous these fake glorious feedbacks look like! Even the bots they're paying for are not doing quality job. Funny wording, a couple words, not even complete sentences, zero details, ZERO actual experience, VC do you truly believe people are complete fools? This fake bs is clearly seen from a mile away! At least invest in better quality fake reviews! Sad how instead of solving actual issues they're just trying to cover it with a ton of fake fairy dust. This is where the investors funds go\n Now my latest order #35272544 - 2410 euros paid for an item with two huge areas of damaged material and entirely worn off brand logos right on the front! The material is chipped off, not repairable! Not a word in the description and -tadaaam!! - very good condition confirmed by their quality control team. I'm feeling sorry for them: so desperate to make a sale, they're ready to let any junk pass their quality check. Reducing commission again and again but the ACTUAL negative reviews are only piling up!  \n  Expectedly, their customer service didn't lift a finger and offered me to list this damaged item within 72 hours with no fee if it doesn't meet my expectation! The problem is though - it doesn't match the description and even their own standards for item's condition. Thanks God I paid via Paypal so the dispute is on the way!\nPeople! Like I already said in my other review - ONLY PAY WITH PAYPAL so you're protected against any possible scam they'd try to pull off! If you paid via credit card, don't hesitate to file a chargeback with your bank. VC doesn't care for your satisfaction, they only care for their fees they gain from every sale so naturally they're striving to complete as many sales as possible.","title":"Another high ticker order and another disaster!","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"},{"date":"2021-02-19","author":"A K","text":"Another high ticker order and another disaster!\nBefore I start, let me just mention how ridiculous these fake glorious feedbacks look like! Even the bots they're paying for are not doing quality job. Funny wording, a couple, zero details, ZERO actual experience, VC do you truly believe people are complete fools? This fake bs is clearly seen from a mile away! At least invest in better quality fake reviews! Sad how instead of solving actual issues they're just trying to cover it with a ton of fake fairy dust. This is where the investors funds go\nNow my latest order #35272544 - 2410 euros paid for an item with two huge areas of damaged material and entirely worn off brand logos right on the front! The material is chipped off, not repairable! Not a word in the description and -tadaaam!! - very good condition confirmed by their quality control team. I'm feeling sorry for them: so desperate to make a sale, they're ready to let any junk pass their quality check. Reducing commission again and again but the ACTUAL negative reviews are only piling up!\nExpectedly, their customer service didn't lift a finger and offered me to list this damaged item within 72 hours with no fee if it doesn't meet my expectation! The problem is though - it doesn't match the description and even their own standards for item's condition. Thanks God I paid via Paypal so the dispute is on the way!\nPeople! Like I already said in my other review - ONLY PAY WITH PAYPAL so you're protected against any possible scam they'd try to pull off! If you paid via credit card, don't hesitate to file a chargeback with your bank. VC doesn't care for your satisfaction, they only care for their fees they gain from every sale so naturally they're striving to complete as many sales as possible.","title":"Another high ticker order and another…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=72&stars=1&stars=2&stars=3"}]