[{"date":"2020-09-12","author":"JGreen","text":"I bought a bag which had different measurements that the measurements given on the website. The company does not want to accept it even though the difference is quite big, for example the hight of the bag should be 11 inches but is just 9.5. \nThey quality control team sent me an email without a proper explanation or prove.\nAs I paid extra for their quality control services, l expected the sale to be safe and l expected the item to match the description from the website. Unfortunately this did not happen.\n\nThe company has finally accepted my claims, hence 3 stars. However, l still do not understand why it took so much time, so many emails and why l had to send the item twice for the check.","title":"I bought a bag which had different…","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-12","author":"JW G","text":"Bought a Louis Vuitton bag for $1400 - took two weeks to arrive after quality and authenticity check.  Bag is 100% fake.  Absolutely no manufacture date stamp or serial number on the item.  Stitching is bad, credit card cutouts are rough (no Louis Vuitton would ever look like this).  Contacted Vestiaire - they provided a shipping label to send it back.  Took 15 days for the latest 2nd level check - results - \"we are shipping the item back to you\".  I asked why - it's fake.  Customer service tells me its verified - I asked how?  Since 1980 all Louis Vuitton purses are stamped - nothing on this one at all.  \n\nInformed them that I am filing with American Express and reporting them to Louis Vuitton and federal authorities for pushing fake designers in the USA.  \n\nThis site is terrible, don't buy from them ever.","title":"Fake Louis Vuitton bag bought for $1400","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-13","author":"Sophie","text":"Unfortunately I have the feeling that issues only can be solved when leaving a bad review. Frankly contacting customerservice is crap. I ve contacted Alexander O, Adele, Madeleine G and Nati and nobody cared, let alone solved it, false promesses yes, we are going to do this, we are going to do that...FYI I kept all the chat conversations with above mentionned staff, just in case...\nLast week I sold 2 items, 3093975 and 3094002 to the same person, Darja. One shipping label, the one for item 3094002 wasn t valid, so I contacted customerservice via chat. A certain Nati told me that this wasn t a problem, and that could ship both sweaters in one box, since both sweaters were bought by one and the same person. The following day both sweaters were shipped, using the shippinglabel for item 3093975. Both sweaters arrived the following day. Asked the buyer if she did receive both sweaters, which she did ( please check comments under item 3094002) she even emailed to you to confirm that she also received the grey sweater. Guess what? I only got paid for item 3093975! I don t know what the problem is? Why making it so difficult? What more proof do you need? Frankly I m not a fan of direct shipping either...buyers can decide whatever they  want, they can damage your item and say that it arrived damaged, in order to get their money back. Fortunately the buyer of the sweaters was so honest to\nadmit that she received both sweaters...love to hear your feedback and to receive my money asap\n\n\n\nUpdate\n\nA bit later I received an email from Alexander O. Apparently the internet connection was lost so he could not be of assistance during the chat. Good news, the money has been transferred to my wallet, special thanks to Alexander! However I m still convinced that 9 out of 10 people from customercare are useless...I gave you already some names in my previous review...","title":"Still waiting for my money....and I received it","stars":3,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-13","author":"Anonymous ","text":"Refused to give refund had to open a dispute with my bank to allow them to handle it, there was absolutely no way to stop the premium monthly $12 charge so I had to dispute those transactions and let my bank know to put a stop payment on Vestiaire collective. They are truly thieves and are really bad at it, the online chat is virtually useless and everything has to get escalated even though they never follow through with their fake investigations. These people are scammers !!!!!!!!!!!!","title":"SCAMMERS, BUYERS BEWARE !!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-13","author":"Ashley","text":"Hi there\n\nAll your emails are is no longer working. Could you please forward this email to the right department about my items.\n\n\nBelow are the shipping information I used in October 2019 if you can check on your system,  UPS, Colissimo (parcel force, royal mail)  and all your ware houses for my items and records if they were ever sold\n\nTom Ford Grey python sandals Size EU35 came with dust bag and box.\nJimmy Choo x Off-White  Red Boots Size EU36 came with dust bag only.\n\nI will be doing a youtube review on my channel about this issue if I don’t get any reply or resolve about my items. And I will  leave it to my Lawyer after that to handle this issue. I have been trying to get in contact with you guys since November 2019 about my items which all my emails to your consignment department you ignored after i had spoken to your customer service of the phone (*before you cut your phoneline service) they confirmed they received my items and they will be listing them soon but I have to wait because you guys had a lot of items. I also have also contacted all delivery services because its over 120 days there are no records of the person who received it. Also the Ups Pick up was never for my Burberry bralet as it was supposed to be shipped by Colissimo (Parcel force, Royal Mail)  to 225BOULEVARD PEREIRE 75017 PARIS FRANCE as it was sold on my account on your website but i never sent it . The Ups pick up was for consignment service for three items Hermes slippers, Jimmy choo x Offwhite boots and Tom Ford sandals to 65 RUE DE LUNION, 59200 TOURCOING FRANCE.","title":"Not helpful!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-14","author":"Ekaterina ","text":"I don’t recommend selling there. They treat sellers really bad. Customer service is horrible, you can’t even call there. They can’t authenticate the item correct. And the fees are crazy high.","title":"I don’t recommend selling there","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-15","author":"EG","text":"As a regular customer of Vestiaire, 3 out of 5 purchases end up with the item NOT being in the condition stated. I've had to battle with them through PayPal numerous times after they denied refunds even after a second inspection. Why do I keep using them? I've gotten some good things despite the hassle. And of course I always win any battle because PayPal and my credit card back me up - and ultimately I am right. \n\nI used to get a £15 voucher every time they made a mistake. These days I'm lucky if I get an apology! I think they just literally do not check the garments before sending them (but you pay for this service). \n\nThis time, I ordered a coat that was meant to be in Very Good Condition. The hem was completely un-sewn on the bottom of the coat, and on one sleeve, making this 100% false advertising! It cost me £60 to repair and they would only reimburse £40. \n\nOn top of all of this, the coat was already at the Vestiaire Concierge Service so Vestiaire themselves KNEW the coat was not in Very Good Condition but they DECLINED my first offer, which was £29 lower than what I ended up paying. Then they blatantly sent a coat that they knew was not in Very Good Condition, said I could repair it, didn't reimburse me the full cost of the repair. And the whole time, they could've taken my first offer given that it was not in the condition stated - and this would've helped cover the repair. \n\nI just want the money I had to pay out of pocket for their mistake! And I want to be treated nicely:\n\nWhen I asked if they could give me the full £60 (after providing the receipt for the repair) they did the whole \"as per our previous email\" thing and said: \"As I have stated on the previous email, we are not able to offer higher than 40 GBP.\" ...As if I hadn't read their previous email.  Total insult.\n\nTotal nightmare. I've spent thousands with them and this is how they treat me!\n\nUnless they see this and honor the first offer I made or reimburse the additional repair fee, I'm done with Vestiaire.","title":"As a regular customer of Vestiaire","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-15","author":"shun","text":"Have a complete production and sales work line\n\nI sold an LV bag, but I haven't received my money until 3 weeks, a fraud company.\nCS has been delaying time and shirking responsibility and then has not received the so-called team email\n\ndon't use these apps","title":"fraud company!!!!!!","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-16","author":"Alice Freeman","text":"Efficient and diligent when checking the authenticity of items - therefore, great for buyers. However, if you are a seller and you have a fantastic in-season item that’s in great condition, don’t be surprised if they now and then push back hard on the price before it is listed publicly online. Sometimes to the extent that it’s offensive seeing as similar brands of a substandard quality are already online at a higher price. When you eventually acquiesce to their proposed price, then it coincidentally sells within a minute. It’s clear that their in-house team have first dibs on items that are submitted to the extent that they refuse to let it go online unless a member of their team is able to purchase it. I advise individuals to sell their items on multiple platforms to get a clear idea of the market value of an item. Don’t settle for less.","title":"Don’t give in to unfair negotiations from Vestiaire’s in-house team","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-16","author":"Anna A.","text":"Hello,\nWould like to share my worst ever experience I had with Vestiaire Collective as a seller .\nWhen I registered I clearly indicating my location and it was mentioned the shipping is FOC. However, when my item was purchased and I had to ship , it turned out that I had to bear all charges as I am based in the UAE.  There is no clear information on the site for a seller to see if the location you are based in falls under free shipping or not .\nThis is ridiculous and doesn’t make any sense to list any items if you pay for shipping  as they already put a lot of pressure on bringing prices down not to mention high commissions. \nI had to cancel my listing at the end . \nA very disappointing experience and customer service !","title":"Hello,","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-16","author":"Serene Khoo","text":"*UPDATED. 2nd Review: 17 Sep 2020*\nVESTIARE COLLECTIVE = LIARS\nItem: 6196774393\n\nA representative from Vestiare Collective replied me below saying that one of their experienced advisors is already in touch with me through email today and made me an offer. LIES!!! I checked my inbox and spam mail etc. NOTHING. They are just trying to make themselves look good here and scam more people!! \n\nPlease do NOT fall for this company's tricks. You will end up a victim like many of us! Do NOT waste your hard earned money on this company. I have never had a worst online shopping experience ever. BEWARE people!! They ignore every single avenue I used to try to reach out to them. They did NOT reply to my emails, my messages through their Help Center and on Instagram. \n\nI have already gotten in touch with our family lawyer today. If VC still do not refund me, I will let my lawyer settle this fraud case.\n\n*1st Review: 16 Sep 2020*\nI wished I read all these reviews on Vestiare Collective before I started purchasing from them. It has been an utter nightmare and a total waste of precious time. I am a heavy online shopper and have been doing so for over the past decade, with 90% of my shopping done online. This is by far the worst experience I have ever had. I do not wish this upon anyone. Future customers of Vestiare Collective, please beware!\n\nI placed a total of 7 orders within a 2 month period since I joined VC in July and accepted 6 of the orders even though the condition were not always graded accurately (I only go for 'Never Worn with Tags' or 'Never Worn' items). However, my most recent order of a Louis Vuitton Murakami Multicolor Zippy Coin Purse that I paid a premium for its 'Never Worn' condition arrived so dirty and used that I dared not even touch it. I paid a premium because I wanted to keep it as a collector's piece as it was no longer in production and was a piece I was missing in my Murakami collection. The condition of the wallet is so disgusting and I do not know how in the world it was assessed and graded as a 'Never Worn' piece.\n\nI sent several pictures of the wallet with its terrible condition clearly shown and sent the item back to VC a week ago, on 9 Sep, and did not receive any updates after I asked them if they had received my returned item. DHL tracking showed that they received and sign for the item on 10 Sep but no email or update was sent to me. They only emailed me back a day later after I reached out to them via the Help Center and IG direct message, letting me know that they have received my return product.\n\nOver the next few days, I checked with them via the Help Center, emails and IG messages on my refund status but received ZERO replies. I have screenshots of them having 'SEEN' my IG messages but there was no response from them whatsoever. I was so polite and cordial initially but this company is a bully! This is NOT RIGHT!!! Treat your customers right!!!\n\nI HAVE NO GOODS AND NO REFUND FROM THEM. According to the Vestiare Collective website, it is stated that once the item has been sent and they have seen the shipping receipt as proof, they will reimburse me fully for the purchase. WHERE is my reimbursement? WHERE is the FULL REFUND promised on their website?\n\nI have tried so many avenues to reach some sort of assistance from Vestiare Collective but to no avail. I have screenshots of them ignoring my pleas for help! Shame on you, VC!!\n\nI will not be bullied into silence! I demand a satisfactory reply and my full refund. This is not the way to treat anyone!!!!!!","title":"A TOTAL NIGHTMARE. The WORST online shopping platform with the most terrible and inefficient customer service. NEVER AGAIN.","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-16","author":"Amc","text":"Terrible customer service -Rude, unhelpful . I’d think twice before shopping with them again - unless the transaction runs smoothly do not expect any help, politeness or your problem resolved .","title":"Terrible customer service -Rude","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-17","author":"Kid Cavalli","text":"Worst Experience in Shopping with a Online website 🤦‍♂️ Not Helpful at all. No way of contacting them customer care phone number they provide doesn’t work at all.👎 still hasn’t receive my item and money been taken frm my account. (NOT TRUST WORTHY) ❌","title":"Worst Experience in Shopping with a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-17","author":"Serene Khoo","text":"*UPDATED* 23 Sep 2020\nItem: 6196774393\nVESTIAIRE COLLECTIVE  PRETENDS TO ADDRESS ISSUES ON TRUSTPILOT.COM\n\nIt is very unnerving how Vestiaire Collective pretends to 'help' and 'try to resolve' our issues through their replies BUT in truth, NOTHING IS DONE. Even after using the link provided below in their replies, I have yet to receive any response, whether through email, IG messages or Help Center. They just MADE OFF with my returned product and MONEY.\n\nDO NOT TRUST THESE SCAMMERS. IT HAS NOW BEEN OVER 2 WEEKS SINCE I RETURNED MY PRODUCT BUT I RECEIVED NO RESPONSE OR REFUND. I have tried all avenues to reach out to them but to no avail. The ONLY RESPONSE I ever received are all the cookie cutter and pretentious replies that they use on TRUSTPILOT.COM. It is all a lie. PLEASE DO NOT USE VESTIAIRE COLLECTIVE. DO NOT BECOME THE NEXT VICTIM.\n\n2nd Review: 17 Sep 2020*\nVESTIARE COLLECTIVE = LIARS\nItem: 6196774393\n\nA representative from Vestiare Collective replied me saying that one of their experienced advisors is already in touch with me through email today and made me an offer. LIES!!! I checked my inbox and spam mail etc. NOTHING. They are just trying to make themselves look good here and scam more people!!\n\nPlease do NOT fall for this company's tricks. You will end up a victim like many of us! Do NOT waste your hard earned money on this company. I have never had a worst online shopping experience ever. BEWARE people!! They ignore every single avenue I used to try to reach out to them. They did NOT reply to my emails, my messages through their Help Center and on Instagram.\n\nI have already gotten in touch with our family lawyer today. If VC still do not refund me, I will let my lawyer settle this fraud case.\n\n*1st Review: 16 Sep 2020*\nI wished I read all these reviews on Vestiare Collective before I started purchasing from them. It has been an utter nightmare and a total waste of precious time. I am a heavy online shopper and have been doing so for over the past decade, with 90% of my shopping done online. This is by far the worst experience I have ever had. I do not wish this upon anyone. Future customers of Vestiare Collective, please beware!\n\nI placed a total of 7 orders within a 2 month period since I joined VC in July and accepted 6 of the orders even though the condition were not always graded accurately (I only go for 'Never Worn with Tags' or 'Never Worn' items). However, my most recent order of a Louis Vuitton Murakami Multicolor Zippy Coin Purse that I paid a premium for its 'Never Worn' condition arrived so dirty and used that I dared not even touch it. I paid a premium because I wanted to keep it as a collector's piece as it was no longer in production and was a piece I was missing in my Murakami collection. The condition of the wallet is so disgusting and I do not know how in the world it was assessed and graded as a 'Never Worn' piece.\n\nI sent several pictures of the wallet with its terrible condition clearly shown and sent the item back to VC a week ago, on 9 Sep, and did not receive any updates after I asked them if they had received my returned item. DHL tracking showed that they received and sign for the item on 10 Sep but no email or update was sent to me. They only emailed me back a day later after I reached out to them via the Help Center and IG direct message, letting me know that they have received my return product.\n\nOver the next few days, I checked with them via the Help Center, emails and IG messages on my refund status but received ZERO replies. I have screenshots of them having 'SEEN' my IG messages but there was no response from them whatsoever. I was so polite and cordial initially but this company is a bully! This is NOT RIGHT!!! Treat your customers right!!!\n\nI HAVE NO GOODS AND NO REFUND FROM THEM. According to the Vestiare Collective website, it is stated that once the item has been sent and they have seen the shipping receipt as proof, they will reimburse me fully for the purchase. WHERE is my reimbursement? WHERE is the FULL REFUND promised on their website?\n\nI have tried so many avenues to reach some sort of assistance from Vestiare Collective but to no avail. I have screenshots of them ignoring my pleas for help! Shame on you, VC!!\n\nI will not be bullied into silence! I demand a satisfactory reply and my full refund. This is not the way to treat anyone!!!!!!","title":"Vestiare Collective = Cheats = Liars = Frauds","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-17","author":"Serene Khoo","text":"*UPDATED*\n4th Update: 23 Sep 2020\nItem: 6196774393\nVESTIAIRE COLLECTIVE  PRETENDS TO ADDRESS ISSUES ON TRUSTPILOT.COM\n\nIt is very unnerving how Vestiaire Collective pretends to 'help' and 'try to resolve' our issues through their replies BUT in truth, NOTHING IS DONE. Even after using the link provided below in their replies, I have yet to receive any response, whether through email, IG messages or Help Center. They just MADE OFF with my returned product and MONEY.\n\nDO NOT TRUST THESE SCAMMERS. IT HAS NOW BEEN OVER 2 WEEKS SINCE I RETURNED MY PRODUCT BUT I RECEIVED NO RESPONSE OR REFUND. I have tried all avenues to reach out to them but to no avail. The ONLY RESPONSE I ever received are all the cookie cutter and pretentious replies that they use on TRUSTPILOT.COM. It is all a lie. PLEASE DO NOT USE VESTIAIRE COLLECTIVE. DO NOT BECOME THE NEXT VICTIM.\n\n\n*UPDATED.*\n3rd Update: 20 Sep 2020\nI used the link provided in the reply from Vestiare Collective below. LET'S SEE IF THEY ARE GOING TO FINALLY RETURN ME MY MONEY. IT HAS BEEN OVER 10 DAYS SINCE THEY RECEIVED MY RETURN.\n\n2nd Update: 17 Sep 2020*\nVESTIARE COLLECTIVE = LIARS\nItem: 6196774393\n\nA representative from Vestiare Collective replied me saying that one of their experienced advisors is already in touch with me through email today and made me an offer. LIES!!! I checked my inbox and spam mail etc. NOTHING. They are just trying to make themselves look good here and scam more people!!\n\nPlease do NOT fall for this company's tricks. You will end up a victim like many of us! Do NOT waste your hard earned money on this company. I have never had a worst online shopping experience ever. BEWARE people!! They ignore every single avenue I used to try to reach out to them. They did NOT reply to my emails, my messages through their Help Center and on Instagram.\n\nI have already gotten in touch with our family lawyer today. If VC still do not refund me, I will let my lawyer settle this fraud case.\n\n*1st Review: 16 Sep 2020*\nI wished I read all these reviews on Vestiare Collective before I started purchasing from them. It has been an utter nightmare and a total waste of precious time. I am a heavy online shopper and have been doing so for over the past decade, with 90% of my shopping done online. This is by far the worst experience I have ever had. I do not wish this upon anyone. Future customers of Vestiare Collective, please beware!\n\nI placed a total of 7 orders within a 2 month period since I joined VC in July and accepted 6 of the orders even though the condition were not always graded accurately (I only go for 'Never Worn with Tags' or 'Never Worn' items). However, my most recent order of a Louis Vuitton Murakami Multicolor Zippy Coin Purse that I paid a premium for its 'Never Worn' condition arrived so dirty and used that I dared not even touch it. I paid a premium because I wanted to keep it as a collector's piece as it was no longer in production and was a piece I was missing in my Murakami collection. The condition of the wallet is so disgusting and I do not know how in the world it was assessed and graded as a 'Never Worn' piece.\n\nI sent several pictures of the wallet with its terrible condition clearly shown and sent the item back to VC a week ago, on 9 Sep, and did not receive any updates after I asked them if they had received my returned item. DHL tracking showed that they received and sign for the item on 10 Sep but no email or update was sent to me. They only emailed me back a day later after I reached out to them via the Help Center and IG direct message, letting me know that they have received my return product.\n\nOver the next few days, I checked with them via the Help Center, emails and IG messages on my refund status but received ZERO replies. I have screenshots of them having 'SEEN' my IG messages but there was no response from them whatsoever. I was so polite and cordial initially but this company is a bully! This is NOT RIGHT!!! Treat your customers right!!!\n\nI HAVE NO GOODS AND NO REFUND FROM THEM. According to the Vestiare Collective website, it is stated that once the item has been sent and they have seen the shipping receipt as proof, they will reimburse me fully for the purchase. WHERE is my reimbursement? WHERE is the FULL REFUND promised on their website?\n\nI have tried so many avenues to reach some sort of assistance from Vestiare Collective but to no avail. I have screenshots of them ignoring my pleas for help! Shame on you, VC!!\n\nI will not be bullied into silence! I demand a satisfactory reply and my full refund. This is not the way to treat anyone!!!!!!","title":"STOP CHEATING PEOPLE OF THEIR HARD EARNED MONEY!! Are you running a legitimate business???","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-17","author":"Serene Khoo","text":"*UPDATED* 23 Sep 2020\nItem: 6196774393\nVESTIAIRE COLLECTIVE  PRETENDS TO ADDRESS ISSUES ON TRUSTPILOT.COM\n\nIt is very unnerving how Vestiaire Collective pretends to 'help' and 'try to resolve' our issues through their replies BUT in truth, NOTHING IS DONE. Even after using the link provided below in their replies, I have yet to receive any response, whether through email, IG messages or Help Center. They just MADE OFF with my returned product and MONEY.\n\nDO NOT TRUST THESE SCAMMERS. IT HAS NOW BEEN OVER 2 WEEKS SINCE I RETURNED MY PRODUCT BUT I RECEIVED NO RESPONSE OR REFUND. I have tried all avenues to reach out to them but to no avail. The ONLY RESPONSE I ever received are all the cookie cutter and pretentious replies that they use on TRUSTPILOT.COM. It is all a lie. PLEASE DO NOT USE VESTIAIRE COLLECTIVE. DO NOT BECOME THE NEXT VICTIM.\n\n\nWHY DIDN'T I READ ALL THESE NEGATIVE REVIEWS BEFORE I TRUSTED THEM??? \n\nRETURN ME MY REFUND VESTIAIRE COLLECTIVE!! STOP CHEATING PEOPLE OF THEIR HARD EARNED MONEY. SHAME ON YOU.\n\nDON'T LIE THAT YOU REPLIED TO ME AND SENT ME AN OFFER. I CHECKED MY INBOX AND EVEN SPAM MAIL SO MANY TIMES SINCE YOU RECEIVED MY RETURNED PRODUCT OVER 1 WEEK AGO!!! I RECEIVED NO UPDATES WHATSOEVER FROM YOU.\n\nSTOP LYING TO YOUR CONSUMERS AND TRYING TO MAKE YOURSELF LOOK GOOD.\n\nSHAME ON YOU!!\n\nI'M NOT GOING TO STOP TILL YOU RETURN MY MONEY TO ME.\n\nSCAMMERS GALORE!!! SHAME!!!","title":"SCAM COMPANY!!! BEWARE!!! DON'T GET CHEATED!","stars":2,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-17","author":"Fanni","text":"Absolutely ridiculous experience here as a seller. This website is trying to rip off their sellers to the point where you don’t even want to sell your items anymore. The curation team has no idea what the value of your shoes are. I posted a never worn pair of heels and was suggested a price of 110GBP, after back and forth finally an offer of 145GBP was accepted. Well the price was so good that someone bought it less than 3 hours after posting it online. Obviously, because it was dirt cheap. I felt disappointed because I know the value of the shoe is more than that and buyers know it too. I actually cancelled the transaction and went back to repost it for a bit more money so I don’t feel so ripped off for the beautiful shoes, and guess what, they say 165GBP, just slightly above before, is too high, I need to lower it to 110! Customer service cannot help at all and now I feel double betrayed as now I cannot even repost the shoes for the previous price of 145 which sold the shoe in a blink of an eye!! I have no way to talk to the “expert curation team” to tell them I sold this shoe the on the same day already for much higher and to tell them to accept my price because it’s still a bargain for buyers!! I had to share this because I’m really disappointed in the website and how they handle things.","title":"Absolutely ridiculous experience here…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-18","author":"Claire Church","text":"Absolutely terrible experience!!! I bought a pair of Louis Vuitton desert boots for £760.57 for my daughters birthday. I received an email yesterday stating there was a small problem with the boots that wasn’t mentioned in the listing, however they felt they were still worth having and to accept or refuse their new offer, which was £119 less than the original price. I accepted as my daughter desperately wants them but the seller hasn’t received any message from Vestiaire regarding this problem!!!! What on Earth is going on, they’re holding £760.57 of my money!!!!! Also they said instead of refunding me the difference they’d give me a credit note for £119 to spend on my next order!!! Surely this isn’t legal??! Absolute shambles of a company!!! I want my money back or my boots!!! I will never use you again and will be deleting my goods I have for sale with you!","title":"Absolutely terrible experience!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-18","author":"Elitsa Altimirska","text":"I am highly disappointed with the company and the platform as I spend half of my salary on a purse to make myself happy for my 25 birthday and the package arrived empty. Evidently this happens often as the customer support guy was not surprised. I was told i would be reimbursed or I would receive the purse. Not one of those two things happened. Don’t really waste your time, hope and money on this scam of a company. I am thinking of hiring a lawyer to get this sorted out. In 21 century, where big Percent of shopping is done online, they cannot scam people because they decide to do so. DONT WASTE YOUR MONEY ON THIS SCAM.","title":"Dont go there","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"},{"date":"2020-09-18","author":"CV","text":"Terrible practice of letting sellers changing their minds about selling the items you have already paid for to you, then relist it at double the price. \n\nSo I found a Burberry coat (ref:11729975) that I liked on the site and place my order (Order no 28772371), paid for it, waited for like 5 days and seller still didn’t ship. Then Vestiare informed me that the seller said the item is no longer available, they would refund me. On the same day, the item was relisted under the same seller for double the price. Even if you think you list it at a slightly lower price, you made a commitment to sell it, once someone paid for it in good faiths, Vestiaire should make sure the item will be shipped unless under extraordinaire circumstances. They should not allow the same item to be listed again if the seller had lied and withheld it the first time. There should be a way to place review for each seller like other websites.\n\nOh and they gave me a 15 euro coupon while on that order I had used my 30 euro first order discount coupon which can not be used again.","title":"Terrible practice of letting seller withholding items after payment","stars":1,"location":"HU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=97&stars=1&stars=2&stars=3"}]