[{"date":"2021-03-31","author":"mr philip stephenson","text":"The company used to be good till a few months ago, My wife has an account with them for a few years, trusted seller, good reviews on her, and suddenly she cant do direct shipping, but her items have to be sent to them for verification.\nContacting their customer care, a week ago they sad it was a technical issue, and today at first they sad she was right, then after a few minutes they sad its their policy, which when challenged to it they were going round with their templated replies, they were not able to advise where in their policies, and obviously their T&C to which a buyer and seller has access, there is mention of a trusted seller and highly ranked, can not do direct shipping.\nOverall the CS team are crap, provide templated replies, and at the end end up closing the chat to get rid of you.\nThe only lie about this review is the 1 star I gave them, as they deserve no stars at all, but trust pilot does not allow a 0 star review or what they deserve a negative star","title":"Crappy customer care, not able of giving a proper reply to your question","stars":1,"location":"MT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-01","author":"Nena Chichi","text":"I bought a Celine bag. When I received it, it wasn't in the condition advertised (had massive interior stains), the measures were not as advertised (bag was smaller), but the most important thing, it was a replica (fake). I know there are very good replicas in the market that are hard to identify, but was one of the bad ones, it even didn't have the number on  zippers or a the code written in the internal pocket tag (Celine authenticity review 101), the logo was poorly printed. So I raised an authenticity claim to Vestiaire, they immediately accepted to review it again. After a couple of days, they sent me an e mail saying that I'll receive a full refund. Until then, everything was kind of OK, people make mistakes, BUT then I noticed that they uploaded the bag on the site again (Vestiaire was the \"seller\" in this case) and then I noticed it was sold it with 25% discount. \nHow can you resell a bag that you know its fake and you have confirmed that to other buyer? \nI really hope this review helps to make people aware that Vestiaire is not fully trustable and you have to carefully review your item as soon as you receive it.\nI also hope that the person that bought this bag (grey with fuccia accents), review it carefully before accepting it!","title":"VC confirmed bag as fake, then put on sale again","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-01","author":"Tina","text":"I sold an item in new condition. Sent it to the buyer who then reported stains and a dent in the item. The pictures of my item clearly showed no marks but the buyervis now able to return the item to me in a damaged condition. Its not a case of buyer beware it should be seller beware","title":"I sold an item in new condition","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-01","author":"Alexandra Gibbons","text":"Awful service - unable to return items far too small.  No customer service - invisible chatbot and unhelpful automated answers AVOID at all costs...","title":"Awful service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-02","author":"Orchid Green","text":"Don't trust their \"expert\" team! They don't know how to authenticate Superfake Hermes bags.  Don't go to the reseller store or website to Hermes bags.  There are 9 out of 10 are fake as per the CEO of Hermes.","title":"Don't trust their \"expert\" team","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-03","author":"Breda Clarke","text":"I was new to Vestaire so didn't know much about it.  Tried to purchase a pair of sunglasses located in the same country as myself.  Kept getting a message saying I can't buy from this location!!!!  Got onto webchat and was told that sunglasses no matter where they're located cannot be purchased by a buyer in Ireland because of Brexit.  Seems bizarre that I can't purchase from a seller in my own country.","title":"Not impressed at all","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-04","author":"Jenny Lapushner","text":"If anyone had any of these experiences, please leave a response or +1.  \nToo many issues to write about in detail but in summary\n1\/  I had 2 items, both valued at over $2K damaged at the hands of VC \"quality\"; several VC operational system errors regarding shipping confirmation, causing them to dismiss paying me my commission until I proactively chased the payment for 3 month (item has still not been properly tagged as shipped);\n2\/  HORRIBLE customer service and management, who have repeatedly ignored or overlooked many of my messages; \n3\/  ridiculous seller fees, especially when they are negligently mishandling inventory and providing unscrupulous customer service; \n4\/  mislabeled my seller profiles, causing my profile to decrease in the search and potentially lose sales (see example of my latest message to VC)\n5\/  Errors in the shipping and delivery system, which does not record or indicate real-world accuracy.  A couple of items sat in quality control for weeks, causing a disgruntled buyer to contact me and eventually I spent hours trying to rectify the situation.  As I observed, the buyer's process is also an issue as noted by several of my buyers.  With the example below, it literally took me at least 5 communications and ~3 months to receive my money for a blouse, which was clearly marked as shipped by Fed Ex, yet VC didn't seem to believe the item was shipped to the buyer and despite the tracking information validating the delivery, they waited for the buyer to approve receipt vs documents submitted by their \"trusted seller\".\n\nApril 4, 2021\nRe: Expert vs Trusted Seller\n\nI'd like to escalate my message to a supervisor, as this is not the first time I am contacting VC as a disgruntled seller. In fact, it seems like there is a huge issue on the operation side of the business and as many times  as I have messaged \"customer service\", I am in disbelief there there is no resolution or attention to my account.   According to the policy I am I am due to be an expert seller ad as I reviewed my stats, the sales\/conformity stats are not accurate.  For instance, I sold a Dolce & Gabbana blouse earlier in the year and it was not credited for 3 months as the shipping and delivery system does not seem to indicate real-world accuracy.  It literally took me at least 5 communications and ~3 months to receive my money as VC didn't seem to believe the item was shipped to the buyer and despite the tracking information validating the delivery.  I have countless other issues in which the \"quality team mishandled my items, many of which were worth thousands of dollars.   In doing the math and tallying the statistics,  I am due to be an expert seller (months ago) and would like to understand why this is not reflected in my profile.   I'm going to deal with one issue at a time but the VC model is subpar to many of its competitors and has caused me to halt on uploading 100s of items I have in inventory.","title":"Too many issues re: Horrible seller experience","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-05","author":"Cyrus","text":"I just started to sell some items on Vestiare and it did \nnot work well at all. Still waiting the payment of 50% of my sold items. Customer support is extremly bad!!!\nEven after the 2nd complaint no solution in sight!","title":"Payments missing!! Customer support not existing!!!","stars":1,"location":"LU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-05","author":"Mati Webster","text":"I sold an item on Vestiaire. I sent the bag into their headquarters to authenticate it, I got no notification on the status of the bag apart from \"non-compliant\" on my payment section, no email or notification was sent as to why. When I further inquired about this you have to speak to an automated help system for so long before you can get through to anyone. They told me the bag was non-compliant because of a scratch on the corner, allowing me to relist it if I chose to. Over a week later, it still has not been relisted and I am again having to go through the automated system to speak to anyone about it. They have responded that they have not yet looked into relisting the item - even weeks after. Awful service - expect fast and helpful staff when they are holding items potentially worth thousands of pounds at their headquarters, and taking such a large cut of it. Completely unprofessional and not transparent on the status of the items you're selling - especially when the items are no longer in your hands.\n\nMy experience as a buyer even worse. I bought a t-shirt on Vestiaire in 2017 that showed up in 2019. I assumed an issue with the post office but Vestiaire had just forgotten to send it.","title":"Unprofessional and slow service. Would not recommend.","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-05","author":"Yulia","text":"I am writing this review because there's yet another issue with Vestiaire Collective which is managed completely atrociously.\nA bit of background history: a customer purchased my item, I sent it to the warehouse and received a message almost instantaneously that it did not pass QC as it's a fake (despite item having brand's original markings and me providing copy of the receipt). After I submitted my comments on the item with the detailed explanation why it is authentic, I received response that it is indeed authentic but the sale was cancelled already and they are very sorry.\nEverything that CS was able to offer me was resubmitting the item online which is absolutely unacceptable. Because of someone's incompetency, I have a fake item strike on my account, a buyer who received a message that the item she bought was a fake which is a horrible lie, no item, no money and no resolution of the situation.\nI can tell you what has happened: someone just did not check the item properly (probably because he or she does not have required expertise) and cancelled the sale which ended up in severe consequences for me. \nAnd VC is keeping silent on this issue, the item is still listed as non compliant on my account affecting my submissions, my sales and my reputation, leave alone absence of both item and money.\nDo you think this is okay? I don't think so. \nIt has been over two weeks and they just stopped responding to me. No item, no money, nothing has been relisted. The last time I had an exchange with customer support and asked them to inform the buyer the item was actually compliant, they offered me to do it myself once item is relisted. How on Earth am I supposed to do this? Not even talking about them refusing to take responsibility for their own mistakes!\nPlease be warned this can happen to you as well. \n\nItem number 15050617. I demand Vestiaire Collective to refund me the money from this sale as what has been happening is completely unacceptable. No item, no money, just a gigantic fraud.","title":"Ghastly ignorance and incompetence","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-05","author":"Elsa","text":"I sold a dress on VC on the 24\/12\/20 which got lost during transit by UPS, and until today I still haven’t received any payment from VC after numerous chasing!!\n\nI contacted UPS to try to locate the package but without success (basically they can’t help) because the shipping cost was paid directly by VC using their corporate account, so there’s nothing I could do to follow it up with UPS.\n\nI was in contact with the buyer via the chat in the app to try to understand what had happened and trying to sort this out but VC subsequently blocked my chat function because I was trying to contact the buyer privately (and they refund to activate my chat function with other members after I contacted them explaining the situation). The buyer told me she has received a refund. \n\nI contacted VC at least five times the last three months and they have promised a payment date twice (3\/2\/21 and 15\/3\/21) but have missed them twice. The last time I contacted them on the 4\/4\/21 to say I will escalate if they don’t get back to me yet they have not responded so far.\n\nIt's hard for them to explain themselves they are not deliberately trying to avoid paying. They even removed the record of my sale from the app and I can't see it from my account anymore!\n\nTL;DR - VC avoid to pay seller after the package got lost, yet pretending they are trying to pay. Broke promise twice and not responding to emails.","title":"VC avoid to pay seller after the package got lost, yet pretending they are trying to pay","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-06","author":"Sarah S","text":"Quality in recent times has simply gone out of the window. Shocking Customer Support!","title":"Quality in recent times has simply gone…","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-06","author":"Carol Campbell","text":"Terrible terrible customer service. The DHL Waybill provided by VC to send my sold item to the buyer does not work. DHL cannot collect it because the number doesn’t work on their system. VC refuse to provide their account number as an alternative (the solution proposed by DHL) and will not offer an alternative shipping method. You can’t speak to VC on the phone and the live chat is useless. This is the second shoddy experience I’ve had with them, it’s not worth the hassle. I have 2 abortive sales, 2 unhappy buyers and a lot of wasted time and stress. AVOID!","title":"Terrible terrible customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-06","author":"MAlvarez","text":"They do not regulate their sellers enough - some ‘professional’ seller continuing to sell fake goods even AFTER reporting it!","title":"They do not regulate their sellers…","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-06","author":"Elisabeth","text":"I have an issue with a product (jacket). It was described as in good condition, the pictures looked fine, however it came stained (someone ate spaghetti sauce on it) and it smells like 100 years old. Both of it is not in line with vestiaires standards. However, I contacted customer service now for three times for the lack of compliance with the description without receiving any answer to my first complaint and with an immediate answer, after the 72 hours have passed, stating, that \"unfortunately nothing can be done as you are contacting us beyond the 72 hours\". This is scam and I intend to take legal measures as I had the exact same problem with a different and expensive product. There is no customer protection whatsoever for the buyer if you buy \"direct\" and at the same time you charge the sellers an expensive fee - approximately 30 per cent or more, just for the listing on the page and the parcel pick-up. Turns out, that this is no better than listing your product directly on ebay.\n\np.s. message you sent to customer service are not saved, so you cannot follow up or see if something was answered. You need to contact them via the contact form each time anew. I also tried the chat box, when they told me \"oh I see that your issue is still being looked into. we will be in touch\". After almost two weeks passed, I do not believe in this any more.","title":"Systematic scam..?","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-07","author":"Maria","text":"Just contacted customer service with an issue and the response was extremely unhelpful. It's really disappointing that for such a premium website the customer service is absolutely terrible. I wouldn't leave a negative review lightly as I understand one experience doesn't reflect everything on the company but this is the 3rd time I've contacted them with an issue and the reply was just completely useless and unhelpful. I guess I'll be taking my money and business somewhere else, I'm deeply disappointed.","title":"Poor customer service for such a premium retailer","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-07","author":"lisa monde","text":"I ordered an item, after i had paid for it, it said it that my order was cancelled and it was generating a refund. After i messaged the seller about it, I was banned, stupid app so annoying","title":"I ordered an item","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-07","author":"Lebron Prake","text":"There are thousands of replicas being sold on this website, the quality check team doesn’t know what they are doing. I follow some accounts where people sell 100,200,300 fake items. I reported these people to Vestiaire but they really don’t care. Items such as 3000$ Bottega Veneta bags or 2000€ Max Mara coats from the best replicas factories are being sold on VC and they just do not care. They are replicas of brands such as orseund Iris, realisation, zimmermann, dion lee, nanushka, ganni, alexander wang, isabel marant, off white, self project, maison margiela, loewe, and many many more - all those people sell those items and their quality team thinks that they aren’t fakes of these brands and accept everything. I offered them my help, to join the team to help solving the replicas problems but they do not care. So I’m going to expose them. Here’s a list of profiles where people sell only counterfeit items from best replicas sellers (they got the info from Reddit from fashionreps or repladies) : ask these sellers for proof of purchase of anything - You won’t get any. \n@elera9686101 - over 120 fake items \n@noah11371357 - 50 items sold and 30 for sale. This girl is selling fakes for two years and has multiple accounts - when I contacted VC a year ago about it they confirmed it and deleted all the accounts, but she keeps getting new and i report them and they dont care. \n@filippapepp - also her account, here she’s selling a lot of bottega Veneta bags without invoice etc obviously fake and they accept it!!\n@staplefindsuk - another fake seller\n@tsf - 62 items sold. 150 for sale she’s even „proffesional seller”. She even uses pictures from Chinese rep sellers - try image searching them on Google and see what you’ll find. \n@oceanbeyond - fake bags, same story with photos taken from replicas sellers\n@omega10951801 - fake items all of them\n@alexander9983054 - 50 replicas sold, some worth over 2000€ I think they banned this account but I doubt they refunded and contacted every single buyer. \n@wendy5863 - all items are fake. \n@marcin12175320 - all fake so bad fakes. \n@julia10989919 same person as above\n@michal8272504 same person as above\n@wojtek9726526 same person as above\n@kacper11182107 same person as above\nAnd they are many more. If You look for these accounts you’ll see what I mean - they all sell the same brands, the same items; for low prices (because they buy cheap fakes). Vestiaire won’t care but most of these sellers lost trusted seller badges so that means they already have at least one item declared counterfeit - Vestiaire should delete these accounts forever - yet they decide to keep them online. They are tragic and pathetic. They only care about the money and until the buyer finds out they bought a fake they really don’t care.","title":"Replicas being sold and VC ignoring the fact","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-08","author":"Martine Lawley","text":"I have been a member of the 'VC Community' 😂 for a number of years.\nIf you ask them for advice\/support in their 'Chat' you get a very sweet person who is paid to apologise and talk to you about the 'Pandemic' but who has no idea how to help.\nMy most recent request was for a solid explanation as to why since 'Brexit' I cannot purchase a pair of Ugg slippers (I understand that there may be some restrictions between the 'World' and the UK, but when the seller of said slippers is a UK seller,  I am a UK buyer and I can access 'Direct Shipping' (this means the item will NOT leave the UK) I am not allowed to do so..   to me this is the epitomy of absurdity..  \nI was quoted some reams of rules and regs which clearly do not apply to a UK to UK transaction.\n\nAnd why are other sites (Rebelle,  Joli Closet,  VideDressing..  a german re-sale outlet and 2 French ones) do not apply such absurd rules?\nWhy is it that Ebay does not follow suit?\n\nVestiaire Collective is not trying to assist their customers but is ruling them in a system that is unhelpful and manipulative.","title":"Vestiaire does not care about it's members\/customers","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"},{"date":"2021-04-09","author":"Kateryna Kosynska","text":"Poor customer service and poor coordination!\nI contacted the CS two times, to make sure that three items from my order will be shipped to me as one parcel (as I order them at the same time, under one order number).\nAfter all my attempts and explanation of my request the items has been shipped separately, item by item to me!!!\nVery dissatisfied and disappointed!","title":"Poor customer service and poor…","stars":1,"location":"QA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=64&stars=1&stars=2&stars=3"}]