[{"date":"2022-01-28","author":"..","text":"I would give a zero rating if possible. The item I ordered is not authentic Chanel, after several complaints they offered a refund, so I sent the item back, however, they have not refunded the item but listed it as I’m selling, for far less than I paid. Used the site before and been great, therefore, very disappointed I will never purchase of this site again.","title":"I would give a zero rating if possible","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-28","author":"J  M","text":"Edit 14.02\n\nI am still waiting on the refund for the shrunken jumper three weeks after I was told the funds would be back in my account within 5 days. Recontacted customer support on 3.02.22 and was told there had been an error and the refund would be processed immediately. But I’m still waiting…\n\nThe support team accepted a return on the Frye boots that were listed a different size. And five days later a refund was issued. \n\nThe website is a cool concept, but it feels like the sellers are the winners and not the buyers. All is ok if the seller is honest, but if they are not, the buyer has to jump through considerable hoops to get the product sent back and a refund issued. Pair that with the long shipping wait (especially if an item needs to be authenticated) and it gets pretty annoying fast.  \n\nThe website is wonderful, and there are a lot of really nice products on sale for good prices. But… my experience so far with this site has been pretty terrible. \nThe first order I made was for three items. After paying I received a message immediately that actually, one of the items was not available any longer, and I would be reimbursed. The refund took a day to come through. The other two items arrived significantly different to what was described in the listing. A wool jumper in ‘excellent’ condition, arrived covered in hair and obviously had been shrunk in the wash. The sleeves arrived a halfway between my elbow and wrists. It wasn’t wool either, but a cheap and nasty mix of acrylic and wool. I sent images to the customer support with the jumper in front of another that was the same size, and they agreed to refund me (I returned the jumper yesterday, but the refund has not yet arrived). \nThe third item was a pair of Frye boots. The listing was marked at a 38.5, but instead the boots that arrived were a 7B (I don’t understand why they didn’t put in the actual size). Anyhow, a Frye 7 corresponds to a size 37-38 (they were significantly smaller than my size 38 boots, so I guess they were a 37.5). Again I had to send images, and mails - and even though I have clearly shown that the boots are not the size they were indicated in the listing, vestiare have not yet agreed to ‘allow’ a return\/reimbursement. \nEven though the error is all theirs, the consumer is the one that looses. \nSo sorry, but so far Vestiaire is a big thumbs down for me. The shipping is way too high, and the customer service\/ validation of products needs to be improved. For now I’ll stick with Ebay, where at least buyers have some rights…","title":"Big thumbs down from me","stars":2,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-28","author":"Hristina","text":"My two items ( ref. 19034567 and ref. 18638589) have been missing since the 10.11.2021. The above mentioned (both) have been officially (in writing) declared lost on the 10.12.2021 by DHL and investigation results made visible to you.\nThroughout this period I have contacted you and I have been in touch with you through chat, email, I have my correspondence with the buyer, DHL and also my publicly visible reviews here on Trustpilot (where you reassure me it has being handled) regarding those TWO missing parcels.\nTwo days ago I have been finally reimbursed 55 EUR for my lost fox stole ( ref. 18638589) . \nHOWEVER, when I asked about the other lost item ( ref. 19034567) - my nearly brand new Gucci Jackie 1961 handbag, your associate ghosted me. \nI reached out again to your \"Chat with us\" option where a Vestiare Collective agent (Rhoa Veeder) told me that the deadline for claim for this item has been expired long ago and that in your records I have never been in contact with you regarding this lost item. \nI have transcripts, screenshots and email correspondence to prove that wrong . \nWhat kind of a scam is this?\nI will not give up on my rights and you should fix your mess! \nFeel free to contact me on my email and explain.","title":"Answer me VC. What kind of a scam is this???","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-28","author":"Mari-Ann","text":"How do I get in contact with customer support?\nThe e-mail to support vestiairecollective worked fine less than a week ago, but now it suddenly does not exist anymore??? \nYou ask me to open a chat instead to get in contact with you.\nIt is a chatbot not able to react to my request!!\nPlease state an e-mail address where I can contact you!","title":"No contact data for customer service?!!!","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-28","author":"RP","text":"Sold one Brand new Cartier neckless and what a suprise that I received one report from Vestiaire saying that is different than descrived. After check pics I saw that the marks on the pic are finger prints from the amazing expert from Vestiare team. Also photos from fine jewerelly are taking over a rock... amazing how this guys worked!! High price items never more... imagine that you send a Rolex","title":"Quality Control is a Joke!!!","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-29","author":"buyer","text":"I have filed a PayPal dispute and bank chargeback.\n\nI purchased a YSL wallet after the seller said on the listing that it was in excellent condition with ‘normal darkening at corners’ and no damage. I even left a comment on the page asking the seller to confirm if there are scuffs or damages, to which she said no, it’s ‘only used once’. Pictures didn’t show damage either when I zoomed into every one of them. Then the product arrived and what?! Peeled leather at the front! It’s obvious that the leather was scraped off! Also corners scratched, showing the white under layer (this isn’t normal darkening?!) I emailed and did a live chat with Vestiaire on the same day and they promised full refund on both occasions. I have photo evidence. \n\nI even have the email proof that they confirmed FULL refund. Nowhere in the correspondence did they say I may be denied refund. They said return the product and my refund will be issued within 48 hours. All these happened within 72 hours of their golden period of relisting without commission btw, so one might think the nightmare is sorted. I shipped the product back to their hub the next business day.\n\nBy then it was beyond 72 hours, catering for an additional 3 days of international shipping. It finally arrived at their hub then they issued an email saying the product was compliant and now I can either 1) have the product back by requesting it within 24 hours 2) relist WITH commission fee DEDUCTED.\n\nI almost wish I made more damages before I returned the product so they have no chance of saying it’s compliant. I emailed them for a proper, formal quality control report. As usual, I got a standard robotic reply. I questioned if the peeled leather and scuffed corners were inspected. If so, how do these ‘match’ the item description? \n\nTheir customer service team is hard to get. I’m constantly chasing time zone difference trying to get in touch with their team. If they promised full refund via email, especially after the product is successfully returned to them (with proof), their promise and my acknowledgment are written agreements made specific to this transaction. Their practice is not compliant with the Consumer Law.\n\nNote, they have now confiscated the product and my money. I’m not going to stop taking actions and filing complaints with the EU commission until they return my money. Alternatively, prove to me how the product is aligned with its description?","title":"Absolutely no respect to the Consumer Law","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-29","author":"Lulu ","text":"Quality control team is horrible! I’ve sold my chanel bag which the color is navy blue and for the first time ever I’ve got a quality control report saying my bag had color error, the report says my bag color is lighter grey in person???? Which is not!!!! Navy blue is nothing close to lighter grey!!!! My buyer cancel the sell, which is fine, I just don’t want my buyer to think I’m lying about my item. My time been wasted by quality control team. Sad thing is Ive asked customer service if I could file a report on the color error, and they told me no, quality control will not change their mind. Very well, so if they say a cat is a dog then no one can say no its not? I can only tell myself the member who examined my bag must be a color blind only to make myself feel better in this situation.","title":"Quality control team is horrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-29","author":"MB","text":"I made a purchase on Vestiare. When the item arrived broken I was told it was too late to return it but that is I could RESELL IT TO ANOTHER USER on their platform.","title":"I made a purchase on Vestiare","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-29","author":"Mathias","text":"Won’t reply Mails about an item I sold and have not been paid for. Will not sell anything through them ever again!","title":"Won’t reply Mails about a item I dold…","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-29","author":"José Miranda","text":"THEY MADE THE PAYMENT OF 2 ITEMS TO THE WRONG BANK ACCOUNT. I SENT EVIDENCE FROM THE BANK THAT THE PAYMENT HAS BEEN RETURNED BUT THE EXPERT TEAM OF THE VESTIAIRE COLLECTIVE ASSUMES THE PAYMENT HAS BEEN SUCCESSFULLY COMPLETED. I ASK FOR PROOF OF PAYMENT AND THEY SEND ME A PRINTSCREEN OF THEIR SYSTEM. NO BANK ON THIS PLANET ACCEPT PRINTSCREENS AS PROOF OF PAYMENT. THEY NO LONGER RESPOND TO EMAILS AND IGNORE THE CASE. I LOST MY ITEMS AND MY MONEY.","title":"THEY DIDN'T PAY ME €290","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-29","author":"Stella Glykanissou","text":"NO MATTER WHAT STAY AWAY FROM THIS APPLICATION","title":"NO MATTER WHAT STAY AWAY FROM THIS…","stars":1,"location":"CY","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-29","author":"Lis Griffiths ","text":"This is the worst company I have ever dealt with. Unprofessional, unreliable. Waiting to get a refund from a parcel that did not arrive in November. DO NOT USE THIS COMPANY. Will never use them again!","title":"This is the worst company I have ever…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-30","author":"buyer","text":"I love how they say they’re certified B Corp, sustainable and all that but my latest order, which was just a wallet, came wrapped with two thick layers of large bubble wrap in a plastic DHL bag.\n\nWhat happened to sustainability?!\n\nWhat happened to the recycled, VC branded dust bag you advertised on site and sustainable cardboard box that is used to ship items?\n\nI’ve ordered from VC 3 times in 2021, the same year they got certified as B corp and every parcel came in a recycled dust bag. \n\nThis time? Thick bubble wrap. Because they’re already certified and won’t be audited for another 3 years? How gross.\n\nLucky I reused both the plastic wrap and bag to return the product. Meanwhile, I still haven’t received my refund. Their staff said ‘be patient’.\n\nIt’s been weeks.\n\nNOTE: my purchase was not via direct shipping. It went through QC in their Hong Kong hub.","title":"NOT SUSTAINABLE. NO REFUND. Just lies…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-30","author":"Lyn","text":"Im really not happy that they always close the sale without any reason. Even if my sweaters are in perfect condition but sellers report they close the sale. I hope they could justify it. Because I have taken pictures of every detail of my jumper, you get what you see, If they change their mind its not my fault they need to change their policy shouldnt close a sale so lightly.","title":"Im really not happy that they always…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-31","author":"Livs","text":"This apps only good selling few hundreds pounds worth of goods, technically I always sort out the dispute straight with buyers. Verstaire should have more consideration towards sellers and respect their goods. Such a shame too many bad reviews and bad experiences","title":"So many bad reviews","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-31","author":"Glow","text":"I AM in this platform years were I used to shop and I sell with confidence luxury goods, \nuntil 19-12-21 I purchased a important amount of money in  3 jewels were supposed to be real natural diamonds in settings of white gold. I shop here before some Jewellery but never diamonds, so I trust that with the extra amount of money you pay for verification of authentication by Professional with expertise will everything be okay, but no! I been scam, i never could expect that some zirconias in silver sterling will pas a filter like VS and be resent to me as diamonds! this is accomplish of a criminal action very BAD!... just to confirm my worse nightmare I bring this items to be check by my local specialist in diamonds just to confirm what I was afraid, mossainites in silver sterling who all have a engrave inside of M925!! I reported right away and send it back to them , to the day of today 31\/01\/22 I only received the confirmation that one of the 3 items are indeed fake, and my money back of only 1! ...they send me another email, telling that one of the items is real and that they would put it in my account to be resell with quick delivery and that they will keep a commission of this selling and the rest would be for me , 1 REFUSED TO BE PART OF THIS SCAM! DONT WANT ANY PART OF THIS because IS WRONG! THEY DONT allowed ME TO WARN people VIA DE SITE!  they are reselling something fake very aware ! this is CRIMINAL!\n\nsince I don't get yet the rest of my money back I am presenting a formal complain in European Commission\nEuropean Anti-Fraud Office (OLAF).\n\nPLEASE PEOPLE DO NOT BUY jewellery ! DONT believe DIAMONDS ARE GONNA COST THAT CHEAP, ASK YOURSELF WHY?? SELLERS ALWAYS GONNA LET YOU HEAR WHAT YOU WANT, BUT WORSE THE PEOPLE OF VS allowed everything! BE AWARE OF THIS AND DONT DOIT! DONT believe WHAT YOU SEE IN PICTURES !","title":"VICTIM OF A SCAM WITH FAKE DIAMONDS!!","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-31","author":"Nas","text":"I've recently sold an expensive Bvlgari watch, which was verified a few days later. I then had to wait for a month and a half to receive my money, although according to Vestiaire's app you are supposed to get payed in 5 or so working days!! I don't even mind the wait that much, what I really find disrespectful is that they don't tell you anything outright (or they simply lie), then don't get back to you when they say they will...","title":"Beware sellers, as you may not get your money right away!!!","stars":3,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-31","author":"Alex correia","text":"After a sale cancelled, they keep my item from 3 months and nobody can tell me where is it, they don't refund me, they don't give my any information about it..... they just say they don't know. Customer service is miserable.... so it's look like they lost or stolen my item. It's unbelievable \nDon't trust them, the costumer service is very very bad.\nI chose another site instead","title":"After a sale cancelled i have no my item back","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-01-31","author":"Cosima","text":"Extremely poor customer experience, impossible to join them and get in touch with them after a sale. I have never seen such a bad company in the fashion sector. If the item is wrong and you want to re-sell it, you cannot change the price (prior to negotiation) if not Vestiaire keeps charging you its commission fee.","title":"Extremely poor customer experience","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-02-01","author":"Bill H","text":"Scam, scam, scam, be really aware when you think about sending something valuable to a company that do not respond to email or enquiries, there are no managers available, only an online chat room with inexperienced people.\n\nIf you plan in sending a £15 necklace or shoes than the risk is minimal, but sending items worth £1000s is not worth the risk.\nThis is the 3rd week that I’m waiting for a manager to contact me to discuss an item that was sold, no one got back to me yet, I don’t have the item or the money.\n\nBe very careful, read the bad review and you will understand.","title":"Scam","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=20&stars=1&stars=2&stars=3"}]