[{"date":"2021-10-19","author":"Isabelle Kyte","text":"Their quality control service is a joke. I bought a pair of shoes and after wearing them a SINGLE TIME, both soles detached from the structure. I went to a shoe maker to get them fixed and the man said that they were really old, which explains why the glue on the soles dissolved. It cost me £80 on top of the £150 I had already paid to have them fixed!","title":"Don't trust their quality control","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-20","author":"Syafiqah Azlan","text":"This is my first sale on VC and I sold a Chanel medium flap (ref number: 17778915). The bag was delivered in full set via DHL and was wrapped nicely in its dust bag in the Chanel box. The box also contained the care cards etc. \n\nHowever, a day after the bag arrived for assessment, I received an email saying that an accessory is missing and the box is missing. This had me so upset as I will not be able to re-sell my bag at a competitive price without the box. \n\nAlso, the quality report did not state which accessory is missing. This leaves me questioning and wondering whether the dust bag is missing, or is it the authenticity card…\n\nI’m still baffled that VC can lose the box even when the bag was contained in it. Doesn’t make sense at all.\n\nCurrently waiting to hear from the expert team and hope that VC will come through; either find the box or pay me the full sale amount as this will cost me the sale (the buyer wants the box as the bag is a gift). \n\nSo much regret for my first transaction on VC.","title":"Regret selling on VC. Chanel box is missing","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-20","author":"grace","text":"I have bought from Vestiaire Collective  and sold a few items there for a few years. It has never disappointed me, until now.\nI bought a pair of Valentino trousers on 22\/9, the pants didn't arrive at the VC hub until 2\/10 for checking. \nAfterwards, I *never heard from VC since then*. Under my order summary, it only indicates the pants are under assessment, I have tried to contact VC through their chat box and through e-mail for many times...... Each time was an auto-generated reply or no reply at all!\n\nThis is extremely frustrating! I have been a loyal customer of Vestiaire Collective, but I feel being let down this time!\n\nI would like VC to update me on the status of these Valentino pants. Is the item compliant with the brand's standard? If yes, please ship out the item with tracking.\nIf the item is faulty, please issue a full refund to me! \n\nI do hope that while Vestiaire Collective is an environmentally responsible business, you will also be a business with integrity and be responsible for your customers at the same time, please ensure the item is properly checked, safely delivered to the customer, or issue a full refund if the item has an issue. \n\nThank you!","title":"Order ref. #13116684 has *never* arrived","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-20","author":"David Lindholm","text":"Ref : 16982754 so I paid for this order and the seller, just cancel it. Apparently seller can cancel the agreement if they feel like it, after several days and I have to wait 4 days to get my money back. What a scam, Lousy customer service my wife wrote them for different order a week ago and they still haven’t respond. Last time I’ll use VC again. Ridiculous!","title":"Cancel culture..","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-20","author":"Ann Ann","text":"Dear Sir \/ Madam,\n\nplease take this letter as a letter before action. \n\nMy original item was posted as 14072127, with no commission. It was removed automatically multiple times (wrongly saying that it was removed by seller), your staff Kurt first helped me to put back my item on 9 July 2021. I then contacted your staff again in Aug, because I noticed it was removed again automatically. Your staff Julie, told me that: \n\nOn 10 Aug 2021 - \n\"I am getting back to you regarding the sale of your Bulgari ring reference 14072127. \n It has now been relisted on your account under the new reference 17449929. Please excuse us for the delay. \"\n\nOn 11 Aug - \n\"If the item was delisted wrongly, then you are entitled to a 0 commission sale. \nUnfortunately, as we are not able to change the commission when relisting an item, there nothing I can do about it now. \nHowever I invite you to get back to us as soon as the item is sold, and we will refund you the commission. \"\n\nI then realise somehow item 14072127 appeared available online again despite your reply. On 18 Aug, I realised 14072127 disappeared (your Vanessa now blames me for deleting it), and I tried to contact your company by email on the same day, but no reply was received. I tried to seek help from online staff, I remembered that they told me they could not relist it. It turns out I could do nothing, I relied on Julie’s words that that my original item 14072127 was listed as 17449929, and I could write to your company once it is sold for a refund of commission.\n\n17449929 was subsequently sold on 29 Sep 2021. Immediately after that, I chatted with your staff Christina online, she asked me to rest assured that the commission will be refunded to me after the payment is made. After I waited for a week, I received no updates from your side, so I chatted with another guy, he said he would return an email, but I received nothing. Then, I chatted with Harjay online. The email was followed up by Vanessa. I sent her all sorts of written records, despite my explanation, she insisted that the item was deleted by me as a seller. I have explained that similar situations occurred before but she still refused to make a refund. She has wasted me days to give me a robotic reply, and did not reply to all evidence I gave. \n\nThe truth is, there is a bug with item 14072127, it was WRONGLY DELISTED BY YOUR SYSTEM multiple times. I have to make myself clear that never delete the item. I suspect that your company is trying to deceive me, by removing my item online and avoid to refund the commission despite multiple representations made by your staff. \n\nI demand you refund me the commission, as your staff have made representation on, and I relied on it. If I do not hear from you within 2 days, I will take it to small claims court and report it to financial ombudsman for fraud.","title":"Letter of action","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-21","author":"Darina","text":"Honestly, the worst service EVER. I have sent an item to the buyer the next day after the purchase on the 30th of September via Hermes (as the buyer chose). First of all the item was MIA for 4 days while with Hermes and there was not a single update at that time. On the 8th of October to the buyer's chosen pick up location, and has been there ever since. The buyer has never collected the item and so I have never been paid. Now I do not have the item I sold, I do not have my money, I do not know where or in what state the sold item is. I have been contacting customer services since last week and have received zero support, not a single sufficient response from the customer team, not a single reply to my email from \"experts\". It is frustrating and downright humiliating to be put in a position where I have to beg for my money because I absolutely will not be accepting the item back since it has been unaccounted for for such a long period of time.","title":"Honestly","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-21","author":"Anastasia Nevtonova","text":"awful experience - I feel SCAMMED - when Vestiare added $100 in tax, shipping, authentication on a $300 item from France! I still have to pay import duties and these fraudsters charge me SALES TAX on an item from Overseas that is USED??? and Authentication i do NOT need??  I asked their chat for a TEL # for corporate - she says there is NONE!  I asked for a resale TAX EXEMPT certificate use and RESALE ACCOUNT - Rep had no info and said she will email some day… and my offer expires today.. So basically 72 hours to waste on one tiny purchase and still have nothing as a result.. VERY DISSAPPOINTED in this company.","title":"awful experience","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-21","author":"KarenMarie","text":"As a buyer, 1 out of 3 of my purchases gets cancelled by the seller. I purchased an item this morning and it was cancelled within the hour supposedly because the seller had been offered a higher price through the direct chat. Meanwhile I am still out of pocket and waiting for my refund. Vestiaire should stop direct chats once a sale has been concluded by (a very easy fix) and block sellers who do not comply. Their reward system for buyers is meaningless for buyers. Buyers should be able to rate sellers directly. If they did, these sort of things would not happen.  I never have this problem on other resale sites not even ebay. Not to mention that the customer service is below par compared to others. Don’t waste your time on Vestiaire, go buy and sell on other sites!\n\nUpdate: the response from VC below has nothing to do with my main complaint. The problem is your private messaging system!!! You’ll see there are complaints below.  I really despair with this company. Go elsewhere if you can: EBay, Poshmark, Vinted, The Real Real. I rarely have a problem with them and if there is, it is always resolved satisfactorily.","title":"untrustworthy and a waste of time","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-21","author":"XY Khor","text":"paid twice as I  thought payment didn't go through. Did not get any email confirmation of purchase and after a while it says item still in trolley. chatted with their customer support who basically said I DON'T KNOW throuhgout the whole frustrating conversation. checked with my bank, total of 4 payments taken by VC AND item not purchased. it is just impossible that they do not know!!! SCAM. BIG SCAM\nthey say they will take it seriously and contact me. I shall see how long they take to get back and refund every penny they steal from me with a scam.","title":"REAL BIG SCAM. DISGUSTING","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-22","author":"Posh Events","text":"Vestiaire Collective is a trustworthy service. As a seller, I haven't faced any particular problems with selling or buying, and the payments always go through. My problem with Vestiaire Collective is its customer support. Firstly, I recently tried to list some amazing special designs of Bottega Veneta clutches. The first one was accepted because it had a special tag of it being a limited edition item. The other two, which were also rare designs needed more photos to authenticate. Vestiaire Collective was asking me to post a photo of their serial numbers (inside the clutch), but Bottega Veneta clutches do not have a serial number attached on the clutch (or did not have when I bought them). It is a pity for Vestiaire, which is considered to be a luxury item reseller to not know how to authenticate common luxury items and ask for something which should not be there. Secondly, as a buyer, I have tried to buy a lovely dress(and the seller was Vestiaire Collective), so I thought everything would be easier as it is the most trusted seller on the platform. After all of my offers were rejected and all my questions about its condition remained unanswered by the VestiaireCo seller (which apparently does not want to participate in its own procedures) I added the item to my basket. Even though the item (with a tag on it) was already at Vestiaire and had already been authenticated, and while I live in Greece, I was required to pay 20 EUR for shipping and authentication. I ended up not buying because I tried to discuss why the Shipping Cost was so much higher since direct shipping is free but Customer Support was not helpful once again. On the contrary, whenever a review is made here, Vestiaire Collective is very helpful and always has a solution. I trust that you will contact me and help me with the problem. Thank you in advance\nUPDATE: A member from the Customer Service team got in touch with me to let me know that they will reconsider posting my 2 items, and an hour later my items were posted without asking for further information! Concerning the item I wanted to order nothing changed..","title":"VESTIAIRE COLLECTIVE CUSTOMER SUPPORT","stars":3,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-22","author":"Olivia Shuttleworth","text":"I posted an expensive designer item (Moncler Coat) out to the buyer on Monday 22nd October via VC’s Direct Shipping. I received a text receipt at the UPS drop off site and on Tuesday 23rd October I received an email from VC confirming that the item had been delivered to the buyer and I would receive payment within 72 hours. It is now Friday and I hadn’t received payment or any communication from VC so I checked the website. I’ve now seen that the buyer has has submitted a claim, so my payment is on hold until the claim has been investigated. \n\nI contacted VC through their online chat service and have been informed that the buyer has made a false claim of receiving an empty box. They’ve provided one picture which just shows the box with a small gap to the top of it which suggests nothing. I am 100% confident that the item was in the box and therefore I know that I am being scammed here by the buyer. VC haven’t done much in terms of reassuring me that this will be resolved all they’ve said is that they’re currently in contact with the buyer and the courier company and that I’ll receive an email within 14 days confirming what the outcome will be. \n\nIf this is something that happens regularly which I’ve seen in previous reviews, then VC should have the item sent to them to authenticate before sending out to the buyer to avoid claims such as these! The coat was initially purchased for £900+ and only sold for £360 (of which a large proportion is removed for VC commission). \n\nIf this does not get resolved I will be escalating things further. \n\nItem reference number - 18156779","title":"Review before escalation","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-22","author":"Darina","text":"The most incompetent customer service team EVER! As a seller, the platform will never ever be on your side, and you will be left begging for your own money to be transferred to you. \nI have sent the purchased item the next day after the purchase (on the 30th of September) via Direct Shipping. \nA. Hermes delivery lost the package for 4 days. \nB. It was delivered to a drop off location on the 8th and has been there ever since. (it is the 22nd now)\nC. The buyer has been notified multiple times to collect the item (ONLY after I asked Vestiaire to, cos they don’t do anything themselves)\nD. I have now been contacting customer service for two weeks, with no resolution, no support, absolutely no accountability while the platform is still keeping and claiming MY MONEY. \n\nThe package has not been accounted for almost a month! It can literally be anywhere, in a puddle somewhere, getting stomped on, in a bin and yet SOMEHOW Vestiaire claims that it is still my responsibility and when or rather IF the customer collects it and something is wrong with it, it's my responsibility and I will not get paid for it! (It was a brand new item by the way, with all the tags, hygiene stickers, labels and a dust bag)!!! That is absolutely disgusting service, impossible to get. in touch with, they refuse to give me a contact email for a manager or a team leader and just say \"it is what it is\". \n\n*UPDATE 22\/10*\nContacted VC again (like I have been doing for the past 5 days, every day) via their chatbox. I was told the buyer had 5 days to collect the item since it was delivered on the 8th. (It was not) Despite that, still will not get my money until the buyer receives the item... Whatever backwards logic that is. Customer service treats me like an idiot saying, they cannot pay me, they should pay me after those 5 days, but they cannot cos they have no confirmation from the buyer...\n\nThat is how they speak to customers by the way (C+P): \n\nME: You treated me like I did something wrong, like I am the fraud and that I need to be checked if my item is okay or not, while the buyer had all the advantages she could. In the mean time I spent MY TIME to basically BEG for my money that you owe me to be transferred to me. SO an apology doesn’t cut it\nMary Jane D.: I did not treated you like you did something wrong however I already explained the situation however you still complaining that is why I am asking what do you wnat me to do.\n\nDO NOT USE THIS PLATFORM IF YOU DO NOT WANT TO LOSE YOUR MONEY.","title":"The most incompetent customer service…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-22","author":"Stuart Rathmell","text":"Paid £900+ for an item which I was told shortly afterwards that the seller had indicated was not available. I was promised a refund within 72 hours.\n\nWe are now 3 weeks on and I have had no further contact; my emails have remained unanswered. I have had to escalate to a credit card claim....\n\nAs a comparison, emails and refunds from Hardleyeverwornit are dealt with promptly.","title":"Is there anybody there........","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-22","author":"mengyao dong","text":"worst customer service, my items as lost , then they have 2 person responding to my enquiry , both said will get back to me , then there is no reply .","title":"worst customer service","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-22","author":"Mrs Melissa Lund","text":"I like the idea of VC but frankly they need to have better comms.  There's no phone number now, the direct e mail doesn't work and the chat function crashes all the time.  Frustrating!  On top of this it's big on beaurocracy and very keen to make sure that customers never get through to anyone vaguely in charge.","title":"Vestiaire incommunicado","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-23","author":"Ben","text":"The way VC handles cases where the buyer clearly abuses the “pick up from collection” option to accommodate their buyer’s remorse has got to change! Their policies supposedly prevent buyers from changing their minds about purchasing, but this “pick up” option allows dishonest buyers to abuse the system, and at the end there is no protection for sellers at all. It keeps happening and just beyond ridiculous. This is some ebay level of BS. I’m not gonna even mention how crap Hermes is as a courier, but with all this “collection point” non-sense that keeps happening to sellers, their UK branch is just waiting on a massive lawsuit to happen. \n\nOn top of that, the customer service is just atrocious. There is no phone option, the non-stop back and forth in the chat is just exhausting. They clearly hire random incompetent customer representatives from all over the world, some barely able to communicate efficiently in English. If you escalate a case, then you better get ready to put in hours and hours of your time untangling the mess bc they will pass your case onto various representatives and the communication will just be so confusing, it will actually exhaust you to the point where you want to just give up on chasing after your money. I’m almost certain this is their strategy, that they’re gonna exhaust you with the chats and emails so you just give up on asking for help. VC should be ashamed.\n\nUpdate:\nThe response VC just posted to my review is a classic example of them NOT understanding what the complaints are even about! First of all I’m the seller, not the buyer! Secondly, when did I ever mention anything about a “cancellation”? My review is about an item I sold which the buyer refused to collect and is now in the wind. I shipped the item on time, I fulfilled all my responsibilities as a seller, the buyer is one that is dishonest (made up lies about the item not being at the pick-up point when it was), yet I’m the one spending hours with the customer service and still not getting my payment? Ridiculous! Again, utterly disgusting low level of service communication, it’s like they can’t even read! (The item reference number is 17468396 if you actually wanna do something about it).","title":"Unfair treatment to sellers","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-24","author":"Justina","text":"I don’t understand what’s going on with VC lately. The last 3 orders out of 7 were not shipped, VC support even provided a fake DHL shipping number and told me to wait... Last time I bought an item on Tuesday and again - the item is still not shipped and the seller ignores my messages. Why is VC not doing anything about it?","title":"I don’t understand what’s going on with VC","stars":3,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-24","author":"Kevi Pop","text":"They know nothing about Max mara do not trust they authentication service. I have just received a fake ICON coat. It claimes to be vintage. The material is definitely not virgin wool and cashmere. It feels more like a cheap polyurethane carpet!","title":"Fake  Max mara coat","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-24","author":"Tmama","text":"I have been shopping on vestiare for years but not any more and if I could could give 0 stars, I would.  Bought a LV bag in what was listed good condition and the authenticator did not spot 4 tears in canvas in it. When I received a bag ( and spotted the damage within 30 seconds )  and raised an issue with VC ( as there was no information on tears to canvas on the photos or description) they offered to recheck it. Again, the authenticator decided that the bag matches the description ( please do show me how it matches the description and photos which do not mention or show damage to canvas and your own grading system shows that good condition means no tears???). Then they sent me an email offering that they will relist it ( and take commission of course) or they can send it back to me. I decided to take it back, of which I informed them and exactly followed the steps as they told me. And now almost a week later another support agent comes back saying \" upon review of our return policy if the return was complaint we will relist it\". I was clearly offered a return and now they decided to relist it and take a commission. Just to make sure I will be out of pocket for their incompetent behaviour. Genuinely shocking and disappointing customer service, but also authenticators who seems to have no clue how to check the bag. So here we are 20 + days after I bought the item, with no bag and or money refunded.  Item 18019568\n\nUPDATE: Things escalated quickly when overnight they re -listed the bag without my consent and without reading my emails with attachments which prove that I clearly was offered a return and chose it. VC has my money and the bag, and seems no one bothers to read the emails, neither to follow their own rules. I am lost for words on how bad this platform is.\n\nUpdate 2:\nVC apologised for re-listing the bag and sent it back to me. While I appreaciate the apology I will never buy a designer bag from them and would rather pay more with local consignor. I still think their team who reviews the bags is shockingly careless as I ended up with a bag with cracks in canvas which I would never buy if I was aware of this defect ( and anyone would know that Louis Vuitton would not repair canvas but they can replace leather parts). If the seller is not honest there is high risk the VC will not do much about it and I don’t think the platform is worth my money or nerves. \n\nUpdate 3: \nIn reply to VC comment below, please do read with understanding . Your team of “experts “ twice denied they could see a damage to the canvas of the bag while the VC grading system states there should be no tear to the item if item is listed under good condition, neither the photos uploaded by the seller showed the damage to the canvas. The team of experts does not follow the VC grading system neither they check the bags properly as the damage can be seen with naked eye. So no, the team did not rectify the mistake at all, because if you think the solution is to give a customer a choice of 1. either taking back a faulty product which team of experts failed to spot the damage or 2.tell the customer you will relist the bag for them but you will take 25% commission on it : it is not a solution’ at all . It is simply punishing a customer for the mistake done by the team of experts.","title":"Shocking customer service and poor quality check","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"},{"date":"2021-10-24","author":"Dominika Wojewódzka","text":"Please be warned. Undelivered item( 2 months ago), unhelpful service trying to blame unresponsive courier. Every 3 day remainder to respond (I dont know for what) if you will not respond they will close topic and you wont see any money back. Worst internet shop\/service ever. Never buy from them.","title":"Please be warned, no item, no refund","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=39&stars=1&stars=2&stars=3"}]