[{"date":"2022-01-18","author":"Helena","text":"PLEASE STOP USING HERMES AS YOUR DELIVERY COMPANY!!!!\n\nThey can’t find an address on a simple map! They lie about trying to deliver and they have lost my parcel for the hundredth time.","title":"PLEASE STOP USING HERMES AS YOUR…","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-18","author":"Louise","text":"I have been a buyer for a few years (and I spend a lot!) I am tired of the endless cancelled sales and sometimes wait weeks for a refund, tying up my credit card funds, in November 2021 I had over 11.5k of outstanding refunds from cancelled sales, this month 4.5k so far! Your free shipping credits or promotion vouchers disappear and are lost with cancelled sales. Offers regularly don't work.\nI tried selling, which was an even worse experience. My first item was rejected for one very minor crease on the leather (we are selling second hand goods here). Yet I received an item a day later which had serious non-photographed or described defects (theres no consistency). Today another item rejected because the UK hub can't confirm authenticity! Its obviously authentic, I have been buying and selling Chanel for years I know my stuff. Its insulting and now I have to pay (by bank transfer) to get my authentic item back which can take up to 14 days! Yet fakes are uploaded on a daily basis (supposedly vetted before going live) What a waste of everyone's time.","title":"POOR PLATFORM FOR BOTH BUYERS AND SELLERS!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-18","author":"yeung mimi","text":"I feel hopefulness, disappointed and shocked. I was sold a pair of Vintage Dior earrings, they requested its'  receipt but I bought it at Japan Dior store such a really long time ago as a vintage style like more than 10 years, may I ask how to keep a small amount little sheet for so long??? They don't know how to clarify it then their team said the item was not compliant. At this moment, they keep my earrings for more than half years now and still suck at their \"hub\" because they request me to pay them a process fees, so ridiculous? OK then, they give me a non-local bank account which is not in my living country, so my bank will be going to charge me 40USD for oversea transfer fee, which is much more than the \"VC process fees\". So I have talk to customer service to ask for a local account and they answered like a robot said,\"we can accept transfer internationally.\" I wanna ask from my deep heart that is it make sense?  I have buy and sold many items for years in this website and never happened this case before, but now they treat me like this. I don't know what can I do and now I can't get back my beloved earrings.","title":"I feel hopefulness & disappointed, just wanna get back my Dior earrings","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-18","author":"B.r","text":"Orders are constantly cancelled because users scroll through items already sold and contact the seller convincing them to sell for more money. For example, see listing reference number 18686386. The user in the comments here constantly comments on already sold items, convincing the seller to cancel orders to sell to them for more money.\nBecause of this the order gets cancelled. Why not remove items from public view once they are sold to prevent this from happening? Very disappointing for buyers and makes no sense to show sold items to public.","title":"Orders are constantly cancelled because…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-18","author":"Ramona Tataru","text":"Absolute incompetence in their Customer Service team\nI bought a skirt in November and after 2 weeks it was shipped to me. The vendor was super nice and fast.\nThey are still tracking when shippment got lost. After making a complain through paypal (I wanted to make sure I have some back-up when paying after hearing other stories), they discover parcel is in theit Hub since December. Still to day, they are struggling to resend it. Every mail or reach to their customer support is completely useless.\nI have removed all my items from selling and once this is sorted out will cancel my account.\nThere must some other decent options out there.\n\nSurprised to see how fast you react here, compared to customer support. The address was not wrong, it was the one of the pick-up point beloning to the courier you use. Due to lockdown, it was closed and even though I informed your team twice via chat, no one cared.\nI wrote to DPD to ask for status after a month and even sent you the mail with their reply. As you were the sender, you were the only ones able the request the investigation, yet the parcel was already with you, but again no one bothered to let me know.\nActions were taken after the complain to paypal and even though I provided a new address to customer service and via app, I keep getting messages that I need to update it. \nI just want this sorted out and then cancel my account, I’ve already removed my products from sale.","title":"Absolute incompetence in their Customer…","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-18","author":"Jane","text":"Worst service ever!! \nCustomer service never replies to me only when I submit a comment here on trust pilot. I sold an Item end November and still have not received my money 2939 euros because VC said I owed them 291 euros. Which I cannot prove that I don’t. So on the 10th of January I transferred 291 euros to VC and my bank confirmed that VC received the money on the 11th of January. VC replied here on trustpilot 5 days ago that they would unlock my 2939 euros when they had confirmed my payment of 291 euros. Still now it’s the 18th of January and I still have not received any confirmation that they have received the 291 euros or any payment of 2939 euros. When I write to them on their customer service they don’t reply. They have no excuse what so ever not to pay out my 2939 euros. It’s a lot of money that VC just have stolen from my because they don’t reply to my with any solution AT ALL","title":"Worst service ever!","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-19","author":"Rav Panesar","text":"I ordered a product but the size was wrong as the ad was very misleading. I emailed VC and were very unhelpful and since have not been responding to any of my emails. \n\nWhy are we paying a service fee when there is no service from this company???","title":"Keep away! Unacceptable customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-19","author":"Bianca","text":"I bought a bag from a seller in the Netherlands on the first days of January. I also paid for authentication so the package should be shipped to Vestiaire offices in Paris. I have a UPS tracking number and the package looks stuck in the UPS access point in the Netherlands since more than 10 days. Vestiaire customer service told me they started an investigation last week but I just contacted UPS and they confirmed they never started any claim, nor the seller whom I cannot contact because Vestiaire banned me from the chat just for trying to ask her to start a claim with UPS. I have no way to contact the seller and I cannot open a claim myself. I seriously don't know what to do or if I will ever receive my money back or the bag even if it looks lost. I have been a loyal customer, sold and bought a lot from you. This is so unfair.","title":"UPS lost article and Vestiare is doing NOTHING","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-19","author":"Margarita","text":"SCAM - ZERO STARS - STAY AWAY FROM THIS SITE!! TOTALLY UNETHICAL BUSINESS. CHECK THE REVIEWS BEFORE BUYING. \nLike many others below, I've had the worst experience and shall never buy from them again. Please read before buying: \n- Bought a vintage YSL bag and paid for the authentication process, total €412. The bag was delivered on December 11th. I used it once before Xmas and then not again until late December due to travels. The second time I used it (I was wearing light coloured clothes), I saw some very noticeable stains on my camel coat and grey jumper. I rubbed a white paper on the bag to make sure it was the bag staining before reaching out to VC. \n- I made contact on the 6th of January (outside of the return window which is 14 days according T&Cs) and was told I would get a response in 24h. Silence. After 2 chase emails, somebody gets back to me on the 10th asking when the item was delivered, which they could have checked their end, but okay. \n- From here, I was asked to provide photos of the damaged clothing and the bag. I sent photos of the stained jumper (the coat was washed and the stain came off). I also sent 2 videos of me rubbing a white paper on the bag to prove it does stain. \n- Solution from VC is: sorry you've had a problem but because you're outside of the return window, the only thing we can do is offer you to re-list the product at no cost for you. In other words, become the seller of a faulty product that damages clothes and then assume the risk yourself. \n- they have now told me 3 times to re-list. After I tell them I do not accept this solution, they keep copying and pasting the same reply over and over. Also don't reply to the WhatsApp 'helpline'. \n- As VC refused to provide an acceptable solution, I had to resort to contacting the seller via leaving a message on the original listing. The seller very kindly said she would help via VC. She messaged me yesterday to say she was trying to help but VC told her that there is nothing to do, that I must re-list the bag. WHAT THE HELL!!! \n- So to sum up: 1) VC is not taking responsibility for their clearly faulty authentication process 2) they're asking me to pass on the problem to someone else 3) they're asking me to list and wait an undetermined period of time until I sell it\/if I sell it to recover what I paid for and potentially make a loss 4) alternative is for me to keep a €400 product that will ruin my clothes 5) Am I being penalised for having worn dark clothing the first time I used the bag and not noticing the issue? How is it logical to have to check for staining on a vintage bag when there's been a paid for authentication process? 6) they are stopping the seller from providing a solution which she is willing to do. \n\nI understand I'm out of the 14 day window but this is not a solution at all. Zero lux experience. \n\nThis company's sole goal is to take the buyer's money, this is where their interest ends. From here, once you have an issue, you're on your own. \n\nI shall report this problem to the ombudsman due to the lack of solution from VC.","title":"SCAM - ZERO STARS - STAY AWAY FROM THIS SITE!! TOTALLY UNETHICAL BUSINESS. CHECK THE REVIEWS BEFORE BUYING.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-19","author":"Sam","text":"I sold and posted an item in november, whilst monitoring the tracking I could see there was an issue. Customer services were not helpful, nor were the courier service. I've contacted them several times over the past two months and repeatedly have the same automated message, they say they will get back to me when I use the chat service but they never do. I'm owed £90 and they have no interest in refunding me or the buyer \nAwful\nDo not use","title":"Do not use","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-20","author":"Laura ","text":"Vestiaire really needs to get a handle of their shipping charges. They are insanely high and not allowing to combine shipping is ridiculous in this day and age of online shopping. I am completely put off from buying because of the charges which means sellers must be seeing a huge reduction in sales. €13 per item is way too much! So disappointed. I loved the experience up until they changed their direct shipping charges","title":"Vestiaire really needs to get a handle…","stars":3,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-20","author":"Fashion","text":"Absolutely awful. Disgraceful customer service. Have a case going on since November (it’s 20th of January now). They made a mistake and now are not transferring my money for no reason. All I hear is false promises and basically lies, their ‘expert team is looking into it’ since December 5th. NO news, NO money, NO nothing. Kept on chasing, talking to people, no one did anything. Really pathetic how they also don’t want to share the details of their legal department e.g as they’re holding my money for no reason and in fact I should be entitled for an interest%? VC used to be a great, fancy version of Ebay but it has been gone sooooo low, it’s awful. Might as well put it on the same shelve as Vinted. Disgusting.","title":"Absolutely awful","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-20","author":"Jennifer Miller","text":"Terrible purchased a Versace necklace £400 meant to be very good condition. Necklace arrived green filthy with rhinestones missing and completely discoloured, Vestiaire wouldn't refund they went on to re list after a secondary check without asking me and completely changed the description to match the above. £120 in import fees and they want to reclaim further selling fees AVOID!","title":"Terrible purchased a Versace necklace…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-20","author":"K Well","text":"Terrible customer service.\n\nDoesn’t check the items properly and when you want to return something they basically ignore you.\n\nI have bought a number of items which were fine and then bought some shorts which arrived without a button and a lot smaller than advertised.\n\nAfter trying to return them I just get emails asking me to send pics repeatedly and now just automated responses.\n\nTerrible behaviour and a complete lack of care for their customers.\n\nI would definitely not recommend buying anything from here","title":"Terrible customer service and company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-20","author":"A non","text":"The worst , non responsive customer services team I have ever met. The site has awful UX as well but please do not buy from VC.","title":"Do not buy from VC","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-20","author":"DrLynda AN","text":"The items on this site are good however, the customer service is useless. I ordered an item from Italy to be sent to a aramex shop and ship address which has to saved in my address book on their site. There is no option to put the address when checking out it automatically picks up the address from your saved addresses then shows you where the item will be delivered. Instead of sending my item to the saved address they sent it to a collection point in Italy and despite spending hours between the customer service on vestiaire and UPS I could not retrieve or reroute the item. Vestiare insisted I gave them that drop of address which is ridiculous as I live in the middle east so clearly I would not give them a n address to pick it up myself. Until now I am still waiting to see if the item will reach back to the sender. Then today a second incident happened exactly the same scenario, I gave them my Aramex shop and ship address in France only to receive an email from Vestiare again telling me I have to go and collect it from a drop of point! I tried to get sense out of the person on the chat line who basically said I have to find someone in France to collect it for me then ended the chat.\n£700 pounds has now gone out of my account for items I have not received and the process to make a claim is a joke. I just pray the items reach back to the sender for me to get a refund!\nApart from that there was also two occasions when I ordered something and paid for it only to wait a week to be told the item is no longer available and them had to wait for a refund.\nVery very bad business model. While the principle is great I've not had a single good experience with this company and would not recommend them.","title":"The items on this site are good…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-21","author":"P R","text":"I had to delete an item for sale because Vestiare changed the description I submitted and it was no longer true or accurate. I couldn’t possibly sell an item that they misrepresented. Buyers beware, sellers list elsewhere","title":"Item Description Altered for Quick Sale and Vestiaire Profit","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-21","author":"Amanda Ack","text":"I purchased a wallet on Vestiaire Collective that was described by the seller as unused. It went through Vestiaire Collective's \"authentication\" process. When I received the wallet, it absolutely reeked of perfume and had clearly visible scratches on the hardware. I contacted Vestiaire Collective to request a return, since the item I received did not match the seller's description. In response, they offered me a promo code for 11.945 euro. This is shockingly poor customer service! I let them know that this was not an acceptable resolution and that I would open a dispute with PayPal if necessary. I am well within my rights for a refund, since the item I received was obviously not as the seller described. Avoid Vestiaire Collective!\n\nUpdate #1: After I told them I'd file a PayPal dispute if necessary, they agreed to recheck the item. They provided a return shipping label (although it wasn't added to my account immediately - I had to ask them about it). We'll see what happens.\n\nUpdate #2: They rechecked the item and determined that I was correct about its condition - I received a full refund. While I'm pleased with this outcome, I still won't shop with Vestiaire Collective again. I shouldn't have to threaten a company with a PayPal dispute to get them to adhere to their own terms and conditions.","title":"Appalling customer service. Do not do business with this company.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-21","author":"Auguste Beinoriene","text":"I think it was first and the last time using it. Sold the item and send it on time. I see that the buyer got it more than 72hours ago. Still havent got any information about my money and payment. Customer service is afwul.","title":"I think it was first and the last time…","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-01-22","author":"Agnes Roge","text":"The item never came and as had been shown from DHL has been returned to the Shipper\na refund has never been made though","title":"The item never came not a refund though","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=22&stars=1&stars=2&stars=3"}]