[{"date":"2021-07-12","author":"Maribel Ruiz Ghanem","text":"I bought a bag, got the confirmation email from VC but the seller claims that she never got the confirmation from VC (although the item appears as \"sold\" on the website).\nI've been trying to contact VC since yesterday but have had zero luck. What a HORRIBLE costumer service!\n\nUpdate:\nAfter trying non stop to contact them -and being very frustrated about it- I was able to do so and they solved the problem, however I do not recommend trying to reach them through the chat on their app as it will always say that no one is online (however the chat on their web page does work) and they don't have a phone number for contacting; also the app, in general, needs improvement and the web page is very slow but they will respond eventually.","title":"Really hard to reach costumer service","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-13","author":"Aldona Tucholska","text":"This place is a total mess. I wanted to place an order and everything was set up with the seller. I tried to buy an item for the agreed price for at least 4 times, but each time my order was magically cancelled after an hour or two (the seller claims there was no trace of the purchase, and considering the fact how Vestiaire works, I'd trust her). After I tried buying the item for the full price, my account ceased to exist. I tried to contact the customer support regarding my \"cancelled\" orders and received no response. I was refunded, but lost a plenty of time. Seriously, don't waste your time here\n\nJust as a small addition to vestaire’s comment below: the issue described below has nothing to do with my comment above and was explained with customer service, when my account was checked and nobody said there was .com\/.con issue. I was told to close and reopen the account, which I did. The circus started after I opened an account using my backup e-mail address, just to make sure it won’t get messed up again. Your comment basically didn’t address the issue","title":"Waste of time. Do not recommend","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-13","author":"Beatnik","text":"I wish it were possible to give a score of zero.  This site is scary.  I sold and mailed a skirt. Vestiaire site indicated item received and assessment in progress but the FedEx tracking did not indicate received. There was no update once item marked received from\nVestiaire. To open an investigation they wanted a copy of my drivers license or passport id. I explained US does not have National ID. They finally accepted School ID. Then they wanted a handwritten letter and they would not accept email or electronic signature. What kind of backwards business is this.  These requests make me question this company.\n\nAlso, when the Vestiaire site says item received and review in progress, why is the investigation not internal. This company is run like some hole in the wall run in someone’s basement.","title":"A zero score is too high for this company","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-14","author":"Katie Jones","text":"Worst customer service I have ever seen and I work in retail. Is this company even legit? I’m trying to buy a bag and the discount code that they offered since I’m a new member doesn’t work. I only get bots and people who don’t understand or can’t help me then they say they forward to email but that also doesn’t help me either. No solutions and I am now scared to buy from this company, after reading all these reviews and people having similar very bad experiences I won’t be shopping here ever! I recommend you to never shop here too and be careful!","title":"Worst customer service I have ever seen…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-14","author":"ALISON SAMUELS","text":"I ordered on the 17th June.  The item arrived on 14th July.  Meanwhile it was tracked from England to France, back to two distribution depots in England and the chat bot spoke only French.  Finally turned up today - crumpled, crushed and stuffed into an paper envelope.  Condition of ties shows it wasn't even ironed before it got into the envelope.  I get far better service on Ebay.  The item is authentic, but since it has been mangled and outrageously delayed in getting validated, I would have done better to buy from the vendor and assess it myself.   I can't tell its condition until I have laundered it.  Honestly, it was for my daughter, came too late for an event, and when I took it out of the bag I wanted to cry.  So if you want to feel like crying when you get your package, this is your supplier.","title":"Stuffed in a brown paper bag","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-14","author":"Khrystyna Shakhmatova","text":"Useless return policy. After being given false information about the item by a seller I still could not return it. The justification of the customer service was \"the incorrect information has been given in comments, and not in description\", so the return policy does not apply (???go figure!). I am now stuck with the item and have to deal with trying to sell it myself...thanks for nothing, Vestiaire. Never again.","title":"Terrible return policy! Be careful with this site.","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-15","author":"Grietje Jansen","text":"Not a trustworthy firm. I demanded to stop using my data for marketing cf GDPR but they keep sending me mails and keep in using my data. They use some pathetic unprofessional excuse. If they cannot solve this beware of having other issues with them.","title":"Not a trustworthy firm","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-16","author":"Js","text":"Do not ever buy from here! Especially their premium service is misleading from the beginning! Customer service is no help…useless. Real bad!","title":"Do not ever buy from here","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-16","author":"Dan Mc","text":"Terrible experience. Needed a suit for a wedding and decided to give Vestiaire a go. Found one I liked and ordered it on 30th June. Vestiaire did not confirm the order until 5 days later, only for it to be cancelled by the seller on 11th July. I then ordered a second suit on 12th July. On 16th July I was told that item was also no longer available. On both times they had taken the money despite the items not being available. Won't be trying a third time. Nothing seems to exist","title":"Hopeless","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-16","author":"Mona","text":"The worst customer service, they do not answer your query properly and the item  I purchased stated Very Good Condition although my bag was heavily scratched and had peeled off in some places. The leather was scratched and again had peeled off in some places and had a cracked clasp, it also arrived with dust and hair inside. I requested for it to be reviewed again which they said they were satisfied with the quality and would either put it on sale (which they did without asking) or send it back. I wanted it back as I knew I wouldn’t get what I had paid for it. Further to this, they didn’t tell me I may have to pay additional tax & duties for it to come back to me. Their careless care is awful and not aligned to the luxury nature of the business.","title":"The worst customer service!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-18","author":"HS","text":"If I could give it less than one star I would.\nSHOCKING customer service. I have made the colossal mistake of buying a piece of vintage jewellery for a friend’s 70th birthday. A very special occasion. They took my money, it’s been over a week since I heard from anyone. The birthday has come and gone, and I can’t contact the seller because apparently that’s in breach of their policy. Either way I am here out of pocket and without a gift. I have wasted hours with some random chat bot pretending to be customer service. This is by far the WORST experience I have ever had and I buy vintage pieces often. DO NOT buy from Vestaire.","title":"If I could give it less than one star I…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-19","author":"Mrs.GGTodd","text":"During these hard times, me and my girls have founded the new world of preloved items. I absolutely love The Real Real and Fashionphlie. One of the high fashion magazine rated Vestiaire Collective as number 1 for finding vintage piece or just adding something different to your collection. TRR and Fashionphile followed 2nd and 3rd. PLEASE DO NOT TRUST THIS WEBSITE. You have to know your designer key authentication marking to not fall victim to knock off. \nI have several designers and we did our checks from the pics posted with the description. I ordered a very beautiful Fendi swimsuit. As soon as it arrived I checked the piece for key marking. I found some discrepancies. I notified VC. They ask that I ship the swimsuit back for a second inspection. They ask for pics of the discrepancies. This item was shipped right back to me with no additional information concerning my concerns. I chat with a VC rep. She said the second inspection also said the item was authentic. I ask can you tell me who inspected and did they look at my pics of the discrepancies. She said nope no info to share on the second inspection. She said if it was shipped back it is real. WHAT ABOUT THE ISSUES I HAVE WITH THE KEY MARKINGS. I expected to receive an email or something posted to my VC account about the second inspection. For all I know they could have just shipped it right back without even looking at the swimsuit. this was poor customer service. I closed my account and deleted the app from my phone. I realize the seller can say whatever they want about their items. Once you pay for it the seller ship it to VC and VC CHECK IT ACCORDING TO THE DETAILS LISTED FROM THE SELLER. I WONDER WHO IS CHECKING FOR THE CUSTOMER. Think about your customer. Also you have to pay to have them to authenticate the item. TRR and FPhile do not charge to authentic the item. You would thing VC would charge the seller to authentic the item! i meant you don't want counterfeit pieces listed on your website. These type of situation will compromise VC integrity with customers","title":"VC is BS!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-20","author":"Beatnik","text":"The magazines listed this company as great for resale.  This makes me suspect these magazines.  Not at all credible.  In my opinion The Real Real is a million times better. VC is not even close, run like of out if someone’s garage.\n\nVestiaire says it’s trusted.  By whom? Certainly not me. They indicated that my item was delivered and in assessment, but now are indicating my issue with mail delivery because tracking not entered. They bloody updated the history of my item on the website to indicate it was delivered to them and it was in assessment. That they are “checking the item matches it’s description and brand standards.” These are their own words as to the status of the item.  Clearly you can’t check something that has not been received.  Now they want to wiggle out of the fact the item has disappeared on some technicality as to tracking.  Why does tracking matter when you updated the site to indicate that the item was delivered. This is the definition of untrustworthy. Apparently delivered no longer means delivered in Vestiaire world.","title":"The magazines listed this company as…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-20","author":"Natalie Barkus","text":"Seriously, do i need to write a bad review everytime i need to get hold of u. I personally don't care that buyer haven't collected the item yet. Can i get paid????????","title":"Seriously","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-21","author":"BARDSLEY74","text":"This company is awful. They don’t care, they have no customer service and trying to cancel their mails is like trying to get rid of herpes.","title":"This company is awful","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-22","author":"K S","text":"Problems again. They send me WRONG LABEL for direct shipping, and then after I contact them and try to sort it out, the strip me off expert seller badge. SHAME on you, Vestiaire. VERY VERY DISAPPOINTED, and will have to complain officially again and report you everywhere.","title":"Problems again","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-22","author":"K S","text":"Problems again. They send me WRONG Label for direct shipping, so I have to contact them next day to sort it out as the courrier would not accept the package. Then they strip me off my seller's badge. The support just mocks me. Inacceptable behaviour.","title":"Problems again","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-22","author":"K S","text":"They make you pay for their mistakes. Sent me the wrong label for direct shipping, didn't attach commercial invoice requested by the carrier. It took me three days to get them to send it to me, with many mistakes and wrong invoices submitted mid-way (first it was an invoice for HongKong while the buyer is in the UK, then they send me invoice for myself as if I have to ship the item to my own address). So I send the item in 6 days time - surprise, they penalise me for sending it late! Despite the fact that I tried to send it next day and only failed due to their incompetence. They strip of my badge, and - surprise again! - their representative says it's my problem and I should work harder. Astounding disrespect of their customers.","title":"They make you pay for their mistakes","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-23","author":"Yulia","text":"I wrote several reviews on how they refuse item after item based on their \"careful examination\" which is normally a real joke. Recently after one of my items was refused because they could not determine its authenticity, despite ton of clear pics and tags and hallmarks provided, I went as far as I found the same products already sold on Vestiaire Collective. The same ones, with the same stamps etc. So I forwarded them to the so called \"customer support\" and asked why these were authentic and my item is not. No clear answer was received, they only kept insisting my item is a fake which was completely jaw dropping as it was purchased by me personally years ago. Having said that, I really can't understand who is doing this so called \"authentication\" in there.\nListing items is a total pain and takes days for someone to at least look at them, refuse and then you spend days fighting CS which behaves like brainless bots.\nIn addition, they started bombarding me with daily emails pushing to drop the prices. This is very annoying as prices are already more than fair given the fact that everyone would send a low ball offer anyway which recently became an issue as well. \nSomeone without any userpic would send the lowest offer possible, I would decline and that \"person\" would never appear again. I suspect these are VC bots meant to push the sellers to accept these low offers, so that VC could send their \"psssst, we did not tell you this\" emails to the genuine people who actually liked the item.\nVestiaire Collective, this is VERY annoying. I am just so fed up with this all, so no longer con","title":"Company in decline","stars":2,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"},{"date":"2021-07-23","author":"Mrs Gabeva","text":"As if it was not bad enough but VC “service” and “expertise “ has gotten below zero.\nJust received an email that my item Ref. 17131379 has been rejected as “non-authentic “. The super ridiculous thing here is that this same item was bought from VC on May, 8th, 2018 , item No 5670063, under order No 18503132 and they was “successfully autheticated”! Can it get crazier than that?!?! I mean - what is wrong with everyone in this company ?!?!\nAbove all, as a super Chanel lover - i shop exclusively from Chanel for more than 10 years, and i can for sure say what is authentic and what is not, in contrast to the VC so called experts. And this item is a 100 % authentic!!!\nOn top of that i am expert seller with 415 sold items. I am beyond disgusted by the service the company provides that has significantly declined the last years. I do not have high hopes that they will fix their mess as they usually do not, due to lack of professionalism and care for the customer!!! Totally appalling and disappointing, again and again. \nI contacted their “customer” service which is usually useless. Lets see whether they will fix their mistake. And if not, this time i will actually take legal actions to reinburse me for the product that i have paid to buy to them which now they “claim” is non-authentic. Which again, you need to be a total idiot to see that it is authentic. \nTotal disgrace for VC!","title":"DISGUSTING","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=53&stars=1&stars=2&stars=3"}]