[{"date":"2020-11-14","author":"Victoria Diaz","text":"On Oct 6 I've sold an Acne Studios cardigan and VC does not process my payment. It's not a new situation as it has happened before.\n The buyer by mistake mentioned that there's a problem with my cardigan. Then later the buyer sent me a message that it has been a miss-understanding, that she loves the cardigan and she will keep it.\nThe buyer never sent the cardigan back to VC (as VC told me).\nThe buyer kept the cardigan, and the buyer is super happy about the purchase (the buyer told me so via message).\nI contacted VC's customer service about this payment issue and they told me \"we'll contact you in 3 days\". The never did. I HAVE MORE THAN 1 MONTH WAITING FOR MY PAYMENT. To talk to them is like talking to a robot or to a wall. Even to talk to a wall could be more rewarding since their customer service people are very arrogant making the experience very unpleasant. They made me feel like I was selling bad things (when the true shows that the buyer is very happy with the purchase).\nThis is not the only product it hasn't been paid to me.\nTo write in Trustpilot is more effective than contacting their arrogant stuff via chat as they only answer you one thing \"we'll send you an email\". It doesn't matter the question or the problem you have, the only answer you get is: \"we'll send an email\". They never do, or the mail you get from them is merely a technical description of your chat with them. No solution. My problem is genuine. VC exists thanks sellers that create content and they make everything very difficult for sellers. Yes, you can sell some items but it takes a lot of time, nerves and patience. Other secondhand platforms are far more \"human\" with sellers than VC. They seem to hate sellers.","title":"On Oct 6 I've sold an Acne Studios…","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-14","author":"Prada","text":"I have many negative points to share about this company. However, I only interested in sharing the crucial issues; \n\n1) VC often lied about the payment to their seller. I have experienced this more than five times. In which, they informed the seller that the payment has been made. In fact, they never did the pay-out. Usually, they will be persisting, that the seller should wait after 5 working days for the money to arrive. After that, they will inform the seller that there was an error on their system which failed the transaction. Thus, the seller needs to wait another week for VC to proceed with ​the payment.  In fact, they never settle the payment. By this trick, they can delay the payment for approx. 2-3 weeks. As I can not accept their dishonest gesture any longer, last time, I was insisted on them to provide me the proof of transfer for the failed attempts. Of course, they can't provide them, quite simple; they never made the payment. \n\n2) their direct-shipping platform is very biased and at the same time very risky. It is so easy for the buyer to claims that the item does not meet the description, etc. Remember, there are also many dishonest buyers. i.e. the buyer will claim the items are not as described. By this approach, the dishonest buyer can use the item for a week or even longer. In the worst scenario, the buyer returned the item with some damages on it after they used it for free. Please note, buyers have their rights protected by its credit company, etc, for example, open a dispute in case of problems. As a seller, if VC or the buyer holds your item then the process will be more complicated. Namely, no protection. So, seller, please be aware of this as VC doesn't really protect their seller. \n\n3) I bought a Drew-Chloé bag. I have doubted the authentication of the bag, they are insisted that their experts were rights. The only option I have is to re-list the item. When the bag is sold at VC, they asked me to provide the receipt because they can't authenticate them. Really? so, they have sold me a counterfeit in the first place. Then, contradict their own credibility afterward. Because of this, they downgraded my status as an expert seller. Hence, the expert seller status is rather a sloppy judgment. \n\nAbove all, I am aware there are no perfect customer services, but keep spreading lies and use the customer both seller and buyer as a free sources of capital are a very disgraceful way of doing business.","title":"Absurd direct-shipping services","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-15","author":"Ji","text":"FRAUDULENT COMPANY!\nI was about to check out an item and I used a $20 coupon code on the item, then all of a sudden they charge me $20 import \"fees\" they never charged before? How convenient, all this ON TOP of $30 shipping on just a $100 item? No thank you!","title":"FRAUDULENT COMPANY!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-15","author":"Liesje Chanayla","text":"DO NOT BUY HERE. They do not check for authentic product and SOLD me A FAKE cartier necklace. Now they are ignoring my emails. I am going to sue the company for selling me fake, and make an online page about their fraud. My order number was 12311771 :) it is the same because I have written so many emails. I learned it haha. I’ve send it to vestaire for second check. They also send me a fake fendi jacket. Until solved I leave my review","title":"DO NOT BUY HERE","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-15","author":"Flora Wied","text":"Quality control at VC:\nBurberry trench coat for 90€ was not compliant - all the defective parts were shown on the images?zzxand my sold product was sent back + I lost my expert seller batch?\nSorry but I think you handled things way to harsh","title":"Quality control at VC:","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-17","author":"Aris","text":"VC’s customer service is horrible. I have contacted them 5 times to get a refund but the online help center didn’t help. Everytime they would say that they are working on it, but it’s been two months I’m still following up with them! \nTheir websites has uncountable bugs. I bought their premium and supposed to be able to research items. But someone else can still purchase during my reservation??? How absurd! Improving your system and customer service! \nThe quality control would lie for their professional sellers. I bought a Dior bag and there were pulling threads everywhere. The seller lied about the condition and VC helped to cover the flaws! How can I trust you again?","title":"VC’s customer service is horrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-17","author":"JT","text":"Horrible first time experience!!\n\nVestiaire offered a \"free commission\" sale for first time customers and I complied by all their conditions and successfully sold my item. However, now they claim I am not entitled to free commission on my first sale due to their own slow approval process. I have contacted customer service and have heard nothing. Absolutely horrible first time experience. Seeing the amount of complaints about dodgy sellers at Vestiaire, you'd think they would try to keep new customers who are hassle free and who have a lot more great items to sell in unworn\/mint condition. But considering the absolute lack of service it seems they do not care about their customers at all. Unacceptable! They have the audacity to call me a \"valued first time customer\" when they completely ignore my complaint and expect me to continue to sell on their platform after such a horrid experience and failed customer service.\n\nEDIT: they have not resolved the issue at all and in fact have made matters worse! Please be warned and take your items elsewhere, I have never experienced such poor service- especially as a first time customer.","title":"Horrible first time experience!!","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-17","author":"Aurelia Vis","text":"Don’t trust buying luxury goods from them\nThe worst site ever! to sell and to buy!!!\nThey damaging items in purpose!!!!","title":"The worst site ever","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-17","author":"Samanta Bartasiute","text":"Very bad expierence!!! Never again!","title":"Very bad expierence!!","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-17","author":"Samanta Bartasiute","text":"Horrible experience! Send my item in perfect condition, got used and stinky!!!!!! company is a scam!!!!","title":"Horrible experience","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-17","author":"Sarah","text":"I've accepted 6 offers so far and not once has someone paid within the 24 hour window! I even went back to one buyer and said the item is available if they still want it, I accepted their second offer and the buyer didn't pay again. Is it the buyers or is something wrong with the website?!\n\nVestiere's 'recommended price' also seems to be way off. I chose my price based on items which had 'sold' on Vestiere and were exactly the same or similar to mine but Vestiere keeps recommending I half my price and therefore they are not promoting my items.\n\nI've been a member for a month and sold nothing.","title":"6 accepted offers and no one has paid","stars":1,"location":"AE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-17","author":"Joanna","text":"This company's policies are extremely upsetting to me as a customer. I purchased a pair of pants that I was really excited for, great price and the item is not available ANYWHERE else. The seller shipped it to their warehouse during the acceptable time frame, and my order history informed me it was received by the warehouse and awaiting authentication. Two weeks went by and no updates, so I opened a chat with customer service. They told me they hadn't received the item during their 15 day time frame and the order was promptly canceled, despite my protests. I contacted the seller, she confirmed she shipped it and her info said they received it just like I had seen. I contacted customer service again to dispute the cancelation, and they informed me there was nothing they could do and I would have to wait and see if it was re-listed so I could repurchase it later on. This is totally ridiculous. I was more than willing to wait and now I might miss out on being able to purchase it at all. It sounds to me like they lost the order and are blaming the seller instead of taking responsibility for the issue and trying to resolve it with me. So disappointed and have now wasted hours of my time (and the seller's time!) trying to sort this out. If a customer wants to wait for shipping delays, that should be their choice!","title":"TERRIBLE customer service and policies","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-17","author":"Lex Priscilla","text":"My items have been sitting in their warehouse in NY over a week waiting to be authenticated before they send them off to Europe. What irks me is the delay between seller fulfilling sale, Vestiaries unbelievably slow authentication and then the buyer in Europe can still reject my item. So payout seems like it will be over a month if it does happen. I think once vestiaire authenticated and checks the item, payment should be released as long as everything is authentic and matches description. I wish I never sent my items to vestiaire on the first place.","title":"My items have been sitting in their…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-18","author":"Marina","text":"Good items. But the app is not too customer friendly. Negotiation and communication is difficult. Costing is not transparent - there is always 15 euros on top, which you do not expect.","title":"Good items, but platform needs improvement","stars":3,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-18","author":"Kavege Anze","text":"Beware!!! They will scam you out of your money. I sold a leather jacket on VC. I was supposed to be payed beginning of October 2020. 6 weeks later no payment. My payment keeps beeing pushed back for no reasons. Been waiting for weeks now for a response. \nTaking legal actions now","title":"Beware!! You won’t get paid as a seller","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-18","author":"Katya SL","text":"Update! - they have now changed it from the buyer hasnt confirmed her address to we have now lost the bag haha. Was told that if they haven’t found it within 3 working days they will pay me, but after checking with someone else they said no (basically I will be waiting forever). Might as well have stuck the bag in a bin. \n\nSold a bag, got declared conform on 13 November 2020. As was meant to be paid on a Wednesday, contacted them to find out if that is happening, only to be told that the buyer had put up wrong info for the address. \n\nWhen asked when they contacted her, they said yesterday (even though the item was declared conform much earlier). \n\nNo answer as to what will happen if she does not answer. The customer service people keep ignoring questions and give the same 2 word answers over and over. As I understand, the buyer has paid them and the item was declared fine, so why cant they pay me?? \n\nOrder 12456531","title":"Bad!!","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-19","author":"Marina","text":"generally good experience, some technical aspects need to be improved","title":"nice","stars":3,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-19","author":"T.W.","text":"I have recently submitted my items to Vestiaire Collective for their 11\/11 anniversary sale, but they have not been included. I have spent a lot of time contacting customer services via the chat functionality (there’s no other way) and spoke to different advisers, who gave me different explanations or told me my items would be promoted on the sale. Never happened.","title":"11\/11 anniversary sale","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-19","author":"Graziana Peri","text":"Payment has NOT yet arrived!!\nAfter almost a mounth!!!\n\nPlease be informed that we have reviewed your item and we would like to show appreciation towards your contribution. Unfortunately as the item was withdrawn from sale no sale was recorded. WHY????","title":"Payment has NOT yet arrived!!","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"},{"date":"2020-11-19","author":"Unknown","text":"Abysmal experience. They have taken my Burberry coat and failed to pay me. I have contacted them 4 times, each time they promise they will send me the money but have continuously failed to do so for months. They have now stopped responding to me.","title":"Abysmal experience","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=89&stars=1&stars=2&stars=3"}]