[{"date":"2020-11-30","author":"nn","text":"They are a little selfish in shipping terms. \nAnd the only way they solve problems is by re listing your items which only lowers the price of your items.","title":"Only re listing your items","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-11-30","author":"Victoria Diaz","text":"Vestiaire Collective did not pay nor send back to me a sweatshirt I've sold.\nI've sent the wrong size to the buyer but they NEVER sent the sweatshirt back to me. They sent me an email saying I'll get my sweatshirt in 5-7 days but they didn't send it back to me. I've got this email announcing I'll get my item back in 5-7 days on 09\/09\/2020 and today 3 months later I didn't received my item back.\nPlease someone at VC send my product back to me. I'm tire of dealing with your arrogant customer service, tired of agents telling me they \"will check\" and let me know. Last time I've talked with an agent called Bart B, but still no answer. Why? \nPlease send my product back I'm waiting for it 3 months already. Reference number: 11617815","title":"Not paid","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-01","author":"KS","text":"Zero star again. Bought an item advertised as excellent quality, it arrives stained. I sent it back for quality check, providing pictures of stains. And they sent it back to me saying the quality corresponds to description! \n\nI have been shopping less and less there, I guess time to avoid all together.","title":"Zero star again.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-01","author":"Maja Pedersen","text":"In general, there is a nice service and a good app.  Delivery went as it should and had the item within a week time.  However, I am very unhappy that one of the colleagues had told me that I should not pay taxes or anything, but only pay to vestaire Collective.  Instead he should have told me that they do not know what the import rules are in all countries, but here he should not directly say that I should pay nothing else other than the payment through them, when i specifically askes about the taxes. Here he should have expressed that he is not aware of the import rules and that the customer must investigate this in their own country, but unfortunately he did not write that ... i ended up paying 3300 DKK ekstra.","title":"Ekstra taxes","stars":3,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-01","author":"Aurelia Vis","text":"I dont know who can give a good review to tis company, perhaps they hired people to write and leave a good reviews! \n\nThis company is unprofessional. If you want to sell something be very careful! I send my item month before and no payment no item! I hope they will go bankrupt soon! I dont think they following law... i hope somebody will open a lawsuit against the company!","title":"I dont know who can give a good rewiew…","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-01","author":"www","text":"I have the same problem as many customer mentioned, the quality control is not good at all. Bought a white skirt listed as very good condition. However the skirt has dark spots on the bottom. Send the picture to them and was told  'condition matches the description'.","title":"quality control issue","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-02","author":"Victoria Robertson","text":"The bag I bought is lovely and I found the quality check to be great. \n\nHOWEVER, my payment was cancelled somehow after the bag had already arrived to me and the only option I was given to actually pay for it was via bank transfer instead of with a credit card, which I find ridiculous since it was their issue and I should be able to pay with the same options I was given to begin with. \n\nAdditionally, when I contacted customer service to let them know they had mistakenly cancelled the payment (the day the bag arrived) and I wanted to fairly pay for what I purchased, they told me to sort it out myself. \n\nSome of the worst customer service I've ever experienced. When I requested a way to pay with a credit card, the response I got also insinuated that I was unwilling to pay for the purchase when I was the one to bring it to their attention to begin with.\n\nThey also offered some type of \"reward\" or something to help with the time this has taken (and lack of credit card rewards points) and have been silent since offering that. They're honestly a joke. \n\nYou may get a nice item, sure, but if something goes wrong in the process then God help you because dealing with this company has been a 2 month long nightmare.","title":"Nice bag, worst customer service","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-02","author":"Victoria Diaz","text":"VC has lost my product (a brand new Acne Studios sweatshirt).  After 3 months waiting for my item they reached out (only after my comments at TrustPilot) saying it's lost and they need a copy of my ID and a hand-written letter from me. They continue to delay my payment and they are going to return my item because they blame the delivery company. I have noting: my items is \"lost\" and they do not want to pay me.\nSomeone help me...","title":"VC has lost my product & is not paying me","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-02","author":"Eva Zahradnikova","text":"I ordered shoes which arrived stained from transport - something had apparently been spilled on the box. Vestiaire provided a return label after much back and forth. I sent the shoes back and then never heard back despite much chasing... wondering whether I will ever get my money back.","title":"unresponsive customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-03","author":"Louise","text":"Over a period of 1,5 years, I have experienced one bad customer experience after the other. I have been a seller and a buyer on the site. My latest experience is about a blazer I purchased. At arrival, it shows three visible wholes in the front. None of them were stated in the seller's description. Vestiaire won't let me return the blazer so I can get a refund of my money. I have again and again experienced the customer service is full of wrongdoing. Also, it's almost impossible to get in contact with them. I must say, that so far this has been a feeling of not being safe as a customer. I feel quite left on my own if something goes wrong.","title":"Customer service is a disgrace","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-03","author":"Sara ","text":"purchased a pair of Celine boots which I'm very pleased with. Quick delivery etc. however I used a discount code which was applied and accepted at checkout yet my credit card was charged for the full amount.  No big deal I thought and contacted them to request a refund. 12 days later, after contacting them daily by live chat for an update with no response and broken promises about this being resolved, I finally insisted that that they call me back.  They have called me and advised that they have arranged the refund today.  Very disappointing and their poor customer service will make me think twice about purchasing again which is a shame as I was very happy with the product.","title":"Poor customer service and response times","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-03","author":"VR","text":"I have come to the conclusion that the new ‘direct shipping’ option is pretty much a ‘at your own risk’ option. I’m having an issue with the shipment of an order , I have spent hours trying to solve it and nobody seems able to help. The best VC can do is send an email to the seller . Also there is no way to contact VC by phone anymore , all is done by email or chat ( where you are disconnected 50% of the time ) . I will reconsider buying again from this site and probably take down all my items for sale","title":"You’re on your own","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-04","author":"Adam ","text":"Poor customer service, also many times purchases get cancelled after payment. Also non existent refunds policy...purchase goods at your own risk.","title":"Poor customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-04","author":"VR","text":"Follow up to the nightmare of trying to get a package to be picked up. VC continues to tell me to reach out by chat or email . I’ve reached out by chat 5 times now and once by email which has not been answered. They push back all responsibility on the seller promising me I will get reimbursed if I never get my order. The order only needs to be picked up . Absurd situation and handling of the direct shipping, rejecting any responsibility in helping to resolve . Impossible to reach anyone of authority to help \nConclusion: birthday present ruined , budget for a replacement present held up until VC reimbursement which will take weeks . Especially absurd as it would only take one simple instruction to get this shipped . This has been the worst experience I ever had with any online transaction.","title":"Still on my own","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-04","author":"Eleonora Capponi","text":"Horrible customer service. I’m waiting from more than 2 weeks for an item that the seller shipped immediately. Myself and the seller are upset as I paid and he did everything properly, then the website did a massive delay with no reason as the item it’s so small!! It was a present and now it’s too late I’m trying to speak with the customer service but they can’t do anything","title":"Horrible customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-04","author":"BC","text":"Ordered dress came dirty with horrible odor .In times where hygiene is very important for your health is complete disgrace .Also had other quality problems but Vestiarre saying dress is good condition and dont accept to take it back ,even ask me to resell it which i  refuse and told them i will not do to another person .i will try to take it to tv and everywhere i can so buyers are aware this could happen to them .","title":"COVID 19 BEWARE DIRTY ITEMS","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-05","author":"VR","text":"As a recount of my latest experience with VC\nVC is answering my reviews with invitations to contact them, giving the false impression that they care and that somehow I haven’t yet contacted them . I have. I am still waiting for an answer to my mail. Chats have been unhelpful with their clearly poorly trained staff giving formatted answers with an ‘above my pay grade ‘ attitude. \nI could wax lyrical about their recent shortcomings but I have neither the space nor the energy.\nSuffice it to say that I find their response to my delivery problem shocking. Essentially they have rejected responsibility on the seller (who tried their best to help unlike VC ) I will remind VC that they are GETTING A HEFTY COMMISSION on sales which maybe they’d like to justify with some kind of after sales support \nIn short I am done with this site . I have made a claim with my payment company for the order I will clearly never receive , as I no longer trust VC to issue timely reimbursement . I will try to put this horrible experience behind me , take down all my items for sale and close my account","title":"Final thoughts","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-05","author":"Heather ","text":"Vestiaire Collective’s customer service has gone downhill in jumping of the cliff speed since two years ago. Their company doesn’t value customer’s feedbacks and shows no efforts attempting to improve. 90% of the time customer service does nothing to solve problems, and most of the time they are arrogant and rude. There is no where you can make complaints either.\nSince they launched direct shipping it becomes mayhem more than what they claim is for sustainability. If you choose direct shipping you have no quality and authenticity guarantees for items lower than 300€ unless you pay extra fees of course. \nBesides the above issues, their evaluation process for time submissions is very biased. Same item listed different times of the week you will get different status of this “we love” label. Having this label is basically the only way to get your items exposure. There is absolutely no standard. And the prices they suggest is always different for the same item listed at different days of the week. After trying for a little over a year I realized it is better to list your items during week days. Perhaps staff who work on weekends are just part times or trainees? \nIt is very sad and disappointing to see the changes for worse since 2014 I joined the community. I’m just waiting for a better European site like this so I can jump ship and never use VC again.","title":"Horrid customer service","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-06","author":"Edu","text":"In September I bought a Woolrich Arctic Parka jacket from VC (order ref: xxxx). The item was supposed to be in pristine condition. I paid for a Quality Control check, and that is the only reason why I bought it via VC (I just trust it way more than other marketplaces). It is no surprise I obviously chose to pay the quality control and authenticity check.\nThis week, as the cold season kicked in, I used the jacket for the first time and I was surprised by its lack of warmth (something Woolrich jackets are famous for). Next, I contacted Woolrich because I was missing one of the buttons (something your QC department was apparently not able to check). That triggered a series of back-and-forths with the original manufacturer, that conclusively led me to believe that the jacket is a fake: unexisting model number, missing key arctic parka labels, wrong logo used on the velcro, buttons without \"Woolrich\" written on them, color of the jacket that is just off.\n\nI have been completely let down by this experience. This was my first purchase in a clothing marketplace, and notably my first VC purchase.\n\n\nP.D.: VC checked my jacket and after all the evidence I provided, they still claim the jacket is authentic. Woolrich, the original manufacturer, said they could not help me out because the jacket was not authentic. This is ridiculous. Don't trust VC.","title":"VC failed to spot fake jacket","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"},{"date":"2020-12-06","author":"T.A","text":"I purchased an item but following receipt there were marks on the bag not shown in the pictures or listed in the description. I contacted Vestiaire and they refuse to allow me to return the item - despite the listing being in breach of their own policy. Sellers are required to show marks etc in photos and describe them if the item is in ‘very good condition’.\n\nI now have to raise this issue via the bank who no doubt will rule in my favour. If the company can’t adhere to its own rules why have them in the first place? They are very dishonest - if an item is in breach of the listing guidelines it should qualify for a refund. I’ll be closing my account as soon as the matter is resolved. I would NEVER recommend them (use Rebelle of Tradesy).  I wish I checked the reviews before purchasing anything.","title":"Poor customer service... never again.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=86&stars=1&stars=2&stars=3"}]