[{"date":"2020-10-14","author":"Dirk","text":"worst buying and selling experience I have ever had on any websites. no places to ask for help, poor service and will not use or recommend it\n\nall the replies here from VC are the same using copy and paste, they don't care and never will.","title":"worst buying and selling experience I…","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-14","author":"Alison","text":"SO STUPID AND FUSTRATING \n\nI ordered a jacket via the app and entered the correct address as I can see it from the app but in their order form they have missed out the first line of the address. \n\nI tried contacting UPS and they changed the address but was still sent back to the seller. Then i contacted VC and they said I HAD TO ASK THE SELLER TO REPOST THE ITEM SO I CAN BUY IT AGAIN? It makes no sense at all and they kept on blaming me for the wrong address and I clearly did not provide the wrong address, now I have to send them a screenshot so they would stop blaming me for the mistake.\n\nThey said they can only create one label, so they cant create another one for the seller to send again. Why is my responsibility to ask the seller to post again and I feel bad for the seller for all the extra admin work involved. \n\nAbsolutely unacceptable and ridiculous","title":"SO STUPID AND FUSTRATING","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-15","author":"Yulia","text":"I have been on Vestiaire Collective for a long time and mostly as a seller. This is my second review already where I wanted to summarize my experience. In a nutshell, if everything goes well, it goes well. If something unexpected comes up, you're in trouble. Now point by point.\n\n1) Submitting items. Sometimes listings are rejected and no reason is given why although items can be in very good condition with good photos. Submitted listings can hang in there for days before someone gets onto them and reviews them. On a number of occasions my items were sold even before VC started reviewing them.\n\n2) Attitude to sellers and buyers. After your listing is finally online, people start sending you offers and you accept one of them. However, the buyer can just walk away with no penalty without paying and you can't accept someone else's offer and make a sale. Which brings me to my next point: previously sellers could cancel the sale without penalty within a certain period of time, so overall it was fair. It was really not cool when VC changed rules on the go stripping me off my Expert Badge out of the blue. \n\n3) Shipping is normally smooth but when it gets to unusual or very expensive items, the carrier may refuse to take your item with the VC pre-paid label. However, the clock is still ticking and your stats may be affected although it is not your fault completely if you are unable to ship the item. The fun starts with my next point which is...\n\n4) Customer support. Honestly people. Please please do something about it. Just today I had to face some incompetent dude which was rude and helpless despite my very clear request. Gosh, he was not even trying to help or solve a problem. When you write to the chat, you never know are you going to face a jerk or someone reasonable. In a nutshell, it is maybe a 50-50 chance that they will dignify you with the information you need. You have to try writing them a few times before something gets a bit clearer but not entirely clear. Worst attitude to the client I've ever seen.\n\n5) Authentication. My favourite. For goodness sake, if I had full sets for all of my pre-loved items which I source, why the hell would I have needed a third party authentication platform with 25% commission?!! Just ask yourself that question? \"Do you have a receipt?\" - really people??? Chanel necklace with logo and a stamp - you really can't work out whether it is a fake or not without a full set? And this is not the first time. Few examples just to make the readers chuckle.\n\na) sent them a watch. If it was in the HK hub, no authentication, nothing, for a few weeks. They come back to me and ask me for a receipt. Ya, vintage watch. Luckily I had some documents which I sent to them. Ok, I am waiting. Writing to CS because it was already a few weeks, poor buyer waiting - he wanted to buy this watch as a bday gift. Good luck - \"oh your watch is so precious, we really want to take care of it...\". It was a third of the price of some other sales of mine. I started to think that they either broke it or they do not know what to do with it, how to check it. After 1 more week I discovered that watch is in the Paris hub, immediately was authenticated and after some discussions (I have a theory about that as well) sent to the buyer. \n\nb) sent them a pre-owned Chanel top. They got back to me asking for a receipt again. I do not keep receipts for old worn tops!!! Guess what - I had to source similar items online on other websites, I arranged a few collages next to my item showing similarity in tags, seams, fabric. The question is - why did I have to do it?... Why those experts could not work it out themselves?\n\nc) Chanel necklace which is an issue now. They are asking me for a certificate or receipt yet again (after I myself had to chase them multiple times because I only got a notification on my phone about the issue and not the email). Can't you read a stamp? Can't you check against other items you have probably seen before? What sort of expertise level are we talking about here?.. I am so cross and so fed up with this. Updated: ok fine, I sent them proof together with a big magnified photo of the stamp to TWO addresses: their website form and as a response to the support after having a lengthy chat about this issue. Guess what - now they are sending me authentication request asking for an invoice again and threatening me to cancel the sale if I don't send it. What a service for 25% off the sale - you must be joking!\n\n6) payment - no issues here so far. Always quick and on time.\n\nI really do enjoy selling nice pre-owned items and see people happy with their purchases. But frustration dealing with VC kills that joy.\n\nP.S.Yet another update: still no news on authentication. Trying to contact them with supporting materials: they don't even bother with the response, only saying please wait. The buyer started writing angry messages blaming me for delay.","title":"My long review of my experience as a seller","stars":2,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-15","author":"Yumna","text":"They do not respond to you. I’ve sold three items that were ‘authenticated’ however a pair of triple S were not even though they authenticated them in another colour. I even have the farfetch receipt! When I started a chat, I was promised a correspondence and I’ve used the link they keep providing to email them but no response! My article number is 11950643. Now they have also done the same thing with 12149456 a pair of Chanel dad sandals even though they authenticated them in another colour a few weeks ago! Ridiculous, please respond to me I have reached out so many times!","title":"They do not respond to you","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-15","author":"Peach","text":"Writing this review on behalf of one of my friends who tried to sell on the site recently...Vestiaire was not helpful in the least possible manner! \n\nI work with a luxury consignment store here in New York City and how Vestiaire handles their authentication is not professional. \n\nAfter looking through the website at the various luxury items they purportedly have, I can say with confidence that some do not meet authentic standards. Based on the reviewers who have shared their grievances with the company, it seems as their authentication process is very shoddy and not clearly defined. I would advise that you do not sell, consign, or purchase from Vestiaire. Please go through The Real Real which is much more professional and guaranteed!","title":"Do Not Sell or Shop Vestiaire","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-15","author":"VS","text":"I wish I had read the reviews before purchasing through Vestiaire Collective. I had an extremely disappointing experience with them, and have still yet to get my money back. I ordered a pair of Acne jeans -- on the app it stated that they were shipped almost immediately, but once they were received at the Vestiaire facility, all progress stopped. They allegedly have been sitting there for nearly a MONTH. I lodged two separate complaints with their customer service, and when I finally received a response they were very vague and unhelpful - and had I not triple emailed them, I am certain that they would not have even attempted to address my issue. My customer service representative, Luke, said that he would escalate my issue after I requested a refund, but I have unsurprisingly not heard back.","title":"I wish I had read the reviews before spending my money","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-15","author":"Huddleson Jeremy","text":"Absolutely disgusted by the so called 'experts', got sent a pair of David Yurman Citrine earrings, one had a large crack, described as in very good condition and no mention of defeats. They've inspected it twice now and sent it back without any explanation or apology. Scam artists and the customer care is disgraceful, no replies because they haven't a clue what they're doing. Spent £640 on a damaged item, I'll be out of pocket to fix their mistake! I've reported it to Paypal so time will tell but don't waste your hard earned money. These guys are the most unprofessional so called luxury resale company ever.","title":"Absolutely disgusted by the so called…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-16","author":"Mrs Gabeva","text":"Dreadful exprience.the VC service is getting worse and worse. As i said in my previous post - they simply do not care. Customer care - useless, careless and rude. From time to time you would get another useless email from a “higher level”. Simply junk filling your mailbox. You can never call or talk to some reasonable person\nFor the last 6 years i have been splitting my time between LA and Bulgaria. Being so I have been using two selling platforms - the real real in USA and VC in Europe (for the simple reason there is no TRR in europe). The difference between the two companies is immensely incomparable. TRR are reasonable, fair and friendly. Just the opposite to VC. In the last 7 months i have been stuck in Bulgaria due to the Global Pandemic so mainly using VC. And i am angry with myself for keep doing so. I have shared some of my worst experiences in my previous posts, of course if i have to share all of them would take hours. No exaggeration. If i can sum it up:\n1\/ customer care - VC do not have such\n2\/ authentication team - they have no idea and no experience. Cannot even make a difference between fake and authentic. At the beginning when i started with VC i had some fun also buying some items, to check it out. When i ended up reselling them - quess what? They questioned their authenticity 😂 really guys? You are so “professional” that now you are questioning your own skills? Of course the items were authentic, it was obvious but it is just an example that these people do not know what they are doing. Same time - for obviously authentic items that you try to list they ask for receipts?!?! Who keeps the receipts for clothes , especially when you shop a lot? And if you cannot provide one, the just reject the listing while at the same time you can see they have the same item on their platform. No logic. No consistency. No explanation.\n3\/ rating system - this is a black hole. For example- i ship my items either the same day when they are sold (if sold in the morning) or the next day (if sold in the evening) or in two days (if sold on friday night). Never longer than 3 days after sale. While, according to VC “precise” computer system my shipping status is 94%. When i contacted them about that, the generated answer was - just ship on time. I sent a screenshot of every single sale from the last 30 showing sale date and ship date clearly showing that there is no delay and asked again - please tell me which one is not shipped on time? Guess what - same robotic answer. Ok, i give up, you win. At the end of the day VC does not fail to disappoint and even takes some pleasure in doing so.\n2\/ comformity - have never and item which is not declared comfort (334 items sold). All of a sudden three days ago a dior sweater with direct shipping to buyer is returned to me because it has holes and it is actually vintage ?!?! First - yes, it has holes, because this is how the model is, three symetrical holes on both sides of the shoulders at the front and on the back. And then - the sweater is from 2016 which is not vintage.  I am NOT blaming the buyer, obviously is not familiar with Dior collections through the years. Not everyone is an expert and nothing wrong with that. But where is the “expert” VC team in this case to act “professionally “ and defent the truth? Like always - nowhere. Just pure idleness and carelessness. Direct shipping is a joke where the interest of the seller is not protected. Cannot wait to get it back to see the condition as they give the buyers 72 hours to assess the item and my buyer decided it has holes and is “vintage” at the end of the second day. Again - nothing against the buyer but VC, hello ?!?! As a result - 1 item from 334 declared non-comform and my comformity status goes from 100 % to 98 % ?!?! Can you do math? If VC team cannot obviously their “computer “ cannot as well. \n3\/ pricing decisions- another joke. I list my items at more than fair price, my decision.  Sometimes, even when there is the same item on their website for double the price they press me to lower my price in order to list it. Why? Because i list from Bulgaria? Yes, sorry, i am an american working in Bulgaria. And for you Bulgaria is a scam? This is pure discrimination\nAnd i can go on and on but i think there is no use. It is frustrating,it is waste of time,there is no security. And when it goes bad nobody is willing to help you. I do not understand the reason for it neither do I understand how they can not care at all despite the copy\/paste answers that they put here which are non-sense.\nNow, i also expect they to punish me a deprive me of my badge because this is another specialty of VC - you share negative experience, then they punish you. Which is a good attempt to try to silence you and also to discriminate.But it is a matter of time TRR to open their European branch and than VC will not have the monopoly.And will be forced to improve. But why wait for that? Anyway.","title":"Dreadful exprience.the VC service is…","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-17","author":"Sandra V","text":"Experience as a seller and buyer \n\nSeller - the customer service is inexperienced, horrible, clueless and unaware of policy of how things work and seems to be manned by a bunch of part time hourly paid millenials who give you only wrong answers... buyers constantly ask for max discount then when you accept (last 6 offers) all of them don’t come back. No serious buyers. Big time waster. VS takes a huge cut from the seller and hiked up the shipping and tax so high that the last two genuine offers had to decline as the tax and shipping was almost the price of the bag (eg €70 for a €100 bag)\n\nBuyer - if goods comes from HK, the goods are in very good shape, almost as described and quality checking is top notch. Comes beautifully delivered in a VS bag.  If goods are coming from Europe its horrible. I had an expensive Jacket stuffed \/squeezed into a brown “used” wrinkly paper bag sent from Paris. It came wrinkled and sad and smelling of old moth balls.","title":"Experience as a seller and buyer","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-17","author":"Isabel Sousa","text":"I am writing this review regarding an issue I have with my account. I am an expert seller on VC, but I constantly see my pieces being rejected by Vestiaire curation team. The problem is that the pieces I see rejected, are for sale in Vestiaire in several accounts, I mean, are common on Vestiaire. I have contacted VC several times, and I am being told that there is no reason for the rejection, but that I should wait for an answer from the curation team. But the answer does not come. I think VC should be a fair market place, and we all should be treaten equal. We all deserve the same opportunities. And I think I am being wronged. I really hope VC can resolve this situation. I will be very grateful.","title":"SELLING ISSUES","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-18","author":"Melanie Mandell","text":"Purchased a pair of Golden Goose shoes that were listed as a woman’s 36. Received them and they are a 36.5 and youth pair of shoes. Contacted customer service and they say the description matches the shoe and the flaws were noted. What?????Wrong size and wrong category?\nWhat is the point of having the item sent to Vestiaire If they don’t catch that the shoe size is wrong and then will not take it back??????????\nTheir solution is to re list the item without a fee but then  It just re posts the original description wrong again and the next buyer will have the same problem. Shameful.","title":"Wrong size sent and youth not adult!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-18","author":"Ben","text":"Paid for authentication, product arrived fine but one item didn’t match the photographs. It was a completely different brand, apparently this matched the sellers description. Still no resolution of what is a clear breach of their own terms and conditions","title":"Terrible Customer Service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-18","author":"Debrah Broadfield","text":"I have used VC for several years both buying and selling. I don't normally bother to write reviews but this has just appalled me so much, I needed to make others aware. \n\nAs a buyer - i spent several thousand on a bag, it turned out to be fake. It was 'checked' by VC but it was clearly fake, incorrect stamping and smelt and felt wrong. Anyway, after some sleepless nights i managed to return it and they gave me a refund (thank god). So bad that i got a fake, but good i managed to return it. Bad that i have still seen the item for sale on the site. \n\nOther items - i purchased something with a gem missing (quite noticeable as on jewellery) but was not mentioned on the listing, or by the VC 'checking team'. I even contacted the customer care to check this specific issue (because the photos were not quite clear enough) who assured me if there was a problem it would be highlighted. I wasn't. Again, returned the item - huge pain and waste of my time. \n\nSeller - up until now, customer care have been helpful. UPS do not pick up from where i am, so i need a DHL label. Up until now, no problem they switched it for me. Today, the label had my billing address and this cannot be changed. To date, it always had my shipping address on the label so never had this problem. First rep, rude and unhelpful, and didn't know anything e.g. when this policy changed, that they shouldn't have done this in the past. She told me to post it at my own expense (and VC keep the P&P the client paid for). 2nd rep, also didn't have any info but at least when demanded some compensation for my lost sale (because i cannot ship) i got free shipping on my next purchase (which i don't think i want to bother with!)\n\nAnyway, told to cancel my sale and relist my item. But they cannot make the old advert live again so had to retake all new pictures and redo the advert again and wait for them to re-approve. The seller need the item in 5 days and thus i lost my sale. To be honest, this last point was the most annoying! what a waste of time. \n\nIn shot - bad experiences, not once but several times. I loathe using them. Suggest HEWI - had good service from them.","title":"Terrible service - truly awful - fake item","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-19","author":"Christel","text":"I tried to buy a bag from this site but had a question to the seller first. I received an email when the seller answered, but the page with the product and the answer was offline so I tried the Customer Service to help me find out what happened. The item was still in my basket so then I tried to buy it, but all of a sudden it was gone from there too and the person in the chat was very uninterested and cut off the chat before I had my answers. So I tried email then, but you can not send them an email if you do not have an order number. I have a question about an order I want to make, not about an order I already made! This is just terrible. I a glad I found out that this website is not trustworthy before I made a purchase, although I am very sad about the bag not being available anymore :-(","title":"Very hard to contact and unfriendly customer service","stars":2,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-20","author":"Amy French","text":"I purchased a Celine Seau Sangle bag through this website.  The seller was very quick to respond to negotiations, and agreed to the selling price within 48 hours.  However, once sold... nothing.  The seller never sent the bag, and did not respond to any further messaging.  I waited the set 15 days required for the purchased item to make an appearance, and when it did not, Vestiaire issued a refund automatically, so at least that part was simple.  At the 15 day mark, Vestiaire did send me an \"update\" via email, letting me know they had contacted the seller and the \"item was no longer available\" (or never was, in my opinion).  Overall, a very disappointing experience; I've had much better with the RealReal.  I will not shop here again.","title":"Disappointing Experience","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-20","author":"indian44","text":"Totally useless. Damn that I've got to give them one star. This is the 3rd time I've tried to list as I keep forgetting how useless it is. It won't accept any description of my item - just says 'saving' then takes me back to it when I try to move on. I've tried listing it in Moxilla, Chrome, Edge. I've tried reducing the words, adding words. Nothing. So that's at least 3 hours of my life wasted on this stupid site. I've made a note now - don't try to list anything on Vestiaire. I'm guessing you don't need my designer items. I won't forget next time.","title":"Totally useless","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-21","author":"Pohjonen","text":"Bought 2500 € \nworth of  items. Bape, Gucci, cartier etc, allfake... All","title":"Bought 2500worth items","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-21","author":"NT","text":"I am a buyer and seller on VC, so I feel qualified to make a review. Nothing I have attempted to order from them has made it to my door. Items are rarely sent, then you need to wait almost a month before they issue you a refund. And if they are sent, the postal services they use are unreliable, and it can take months to arrive, or be labeled as « lost ». In those cases, you as the buyer need to contact VC to demand a refund. Customer service is awful, finding it on the app or uploading something using the app can be a disaster. They purposely make it difficult to contact them when something goes wrong (and it almost always does). They do not take any accountability for the limitations of the app and website design features. As a seller, they take a huge percentage cut of my sales, which I understand and accept, but they will reject items if you set a price they deem too “high”, even though you can do a quick search and see that there are usually Hundreds of items like yours that have already sold for “higher” price points. Buyers can make offers but every communication you have with them has to be “reviewed”. This delays sales because by the time the buyer receives the information they asked for, they have often moved on. As a “Trusted Seller” who sends things under 2 days of purchase, I can lose my status as a seller if I fail to send something 1x within 1-2 days. Also, after the buyer has picked up an item that has been sent from me, they can take weeks to confirm, as it seems there is NO communication between the shipping services they use and VC. I am still waiting to be paid for an order I sent a month ago, which was received less than 5 days after I sent it. Honestly, after taking such a huge cut for doing nothing but bringing headaches to my sales, it’s not so much to ask that VC start taking accountability and following through with their shipping services. It is so much easier to sell elsewhere.","title":"I am a buyer & seller on VC","stars":2,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-22","author":"Ernesta Norkutė","text":"I have bought LV Speedy.\nPaid for inspection.\nWore it for a couple of days to notice that handle is coming off which was glued on before selling! \nThat was never mentioned in a description. Knowing some parts were glued on I would have never made this purchase.\n\nDespite customer support saying it should have been mentioned in the description, they refuse to take back a faulty item.\n\nI bought many items there but this time I am so disappointed with their customer support. They don’t take into consideration any of my reasons.","title":"Glued on handle LV Speedy","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"},{"date":"2020-10-22","author":"Aviva ","text":"Terrible !!! \nThey have no customer service WHATSOEVER !!!\nThey don’t follow through or assume responsibility to anything. I was about to purchase a purse and got stuck with a non responsive seller and there was NOBODY I could talk to. They simply don’t provide any backing to anything - they just advertise the items one wish to sell.\nRetrospectively I’m happy it failed before it went through because if it would’ve gone through and there were issues with the product - I would’ve been stuck after loosing thousands (!) of $","title":"Terrible !!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=93&stars=1&stars=2&stars=3"}]