[{"date":"2020-09-26","author":"Katerina NZ","text":"To all my fellow sellers or buyers that are still chasing Vestiare for your money, I became a little more aggressive and decided to send them a money request via pay pal, for the amount they owed me. Well, what can I say, it worked! Thanks Vestiare for finally doing the right thing. Overall though, my trust in you has been compromised. I don't think I ll be selling anything for a while!!","title":"Finally I got payed the rest of my money","stars":2,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-09-26","author":"Wendy Kelly","text":"Update !!!!!\nThey offered me to send the damaged item back for a refund but I can’t get a returns label from them !!! I have emailed several times for it \nAnd I am  Still waiting on a return label I have had two emails from them the customer service agent clearly does not read emails properly \n\n🤞🤞🤞🤞🤞🤞 fingers crossed this team can read an email properly or us it a ploy to keep the money \n\n\nDreadful customer service team !!!\nAfter buying a coat direct shipping my item was lost in Spain DPD depot for over a week , I chased this myself. And eventually the item was found the parcel had opened and the coat was in the lost and found \nThe carrier emailed me a picture to see if it was the missing item , which it was\nThey repacked the coat and sent it to me damaged really damaged The gold buttons were all Scratched the coat had drag marks and pulling and bobbles all over it and what looked like dog claw marks and one claw had pierced the fabric the carrier said I was to claim insurance but it had to be the account holder that done it , I emailed Vestiaire and they replied “ We believe that the item pictures does match  the descriptions and there for conform we will let you resell commission free but no refund !!! What the hell. I used to buy lots from the site my daughters buy from it as well \nBut not any more","title":"Dreadful customer service team !!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-09-27","author":"Gwyneth Lam","text":"Worst service I never met. Refusing my item and cancel the order by saying my item is fake??? Give them evidence to show it is not fake, but never reply me. So now I have to pay the shipping cost to get my item back and have no idea if it going to be lost on the way.","title":"Worst service I never met","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-09-27","author":"F Abo","text":"Very disapointed with Vestaire, they removed my Expert Seller Badge on 27 September, even though the following happened that affected my shipping.  Please look into this and reinstate my Expert Badge. \n\nIn the current climate Vestaire should be showing more care and compassion towards its sellers and not causing them this level of upset.\n\nItem 9780575 sold on 27 September could not be shipped as I had already sold this on Vestiaire on 10 September (9436803). I did not realise I had the item listed twice on Vestiaire.\n\nItems 9780102 and 9780575 sold on 1 August could not be sent as the buyer provided an International Forwading Address instead of her own address, I contacted Vestiare via Twitter and Trustpilot and emails several times to highlight the issue and still did not get a valid address from the buyer so was forced to cancel the sales as International Forwarding address are not secure.\n\nItem 9780575, I did not receive a Direct Shipping postal label from Vestiaire even after many emails requesting one, so I had to ship this myself to the buyer and was then later reimbursed for my shipping costs by Vestiaire.\n\nAll my items are shipped on the same or next day unless there is an issue. \n\nAwaiting your response.","title":"Very disapointed with Vestiaire","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-09-28","author":"Anon","text":"I also find Vestiaire Collective poor. The costs are extremely high and they recently reduced the price of an item I sold because they found a stain. The item was perfect when I sent it - it had never been worn. Agree with previous reviewers that they are trying to steal clothes and money. I‘ll be removing my account and listing items with other sites.","title":"I also find Vestiaire Collective poor","stars":2,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-09-29","author":"Liv","text":"The investors who funded this company should be weary of the executive team.\n\nSeriously, you raised 64M and you can't build a working tech platform without bugs?  \n\nAn absolute scam.\n\nI sold two items to to different buyers.  I shipped them both promptly at the exact same time.  When I view my Vestiaire account, only one item says it has been sent. My receipt from UPS shows shipment is in progress but shows a receiver name different than what Vestiaire shows. \n\nNow, I am very worried the sale will be cancelled since my account says I still need to ship the item, but I already did.\n\nThis company needs a major overhaul.  The business concept is no longer unique and a competitor will take over quickly if you can't get your operations sorted.","title":"The investors who funded this company…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-09-29","author":"Ays","text":"My item chanel CC earrings have been found unauthentic and they cancelled the sale. This is a ridicilious situation. The earrings were bought from chanel store and VC says they do not have brand criteria. That is a weird explanation. They are 100% authentic, do  your experts know brand criterias? I want my item to be checked again by a real expert. You can take it to chanel store, and compare its stamp. This is 4 th time they found my items unauthentic but after they check them for second time, they apologized and paid my money. And I insist on that the earrings are authentic bought from its store, please check it again. I have sold more than 1500 items and they all found authentic. The reference number is 10956771. Please solve this problem asap and pay my money. Thank you so much.","title":"VC could not verify authenticity of my authentic earrings","stars":1,"location":"TR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-09-30","author":"dodo bird","text":"worst customers service in the world, these people do not have ANY training before they handle and check your bag, just ask for recipe everytime. How on earth am i gonna find a receipt of something i brought a few years ago??? And why the hell do i need to pay up to thousands of commission if u just gonna ask me for receipt?? Isnt the whole point you exist is to check bags without certification? AND NOT TO MENTION HOW RUDE THOSE STAFF ARE!!! It's like they are working for us for free or they are actually paying us or something. Btw some tips for new sellers, when they refuse to return your bag, just call the police to their shipping address :) that's the only way works, no need to wait for their emails cause you very likely need to wait up to months","title":"Tips for new sellers","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-09-30","author":"Fi","text":"have sent an item using the UPS label provided by Vestiaire and the address seems to be wrong or the buyer did not receive it for reasons that I will never know. I don't have any form to contact the buyer and Vestiaire says the item will be returned back to me and the sale cancelled. while this is not obviously my fault, vestiaire does not simply want to contact the buyer or provide a new label. they even suggested me to send the item again once this gets back but at my expense and they would take the same comission.... not only they are not capable of fixing this they also don't understand how frustrating this is, stressful and the time you lose.... obviously this company doesn't honor their sales and service they say they provide and there is no point on selling here. I would strongly recommend you to use other platforms in the market and avoid this !\nEdit: this response from vestiaire collective to my review here and which directs me for the FAQ is another joke of how irresponsible they can be. This person just wants me to repeat the same process again and again. Lol. In the meantime, After the initial chat conversation I have received an email by a supposed \"higher\" department that said the sale will be cancelled. They didn't care about contacting the buyer and try to arrange a different way to send the item. Vestiaire was taking 100eur as a fee. I think it would be more than fair for them to try to honor their service.... So my suggestion is use other platforms to sell and buy. Avoid vestiaire.","title":"Avoid vestiaire!","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-09-30","author":"VenJoha","text":"I’ve been using VC for just over a month now, both as buyer and seller. \nAs buyer, I had one negative experience where an item was not as described, and as it was my first order I was given free shipping, bit disappointing but item was very good value although damaged. Other items I’ve received have been very good, let’s hope my luck holds\nThat being said, I’ve mostly bought items that haven’t been too expensive, like kids-wear and home. I’m not comfortable paying loads for designer goods that are second hand, no returns and quality not guaranteed. I’ve seen a few items that are more pricey, but I’ll need to think very carefully before buying. \nAs seller, I’ve sold quite a few items and am now an expert seller. Like with buying, I’m not comfortable selling highly priced or special designer items here. The main plus is that they sort out posting for you, very easy and less hassle than say Ebay. But app and uploading is very buggy, and IT structure is atrocious. There is no rhyme or reason in brands selected (for instance why accept Zara Kids if you don’t accept Baby Gap?). The result is that it’s pretty dull with brands and clothing, nothing new unusual or exciting. Wish there was a way to input brands I’m looking for. My experience of customer service has mostly been good. I do feel they discriminate against British sellers, as I see European sellers getting away with selling certain high street brands, but when I try to sell them, or sell an item from a UK brand on the same level, it’s refused. And also they’re less stringent with European sellers when it comes to pictures. The commission is outrageous, especially on something like childrens clothes which don’t go for much anyway. That’s also put me off buying, as I know the sellers get so little, it doesn’t seem fair. \nSo overall, good and bad. Worth trying, but be careful and don’t hope for much.\nP.S. tip if you’re a new seller: put all your unsigned\/non-designer stuff to sell on at the beginning, when they’re more likely to be generous. After that, you can kiss goodbye to trying to sell anything not in their brand list.","title":"Could be worse, but buyer beware","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-10-01","author":"Ana ","text":"On the 20th September I bought a pair of sunglasses from Vestiaire, order N°29993516 . First my surprised when I did checkout I had to pay import duty and taxes. Always tough the site was based in France. As my item need it to be authenticated in Hong Kong. The item was sent by DHL, even didn’t had left HK I received an e-mail from DHL that I need it to sent documents for customs clearance purpose.  After that they were cleared in customs and now I have to pay again to customs plus DHL ( the carrier company) charges 35,4€ just to issue the declaration for customs. Why they charge for import duty and taxe when we ll have to pay when arrives our country. A bit of a scheme.  Really upset if I knew never ordered anything,","title":"On the 20th September I bought a pair…","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-10-01","author":"Lauren","text":"Vestiarie Collective are ignoring my emails and refuse to provide a refund for a counterfeit bag I purchased. The Chloe Nile minaudiere bag I purchased via their site was clearly a counterfeit bag - it smelt like plastic, the stitching on the bag was completely different when compared to the stitching of Chloe authentic bags on the Chloe website and the leather serial tag was missing from the bag.\nI returned the bag for the second quality control on 9th September 2020. I follwed up 7 days after they received the bag and they told me it would take up to 15 days to hear the outcome. I have followed up after the 15 days timeframe for the review outcome and requested my refund multiple times over the last fortnight however they are not responding to my emails. \nIt's clear that their authentication process is flawed & questionable and their lack of customer service is highly concerning. I won't ever be using their service again and will commence legal action if I don't hear from them.","title":"Vestiarie Collective are ignoring my…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-10-01","author":"Zahra Shirbaz","text":"I sold 2 items on their website, one 13th August and second 9th Sep and they haven't paid me yet.\nBoth items received by customers within the 7 days time frame and I am still chasing them for my money, total of £700.\nNumber one fraud website was supposed me pay me on the 16th Sep for both sold items, but still nothing received.\nYou can't contact them otherwise except chat and every time they promise to get it sorted and nothing happens.\n\nI have now filled a fraud case against this fraud company. I will make sure you never do this to someone else.","title":"Fraud Collective","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-10-02","author":"Naouel","text":"I have placed an order today, for some reasons the discount code didn't apply, so I have contacted them. they couldn't help me as I randomly didn't take a screenshot of my phone to prove I did apply the code ?? \nwell luckily they gave me a discount code so I can save the £6 shippings when I won't order with them next time. \nYou should read all the bad reviews and think about ways to improve your service.","title":"miserable service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-10-02","author":"Mrs Gabeva","text":"Another month, another ridiculous disappointment from VC. Just when you start thinking that they have exhausted all options of being unprofessional and outrageous, there is a new surprise from them. This time i had to read their email few times just to be sure that i got it right. I have sold more than 235 items. All of them either not worn or worn very little. When an item is worn a little, although no signs, i always say that has been worn, just because this is the right thing to do. And i also have a rule - before posting an item i always first dry-clean it, no matter worm or unworn. I also post my items at very low prices although they are all high-fashion, but this one is on me, i mean has nothing to do with VC. So what happens. Two days ago i sold a Chanel sweater. Shipped it right away as always. Now i am receiving an email that the item has ... slight odour. Shock. Of course it has, it has been dry cleaned 10 days ago before posting and of course as i use a really a good dry cleaning, they use nice detergent. All 236 items had the same odour. But this time they decide that this is flaw and it has not been mentioned in the description!!! Really?!?! As a result they do not reject the sale but they propose a price reduction of 48 eur (and believe me it is already sold at a very low price. So, yes, of course i will accept it just because i have absolutely no time, desire or interest in dealing with them further. And i guess they keep doing that because they know people just do not feel like dealing with them. So they keep getting away with everything. But how ridiculous is that that they ask for a price reduction just because the item has been dry cleaned? Is it better just to send something that has hung in the closet for an year although it has not been worn?!?! I believe that actually taking it to the dry cleaning before posting it is a nice gesture to the future buyer. But obviously that is not way VC concept is who only pretend to care about their customers - both sellers and buyers, but their actions just prove the opposite. And now, i also feel bad for the buyer because i am not sure what they might think about the so called “odour” as i have no chance to explain to them what is the actual case here. I am already so used to Vc absolute lack of professionalism that i do not even care so much but i have decided that every time something negative happens i will just keep sharing the experience. Might be helpful for some of you. For sure VC do not care but this is upon them. As working against your own reputation usually gets you at the end. Eventually.","title":"Another month","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-10-02","author":"SAVAGE","text":"I own a consignment shop.  Have been alerted by customers today, that a rare Chanel bag we have for sale has appeared on the VC site at a considerably increased price. All information had been copied and pasted  word for word from our website. \nWe contracted VC Webchat (the only way to contact them it seems) and were told ‘Oh sorry, there’s been a mistake, we’ll take it down’!\nMake of that what you will? \nThis isn’t the first time we’ve had negative dealings with Vestiaire Collective.","title":"I own a consignment shop","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-10-04","author":"Gwyneth Lam","text":"Again, disappointed! They cancel my transaction and told me that my authentic bag is fake! It is not the first time. What is the professional?! Please check them by your professionor with the trainees together.  That will let my customers disappointed too!! I like Vestiaire, and their service, but why don't pass when it is authentic?","title":"Again, disappointed..","stars":2,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-10-04","author":"Pierluigi Fantozzi","text":"Bought one Adidas Sweater from Malayisia: had it sent to their \"\"\"\"\"\"TEAM OF EXPERTS\"\"\"\"\"\" who said the item was AUTHENTIC. \nThe yellow \"Adidas\" which I paid 70 euros was clearly a fake, and it started falling apart the moment I touched it. \nI wouldn't recommend this company to anyone, due to their lack of seriousness in their business.","title":"Bought an \"original\", received a fake","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-10-05","author":"C. Muskens","text":"Description mensongère\/ Liar description:\nA « Chanel » pin sold as a « vintage brooch », : I’m not sure it is a real Chanel stuff, and It is MUUUCH too expensive. \nThis pin it is typically the type if pin that you received for free at Chanel’s happenings\/events, some years ago... \nI was ELLE Magazine Chief Redactor for years... and remember well this kind of « gifts » : it was common - and free- at the time! \nSo: this is a little bit as if you were selling the fabric Camélias that they put to decorate Chanel’s paper bags! \nAnd  I bought it 242 USD...\nThe pins’s size is half the size of a tea spoon, which of course was not mentioned...!\nI thought I was going to receive a Chanel brooch (which usually are 2,5 x 2,5 cm or so...AT LEAST)  and this ridiculous pin reaches hardly 1,5 cm...\nIt is even not written anything as Chanel Paris in the back; maybe it is one of these chinese’s fake! \nI’m very disappointed and will never order nor sell anything on Vestiaire Collective.\nTrust is gone. \nIt has been sold by Babelou, a « professional seller » .\nI’m really pissed off and I think this is not serious.\nI know Money is money, but...Vestiaire Collective really should be more regarding when putting its name on the items they show (my « brooch » was verified!!! 🙄), as with time, nobody will trust them anymore.","title":"Description mensongère\/ Liar description","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"},{"date":"2020-10-05","author":"JS","text":"Part 2 - see VC Comment as well. (2 days later)\n\nThe reason I ended up paying the correct amount is that the seller and I communicated about the issue- VC said they couldn't do anything. \n\nWe waited until the offer expired then I put in another bid. This second time the bid amount wasn't changed. However, VC's comment makes it seem like there was Never an issue. Not true: we just worked around it.\n\nTheir denying the issue is typical and- amongst other things - means they won't investigate and correct the \"technical issue\". Appalling for an e-platform.\n \n\n\n\nOffered £66, get a message saying offer accepted, then on checkout notice the amount is £67.65. Go back to check: I see my offer, also the message that the buyer accepted - but with the different amount.\n\nChanging the offer price without the buyer's consent is illegal. Buyer truly beware!!","title":"Illegally changed my offer price - Part 2","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=95&stars=1&stars=2&stars=3"}]