[{"date":"2022-01-22","author":"Girl Eyyy","text":"VESTIARE COLLECTIVE are THIEVES!!!! They will wrongly authenticate REAL items so that you will have to pay a fee to get the item send back to you ! If you do not they will KEEP the items which is called STEALING","title":"VESTIARE COLLECTIVE are THIEVES!!!","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-23","author":"R","text":"Bad company, no protection for the sellers. Take a big percentage off of your money. Don’t recommend, deleted my account","title":"Bad company","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-23","author":"Harriette Bond","text":"Shocking. I ordered two items, neither of which have been sent and there’s no way of communicating with anyone. Just a robot on a chat thing who spouts stock answers at you until you go away. The ‘community of sellers’ is a flawed concept as there’s no way of reviewing them or holding them to account for being rubbish and not responding to you (unlike eBay where you can see each person’s buying and selling background and reviews). And don’t be fooled by terminology like ‘Trusted Seller’ - all that means is they’ve sold more than two items. No other information about whether they actually sent the items or what the items were like i.e. no buyer feedback at all.\n\nMany of the items are beautiful but overpriced compared to other preloved sites. \n\nI will be removing my account and shopping elsewhere in future.\n\nUPDATE\nA useless response to what I have written above:\n\n1. I did try to contact both sellers more than once and received no response.\n2. You fail to address why your own customer service function is attended by a useless robot.\n3. Sellers actually get 7 days to ship according to the order and, indeed, my order was cancelled on the eighth day so you don’t even know your own delivery terms!\n4. It’s quite incredible that I have tried to get hold of someone at your company to deal with things before being compelled to issue you a one star review here to no avail. And yet the only point you deem me worthy of a response is now. Judging by the reams of one star reviews below this one, I strongly suggest your whole company reviews how it handles its customers and the customer experience with the sole aim of improving things considerably, instead of wasting time issuing pointless responses to poor reviews on Trustpilot.","title":"Shocking","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-24","author":"JK","text":"I have purchased from VC many times with no problem until they recently opened a new UK authentication center. \nI bought a £3000 Chanel boy bag which the seller's description said no scratch or any sign of wear. Before my items were always sent to France for quality check. This time was sent to the new UK center. \nWhen I received the item, the gold hardware was chipped off badly. It was chipped off from gold to silver colour. When I looked back the photos, the seller used the chain to cover the damage parts with intention. I contacted VC customer service straight away and the advisor agreed that it didn't not match the description and asked me to post it back.\nHowever, few days later I received an email said the UK quality team had second checked it and it was perfectly matched the seller description (?!!!) When I contacted the customer service again, they were just replying like a robot. They won't look at the photos, just repeatedly said quality team said it matched then nothing they can do. I did not manage to get a refund for this damaged bag.\nThey would only relisted the bag under my profile BUT they have amended the description: marks on metal and stain\/scratch under flap. Excuse me? I thought the UK QC team said it matched the description which had no scratches and sign of wear??\nAlthough the item was resold, I have lost £75 due to QC, postage and process fee. They refused to refund me but only given me a voucher code which I don't think I with shop from them anymore!\nEveryone please BECAREFUL of this new UK authentication center. The people who work there do not have the capability to spot such an obvious damages!!\n\n**Update**: They did contact me but they just reply the same thing again like a robot! Didn't refund me or help me any further! Dont fool by the disgusting company!!","title":"DISGRACEFUL UK authentication center","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-24","author":"Bill H","text":"Although a professional seller, this company is a scam, the change the timescale of payment without notice, there is no knowledgeable person can deal with queries.\nJust buy directly from the seller and cut them out, they don’t deserve the commission they charge.\n\nStill after 7 days of emails no representative has contacted me, you really suck, worst customer service ever","title":"Although a professional seller","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-25","author":"MC","text":"I am utterly disappointed with Vestaire. I recently bought a Cartier love bracelet. I specifically bought from a UK seller since I am also in the UK and because I do not want to pay for custom taxes. I received a notice from the courier asking me to pay for custom fees if I want my item to be delivered because Vestaire needed to authenticate the item in France and then it was sent to me in the UK from France. This is not my problem anymore that Vestaire decided to authenticate it in France. I was not informed of this process of authenticating in France and not in the UK when I bought the item. And this is not the first time I bought item in Vestaire after BREXIT and all of the items I bought in the past were all autheticated by Vestaire as well. To add to the insult, customer service is totally horrible misleading to make the custom fees payment and Vestaire refunding it after the item was delivered to me. Now that I am requesting for a refund which was guaranteed to me before paying the custom fees, Vestaire is saying they will not give me the refund. So frustrating. I have been in contact with their customer service trying to get the refund several times but the agents are unhelpful even cutting off the chat. I will not recommend Vestaire to anybody and I will make sure that nobody will have to experience what I am experiencing now. I will spread word about how bad service Vestaire is. No words to describe how awful this experience is.","title":"Total Fail","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-25","author":"Michella Malin Petersen","text":"Leaving another review because I am in complete shock at the lack of service from Vestiaire. Their customer service is non-existent. I tried reaching them today via chat and could not bypass their awful service-bot, which was NOT able to help me with my issue. Why are Vestiaire so afraid of helping their clients? They’re supposed to be a luxury site (and they charge a pretty penny for using their services!) yet they have the service level of a dollarstore. I’ve sold an item that I have shipped and Vestiaire hasn’t registered it as shipped. This means that I could lose my sale and money even though the buyer gets the item. And I can’t get through to so much as one person from the customer service team. \n\nVestiaire, you might be selling luxury items but your service absolutely places you in the discount bin. I have shopped (and sold) through alot of sites and your service is, without question, the absolute worst one I have ever experienced.\n\nUpdate: this is EMBARRASING. Not only is the issue still NOT fixed, and my sale will currently be cancelled tomorrow but your customer service representant sent me the wrong mail - a mail meant for internal use - stating that I left a bad review on Trustpilot.\n\n“We take customer complaints very seriously” no you clearly don’t. And once again, if you cancel my sale, and the buyer still gets the item (which they will, since it’s Direct Shipping), that is theft.","title":"The Collective of bad service.","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-26","author":"Ella","text":"Be very careful when the buyer returns your expensive item as not as described ( spots and damages ). In Vestiaire the item can reported as not suitable up to 72 hours. My Moncler jacket was returned to me as the buyer reported the item in two days stating it had spots what was not true. Vestiaire returned the item to me. When I received the item obviously there were no stains BUT IT SMELT CHEAP PERFUME. The buyer was wearing Moncler jacket probably to show off for two days and later just returned to me as having spots. BE CAREFUL-IT IS NOW A NEW WAY OF RENTING BRAND CLOTHES FOR FREE!! Moreover the buyer returned the expensive item as a piece of rubbish without proper protection and packaging. Vestiaire don’t care! They replied they will warn the buyer.\nPS. Below you will see reply they will refund money when they receive the jacket. One more lie from Vestiare. The received the jacket put on my account as a sale item. But never refunded. So now I am selling again the item, damaged because of the Vestiare, The item is not in  my possession now. As well I have not received the money that they promised. I will definitely not let this situation go. Avoid selling in this platform. Who knows your items as well can be worn and then returned back.","title":"Be very careful when the buyer returns…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-26","author":"Kristina","text":"I sold a pair of brand new Chanel flats that they were unable to authenticate and therefore have cancelled the sale. I’m now asked to also pay a fee to get the item back. \nIt really seems that it’s a gamble with whoever you end up handling your item. They lack expertise which makes you wonder how they are able to authenticate Birkins, watches etc. My guess is that they simply don’t.","title":"Unable to authenticate items","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-26","author":"Sar Mer","text":"I wish I could give them minus 1000 star ! horrific experience, \non the surface, they are polite , but for in reality so unprofessional and uneducated .\nMost of the stuff are fake and they pretend they examine it, but if it is sold, and no-one noticed they have been sold a fake, they just get their commision and move on.\nthe percentage that they charge is so high, save your dignity and money and bann this horrible company.","title":"I wish I could give them minus 1000…","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-26","author":"Lina","text":"After complaint on various social media places we finally got our item sent back to us. However, our payment is still pending since December. VC - it's time to pay us, don't you think? \n\n\nIt's been two months that I've been trying to get my item back from Vestiaire Collective USA. I've been receiving the same trivial answer:\n'Good day. Thank you for reaching out to Vestiaire Collective.\nI will coordinate this matter to our Experts to have it check and assess thoroughly. Rest assured that we will take this matter seriously in our end and we will do our best to resolve this matter.\nI will get back to you within 3 business days or as quickly as possible once I receive feedback from our Experts. I am humbly asking for your patience as we wait for our Experts response. Thank you very much and keep safe!'\n\nOur account manager is no longer with the company and none of the management in the USA is replying.... The item is worth $400!","title":"Can't get our item returned to us","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-26","author":"Anastasia Makarigaki","text":"I recently bought a Rolex watch and theoretically the quality team checked it and their review was encouraging me to buy it saying that there is a minor default on the bracelet. On the contrary I received a fake rolex without any papers and now they dont return my money. They want to resell it and then give me my money. So I need to take legal actions against them. Be careful with vestiaire. Is not serious company.","title":"Vestiare sells fake rolex and the quality dept does not do its job","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-26","author":"Sarah","text":"Vestiaire sold me an obviously fake Chanel bag that their “quality control” failed to catch. Avoid for all luxury high end products, you can’t trust their authenticity process which is lazy at best.","title":"Vestiaire sold me an obviously fake…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-27","author":"Jeffrey portman","text":"I recently sold an item on Vestiere Collective and the sale was cancelled due to fit issues (buyer ignored my measurements) The Item was returned to me using Hermes, item was delivered, but not to me, delivered to a different address. I contacted VC collective customer service, which was like a bad comedy, a joke, which would have been funny if my item wasn't an expensive one.....the person seemed to be taking me round and round in a circle, as though not understanding what I was saying, even though I was clear with my issue. It seems like this is a tactic by VC, making it impossible to solve issues. Very frustrating. Now I have lost my item through the incompetance of VC with no way of solving. Avoid!","title":"Avoid!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-27","author":"Lowri Woodcock","text":"Worst customer experience and selling experience I’ve ever experienced.\n\nEdited - thanks for the response but my account is now deleted after your customer care team lied to me and cut me off repeatedly when I needed help. Will not be returning.","title":"Worst customer experience and selling…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-27","author":"Giselle","text":"TERRIBLE CUSTOMER SERVICE!! I had to delete an item for sale several times because Vestiare changed the description I submitted and it was no longer true or accurate. I couldn’t possibly sell an item that they misrepresented. Buyers beware, sellers list elsewhere!","title":"TERRIBLE CUSTOMER SERVICE!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-27","author":"TM","text":"Bought one silk scarf and had an overall good experience.\n\nQuick shipping and it came with a quality control label. Matched the photos and was a good bargain.\n\nFollowing the whole process online, the article was only for a few minutes (?) for quality control which didn’t make me feel very confident in the process that we pay extra for.\nI would like to know more what are the standards for quality control. There are so many items available, from so many labels, how can you really tell? \n\nI also don’t like that throughout the site you see the same article\/ same photos but from different sellers.\n\nIt does not make me feel very safe in investing in more expensive items like a bag.\n\nThere are also a lot of bad reviews.\n\nI took a chance and it went well but would like to see more control so that I’ll buy again.\n\nFinally, it’s impossible to get rid of the newsletter. I’ve already unsigned it via app\/ via desktop and the mails itself don’t allow for unsubscribing directly. It’s annoying and feels like harassment","title":"Bought one silk scarf","stars":3,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-27","author":"Gee Kay","text":"Please ask all questions before buying. Vestiare quality check is questionable. I thought I bought a brown bag, not knowing the seller passed off a bright red bag with a brown photo on the website. I contacted Vestiare, but nothing was done. Instead, they asked me to relist the bag, and that's all they could do. Avoid at all costs.","title":"AVOID!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-27","author":"Mischa Gascoyne","text":"The worst customer service ever! I have no idea how they continue to operate, I have never known such poor customer service.\n\nI have had countless issues, but the latest is the final straw, Hermes lost my parcel in December and admitted liability with an email explaining they had lost it, Vestiaire who also have the tracking number and the email from Hermes explaining that I never received the item, still won’t refund me my money. They have wasted far too much of my time and I would avoid this company like the plague, unfortunately I now find myself having to get trading standards involved.","title":"The worst customer service ever","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"},{"date":"2022-01-28","author":"Simona Momeniskyte","text":"Not to be trusted!!!! All is great until something goes wrong.\nLost my items, noone is even trying to get my money back. I been emailing back and forth  for 2months now without resolution..they are keeping over 200 pounds of money as currier they chose lost my items. Do not buy from them cos of something goes wrong you will not be looked after ....","title":"Not to be trusted!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=21&stars=1&stars=2&stars=3"}]