[{"date":"2021-12-26","author":"Hristina","text":"\"Dear Hristina,\n\nThank you for  your email.\n \nI am sorry for  the inconvenience.\n\nFor  this reference 19034567 we would  like to inform you  that there is  an ongoing investigation. We will notify you  once done, and for the  other one, can I confirm the  reference number  please?\n\n \nThank you very much for your patience, I remain available if you have any further questions in the meantime.\n \nBest Regards,\nCathyrine for Vestiaire Collective \"\n\n\nDear Vestiare Collective ,\n\nPlease stop sending me ridiculous emails as the one I received few minutes ago!\nI have been notified (and forward it to you as well ) by DHL support agents that on the 15th of December any investigation has been stopped and both shipments are OFFICIALLY declared DISSAPEARED!\nThe only thing you need to do is start reimbursement process and give me my money or items back!!!\nI am already starting to investigate my legal steps with Finland's consumer protection agency . This is a theft!","title":"\"Dear Hristina, let us waste you another month\"","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-26","author":"DIM","text":"Like two years ago, I would say that this is the best second hand shop, even better than Farfetch. Now I can surely say this is one of the worst ones. Everything became so much expensive, even more than the retail price of some items, Vestiaire increased the direct shipping cost, import duties fee went to a massive amount like 200£ if you buy from a non European country (if you are in Europe). You cannot find good deals anymore like before. And something important I need to mention is that I bought recently a Gucci bag. I decided to receive it through authenticity check means that the package passed from the Vestiaire warehouse to get to me. When I received the package, it was literally empty with only some papers. I was so disappointed. Took me a month to get my money back. And after the last fact I decided to stop buying from that shop. Doesn’t worth it anymore like before.","title":"Not worthy anymore","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-27","author":"Kattis Axelsson","text":"I send my Chanel to Vestilaire on the 13\/12 - a buyer wanted it fast because of christmas ..! Then Vestilaire sended me an cancellation of the item ?! Why?? I send it as they said and i have the Recive - video when packing it at the postoffice -  in case..\nSo now my Chanel is in their hands- and my item is now avible on the site whith wrong information \nNone to contact - no email, phone  number or anything to get in contact with them \nI want my bag back -but how Vestilaire ?? Can you please answer here how to get my Chanel timeless back ??!","title":"My Chanel is now in their hands- they Said they har an buyer!","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-27","author":"Mariana Puente Palacios","text":"I sold one item on their website sound 5 weeks ago. The seller did not pick it up and my item is still in the parcel shop. They don’t offer any solution, but keep waiting indefinitely. On their FAQ says that the item will be return it after 10 days the buyer don’t pick it up but it is just a lie. Sell your stuff on vinted, depop or ebay, Less fees, easier to sell and get your item back if there is an issue.","title":"No money and no item","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-27","author":"Jane","text":"I should have received my money the 9th. of December. Today its the 27th of December. I have contacted them several times without any luck:(\nI have had 94 succesful sale with them but now they Seem to be a pure scam Corporation. Crazy to believe that Gucci can be a part owner of VC. When this is How they operate.\nHere is what I wrote to them today:\n\nHi. I am desperatly writing to you! I have now contacted you several times since the 9th of December to receive my payment for my Chanel bag.\nYou keep telling me that you will look into it and get back but nothing happens.\nI am desperate here, I am\nLoosing my house because I cannot pay the bills because VC is not paying out my money which is an illegal action from your side.\nThis is nor acceptable in any way.\nYou have stolen my money.\nGet my money transfered now\n????","title":"VC has stolen my money!","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-27","author":"Anne-Sophie","text":"Horrible service. Vestiaire are now holding back my items at their HQ. I had put up a pair of vintage Chanel sandals which i no longer has receipt etc to. This is normal for vintage items and 90% off sold items on Vestiaire are without receipt and this was also written on the product page that did not come with the shoes. Still at their “quality control” they would not send them to the buyer because they did not come with receipt which i never said i have! They are now hodling back the item unless i pay to get them back! This is a big scam. They are asking for something they know i dont have and now holding them back for payment. I am now looking it to how i can go further legal with this. I would not recommed selling here!","title":"Horrible service","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-28","author":"Hristina","text":"3 days later, same useless reply .\nI will post all the ridicule conversations until someone finally answers my questions and concerns numbered 1,2, 3 described below.\n1. Why are you keep on investigating if the carrier (DHL) has officially closed the investigation and the parcels ( ref. 19034567 and ref. 18638589)  are declared officially lost. According to them, you should start insurance claim.\n\n2. My items have dissapeared on the 10th of November 2021. What is the deadline on which I will get compensated for the loss of both of my items? \n\n3. Please, kindly assign me a new customer support agent, which will actually provide support , won't send me the same old email for over a month and won't ask me for a 5th time now for my ID and proof of shipment for the two items.\n\nBelow, for your information and for everyone to see is the last email I exchanged with your agent Cathyrine. (It is exactly like the first 10 of them) .\n\n\nCathyrine M. (Support Vestiaire Collective)\n\n27 Dec 2021, 19:02 CET\n\nDear Hristina,\n \nThank you for  your email.\n \nI am sorry for  the inconvenience.\n\nFor  this reference 19034567 we would  like to inform you  that there is  an ongoing investigation. \n \nThank you very much for your patience, I remain available if you have any further questions in the meantime.\n \nBest Regards,\nCathyrine for Vestiaire Collective\n\nHristina\n\n26 Dec 2021, 20:38 CET\n\nHello\n\nPlease answer me - do you read my emails so far?\nI have sent you all that information a month ago, then again and again and again???\nHow many times you need me to send proof of shipment and ID - they are literally shared in this set of emails and you will not even bother to scroll few emails back and open them? How much time you will further use for pointless emails?\n\nI am planning to start legal actions against Vestiare Collective and I will use our correspondence here as further proof of your unwillingness to resolve this matter.\n\nFor 4th and last time find below attached the proof of shipment and copy of my ID.\n\nBest wishes,\nHristina","title":"3 days later","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-28","author":"mona brar","text":"I purchased a Hamilton watch listed for £450, the website mentioned its in 'good' condition. We didn't receive the watch until 8 months later as the parcel went missing and i received an email to tell me the box had been damaged and being returned back to them. I:\n\n-Received it  8 months later then the purchase date (refund was refused in that time it was missing as they kept saying it was on its way) \n-paid 65 for customs, was charged this again on delivery\n- when it came, it was scratched, old, and one stap was a fake generic strap, the other fabric strap had stains on it.\n- After a couple of weeks we noticed the time kept slowing down an stopping. We had to pay 150 additional to fix that. They told me because i didnt inform within 7 days i can't get a refund (even though the law states anything fault within 6 months can be considered faulty to begin with).\n\nWhen i informed them they told me to relist it (prior to me fixing it). That means their happy for me to sell broken goods. They only want their cut. \n\nWorse transaction i went through in my life. I deleted my account after to resist temptations and deleted all their notifications. The watch would have been cheaper to buy brand new. And the fact i have to inform them in 7 days but they think 8 months to deliver is reasonable.","title":"The company has a lot of work to do","stars":1,"location":"OM","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-28","author":"LM","text":"I’ve been a loyal customer of VC since 2017 but I’m closing my account as soon as my dispute is over because this company is becoming extremely “unethical”. Standard of their inspection and Customer Service have become shockingly bad and they are only focusing on making commissions now. \n\nTo share my latest experience;\n\n1. I bought a Hermes dress but wasn’t happy with its condition - product was not washed so it had really bad smell. It was also more worn-out than the advertised “very good condition”\n\n2. I requested refund by sending product photos and was given a shipping label to send it back to VC Hong Kong (city where I reside)\n\n3. I got a notification saying that I listed the product for re-sale and VC will charge me a commission for this - very cofusing!\n\n4. I contacted CS and got a reply saying it’s a mistake and I’ll be given a full refund\n\n5. Another CS person wrote me the following day and said VC listed the product for resale because they refuse to give me a refund. Their inspector thinks the product is “compliant” to be in a “very good condition” which is a total nonsense :) I was told to wait until the product sells if I want my money back\n\n4. I disputed the decision but my opinion on the dirty and more worn-out product condition was ignored again with no supporting details\n\n5. I asked the dress to be sent back to me (to my home address in Hong Kong) as I found it extremely “unethical” VC is attempting to make double commission on this dress, screwing over unhappy customer who’s been loyal for so many years.\n\n6. I received a reply saying the dress is now at VC warehouse in France and cannot be shipped to the UK due to VAT issues??? But I live in Hong Kong!!!\n\nI’ve been in this never ending, disastrous purchasing experience for two weeks now and wonder if I’ll ever get my money or at least the dress back??? \n\nVC was good back in the days but I don’t think it will survive for much longer in the market because they’ve lost core of their business ; Product Quality and Customer Satisfaction!!","title":"Extremely unethical business practices","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-28","author":"JH","text":"I don’t know where in the world they have their customer service is, but they don’t answer my questions via email. They end the chat without answering my questions. It’s as if they don’t even read the messages. It’s ridiculous","title":"worst customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-28","author":"Kiran Dhadwall","text":"Tried to make multiple purchases and had buyers pullout and many purchases cancelled by Vestiaire for no reason whatsoever. No vetting on listings, people listing items without intention of selling or without owning item. No help from customer service as I got no replies. Really let down.","title":"Awful reselling service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-29","author":"Ольга","text":"#20034681 I was blocked on the grounds that my photos in the publication belong to another person! This is such idiocy that goes beyond all decency! I am very disappointed because I did not have more than one comment and warning","title":"I was blocked","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-29","author":"Ольга","text":"#20034681 I was blocked on the grounds that my photos in the publication belong to another person! This is such idiocy that goes beyond all decency! I am very disappointed because I did not have more than one comment and warning\n\nI don't have any second account! I have a crystal clear reputation! Your blocking actions are wrong","title":"I was blocked","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-29","author":"Tara Jones","text":"At first, I loved shopping on Vestiaire - they have good product options over a variety of sellers and types of products. But BEWARE, they have the worst customer service out of any platform I have ever seen. I purchased a product that, shortly after purchasing I realized was gravely misrepresented in the listing (I basically thought I was buying a purse and it was in fact the size of my palm”. I reached out to Vestiaire immediately about the issue to see if we could cancel the order before the item was shipped. I was told that, although they agree that the item was misrepresented, the Seller is the only one that can cancel the order. I reached out to the seller and she refused to cancel in order not to hurt her “selling reputation”. Once I actually received the item, I reached out to Vestiaire again. I have been tossed around with about 5 representatives for a complaint that I filed. Finally after days, they just told me that they agree the item is misrepresented but I didn’t reach out within 72 hours of receiving the item so there’s nothing that they can do. Plus, I reached out before the item was even shipped. Many other sites will give you a one time leeway but not here!\n\nAnyways, what I am saying is you can find some good stuff on this site. There’s also a chance that you will pay $300 for a keychain that fits absolutely nothing. If you have money to waste, go for it.","title":"TERRIBLE CUSTOMER SERVICE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-29","author":"HHH","text":"Ref: 16730697 \n\nI sold Hermès rings through this site. And I obviously sent the original invoice in the pakage.\n\nBut they said they never receive an invoice. \nMy sale was also canceled because an invoice issue. \nWHAT??????? I obviously sent the original invoice in the pakage.\nI also took a picture of the invoice the day before sending it to them. \n\nI've asked them several times to check the inspection team's CCTV because I obviously sent them an invoice, but the answer I get back is always that they never receive an invoice. They ignored the CCTV confirmation request and did not even make a proper apology. Worst customer service ever. \n\nThey don't even reply anymore. Complain can only be made by e-mail and chat. They always send reply with the same content like a robot. They say that they have never received an invoice only verbally without any evidence from CCTV.\nPLEASE JUST CHECK THE CCTV!!!!!!!!\nThey don't even have the will to solve it.\n\nThey lost my original invoice. I obviously sent it. \n\nIt's a company that deals with luxury goods, the customer service is awful.\nI can't trust them at all.","title":"They lost my Hermès Invoice!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-29","author":"Arianna Aronson","text":"I bought an item that was sent to the post when I went to pick it up they said it was sent back to the seller and warehouse. \n\nI contacted Vestiaire it was very difficult to reach them - only through a robot chat then they told me that they were able to locate the item after I kept asking where the item was and then they offered to just refund me. \n\nWhen they said I could re-purchase the item I went to look and it was double the amount I paid for. They wouldn’t waive, accommodate or help in any way. There were addition costs\n(shipping and authentication fees) that weren’t there to begin with.","title":"terrible customer service","stars":1,"location":"IL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-29","author":"Sophia Lee","text":"Never give me back my bags.\n I sold my 2 authentic hermes picotin bags and they told me mine is not an authentic which is insane.I asked several times to get them back  and paid the returning fee for both of them. Never give me back two bags and VC stolen my bags!!!! Never resolve!!","title":"Never give me back my bags.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-29","author":"Nancy","text":"So after many weeks the DHL invoice sage (which I shouldn't have received in the first place) is still unresolved.  I have been passed from Grace, to Marianne and now to Sarah Jane.  All these 'customer services' people are great at wishing me a lovely day but not one of them has sorted this issue out.   I was told by Grace to 'disregard' the bill and now I'm being told by Sarah Jane to pay it and I'll get reimbursed.....  Who believes that ?!? would ever happen.  So from a matter which could be simply resolved by this company completing the necessary form, which has been sent by email several times, I am being passed from pillar to post and guess what.. nothing is being resolved.  This company has very very poor reviews, and now researching online I can see exactly why.   There are major flaws and issues and all I can say is my experience is so unprofessional I am determined to never ever use them again.  I'd rather shop with confidence, then have to experience weeks and weeks of chat and emails and get absolutely nowhere.  If anyone from Vestiaire is reading this, can you please look into this matter and resolve it..  Don't ask me to pay this bill that should never have been sent to me.  This matter has gone on for far too long.... we are now entering around the 5th week of me bringing this matter to your attention.  I am very disappointed to say the least and this has hung over me all through the holiday time... let's see who else picks this up seeing as the last 3 people have done nothing!!!","title":"Avoid Vestiaire at all cost..if you want peace of mind...","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"},{"date":"2021-12-30","author":"Natalie Barkus","text":"The worst customer service\/website ever.\nI sold my authentic moncler jacket, packed original invoice, in original moncler box, labels, spare buttons. Obviously qr code.\nJust for the buyer to claim it's not authentic.\nCustomer service is beyond bad. I asked for someone to call me, noone bothered. They needed the chat with me before anything got resolved.\nOutraged","title":"The worst customer service\/website…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=27&stars=1&stars=2&stars=3"}]