[{"date":"2021-06-14","author":"Daphne Dee","text":"Very difficult to reach a favourable resolution with them when there are issues. A lack of adaptablity to current situations. Also a lot of restricted brands. They decide what brands one cannot sell without giving an explanation.","title":"Very difficult to reach a favourable…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-15","author":"Yulia","text":"I wanted to share my most recent experience which I think is beyond all possible limits.\nPlease all do very careful with Vestiaire Collective as what is going on over there is absolutely not acceptable.\n\nI have been having a lot of issues with my items being refused but typically I was able to resolve these after some hassling with the customer support and making someone more senior to look at my items. They were all placed online after a few email exchanges and real people checking my items.\n\nMy understanding is that it is either AI or someone junior who is reviewing the items at the initial check. So my strategy was to make them \"escalate to the expert team\" in order for them to actually look at the items and see that they are authentic.\n\nFrom my last upload, 6 items were refused as Vestiaire Collective \"could not determine authenticity\".\nFine, I am writing to the customer support, it is escalated to the \"expert\".\n\nHere is the response of the CS and \"expert\":\n\"Our expert team reply in my email. \nHere is the report why your item is refused.\nHello\n16578120 finish, engravure, et box NOT CONFORM\n16575357 same\n16575321 same \n16558233 finish NOT CONFORM\n16558515 finitions NOT CONFORM\n Base to our expert team We can't accept it.\n\nWe hope to see the new listing from you.\nThank you.\n\nChristian from Vestiaire Collective.\"\n\nI always doubt myself in case I missed out on something and who knows, maybe I overlooked something in some items but all items are common models which authenticity is so obvious to me.\nThe most bizarre issue here that, for example, item 16578120 above was just serviced by Chanel Singapore. Not just serviced, but I dropped it off and collected it personally and I paid for the servicing with my own card.\nI have provided super clear photos of the earrings and photos of BOTH receipts: collection slip and receipt with payment of 65 SGD, my details, my signatures, item model number on it etc. Even the pic of the slip I took IN CHANEL ITSELF while collecting. Everything was provided.\n\nIf I could, I would be very happy to share hallmarks for all the items just to show what I am talking about because I have zero doubt with their authenticity.\n\nThe reason I am writing this all here is that there was an actual person from the \"expert\" team (not the customer support folk who can't even speak English) who actually looked at the items and concluded all of them are fake. Despite hallmarks, super clear photos and documents from the original brand provided.\n\nThis clearly shows not even the level of expertise but its total and absolute absence, stupidity, zero knowledge of the brand and lack of skills to do some basic research. This is all despite the fact that the items are pretty basic, these are not some rare vintage unknown models - no, there is nothing really special about them.\n\nStill, Vestiaire Collective is unable to recognise authentic pieces despite being provided with the sufficient information to do so.\nI really wanted to make this public for everyone's awareness. \nDespite the fact that everyone knows that they do pass fakes but pointing their dirty stupid fingers at authentic items, calling them fakes and placing themselves ABOVE THE ORIGINAL BRAND in terms of expertise - this is not a viable business model.\n\nWith the absence of the brand knowledge, I believe they have no right to do any sort of authentication service if the skill literally does not exist. I will also be reaching out to Chanel representatives to raise concerns over Vestiaire Collective selling and \"authenticating\" Chanel products without any capabilities to do so.","title":"Experts without expertise","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-17","author":"Natalia","text":"Worst experience! Terrible customer service! Not possible to solve any issue. They limited all customer service interaction to Chat. So if you will be lucky to get through the Leo bot and connect to a human agent they will be just cutting and pasting polite apologies and promising you to look into the issue. Then you end the chat and wait for feedback. don't receive any feedback, go to chat again, explain your problem again, new agent is promising you to look into the issue PERSONALLY and assuring you will get a feedback within a day, you end the chat you wait for the feedback, no reply received, you go to the chat again and start all over again.... Never ending frustration. The worst expert team, next to ridiculous! Weak technology, malfunctioning platform. DO NOT RECOMMEND! AVOID!!","title":"Worst experience","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-17","author":"Soula Valindra","text":"I have used VC many times but i have to say that if a seller is not trusted they arent protecting you from them. I had ordered an item that was never shipped and although they refunded me, I tried to order it again because it was still on sale and the seller was allegendly out of town for business. She was still selling items and never shipping them. After contact with VC and stating this problem, they never did something to prevent me from ordering items that were never shipped to them. Their policy about not trusted sellers is very weak.","title":"Untrusted sellers","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-17","author":"Frieda Ryckaert","text":"Since Corona times, dishonnest competition with those who simply let VC handle their prices without thinking about the real value of things. \nChantage -you'ld better listen to VC- and chantage - we won't support your items if you don't bring prices as low as we decide.\n\nOne of my items rejected for having marks during controle before shipping, item returns to me and nothing to notice but the shadow play on changeant fabric (like chintz). Professional??\n\nBe told certain items will make part of the Summer Deals even when they don't, not even 1.\n\nA great pity VC sells his soul in return of money, remain true to yourself even in difficult times we all deal with.\n\nNot getting any reply to message about all this.","title":"Since Corona VC lost his glam and glory","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-17","author":"Piotr","text":"Tragedy I am waiting over 3 months for delivery nothibg proposed for this oncovinence and no way of contact every email answer different person. Trybto get money back no way !","title":"Tragedy I am waiting over 3 months for…","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-17","author":"Yueeve","text":"I have been a relative happy customer of VC, but the last two purchases have been absolutely horrendous. \n\nFirst of all I suspect their \"so called experts\" have the right qualifications to verify any of the items listed on the page. In the past I have received items that was clearly FAKE even for the untrained eyes. \nSecondly it is almost impossible to have a item returned for refund EVEN IF THE ITEM CLEARLY DOESN'T MATCH THE SELLER'S DESCRIPTIONS. \n\nWhen you finally gets in contact with the customer services, they claim that they have to follow their policy and they can only offer you a voucher and relist your item, so they can profit more from you.\n\nThe only way to get your money back from these thieves is to contact your bank and open an dispute and file for a chargeback. \nFurthermore it's stated very clearly in the EU Consumer Rights Directive that the consumer has the rights to return any good within 14 days of receiving the goods without the need of justification. \n\nLike comments from earlier, I encourage you to take administrative steps to submit a complaint to the European Commission to stop this fraud company.","title":"Do not purchase from this company EVER","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-17","author":"Lorna Nhova","text":"Don't use. I'm new to the site and sold a brand new item to a professional  buyer.\n\nThey received the item and reported an issue with the item. When the item got returned, I noticed the item looked  like it has been worn and got dirty in the process. It even has what looks like food marks. \n\nUnfortunately buyer has all powers. Sellers are scammed!\n\nWhat a loss for me. I feel the buyer highly likely partied wearing my item then after flaged an issue and returned. I wish I had never sold my item in the site.","title":"Don't use","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-18","author":"careful consumer","text":"Another jungle that works very nicely for the company and poorly for the clients. Everyone of course is looking for bargains in VC. The prices are originally inflated as buyers expect discounts, even very steep discounts. VC allows for requesting 30% discount on the asking price of a listed item but at the same time VC also pushes sellers to lower their prices if their items don't get sold asap. I have seen items that were originally for sale for 500€, getting sold for 150€ or less. VC is whistling blissfully with a flat 15€ commission from any sale up to approx.150€ and percentages for sales above 150€. So if a seller has let's say listed a nice but non-signé leather belt for 60€ it is likely s\/he will actually sell it at around 20-40€ which means that s\/he would barely make a profit of 5€ which doesn't worth the trouble at all if you consider handling and shipping. One would do it for the fun of it, but VC makes the serious money, not the average seller. VC is also replete with professional sellers who don't sell items from their wardrobes (2nd hand) but merchandise stock (items still with tags). These professionals probably also make some good enough money. What is attractive at VC is the seer volume of items on offer. But bear in mind that if you pay 25€ for a silver ring that you really liked and waited to get on discount from let's say the 100€ it was originally listed, that does not necessarily mean you got a real bargain! The ring might in close look seem worth less than 25€. VC charges extra for quality control and if you end up with an unwanted item ... bad luck! You may relist it for the money you paid and commission-free .... BUT it is likely that nobody will buy it for what you payed; everyone will want a discount! So VC does you a BIG favor! no?","title":"Another online retail jungle","stars":2,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-19","author":"Anna","text":"I like the idea of the website and shopped a few times on it but recently the difference between the price you think you oay and added taxes and shipping makes it cheaper to buy elsewhere. I live in the UK, and even when trying to buy from sellers in the UK, 20% tax was added on top (and there is no such thing as domestic tax). Also, if you sell with them they take such a huge cut you will never make any money. Disappointing","title":"You pay „taxes” on domestic shipping","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-19","author":"noisette","text":"After several months of using VC, I unfortunately have to give VC 1 star of their service, platform system and the overall experience. \nThe shipping time is extremely long, and if the item need to be checked, it will take even longer ( I understand the checking system for higher-end products but they check things from high-street too, which is a bit confusing for me, though this did not contribute to the lower star result though ). After the item is received, the buyer has 72 hours to confirm the item which I found it a bit too long, give them times to do things that result in sending back damaged item and I had heard several experience like this from close ones already. \nThe commission fee is too high for products that is not high priced, since there is no extra service provided for these items, the commission should be lower to none considering. \nHowever, all above may just result in a 3 star review, but what bring them 1 star is the service attitude they have. When encounter difficulties, the staffs are cold, rude and not helpful. I never get the help I need unless I involved other parties, such as my bank. Some of the payment that I ought to receive within 5 days does not even show up for 1 month. (even now i have to involve my bank in this unsolved situation...)","title":"Not recommended","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-21","author":"HYYOONIQ","text":"Seller - compared to Poshmark this site doesn't have enough buyers.  The listing also takes days to upload, and they don't translate english properly.  The commission is also the highest vs Poshmark or Tradesy.    They throttle your listing if you don't list at their \"recommended\" price and their buyers nitpick and constantly low ball.  Even when they \"buy\" - they don't fund, so it's the lowest class of buyers on this site.  Maybe it's good for buyers but if you are selling something - DON'T.  I put brand new LV Neverfull on all 3 sites - sold in 2 days with multiple offers on Poshmark and Tradesy at full asking.  NOTHING from Vestiare - why?  Vestiare recommended a lower price by almost $300-$400 less than other sites.  If you don't follow their pricing - they don't let your listing get exposed.  As a seller - by far, I think Poshmark is the easiest and fast way to sell and get paid.  Tradesy is also good - but it takes 3 weeks for you to get your money after you ship, so Poshmark is the best","title":"Seller","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-22","author":"Jana","text":"First of all, Vestiaire Collective is a company who violates its own policy. I take all the responsibility to all the information I have here, and I kept the emails and chat history as well:\n\nI´m an expert seller on Vestiaire. \n\nOn 06\/07\/2021, I shipped the brand new with tag dress to my buyer, who lives in Germany.\n\nOn 06\/09\/2021, the buyer received the dress. (info via DHL)\n\nOn 06\/11\/2021, the buyer reported a stain problem, but she didn´t upload any photo of the stain. (info via email from Vestiaire and chat) \n\nAfter the day 06\/11, I contacted their team almost everyday, especially on 06\/18 through email, to sent them high quality photos and a packing video of the dress, all these evidence proof that when the dress being packed, it was clean and brand new.\n\nOn 06\/18\/2021, their agent Garry O. confirmed in the online chat that according to the DHL tracking info, the buyer had sent the dress to their Paris expert team and they´re waiting for its arrive. Also he replied my email that they had received my photos correctly and if there were any updates, they would let me know.\n\nOn 06\/21\/2021, I contacted them again through chat, wanted to see if there was any photos of the stain, the agent at the time confirmed still not, they were still waiting for the buyer to upload the evidence.\n\n2 hours later, I received a message from DHL, saying that there´s a return package for me from Germany, the buyers address.\n\nSo I contacted Team Vestiaire on chat, they started to trying to close the chat and promised me that if we talk through email because it will be more efficient.\nAt the same day afternoon 06\/21, I received some photos from the buyer, and I asked them to mark the stain for me because I couldn't find any. \nAt 10PM, their agent Vanessa Nacion replied my email, didn't answer any of my requests, and telling me that is the \"direct shipping\" policy that the buyer can choose a return because the dress is dirty.\n\nSo I carefully checked their \"direct shipping\" policy online, it has one sentence: \"Whilst waiting to know more, your payment will be placed on hold and we’ll let you know the outcome within 7 days.\"\n\nI have all the evidence that the case was opened on 06\/11, and I received the outcome on 06\/21. \n\nThe solution is simple, I didn't get the outcome on time, I get paid.\n\nToday is 06\/22\/2021, They never replied my last email.\n\nI think I was tried to be reasonable.\nHere is my experience, and I always take detailed photos and packing video just in case for anything complicated. But here it is.\n\nUPDATE!!!! People, please see their reply below. They thought I didn’t know their direct shipping policy, and they left the link of the policy (the one they violated in my case!!) Omg this is so funny. Btw, I got my money back.","title":"Vestiaire Collective is a company who violates its own policy","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-23","author":"josefin","text":"They BROKE my Chanel bag when they inspected it! They ripped a sealed pocket!And then claimed that it was already broken! Scam company that blames their customers instead of pay for the damage! Discusting","title":"They BROKE my Chanel bag when they…","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-24","author":"Akushia Campbell","text":"I have purchased and also sold items on this site and generally its been OK, even though I always thought their recommended prices were quite low, considering the commission is quite high.\nLately I have noted that they value items excessively low, and its difficult to understand how they come to those prices.\nI recently listed a solange azagury-partridge diamond spinner ring for £4500, its currently retails for £9200 on the designer's website.\nSelling for £4500, means I would get £3375, the difference is their commission. However \nVesitiarie recommended I sell it for £142, REALLY!!!\n\nThis was their recommendation:\nReference : 16801204 \nSolange Azagury-Partridge\nWhite gold ring\nVery good condition \nOn the site : £4,500.00\nFor you : £3,375.00\nWe recommend : £142  \n\nSee My Listing\nGive It The Best Start  Your item will have low visibility as the price is too high according to our records. We recommend adjusting your price to £142. \n\nAdjust My Price\n\n I would be interested to know how they came to that price.","title":"Recommended pricing of items can be very suspect, excessively low against current market price and other comparable sites","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-24","author":"Nina ","text":"I have previously sold a few designer items on the VC platform. The process has not always been smooth but, in the end, any issues were resolved. \n\nToday I submitted a Mulberry bag for listing. I took 20 photos of the bag (could I have been more thorough?), including close ups of the serial number and inside label. The bag came with its dust bag but, given it is  almost 10 years old, I have lost its authenticity card. \n\nMy listing was refused within 50 minutes on the basis that \"when applying the specific criteria determined by the Vestiaire Collective it was not possible to confirm the authenticity of the item\". \n\nThe said authentication process disregarded the number of photos and detail I provided. In addition to that, the company seems to pay no regard to sellers' track record. My understanding is that the sole reason my item was refused was the lack of an authenticity card (of course that is only my understanding, I was not offered any more clarity but I am hoping their customer team will reply to my follow-up e-mail). \n\nVestiaire Collective should really invest in building an in-house team of experts whose job is to make sure everything is PHYSICALLY inspected and authenticated and not just refusing items following only an online review. It would also help if they could be more specific on the criteria they apply when refusing listings and, of course, not disregard the sellers' profile (please note I am not a professional seller and have historically sold 8 designer items). \n\nI doubt I will be returning back to VC, considering their poor authentication process and hefty commission charges.","title":"Unfair authentication process","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-25","author":"Matilda","text":"Disgusting disgusting disgusting! I bought a jacket from here that cost me £500 when it came it was smaller than they had said it was in the advert the measurements were wrong so I sent it back and because of the faulty shipping label they had told me to print off it has now gone missing somewhere and they do not want to know. There is no customer service with this company just bots. If someone is buying something for £500 there should be a human at the other side of the phone not a computer pretending to help you ! Do not order from them they are incredibly corrupt and only care about ripping people off. The commission you have to pay is sky high ! This is the most disgusting website for people who want to buy second hand and care about the universe. These people are crooks !!!!!!!","title":"Disgusting disgusting disgusting","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-29","author":"Yara Sanei","text":"I have order a brand bag from a user Heidi Taylor in Belgium.\nIt was literally a fraud! Sent me back an old, no name bag instead of the Max Mara one in the picture! Not recommend to use this app! It must be reported","title":"Faud user with the name Heidi Taylor from Beligum…","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-29","author":"Izabela","text":"Absolutely ridiculous charges! \nI wanted to purchase a shirt from this site for £60 when proceeded to check out there were £30 of added silly charges. Since Brexit, the site doesn’t allow direct shipping between the UK and other European countries, why? I work in retail myself and there is no problem in moving fashion products within Europe. Why Vestiaire is making it complicated? \nThey added authentication charges, why? I understand an authentication for a Chanel bag but for a simple cotton shirt? That’s just silly! \nThey added double Duty and Vat! Double because first the item needs to go to their office for authentication! Absolutely ridiculous! \nAll of the resale sites are completely disregarding the fact that anything that costs less than £135 should not incur any duty charges. Vestiaire have added them twice!","title":"Absolutely ridiculous charges","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"},{"date":"2021-06-30","author":"Kramia","text":"You will never successfully unsubscribe from this site. Be prepared for a deluge of daily spam emails!","title":"You will never successfully unsubscribe…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=55&stars=1&stars=2&stars=3"}]