[{"date":"2021-08-04","author":"Beatnik","text":"The saga continues with Vestiaire.  This is their response to me even though their website says item received. They keep asking for information about shipment when they acknowledged receipt two days after item was mailed\n \nThank you for responding.\n\nI just want to let you know that this has been coordinated to our Team of Experts and the advise is to contact the USPS drop off point to and check with them directly as the parcel has never entered the network of Fedex.\n\nYour understanding and patience on this matter is greatly appreciated.\n\nThis is my latest response:\n\nMy question below about why Vestiaire indicated received is still not been answered. I am told if item is dropped off at USPS a FedEx truck will ultimately retrieve it, that is the process in place. I though nothing of it since Vestiaire marked the item as received.  I expect because went through USPS, it may not have been properly scanned for tracking.  Still, Vestiaire showed it was received two days after shipping.  Seems Vestiaire is using this technicality and still not addressing the elephant in the room. Why was it marked received by Vestiair if not received. This is like me confirming that I received an Amazon delivery, but then saying no I did not receive it because the tracking is off. Please answer the question regarding Vestiaire marking this item received and in assessment two days after.  What are the chances that temporal with the shipment that Vestiaire will mark the item received and in assessment.  This just seems very off and fishy. The investigation should be, who marked the item received at Vestiaire, review video of day they marked the item received to see what they processed.  Has that been done?\n\nVestiaire’s response on 8.5.21 to my communication above:\n\nThank you for responding.\nI am very sorry for the inconvenience this has caused.\nAs much as I would love to help, this was the advise by our Team of Experts.\nThank you very much for understanding.\n\nMy response to Vestiaire on 8.5.21:\n\nCan I please get an answer to the following?\n\n1. What is the Vestiaire process for marking an item Delivered and in assessment?\n2. And, why was my item marked Delivered and in assessment on June 23rd by Vestiaire giving the impression that Vestiaire had received same?\n\nVestiaire has still not answered this which is critical to this issue. It keeps on glossing over it as though of no import.","title":"The saga continues with Vestiaire","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-04","author":"Lise","text":"i really wish I’d tend the reviews. Similar to other experiences on here I made sure the item I bought was from a UK seller to avoid additional fees due to brexit. Who knew that when they said the item will be authenticated at their nearest hub they meant their hub in FRANCE?!? Obviously got in touch with customer service and was directed to a bunch of FAQ pages. Any way I’m now left paying additional fees on my purchase......the total of which amount to a brand new bag and not a pre-owned one from VC. AVOID VC AT ALL COSTS. Their business is an absolute scam.","title":"Better off buying brand new","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-05","author":"E","text":"Their customer service said they would get back to me within 24 hours. Its been a week tomorrow and I have reached out to them again a few days ago. \nThey payed me less than they were supposed to do when I sold an item and blamed it on my bank saying they charged me fees etc, which my bank confirmed is not true. I asked the to send me a picture of their payment but thats when they stopped answering me.. you seem to be very quick to answer reviews on trustpilot, maybe focus on helping your customers before they go here?","title":"Payed me less for my sold product and now they are ignoring me!!","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-05","author":"Dan","text":"The worse website ever\nI bought a key ring that cost €40 in the end was €87 when arrived it was plastic and not original.\nHuge scammers this website.","title":"The worse website ever","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-06","author":"Xin Ngoh Tan","text":"This is my first purchase with VC, I purchased a Celine classic box bag last week and I opted for authentication service by the team just to ensure the authenticity. The item turned out to be a counterfeit despite having passed the quality control. I contacted the Customer Service and was asked to return the item for another round of authentication. It’s such a disappointment.","title":"This is my first purchase with VC","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-06","author":"Alice Freeman","text":"I call your attention to the dishonesty and deficient moral code of Vestiaire Collective’s employees. They have consistently misrepresented me as a seller to customers by manipulating the sales price of my merchandise, quoting the lowest end of my negotiation rates for in-season items - that are in great, sometimes never worn, condition - to interested buyers based on the private messages I have exchanged with other members on the site. They have engaged in communications with potential buyers that I have not authorized by prompting them to drive my negotiations further down. \n\nOver a month ago, I emailed Dounia Wone, the Chief Sustainability and Inclusion Officer, and seven other key figures in the company: Meera Trivedi, Fanny Moizant, Sophie Hersan, Sylvain Andries, Patrick Herrmann, Olivier Marchteau and Vanessa Masliah, raising issues with Vestiaire’s company ethics and selling integrity. I have not heard anything back. \n\nSince they have taken no action on their mistakes, I am informing other sellers of Vestiaire's underhanded tactics - and complacent attitude towards customer service. I encourage buyers to stay firm on their rates and to ignore any ill-advised guidance sent by Vestiaire’s notification system. As stated in my correspondence with Vestiaire:\n\n“... I write regarding an incident that occurred with your establishment, Vestiaire Collective. The matter took place on the 22nd June 2021.  Fortunately, this was brought to my attention, very kindly, by a purchaser. \n\nI understand that Vestiaire Collective seem to have a company policy of advising purchasers that sellers will be open to a specifically lower offer - with negotiations - should one put it forward. \n\nIt is clear to me that a direct approach has been endorsed by your establishment, Vestiaire Collective, to directly message prospective purchasers and advise them on how to approach a sale in order to get the best deal for them, i.e., the buyer. This has both horrified and concerned me as it seems apparent that I have been misled and misadvised. As a result, I have lost substantial income due to Vestiare's policies.\n\nI would be obliged if you could give me clarification on these policies.  I would appreciate ideas on how Vestiaire will discourage this unfortunate business practice in the future.  In the meantime, I reserve the right to take whatever actions I deem necessary to warn others and recoup lost income.”","title":"A warning to all sellers using Vestiaire's platform","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-06","author":"A K","text":"Fakes keep being listed and sold on this platform from first time sellers via direct shipping! Sellers who are only out to rip off buyers! Scammers misusing direct shipping option to sell cheap replicas from china and ship them directly to buyers! Vestiaire doesn't lift a finger to do anything about it!! Buyers, you can only be protected if you pay via Paypal! They let these knockoffs slip through without asking sellers for pictures of data codes and other details! Absolutely appalling! Hermes bags for 500 and limited Louis Vuitton for 400 with stolen photos of authentic items or stock pictures from chinese replica suppliers. Market price of these bags are thousands and tens of thousands! What a goddamn mess, which VC clearly can not care less to fix and not even interested to! Since they're pocketing commission from every sale regardless\nA few examples: 17372794 LV Couer bag, 17406667 LV Multi Pochette, 17385831 LV Coeur bag, 17380755 LV Coeur bag, 17229455 LV Multi Pochette, 17086050 Hermes Birkin (atrocious fake),  17303686 LV Multi Pochette (cheap fake junk for $50 in the last picture, was uploaded by VC and sold straight)","title":"ATTENTION BUYERS fakes being sold via direct shipping","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-06","author":"Aliaksandra Sankova","text":"Horrible experience as a seller. I was banned in the middle of a deal with a buyer because they detected words “other platforms”. What I was explaining my buyer is that I copypasted description across platforms that’s why there was discrepancy with app condition tags. Not only the deal was lost but they kept me banned for weeks even after me contacting their support three times and support agreeing the ban was unfair! I ended up deactivating my profile because I felt frustrated. \nThey take the highest commission (literally about 100£) from sales which is ridiculously expensive  if compare with platforms like Vinted or Depop or Facebook market. And yet this is the worst experience you could have on an online selling platform. Being banned from the chat they didn’t just kill my sale but they lost the commission that I could have payed them if the deal would work. So literally ridiculous business model 😂\n\nUPD your response doesn't make any sense, you and your support just copy paste the same piece of text without looking into human factor and recognizing that any recognition tech can have false positives. I am telling you that as software engineer. Stop copy pasting the rules of ban and actually look into people and their cases. Shame on you","title":"Horrible experience as a seller","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-07","author":"Astrid C.","text":"I have been using VC for about a month so far, despite the first few good experiences, both buying and selling have been a total nightmare. The customer service agents are full of lies and always shifting blames. \n\nSelling: they paid me less commission than they the should. I listed a few items during a commission promotional period, however the system did not correctly reflect the rate for one of the items. when I inquired about the issue, one of the agent suggested that I “sell the item first, they will correct the commission after”. However after the item was sold, they processed the wrong amount for me again. When I asked them for an explanation they lied and said that the promotion never happened, despite all the proofs I had supplied. \n\nBuyer: I purchased an item from the platform. 3 weeks after making a payment, there was still no updates. I chatted with a customer service agent who advised that the item had not been shipped by the seller. So I decided to cancel the order which he agreed to process within 24h. The next day VC had the seller of the item contact me directly and beg me not to cancel the order, because apparently VC had some problem with the shipping code which caused the shipment delay. Another proof that VC customer service is full of lies and they had no honor or integrity when it comes to running a business. \n\nFor the level of commission they charge (or overcharge), this business is a huge scam, there’s a long period of time when they are in possession of both the goods and the full payment and they apparently misuse this power to maximize every little profit. My advice is to STAY AS FAR FROM THE PLATFORM AS YOU CAN","title":"Buyers and sellers beware","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-08","author":"PICKLE Marz","text":"I have purchased from Vestiaire Collective in the past and have not run into any issues. I have tried to sell an item on the website and decided against it when I saw how much commission was taken. There are many other places that can be used so this is not my main issue with VC. As a Canadian this website is extremely frustrating to navigate when it comes to duties, taxes, and authenticity fees. The pricing is inconsistent and the explanations even less informative. I cannot complain about customer services as I felt they responded in a timely manner. I am a very savvy consumer and I do my due diligence when buying or selling items. On the VC website you will find items at reasonable prices until you checkout. EXAMPLE: (ref: 16255704) Burberry shirt priced at $343.13 CAD with authentication at 10 CAD plus 26.24 shipment\/insurance and $137 dollars in VAT taxes (duties). The shirt ends up being over 500 dollars Canadian. This shirt is coming directly from VC, so why am I paying 10 dollars to authenticate it? Is VC suggesting that they hold merchandise in their warehouse that could be counterfeit? If you have the item onsite does that not suggest that it has already been authenticated? Why am I paying for this again? Something seems a miss here. I have shopped at many luxury websites and find VC to have the most outrages taxes, given that they are a large coropration that has many perks and deals when it comes to brokerage fees. There are many great gems you can find on the site, but maybe they need to change their model and perhaps even include payment friendly choices such as Afterpay or Paybright, as many other consignment shops do. I am not about criticism for the sake of...I want to helpd companies improve their overall customer services.","title":"Disappointed","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-08","author":"Iwona","text":"Three difficult issues with VC: \n1\/ Not possible to get help from customer service\n2\/ The website cannot be reached currently (about 2 weeks) goes to error constantly\n3\/ Sellers often do not respond to buyers with answers about sizes or other queries \nIt all needs improvement very soon","title":"Three difficult issues with VC","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-08","author":"NEVER AGAIN","text":"AGAIN LOST SALE BECAUSE THEY DO NOT SEND CORRECT LABLES\nTHERE IS NO “ customer service “ no one listens literally bots\nThey send post lable you can not use you ask for help they send generic response. Completely useless stressful annoying company\nTHEY WILL SHUT DOWM SOON AT THIS RATE\nWORSE SELLING EXPERIENCE EVER\n\nFIND ANOTHER PLATFORM. THIS ONE DOES NOT WORK\nYOU SELL ITEMS THEY REFUSE TO PROVIDE LABLES YOU CAN\nSEND ITEMS WITH. \nCompletely useless, ignorant, unprofessional rubbish company\nGood riddance","title":"Worse company experience AVOID VESTERIE AT ALL COSTS!!!!!AGAIN LIST SALE BECAUSE THEY DO NOT…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-08","author":"NEVER AGAIN","text":"USELESS\nCONSISTANTLY LOST SALES EXPLAINED OVER AND OVER\nTHERE\nIS\nNO\nDHL\nIN \nMY\nAREA \nAND I CANT USE DHL IM. Disabled can’t use that site the lables don’t work, asked for UPS OR ANY OTHER BUT.,..\nNO ONE LISTENS AND KEEP SENDING DHL LABLES HALF A YEAR LATER LOST ALL SALES BECAUSE OF THISAS CANT SEND OUT!!!!\nSICK TO DEATH OF THEM\nCLOSING AVCCOUNT AS CANT SEND ITEMS ANYWAY BECAUSE THERE TOO INCOMPETENT TO LISTEN OR SEND THE RIGHT LABLES. \nWorse experience \nUseless customer service \nGood riddance \nIf you want to lose time & money stick with them I’ve had enough of talking to my self for half a year with lies and promises to sort out\nCompletely useless \nLOST MONEY AGAIN","title":"POINTLESS & very USELESS","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-08","author":"NEVER AGAIN","text":"Sick to death of this company \nFor half a year I’ve been telling them over and over that I THERE ARE NO DHL SHOPS IN MY AREA closest 30 miles away and when tried all there lables read error. I can’t sign up online I’m disabled and no one to help plus my disability can’t cope with it . JUST CANT USE IT asked for UPS or Hermes which is close by  over 20 reps spoke to over 5 months send they would change it , guess what, still sending DHL lables I CANT USE, not in area etc. Totally fed up with saying the same thing over and over it’s 6 month lost all days because they DONT LISTEN- fed up with the stress of it all, if not sorted I’m deleted account","title":"Sick to death of this company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-08","author":"Fanny Ann","text":"Useless company \nMake you lose sales\nSend wrong shipping consistently \nYou end up not being able to send items\nLose money &time\nNo one listens\nAvoid, this has been going on for months\nSell elsewhere you WONT BE LISTENED TOO REPETITIVELY\nUSELESS","title":"Useless company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-09","author":"casanova","text":"impossible a joindre par telephone  qd il y a un probleme et par mail on tombe sur un robot qui ne repond pas aux questions","title":"impossible a joindre par telephone  qd…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-09","author":"Fanny Ann","text":"horrible experience-\n“ customer service “non exsistsnce,,, so if you need ‘ANY ‘help forget it, whether that be shipping , money owed and so on, YOU’LL get zero sufficient or credible help. \n\nJoke!!!\n\nWast of time","title":"horrible experience-","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-09","author":"Chevalier Karalidi ","text":"Do not trust them , I had paid for the same item twice \n two days after the order they informed me that the item is not available and they made a refund \nI contacted the seller and she told me that the item is available though and that she don't have any payments  \nSo I made a second payment .In both orders it says confirmed the item is still available for sale though","title":"Do not trust them","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-09","author":"Mw","text":"So where to begin. Another dodgy selling platform! Started off ok but then wait for it when you need help!! None!! At all!!! Customer service is diabolical no help what so ever thick so called experts that refuse genuine items with proof of authenticity!! An absolute farce of a company! In my opinion avoid these absolute waste people!! And run for the hills! Don’t waste your time effort or moneyyy!!! Vestiaire collective needs to be shut down!!!!!!! God awful company!!!","title":"So where to begin","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"},{"date":"2021-08-09","author":"Daniela Bogoeva","text":"Go far from there !!!!!!!!! There is some discrimination of the team . Second authentic item of me is canceled, this time i am saving the receipe and again nothing! Loosing my money and also paying for returna. Guys it s possible they to have some business with Chronopost.!!!!\nI have proofs i texted with a guy from the chat Pinky A and ahe said that the bag passed the check and is authentic, but not complian which is also lie but anyway. Suddenly the bag is went to second check and is cancel my sale! \nThey have discrimination team , maybe to Bulgaria, but who will pay my lost money? Collective i am sure that a one beautiful day your platform it will be forgotten. Like this can’t make bussines. Please\nLet me know.","title":"Go far from there !!!!!!!!","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=50&stars=1&stars=2&stars=3"}]