[{"date":"2022-04-17","author":"Elisabetta","text":"I was an active Vestiaire seller user for under 72 hours, had two listing approved for sale and was hacked. Locked out of my account, then deactivated, no one can tell me what happened, I just keep getting told than an “expert” team is looking into it. And of course, your personal information is on the account. Absolutely terrible experience, never ever use this service.","title":"In less than 72 hours someone locked my account","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"evelina hadzhiyska","text":"The customer service does not even deserve 1 star!\nUseless people, never can fix any problems or issues. First time use them and last.\nDo not waste your time, energy and money with clueless managed website.","title":"The customer service does not even…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"Thomas odum","text":"Vestiairecollective.com won't back my shoes. They won't get back to me or give me any indication of where my shoes are. \n\nI sent my shoes in. A pair of gucci tennis 1977 high top black. I purchased them in Miami and I couldn't take the box me on thr flight so I ditched it and packed my shoes. Fast forward to the sell of the shoes on Vestiairecollective.com. \n\nNow I put the shoes in a replacement box because I threw away the original box to back them in my luggage. The shoes were packed in a authentic gucci box from another pair of gucci shoes. The item was sent directly to the buyer. Buyer raised questions of authenticity because it wasn't the original box. \n\nVestiairecollective.com was sent the shoes and hasn't returned them at all and won't give me explanation to why they won't. Customer service says they are sitting in a warehouse. Why???? I've chatted with 6 different customer service representatives and they all say they email me. I complained everyday to them with no results. I'm considering filing a law suit against Vestiairecollective.com for theft. Vestiairecollective.com has had more enough time to send my item back give me a reason to why it's being held. \n\nVestiairecollective.com gives the buyer 72 hours to file a complaint which in my opinion is to long. Buyer could wear them, send them back, with a full refund and now the seller is stuck with a used shoe and get penalized. Not fair. \n\nHopefully Vestiairecollective.com see this and finally want to do their damn jobs. I don't recommend people sell on this site. Communication is terrible and your not actually talking to anyone directly. Maybe through the chat service but they'll jus tell you they will contact you by email. Which in my case they haven't or won't.","title":"Vestiairecollective.com Stealing items???","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"email addy","text":"After putting in enormous efforts on the site I suddenly  had multiple issues from no payment, items not returned then a wealth of errors made on my account that took an unacceptable amount of time to fix and was messaging daily for over two weeks without success, at this point I’d had enough, So deleted my account then thought why should I lose out through others failures.So Decided to reactive, it’s been 4\/5 days or going around in circles…CAN YOU SIMPLY reactive my account  as AGAIN I’ve lost over a month of being messed around . I’ve sent over 29 messages and chat. This should not be difficult, I’ve already had months of stress that was not my fault, and given that I’ve uploaded over 600+ item I don’t think I should be continuing to suffer through all the unnecessary failing I didn’t cause. Reacted account asap!","title":"After putting in enormous efforts on…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"rosalindLaw","text":"I think you push too hard to lower the selling price and most of the buyer told me that the charges is very high from Vestiaire Collective especially the oversea buyer which cost them a lot and they lost interest to buy.","title":"I think you push too hard to lower the…","stars":3,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"Lainne Vega","text":"I should have known the moment I discovered they discretely charge a higher exchange rate that this company was dishonest. After chatting with a seller who said she sent me an offer, the offer was the listing price. As we discussed more, I learned she was offering me 1750 euros which should be $1880 but in my end it was showing up $2035. No one in customer service could help me. They wash their hands and say a third party handles the billing. I realized you can change your settings to another currency. When I changed to Euros, there it was, listed at 1750 euros. I have a MasterCard with zero foreign transaction fees so I purchased it in Euros. I got an email confirming my purchase. When I tell the seller I’m so excited for the item, she tells me she hasn’t received a shipping label. Customer support said they were verifying payment and if they needed supporting documents, they would email me. The account is in my name. Everything matches so I didn’t worry. 4 days go by and still nothing. Customer support keeps telling me they’ll email me after forwarding to their “experts” but nothing. On the 5th morning, the seller emails me saying her item is showing back on sale. When I look at my order status it says “cancelled by seller.” Seller says it wasn’t her. Customer support says they can’t verify my payment and have cancelled. Seems like they want to pocket the extra money from the exchange rate and since I found a way around it, they decided to cancel my order and blame the seller. Again, was told I’d get an email. They still haven’t refunded my money or communicated what they couldn’t “verify” if the account is valid and mine!","title":"Pocketing higher exchange rates","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"Allison Brody","text":"Do not use Vestiaire, they will steal your money.  I live in the UK and recently sold three items on their website to three buyers in the UK.  My total sales were 212.14 pounds and taking into account their selling fee (12%) and processing fee (3%), I should have received 174.57 pounds.  However, when they paid me, I received 134.44 pounds.  I emailed them to ask them about the missing 40 pounds they owed me and they said it was because of currency conversion fees.  That makes no sense to me as I was selling it within the UK.  It is very un-transparent, as they did not tell me what currency these people whose addresses were in the UK decided to purchase my items with and even so - there should be a disclaimer about conversion fees that are almost 20% of the total sale price!  I think they are not being honest and are using that as an excuse to skim money off of customers.   As there are many more resale platforms around now, I will no longer be using Vestiaire.","title":"Do not use Vestiaire - they steal your money","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"Ank Andrei","text":"after they received my item to their hub they didn’t send it and it passed more than 1 month, l began to write them and after 4 chats support(all useless), 6 email they had the same respond”their expert team” is working. l asked for a refund nothing happened.","title":"item lost in their hub and no refund","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"Viv","text":"TOTALLY HOPELESS\n\nnot capable of figuring out basic errors \n\nI’ve seen chip shops run more smoothly the Vc\n\nIncapable & Hopeless \n\nDon’t believe the FAKE reviews who in there right mind enjoys talking to bots","title":"TOTALLY HOPELESS","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"email addy","text":"Soooooo tired of going around and around in circles \nNow day 7 off asking to reactivate my account as understandable got fed up with all the error abd hassle VC made, so deactivated  then decided since none of which was my fault abd I’ve put Soooo much effort in ( 600 plus item)  I decided I would reactivate again ( give me strength, I shouldn’t lose out when Ive put in so much effort, now, after 7 days of asking,  messaging etc etc NOTHING- still not active!!!!\nEVERY day being told it will be 24 hours now is 7 days , this is not a good way to treat good sellers I’ve lost a lot of sales again \nReactive account and stop messing up","title":"Soooooo tired of going around and…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"Annie Greenberg","text":"Support for DHL paperwork, printing shipping labels,& long unresolved chats, all going nowhere, I had high hopes that this would be professional. I put a lot of work into photos, descriptions,& responses. The things I sold were beautifully packaged and sold at very low prices. The waiting for couriers,& hours of stress not worth it. I cancelled all remaining items,& deleted the app. Apologies to the person who wanted my beautiful silver silk Alannah Hill evening coat, was wrapped & ready to go, but couldn’t get a shipping label. Would have sent if I knew how to find you!","title":"Just not worth it","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"Nancy Sterg","text":"I have used Vestiaire on a couple occasions purchasing items below £500 for which I may have waited a while to receive,but I would say had an overall good experience.\nI purchased a lovely bag from an Italian seller for £1200 over a month ago.Vestiaire provided a tracking number which only worked , up until Italy.I am based in the UK and had absolutely no visibility of where my item was 3 weeks from when seller sent and even though I reached out to Vestiaire to ask for an update they just said it may take another week.\nA week later the Vestiaire app updated to ‘item delivered’ and of course it had not been delivered!I am still trying to get any update from Vestiaire claiming they are investigating the courier they said delivered it,but they can’t provide me with any proof whatsoever.They keep sending me ‘we have not forgotten you’ emails with no update either.\nThank God I paid with PayPal,and I was able to request my money back through them..\nTheir after sales care\/customer service is shocking and non existent sadly.I went to Gucci directly and purchased the bag,Vestiaire never delivered to me..","title":"OK for low value items,but unreliable for higher value ones","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Kate Evans","text":"40 days and counting…. No contact, no resolution, just corporate arrogance from these clowns…..","title":"40 days and counting…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"email addy","text":"THIS IS WHY I DEACTIVATED MY ACCOUNT BECAUSE YOU MAKE UP RUBBISH UP ON THE SPOT AND DO PURE GUESS WORK\n\n****I DEACTIVATED MY ACCOUNT******\nNOW YOU ARE SAYING YOU DEACTIVATED BECAUSE OF COUNTERFIT ITEM I STILL BELIEVE TO BE REAL THAT WAS CANCELLED OVER 1\/2 YEARS AGO???!!!! \nEVEN THOUGH IVE BEEN SELLING FOR OVER 1\/2 years until THE POINT I ask for THE item back, \n \nI got in contact with you to get this item back ,  that you randomly after months of selling deactivate then Icome back because you realise your  mistakes made and after mistakes and mistake and taking months to fix it, I have enough of it SO I  *****I DEACTIVE MY ACCOUNT  AFTER 10 perfect sales (NO BADGES) I deactivated because it’s impossible to get through to you and you continue to make mistakes. I DEACTIVATED £ NOW YOU TRYING SAY YOU DEACTIVED IT FOR SOMETHING Over 2 year ago when  I was selling up to a week ago when I deactivated  ??????? Ludicrous \nYou really need to sort my account. And sort out all the mess you keep causes not all these reviews can be wrong it’s so ridiculous you make things up on the spot and dont have a clue what your talking about m fix my account it’s been over 7 days since I DEACTIVED abd have been asking you to reactive it back","title":"THIS IS WHY I DEACTIVATED MY ACCOUNT…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Fanny Ann","text":"Worse selling experience ever need shutting down \nYou can’t treat customers how you like eventually you will be accountable \nReally the worst app going all these fake great reviews wait until your time comes","title":"Worse selling experience ever need…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Kate Evans","text":"Here we are at 41 days after posting my item. Vestiaire clearly have the buyers money, responsibility for my parcel, and the same rotten attitude. Don’t entrust your precious items to them. They’ll use the cheapest, most incompetent delivery service and as Vestiaire are the Hermes\/Evri  customer, you get nowhere.","title":"41 days. No refund. No contact.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Nathalie Bourgoin","text":"UK Buyers - BEWARE \nI ordered an item in which I have already paid the import charges at check out to VC.\nDPD is asking again for the import charges, I contacted their Customer Service via chat, no number, I could not get anywhere with the Customer assistant.. Basically, she told me to paid again. \nTerrible experience and this is not the first time... \nI am thinking to close my account now!!","title":"UK Buyers","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Mrs","text":"Disorganised chao\nNo thanks I’ll pass","title":"Disorganised chao","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Bob Bond","text":"Total scam. Brought a L Bruno Cucinelli 1\/4 zip. When it arrived it had clearly been incorrectly washed and shrunk so was nowhere near a L and it had holes under the arms (not mentioned in the description).\n\nTheir verification service promptly told me that it was “as described” and have now relisted in my behalf. The original seller has palmed off a sub-standard item and I’m left out of pocket and having to re-sell it to recoup my money.\n\nAppalling. DO NOT use this service.","title":"Total scam & appalling (non existent) customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"email addy","text":"DAY 10 of asking you reactive account after I deactivated because of the lack of basic competence and mistakes\n\nSTILL NOT ACTIVATED!!!!\nWhen the mistake is corrected I will delet this reviews!!!!!!\n\n31 combined chats\/ message \/ review over 9 days no proactive reply of action,\n\nWhere is the basic interest in customer satisfaction and company reputation? \n\nThe fact that no reviews are read and to write a review is often last resort. Shows a lack of care for the very people who make you successful. \n\nDay 9 of asking ( see previous) can. You. Reactive. My. Account! \nI deactivated because of all the hassle & errors and it’s seems it is just as hard to get a simple request done! \n\nRemain humble & great full for the people who have worked hard abd put in years to make Vc a success \n\nPlease reactive my account!!","title":"30 combined chats\/ message \/ review…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=5&stars=1&stars=2&stars=3"}]