[{"date":"2020-12-06","author":"Anonymous","text":"This is a seller appalling experience. This company's standards and customer service support for both sellers and buyers have fallen and are appalling especially considering the high percentage they charge. \nIn brief, I've sold an item, packed it up and arranged a collection with their choice of carrier (and got charged astronomically as obviously they have agreed to have this done only by phone to charge seller premium rate 0844 number) only for the courier not to show up for collection. Then I decide to bring parcel to a drop parcel shop, to be turned away as waybill generated by Vestiaire does not work, is not accepted by carrier's system. After lenghty virtual chat with Vestiaire - as there is no way of contact them otherwise - it looks they have resolved it by sending a new, working aiwaybill. NOT! they just resent the same old one I already had and wasn't working so shipping the goods was not possible all at their own fault and responsability. Sent emails to Vestiaire, which were ignored. Contacted their webchat again where Artie was at hand, ready to NOT help in any way and actually on the ready rude. So no, I am advised there was nothing they could do and as I could not ship because of their inability to make this right and allow me to do so, I would lose the sale as they will cancel it. Lovely. \nThis is what you expect from a concierge service, this is get when paying 40% of your revenues - no help or support, just ready to dismiss a customer and let them incur in a loss and disappoint a buyer waiting for their purchase. Shocking, appalling and pretty disgusting for a company that brags to be the top of the game for service and innovation. Vestiaire, you should look more into your customer service and they way they and you as a company operate as it is clearly a failure. I have sold items on there before, needless to say I have no intention to associate myself with such company anymore and I hope more people research and make better choices when looking at resale companies.","title":"This is a seller appalling experience","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-07","author":"Olena","text":"Where shall I start!!!\nBought Christian louboutin boots ref 32299439 via direct shipping, boots shipped in timely manner by the seller , only to find out boots gone to ups drop off , label provided by vestiaire. So I contacted vestiaire to be told from 1.11. 2020 items purchased via direct shipping go to drop offs , ok, but!!!!!!\nThe drop off point the sent it to is closed due to covid , so took me a week to sort it out with ups! Received item today when I suppose to get item a week ago. \nSold yesterday item ref 10171411\nWent to the office this morning to print the label so buyer could get item in timely manner only to find I can’t print the label, as was saying validate address but after validating nothing has happened. So I contacted vestiaire after twent minutes on the line I could print Dhl label .\nDrove to Dhl only to FIND way bill doesn’t exist!\nSo while in Dhl contacted vestiaire AGAIN! \nThey just typed use different way bill .... \nwhen lady at DHL system checked the were no buyer information only vestiaire. \nAfter forty minutes on the line with Natalie , she told me I have to cancel sale!!!!! Because they can’t provide me with correct shipping label.\nSo in summary I spent over two hours of my time , to find out vestiaire can’t even issue correct way bill.\nAnd telling me to cancel sale , so buyers you probably getting cancel sales because sellers can’t even post it to you as vestiaire not providing shipping labels !!!!!\nI am truly lost for words!","title":"Where shall I start!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-07","author":"ana","text":"Generally, VC is a great platform to sell stuff you own, but not wear anymore. There is a lot of traffic and eventually a buyer is found for most of the pieces. However, more current and brand new pieces are favoured by VC through their \"we love\" system so that there is definitely more preference for professional sellers. But more importantly the customer service is lousy. There is only a chat, which is half AI, half possibly low paid worker who don't care if they solve your issue or not. As a seller you have to be very fast with your shippings. If VC however needs to process something for you, it takes up to a month. And for all of that they take 25-30% and more commission! Not cool","title":"Great platform, but preference for professionals and lousy customer service","stars":3,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-07","author":"Jennifer Shining","text":"I sold a dress. And the authentication team decided that my item is inauthentic!!! Just because an item doesn’t have the invoice anymore, it doesn’t mean that the item is fake! VC should educate their authentication team. This is unacceptable!\nAnd i sold many times on VC before!","title":"Authentication team doesn’t know how to do their job!","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-07","author":"Kerry Lin","text":"Sold a dress recently and the “experts” say they can’t authenticate it because I don’t have an invoice, even though the dress still has its original tag on!\nIn order to get my dress back, I need to pay for their processing fees!\nWhat a waste of time and money!\nVery disappointed with their service and the team is so unprofessional!!\nI have sold a few items on their app before and will never use them again!","title":"Don’t sell with them! Unprofessional Authentication Team!","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-07","author":"VR","text":"I have purchase a bag through direct shipping which was supposed to be delivered in 2 to 5 days . 11 days later the bag isn’t delivered, tracking has not moved and UPS whom I have contacted confirms they cannot trace the parcel. Multiple chats later (Only way you can contact them) with their untrained and unhelpful customer reps and they have rejected responsibility on the seller (who DID ship the item so what do they want from him) and telling me they will open an investigation pending information form vendor who they say they can’t contact ? The refund of an order that is clearly lost or stolen is now subject to an investigation they cannot tell me is open , or when it will be open , and still subject to approval from their ‘team of experts’ ( what team of experts customer service cannot clarify. ) my funds are being held until something hypothetical happens . Or not \nCherry on the arsenic cake , I’m now getting an email from another rep telling me ‘good news my item is in transit ‘ and referring me back to the UPS tracking I’ve been saying for days doesn’t track anything. Clearly standardized answers possibly aimed at wasting my time so it becomes too late to log a claim \nI have been buying and selling with VC for years and their level of service has declined steadily . They now have both dodgy business practices and appalling customer service . I will never buy from them again , have taken down all my items for sale and will be taking legal action . Still hoping not to receive a reply to this review along the lines of ‘ we are so sorry please contact us with your details so we can look into this’. They have my details. Several times over","title":"My order is lost or stolen and VC won’t refund me","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-08","author":"F Abo","text":"The curators have started changing the wording of descriptions for UK sellers items, my item 13206526 that is \"black and beige\" has now been changed in the first sentence to \"black and tan\". In the first sentence \"lightly used\"  has been changed to \"little use\". \n\nThe curators are translating descriptions into French and then making any changes they want. Making a complete mess of descriptions. This is leaving buyers with misleading descriptions and sellers will then be penalised that their item was not as described once it is sold. \n\nI have asked the customer services to change the errors but they cannot seem to do such a simple job, as again they are working in French not in English.\n\nThey are also leaving the descriptions in French on some listings 12368793 and 12265790, which means UK sellers cannot even read their own descriptions on the mobile Ap or have to press translate on their laptops to read and check their own descriptions. This is problematic when you get a question from a buyer, as you cannot even see your own descriptions in English. I have highlighted this problem to customer services but as usual they send out a standard message which does not solve the issue or give you misleading information about changing the overall language of the site, which is not correct.\n\nStop changing the descriptions, UK sellers take time to write their descriptions and do not have time to waste having to write multiple messages to Vestiaire to correct your mistakes in your additions.\n\nBetter still employ people who are multi-lingual and have a good understanding of English so they do not have to translate descriptions into French and start adding their own descriptions.\n\nAnother thing that is becoming very common because of inexperience, the curators they are rejecting perfectly good items so they then have to be listed elsewhere and sold elsewhere.\n\nIf you are a UK seller and have 1 item that the inexperienced curators deem as not conforming, you will loose your conformity rating as they will move it down from 100% to 0%. If you query it they will tell you that it is the algorithm even though algorithms do not work that way, it a change made directly by Vestiaire staff. Algorithms do not discriminate its humans that discriminate. \n\nYou are making Vestiaire a difficult place for UK sellers and they are all having to make sure they are selling in multiple places that give them less stress!","title":"Stop making a mess of item descriptions!!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-08","author":"hee n","text":"Hello Vestiare!\nCons:\n1.i feel the commission is too much so it was hard to sell\n2. I wish I can turn off offers as some offers are really low.\nPros:\n1. So easy to send the items once sold","title":"My comment","stars":3,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-08","author":"Yasmin Jenis","text":"Horrible customer service. I am a seller on this website. I have asked for help three times from the support team when the generated shipping label in the app was invalid so I couldn't ship my item. Everytime I was told there is nothing they can do and I should just cancel the sale. They just don't care. I cancelled the sale and now my item can't be relisted and I have lost my expert seller badge. This is absolutely ridiculous. Customer service were not able to help me in anyway and are absolutely useless. Avoid!","title":"Horrible customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-10","author":"Guy Verduystert","text":"I sold an item on 24 November. They informed me on 27 November that the item was actually sold. No problem. Payment date would have been the next Wednesday plus maximum 5 working days. This brings us to 9 December latest. Checked my accounts. Nada yesterday. Wrote an email. Nada answer. Chatted today (10 December). Was informed that payment will be 16 December. That is over 3 weeks later. All well taking away your money in a flash but when it comes to payment they dragged their feet. Well taught me lesson. No more selling (and buying on) this platform.","title":"not happy","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-11","author":"Theresia Tan","text":"Utterly disappointed with my recent purchase! I bought a bag that was listed as brand new without any defects stated in the description. When the bag arrived i noticed immediately there was a glue stain on the bag. Certainly I reported this as as issue and requested for the item to be returned. However Vestiaire Collective insisted that the request is not possible as it matches the description. I relooked at the original post and zoomed in to the pictures and I found the same glue stain on the bag! Obviously it was not caused by me and the defect was already present. I wonder how it got passed the control checks and I sent multiple emails to their customer service to re-visit this issue but there were no response at all!","title":"Utterly disappointed with my recent…","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-11","author":"Julia","text":"I have received a scarf from Burberry that is not meeting the requirements. Comparing with other scarfs of the brand (and I have just received one) the qaulity is not the standard and the size does not even exist. (it was just washed to hot so the fabric shrinked) But even a second control of the \"expert\" team was not able to detect that. (a blind person would have noticed that) Numerous attempts to receive answer on what exactly has been checked and how it was checked have been answered with \"quality is meeting standard\" This is simply a joke. I have bought lots of things at Verstiare and I am also a seller. But frankly speaking, when I see how the team of \"experts\" is doing the job and how requests are handled by the CS I do not have the feeling that there are people who have a clue. Its only about the commision. \n\nI was told that the scarf will be sent back. Luckily I have a different scarf (also 100% lambwool) so I can have a comparision. I will hand over to cosumer protection as this is clearly fraud. \n\nI have used Verstiaire as I wanted to have a nice christmas present. I have paid for quality control as I wanted to be on the safe side. But if the USP of Verstiare \"expert team and quality control\" is not doing the job what is it with your USP and service? \n\nI am VERY unsatisfied.","title":"Expert team not checking requirements","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-11","author":"Sarah","text":"Received a £500 LV bag with canvas past saving and tears to the leather! Send back and still they say it’s acceptable. Authenticator must be blind! Now I can’t send emails back as mailbox full! Unbelievably bad service! AVOID!","title":"Avoid","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-11","author":"Miss lisa stenning","text":"I have bought from there before and it was fine, this time I have sold through them and have had the worst experience, \nI have been in contact with them so many times and each time they say they will get back to me they don’t, finally they say my item can not be found, but instead of just refunding my money they just keep saying I have to wait, it’s been weeks now and still they make it out like it was my fault, saying it’s a fault with the shipping label, I used the one they sent me. \nI am so disappointed with them and at how little they care about their customers. I’m down my item and my money.","title":"I have bought from there before and it…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-11","author":"Oneida Volz ","text":"horrible customer service. they make it impossible to return damaged merchandise, given all information was provided numerous times. Incompetent customer representative, wasting their customers time by failing to do or understand their job. After seven e mails back and fourth, customer representative continues to give  wrong info. Even worse she DOES NOT EVEN REPLY!!!!\nIf we are going to pay hefty quality control fees than please do your job!!! way to treat you customers of 10 years!!!","title":"horrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-11","author":"F Abo","text":"I received an email from Vestiaire on 10 December stating that an item I sold 12173497 was not compliant and needs to be returned to me and that I need to send Vestiare €12. \n\nThis is an authentic item with a serial number but due to the inexperience of your authenticators you have not been able to authenticate it. This is a common recurring issue happening to so many other sellers with many complaints about this online.\n\nPlease provide adequate training to your authenticators on how to locate and verify serial numbers as some of your authenticators are still trainees its important that you train them adequately to limit this ongoing issue.\n\nVestiaire is now an unreliable place to sell. Such a shame as more and more sellers are now selling more on other sites commission free.\n\nUPDATE 15 DEC - on 11 Dec I sent Vestiaire €12 by bank transfer with the relevant reference, however I am still awaiting confirmation of when my item will be returned to me and the tracking information. This is a new authentic item it must be returned swiftly, it should not take 15 days to return items to sellers. I have sent many messages via email with no response. The item must be returned.","title":"Inexperienced Authenticators Rejecting Authentic Items","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-11","author":"Bea ","text":"The most disgusting and useless customer service team ever, not helpful at all and don’t understand anything. Have been in touch with them 4 times and they still don’t understand. Very upsetting!!!","title":"The most disgusting and useless…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-11","author":"Eugenia","text":"After several purchase I can certainly state that Vestiaire collective originality\/quality check is awful. Had sent back to their warehouse a Prada bag that was in awful condition and had been described by the seller as pristine. They said everything was fine despite evident signs of an attempted restoration in the handle of the bag. Costumer service, inexistent. Do not spend money for their checking service! It’s awful, done unprofessionally and does not help the customer in any way! It’s just to take more money from you.","title":"Do not pay extra for unprofessional originality check","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-11","author":"Jaklin Hikova","text":"I am e seller on Vesiaire Collective and I have been actively selling on the website for the past 6 months, I have sold more than 35 items that have all matched their descriptions and were shipped on time, so I was given a “Trusted Seller” badge by Vestiaire Collective. Unfortunately, one of the last items I sold was marked as non-compliant according to Vestiaire, even though they did not even provide me with any arguments about this statement, nor any clear explanation, just an email saying they cancelled my sale and claiming I need to pay them a processing fee or the item won’t be returned to me...Not only do I now have to pay the processing fee for an item that is perfectly compliant with the description, but I have also lost my Trusted Seller badge and they have decreased my conformity rating to 0%, which is so unfair given the fact that all my previous sales had descriptions perfectly conforming to the items and my conformity rating should be much more than 0%. \nI am very disappointed with my late experience on the website, especially regarding the unfairly reduced conformity rating to 0%","title":"Very disappointing experience","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"},{"date":"2020-12-13","author":"huyen anh pizzabella","text":"You must be extra carefull when selling via Direct shipping expensive item. Recently i shipped to buyer brand new Canada Goose jacket with all the label attached on , and the buyer either changed his mind or size doesnt fit him claim that it has “odor” and sent some miserable picture photoshoped that its not new. When i got back jacket its nothing like buyer pictured not mention “odor” in brand new jacket with the tag still attached all. When i wrote to buyer by chat what is his problem with jacket he was shame to answer me and Ignore the question, because he didnt really could find any flaw to jacket and he couldnt lie straight to my face so he just ignore my question . They didnt care even that Im expert seller with more than 200+ items sold and just believe buyer by words and refund him. Very dissappointed since I have been working with them from long time. Direct shipping leave too much spare rooms for dishonest buyer to claim whatever they want, unlike before, no return policy or changing mind. Im upset that seller doesnt have option to not participate in direct shipping program, selling is not safe anymore cause they believe buyer without double check it.","title":"You must be extra carefull when selling…","stars":2,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=85&stars=1&stars=2&stars=3"}]