[{"date":"2021-01-29","author":"D Patel","text":"Absolute waste of time, Vestiaire have lost all credibility selling non compliant items, refusing refunds and running a failing business with a bunch of useless staff. Avoid at all costs.","title":"Absolute waste of time","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-01-29","author":"Farhana ","text":"PLEASE DONT USE VESTIAIRE COLLECTIVE \nthey take your money and then don’t send items, I’ve been waiting for 2 items for which shipping information was provided, however no tracking update after 3 days, contacted Vestiaire, different staff tell you different things each time you chat to them , an expert will be in touch etc 15 days and no expert, according to one colleague of theirs my parcel is still in the warehouse and hasn’t left the hub , absolutely awful would not recommend to my worst enemy, the service is absolutely nil, good at passing  the book on , I am still no where closer than I was 2 weeks ago, chat is awful they end chat when you ask questions they don’t want to answer. If I could I would give them zero feedback","title":"PLEASE DONT USE VESTIAIRE COLLECTIVE","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-01-31","author":"Heather ","text":"From 4 star just a month ago dropping to 3.2 stars?! This is the true story of how a corp  can get so big and forgets who made them. Never, ever, forget your business relies on your customers! Your business does not rely on how big and famous you’ve become!! Your business also does not rely on bullying your customers!!! If you don’t know how to run a business, doesn’t matter how much investment money you got, you’re still bound to fail, and this is exactly where Vestiaire Collective is heading, because this company doesn’t value at all customer’s feedbacks and shows no efforts attempting to improve. Just look at the increasing “1 star” reviews here in the past months, it’s mind blowing! This company is like it’s run by a bunch of spoiled children just received their trust fund money, with that same ungrateful attitude to whom gave you that money. It is absolutely tragic comparing to the start up it used to be, that ethical, open to improvement, customer oriented new company. Please spend your investor money on updating your system, changing your toxic company culture, and getting rid of that rigid and stuck up attitude. You may be a huge company but half the time you’re wrong. \nLet’s see next month how few stars they will have left.","title":"When a company forgets about their customers, they bound to fail.","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-02-01","author":"Jaleh Moyse","text":"Just avoid this platform, it isn’t even worth the stress.","title":"Just avoid this platform","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-02-01","author":"Sela","text":"HORRIBLE COMPANY!\n\nSTAY AWAY FROM THIS COMPANY, THEY ARE A FRAUDULENT COMPANY. THE STAFF ARE INCOMPETENT AND OFFER NO HELP WHATSOEVER. EVERYONE SWITCH TO DEPOP OR VINTED OR EBAY, DO NOT WASTE YOUR TIME ON YOUR APP. AS YOU CAN SEE FROM ALL THE POOR REVIEWS THIS COMPANY IS IN BIG TROUBLE AND WILL GO OUT OF BUSINESS SOON!","title":"HORRIBLE COMPANY!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-02-01","author":"A ","text":"Fortunately i didn't even get to ordering the products!!! I had put together a large order for the start of a small business and the checkout made me suspicious as standard visa debit card is not accepted. I didn't notice this at first but only until after attempting my card. Less than a few hours later I am receiving attempted fraud alerts on my card. Then just to top it off they tried to call me and ask me to send all my money into a \"new account\" so it would be safe. DISGRACEFUL & DISGUSTING behaviour from a business. Your customers run your business so hopefully you'll be out of that soon. I hope someone you scam sues you :)","title":"CARD FRAUD","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-02-02","author":"Kerry","text":"I been a buyer and seller on VC for a number of years. 2 things that have annoyed me...\n\nEvery time I add something for sale they make a silly price suggestion £100’s under the value of your item which is pretty annoying, the people adding the listings don’t always know what something is worth which is bizarre!\n\nI bought a pair of shoes on the 19\/01\/21 to have them shipped to me and the courier wanted to charge import tax which I get since we left the EU but I already paid these at the check out!\nThe parcel is going back to VC. I want it to be resent to me but the terrible customer service that takes an eternity to get an answer from - and poor responses tell you that when the item goes back it goes up for sale on your page!\nHow bizarre... I don’t want to list the shoes for sale! I want them sent to me without being told I need to pay a customs charge and when you ask them to sort it out with the courier you are basically told no do it yourself!\nCome on VC sort it out. If someone pays you customs they don’t pay them twice and you need to have orders sent correctly 🤷🏻‍♀️\nSo for me to get my shoes I have to buy them from myself so that they get resent... that doesn’t even make any sense!! 🤦🏻‍♀️","title":"I been a buyer and seller on VC for a…","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-02-02","author":"Rita Zlatova","text":"Horrid company \nStay away \nOther apps are better for selling","title":"Horrid company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-02-02","author":"Niki Laesse","text":"Tried to buy a pair of Chanel sandals listed as new but these came not only damaged but FAKE.","title":"Tried to buy a pair of Chanel sandals…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-02-02","author":"Megs ","text":"I was not paid for my item on time, and am trying to contact VC to resolve the issue. The status of the item says that the buyer has 72 hours to raise an issue on an item that was directly shipped, but its been week's and there was no issue and neither have I been paid. \n\nAs a buyer, unless there is a serious issue there seems to be no option to return an item, which is ludicrous when it comes to online shopping.","title":"I was not paid for my item on time","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-02-02","author":"Sylvia Hoffmann","text":"They do agree to sell fake items! I made notice about fake item on the website as I own same item which I bought in Paris butique and they keep deleting my messages under the item when people are aloud to put comments and ask seller questions! Unbelievable! Everything is going through their approval so you have no control over what you actually buying! Save your money and DON’T TRUST THEM!!!","title":"They do agree to sell fake items","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-02-03","author":"Anna","text":"I bought a Chanel suede coat from VC 20\/10\/2020 in \"very good condition\". It arrives and is damaged with marks to the skin and dirty -clearly it has not passed through their control system. \n\nVC then issued a wrong DHL label, which made DHL loose it in their system for over a month. I had to try to rectify their mistake with countless hours on the phone with DHL. The coat was then wrongly sent to an old address of mine in France (I live in the US). Finally, after 2 months, the coat was with them at VC warehouse in France. They then took over a month to process the return.\n\nI payed the coat in USD, using my a credit card in another currency. Because VC only returned the amount to my account 13\/1\/2021, the dollar had lost its value, and the amount they transferred back to my account was 180 dollars less then what I transferred to them in October 2020. If VC had not 1) lost the coat and then 2) spent months processing their mistake, all this could have been avoided. I've provided them with bank statements and spent literally dozens of hours with customer \"service\" throughout this whole story, and still they will not return the 180 usd. Absolutely horrible experience. \n\nDo not shop here, they do not ensure a quality check, and then steal your money\/do not own up to their mistake. I've been lied to by people at their customer service (saying they'll get back to me on certain dates, and then not doing so, telling me the processing will be done before Christmas), and only when I threatened to report them to Mastercard for fraud did they return my money partially. \n\nSuch a shame, because I've been a faithful enthusiast of VC for many years. But after this experience I'm never endorsing them again. My tip to anyone would be to save yourselves the high blood pressure, and extremely unsecure customer experience, and spend your time and money elsewhere.","title":"How VC stole 180 USD and took 3 months to handle the return of a damaged Chanel coat","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-02-03","author":"Meerkat","text":"Buyers, be aware that this website sells fakes, and thanks to the option of direct shipping, VC will not even try to authenticate fake items. Example is 14184318, visibly fake Van Cleef earrings that VC curation team considered eligible for direct shipping in absence of any certificate or invoice or proof of origin and poor photos. The worst part of it all is that VC has re-listed this item already 4 (!!!) times as previous sales have been cancelled. There are over 20 buyers' comments under the item explaining that this item is fake and why it is fake, but VC does not do anything about it.\nSo be careful with items listed just under below USD\/EUR1000 (this is the threshold for direct shipping), if you take the risk with direct shipping, make sure the seller has some sort of history and did not appear just yesterday, and that if something is too good to be true, it is probably best to give it a second thought.","title":"Increased number of fake items listed and sold","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-02-03","author":"Nicola Marshman","text":"I don’t know where to start other than to say the customer service is absolutely awful. I bought an item which was being shipped from France. I paid the import duty to them but when the item arrived in the U.K. the courier invoiced me for it again as the import duty hadn’t been paid this also included a service fee. Trying to get through to this company is almost impossible they only have  a chat function on their app nothing else. I had to wait more than 1 hour before I got through. They told me I would have to sort it out and pay the courier and they would refund me. I said I can refuse delivery as they have not paid the duties but they said I cannot get a refund only resell the item through them on the site 😳 When asked how I get a refund they said they would send an email of the process as I wasn’t keen to pay again as I wasn’t sure whether it’s a scam. The email never arrived I’ve joined the customer service Q at number 54 so probably 2 hours wait this time. I’ve sued similar companies that a lot more customer friendly. I do feel I’m being scammed and not sure I will ever get my refund. I will never ever use this company again.","title":"Do not use this company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-02-03","author":"Alice Freeman","text":"This is coming from a past \"expert seller\" who keeps losing her selling status because I cannot send the items in time. In some cases the deals have fallen through completely. This is due to the fact that you are sending invalid shipping labels with waybill numbers that are not recognized by DHL. Please, show me you are worth the commission you take and rectify the issue before I start selling my items elsewhere. I've spoken to over twenty agents from DHL and your chat live services. You have had over one month to sort this out since Brexit came into effect.","title":"Start sending valid shipping labels","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-02-03","author":"MV","text":"Order Ref : 13635752 (£212.34)\n\nArrived damaged, faulty and not in the conditions, described. I’m trying to reach out to their customer team for nearly two weeks now but they deliberately ignoring to look into this case (can you, VC team, send me a return label, check the item again and refund me as it is certainly not in ‘never worn\/used’ conditions?).\nWhy I say deliberately ignoring: there is another issue which I brought up at the same time and they are responding to it as it does not involve potential refund, yet it should. This other-issue is next:\n\nOrder Ref : 13409079 (£219.47)\n\nI made this order on 19.12 and received…. On 25.01. I ordered it as a gift for my friend and I thought I bought it ahead of time. I would never think it will take nearly 2 months (!) to get my order. Obviously, I missed the time to give it as a gift, so, I decided to re-list this item in an attempt to get my money back. And guess what? Their ‘curation’ team says it’s not the item ‘they would list on their website’. Yes. I bought it from them and they don’t sell such kind of items (yet I saw the identical item was approved a day before and a few days after. I literally have no words). I tried to get a reasonable explanation, yet no specific answer was given to why you sell, ‘authenticate’ but don’t accept it for sale.\n\nSo, the drama goes on.\nI contacted their team in attempt to re-list the item not as new one but as the one which I purchased on their web’ (e.g. their IT team just relocate the item from a seller name to my name). And, their customer team replied (the proof they are selective to what to reply), saying, yes, we can re-list it this way.\nSo.\nI was in touch with 3 different representatives (the current one is Jack) who cannot resolve the issue (the other two just stopped replying\/updating me on resolving the issue). The item is visible to their IT team and it’s shown in my ‘submitted’ items but it’s neither among my items for sale nor can be found when searching for this type of items. I repeated the issue all three times with details and multiple screenshots, showing that the item is not listed and not actually visible to buyers. I even had to explain them to log off and go to my items for sale and see it from the buyer’s perspective, this item is not there.\n\nSo, all this in my very sad attempt to get my money back and they are not even trying to help anyhow. In both cases.\n\n\nTO VC TEAM: \n1.\tCan you send me a return label for the faulty item (Ref : 13635752), so your team will see it’s certainly not as it was listed\/described and refund?\n2.\tWhy your ‘curation’ team does not accept items for sale which were purchased on your website?\n3.\tCan your ‘curation’ team accept the item to be listed on your website as a new item, not as relisting from a previous seller as it’s obvious that neither your CS team nor IT team know how to do it (which I purchased on your website, Ref : 13409079), so I can try to get my money back?\n\n\nIf this website (trustpilot) allows, I will certainly post an update on those issues.","title":"Very bad","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-02-03","author":"Kamila Harris","text":"I would strongly advise you NOT to buy anything from Vestaire if you live in the UK and the item is coming from another country. They charged me duty fees at the check out (which after Brexit is understandable), when the item arrived in the UK, the customs asked me to pay these same taxes again myself as they havent been paid for Vestaire. Vestaire refused to pay them, cancelled the order and said they would relist the item and give me my money back when someone else buys the item ...Nightmare, bad, dishonest, sloppy customer service and total waste of money","title":"I would strongly advise you NOT to buy…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-02-03","author":"Tsvetana Boyadzhieva","text":"The worst company ever !!!! Never buy from them !\nThey charge you and never deliver so you just waste your money !","title":"The worst company ever !!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"},{"date":"2021-02-03","author":"luna","text":"Absolutely awful support— no bigger picture of the customer problem. Repeating myself 10x receiving emails in German and French, despite being in Spain...","title":"Absolutely awful support— no bigger…","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=76&stars=1&stars=2&stars=3"}]