[{"date":"2020-08-28","author":"Lee Yoder","text":"Potential customers. Follow my thread of comments on this review thread. Do. Not. Shop. With. Them. EVER. I did get a response after now 10 contacts and over four weeks. They are refusing to refund 1000 for a product they did not ship to me. This company is shady as hell. Their current actions are illegal. And in order to get my 1000 back, I will have to dispute it in court. This is a 100% genuine warning by someone who has never reviewed online until now - DO NOT SHOP WITH THIS COMPANY.","title":"Potential customers","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-08-30","author":"Mrs Gabeva","text":"Just when you start thinking that VC has improved their customer service and you get hit by another ridiculousness from their side. On august 25th i sold a chanel item. Shipped in in august 26th and they received it on august 27th. Shortly I received an email saying thay in order to proove the authenticity of the item i have to send them a copy of the invoice. The funny thing is that I actually bought that item on VC so it has already been authenticated once by them ?!?! Now they are questioning their own professionalism... anyway, I immediately sent an email with all the information- order no, date of purchase, date of declaration of conform, etc and said that actually the invoice i have is from them. Received an authomatic answer that my email is being processed and wil get a reply in 48 hours. Guess what? 48 years passed, no reply but instead i am getting a reminder to send the requested information. So i am left with no choice but to contact customer service via the app which is always a bummer. I do so, explain and they say - ignore the reminder if you have sent the information. I am asking whether they received my email - they say yes. Good thing that i have horrible experience and this taught me never to take they answers seriously but to keep asking - so i am asking - what does my email say? Of course i receive the answer - we have not received it .... so ok i have to resend again. Unfortunately i do not even get shocked by their consistent ridiculousness and lack of professionalism. But it is still\nFrustrating because they are wasting my time, they keep the buyer waiting, the do not even check their emails and are actually doing nothing but questioning their own authentication... and it is a dead end because nobody actually cares to do their job. It is a constant rollacoaster with them. Few transaction go fine and then some crazy thing happens when you least expect it and the worst part - for obviously no realistic reason. Just frustrating and unacceptable.","title":"Frustrating and ridiculous","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-08-31","author":"specreiny","text":"I sold a pair of Stella Mccartney Shoes on 30\/07\/2020 Reference:10844053\n\nHowever it has been 30 days past and I still haven't receive this payment which claimed to be transferred on  11\/08\/2020 on the VC APP.\n\nI have reached out to customer service, but they said they are not able to give me a detailed response, so they have transferred this issue to our expert team.\n\nThe customer service also mentioned 'Our policy is to get back to you within 3 working days to update you on this situation'. However since then no Expert Team give me any update on this situation, and it has been past again.\n\nI would request a Proof of Payment for item #10844053\nCan someone from VC please look into this issue for me?????","title":"Sold an item but payment overdue for 4 weeks","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-08-31","author":"Consumer","text":"I really disappointed with vestiaire online chat. Ppl who are working there really need training  from the owner. My order 3x came back to bases because wrong name address. Actually should not happen because I wrote my data at vestiaire clear and right as also I receive many orders before with same address no problem. For whatever reason one order has problem . I chatted with so many ppl saying “ ok we can handle this bla bla bla at the and no good results until I wrote my wrong name extra at my letter box . Then finally I received them . Unfortunately I was not at home when the pos arrived. So I have to pick them up at the pos station. And again problems because my name at my ID card not same as name at the address! So fu*k  up :( I’m so angry with stupid people who just chatting with doing nothing. The chatting system is so not good for the customers. Pls vestiaire!!! Bring back your good service to your costumers !!!","title":"I really disappointed with vestiaire…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-08-31","author":"Jayne Noakes ","text":"No e mail service available- \n\nNo telephone line- number just cuts off when dialled. \n\nLive Chat line manned by poorly trained staff who are unable to deal with problems sympathetically and effectively \n\nThis is deeply concerning","title":"Tread cautiously","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-08-31","author":"Tanya","text":"I don’t think Vestiaire cares about sellers.\n\nI sold a balenciaga bag in perfect condition for a great price. I then got an email stating that although my bag was in perfect condition it was marked non compliant because there was no invoice. However the bag was not advertised with an invoice. So I am shocked that my bag was made non compliant given this is the only reason an otherwise perfect bag has been refused. \n\nFurthermore, Vestiaire could have easily contacted me to verify the invoice issue rather than offer the buyer the chance to cancel the sale. If I had been contacted I could have explained why there was no invoice and perhaps offered to email a copy for the buyer. \n\nThis is a terrible reason for refusing my sale and I am extremely disappointed with the service. Furthermore, no one updated me to tell me that the buyer had refused the item. I had to contact Vestiaire for this update. When I complained they agreed that the bag should not have been refused as it was sold as advertised. I can only assume that Vestiaire did not want to sell my item.\n\nThis is not the first problem I have had selling with Vestiaire. They cancelled another sale because the bag had python leather (without making clear I can’t sell python online) and then returned it to the wrong address! When I finally got it back it was squashed into a small box with poor packaging and the handles were squashed. \n\nCustomer service is slow and  terrible - You have to use their chat function and you cannot have a conversation with a real person. There is no record trail as you can’t email. They do this to protect themselves against their poor service. Make sure you take screen shots of your chats or you will have no evidence of their poor and contradictory service. \n\nPersonally, I have had so many issues selling with Vestiaire I cannot trust them to sell on my behalf anymore. Plus they charge a fortune in commission for a terrible service. I do not recommend at all.","title":"TERRIBLE SERVICE FOR SELLERS","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-08-31","author":"Tanya","text":"I sold a balenciaga bag in perfect condition for a great price. I then got an email stating that although my bag was in perfect condition it was marked non compliant because there was no invoice. However the bag was not advertised with an invoice. So I am shocked that my bag was made non compliant given this is the only reason an otherwise perfect bag has been refused. \n\nFurthermore, Vestiaire could have easily contacted me to verify the invoice issue rather than offer the buyer the chance to cancel the sale. If I had been contacted I could have explained why there was no invoice and perhaps offered to email a copy for the buyer. \n\nThis is a terrible reason for refusing my sale and I am extremely disappointed with the service. Furthermore, no one updated me to tell me that the buyer had refused the item. I had to contact Vestiaire for this update. When I complained they agreed that the bag should not have been refused as it was sold as advertised. I can only assume that Vestiaire did not want to sell my item.\n\nThis is not the first problem I have had selling with Vestiaire. They cancelled another sale because the bag had python leather (without making clear I can’t sell python online) and then returned it to the wrong address! When I finally got it back it was squashed into a small box with poor packaging and the handles were squashed. \n\nCustomer service is slow and terrible - You have to use their chat function and you cannot have a conversation with a real person. There is no record trail as you can’t email. They do this to protect themselves against their poor service. Make sure you take screen shots of your chats or you will have no evidence of their poor and contradictory service. \n\nPersonally, I have had so many issues selling with Vestiaire I cannot trust them to sell on my behalf anymore. Plus they charge a fortune in commission for a terrible service. I do not recommend at all.","title":"TERRIBLE SERVICE FOR SELLERS","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-09-01","author":"Ays","text":"I sold 5 items and they are checked, and payments seem to be done but I didn't get any payments. Usually i get in 4-5 days. Two of my payments seem done two weeks ago and three of them are done one week ago. I have wtitten to VC, it has been more than one week, there is no reply. Please check your payments -there must be a problem - , and do my payments. I am waiting an urgent answer. Please check and solve my problem urgently I need that money for my own payments. Thank you so much.","title":"Waiting payments for two weeks","stars":1,"location":"TR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-09-01","author":"Vik","text":"I placed an order for a Givency bag 3 weeks ago. The bag is a counterfeit. It can be easily appreciated by anyone who knows how Givenchy bags look in the inside. The inside zipper is plastic and the condition of the bag (leather, label etc.) does not satisfy the brand standards. This bag passed the first authentication control and a second authentication control despite being a counterfeit.\nEither their team of experts does not exist or have no knowledge that enables them to distinguish between fake and original items.\nThis is very serious since VC is claiming an item is original when it is not. I cannot resell this item since it would be illegal so there is nothing else I can do as the brand does not provide authentication services.  \nNow, nobody within VC is helping me nor replying to my emails. But because of VC autehtication team's incompetence I have lost 400EUR.\nI STRONGLY DISCOURAGE ANYONE FROM SHOPPING OR SELLING AT VC... the company \"guarantees\" the authenticity of items but this is not true. This only encourages more fake items to be sold on the website. I wonder how many people have bought items thinking they were original when they are not!!!","title":"VESTIAIRE CLAIMS FAKE ITEM AS AUTHENTIC","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-09-01","author":"Iris","text":"I was a very loyal customer from VS for years and recently there's two very unpleasant events I really want to share it to other users. \n\nFirst \nI've bought a Hermes belt at July, I paid and I was waiting and waiting for the update. I asked VC few times about the progress as the seller use other delivery than DHL. And after 23 days waiting for it I saw there's a new post selling exactly the same belt. So I msg VS saying that's very strange and I hope the seller is not re posting my belt. They replied me like it won't happen as the belt will arrive their warehouse. \nAfter a day, they told me they've made a mistake and the item was sold to the new buyer. \nI do not understand what is the logic behind this. I paid and I was waiting and asking the situation of my belt. And now they told me it was sold?\nWhy don't them tell the new buyer that they made a mistake and cannot sell to her I stead?\n\nSo I have no choice but got refunded. \nThey didn't even gave me a apology until I send an email to them saying I'm very disappointed. \nThey gave me a EUO15 coupon. Which is not even enough for the shipping as a compensation. \n\n\nSecondly\nTherefore I was waiting and I found another good deal for another hermes belt on their website. \nI bought it immediately. \nPayment was made. I got the SMS and bank notification Immediately. \nHowever I was waited for few hours there was no order number no email saying my order has been made. \nSo I used the live chat to ask VC what was wrong and at the end ofcourse. They refund me. \n\nEven I wrote email told them I bought it immediately when it was out and they didn't even care. It was the technical problem of the app and I lost another good deal. \n\nI checked my bank another day and they refunded me the incorrect amount. \nThey still own me EUO83!\n\nSo I emailed them and online chat with them for many times and I showed the proof of my bank and everything. \nThey kept saying I should contact my bank. \nAlright. I contacted my bank and asked for every transactions between this company. \nThey told me there's no charges or exchange fees. My bank suspect that they were trying to refund my previous order with them (a pair of shoes which has the exact amount of what they refunded me.)\n\nSo I email and told them what happened. And ask them to find out and give me back the differences. \n\nThey kept saying at their system they never receive my money and refunded me back. \n\nOkay I have two questiones: \n\nWhy my bank shows that I only got refunded partly from what I've paid?\n\nAnd why is that the amount you refunded to me is the exact amount of my previous order?\nI'm sure this is their mistake. \n\nI've got refunded from the first hermes belt and everything was okay. The amount was exactly the same with no problem.  \n\n83 EUO is not a lot but it's completely ridiculous for what I never get! \nI never get the belt and I did not deserve to pay for it. \n\n\nThis is ridiculous and unacceptable \nI lost my trust completely to this company","title":"Very bad experience","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-09-01","author":"Amanda","text":"I thought I was on a professional website, for serious sellers and buyers. What a joke\nI have items for sale on VC. \nA buyer made an offer for one of my items- I accepted. No payment was made. I was under the assumption that once an offer is accepted, it is binding. \nOn other sites, such customers are blacklisted; for sellers to be aware. Not on VC. \nThese non serious buyers are allowed to get away with not paying, when an offer is accepted time and time again, \nI have contacted VC’s customer service by email to complain, but no reply.\n VC are very very unprofessional. They are a bunch of scammers and so are their buyers. You need to change your processes, and blacklist non paying buyers, so that sellers are made aware and can reject future bids from these scammers\/time wasters.\nVC are quick to charge huge commission, but offer terrible customer service.","title":"The worst ever!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-09-01","author":"Yasmin Dey","text":"Not been paid for my sales...\n\nAbsolutely appalled that I've not been paid into my bank as promised. I asked staff where my money is and they don't know? That's not a good enough answer and I want my query dealt with not just passed on for another day.\n\nReply: I have already done that multiple times. I was told I would get a reply from your finance team in 24 hours. Its now been 29 hours. Live chat staff won't help in any way. I want my money or else I'm seeking legal advice.","title":"Not been paid for my sales...","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-09-02","author":"Jayne Noakes ","text":"I AM STILL IN LIMBO, having paid hundreds of pounds for a badly damaged necklace. I have received only one e mail since I raised this issue, which bore no relation to the complaint raised. Instead, I was asked which account I had paid the money into when I purchased the necklace. 😩🤭😩","title":"APPALLING SERVICE","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-09-02","author":"Peggy Li","text":"VC has extremely poorly-designed IT system and their customer service is also a joke. So please AVIOD AT ALL COST, because if anything goes wrong, it will become a NIGHTMARE dealing with VC.\n\nI recently purchased a pair of shoes via VC. When the item arrived at VC for quality control, there were defects which were not mentioned in the original listing. \n\nVC tried to contact me but their system had a bug. So without my consent, they were ready to ship the item.\n\nThen I had to contact Customer Service via the Chat function on their app (I guess they've probably decided to close call centres to avoid cost - but what kind of company does that??)\n\nFinally, the Customer Service team got in touch via email. However, when I tried to respond to them, their email address doesn't work! I keep receiving mail delivery failure notifications!\n\nThis is ridiculous - they are making it impossible to be contacted! I have no idea what is the status of my item - all I want is to cancel the order given the defect but they are making it impossible!","title":"Impossible to be contacted! Worst customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-09-03","author":"Regina Cheung","text":"I’ve paid with PayPal twice and I got a notice from Vestiare that it didn’t go through. But at this time the money was written off by PayPal? I tried to find a solution with Vestiare and they just couldn’t help me. Then I tried to file a claim to get my money back and Vestiare just gave PayPal the tracking information from the purchases (I have received) that I have done with my Creditcard, so PayPal couldn’t check that. So my claim was denied, it’s a shame. So now I know never to use PayPal for these transactions anymore. Lesson learned.","title":"I’ve paid with PayPal twice and I got a…","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-09-03","author":"Katerina NZ","text":"Their customer service is quite honestly the worst I have ever dealt with. They seem very kind and helpfull at the time, but they do not act on ANYTHING they say. I have spoken to half a dozen agents the past week, all say they will resolve my issue, but nothing is being done. I sold a backpack, and instead of paying me the correct amount, which was 130 euro, I have been payed 75. They keep reassuring me that they will fix it, but they don't. This is plain steeling. Their app has many issues, and instead of owning up to it, they put the blame on users... I sold a relisted item, and the printable shipping label was of the old item. They tried to blame me for printing the wrong label. Then the money issue. Plus if you don't screenshot the chat, you have no proof of your discussion. I asked to be sent a copy to my email, they only did it once, all the other times, I never got the mail. Even with the copy though, there is nothing I can really do, to get my money, is there? There isn't even a phone number to contact them. I am deeply disappointed, I desperately needed that money, and I have lost all trust in them.","title":"I got payed less for a sale, and despite being reassured this would be fixed, nothing has been done. Their customer service is a joke!","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-09-03","author":"Anne-Claire LACROIX","text":"Vestiaire collective is a company which isn’t transparent on the payment modes : they charge you additional fees without you knowing it : for an order which was not available I was debited and refunded each time with an additional fee of 2.8%. I lost about 100 euros for a good I didn’t even get . Their customer service suggested a 30 euros voucher as a compensation... to my point of view it is not a merchant you can trust...","title":"Vestiaire collective is a company which…","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-09-03","author":"Jade Ireland","text":"If I could give less than one star I would. By far the worst company I have ever dealt with: You can't edit your own listing...so when they added the wrong description & measurements which they do a LOT. You still can't get it amended despite 12 attempts of 'chatting' to a  robot. You see you can never speak to a person. You can't even email a person. It's an absolute farce & nothing is explained to you. I searched for hours!\nThey then take over 35% commission. \nOnce you get over all that you have to send your item off to France just to be told it has a scratch (it doesn't) and you should list your item for 50% off.  Waiting for it to be returned so I can sell it for double the price on EBay. Hideous experience from start to finish.","title":"If I could give less than one star I…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-09-04","author":"Yulia","text":"The only reason I am writing here (although I have a lot of interesting stories about my sales on VC) is because I made a big sale on VC and now I am stuck with my item because DHL refuses to take it from me due to its high value.\nI have contacted both DHL and VC obviously and apparently it can be shipped (after all my conversations with DHL) but if VC provides proper documentation on their end and contacts their account manager which is not my responsibility. Obviously, I can't call anyone in VC and so called \"chat support\" is completely useless, feedback form takes 3 days to get back to you with useless answer. The only update I've got is that logistics department is looking for alternative arrangements. Hello? Have you tried to liaise with DHL first???\nHowever, they do not forget to send me reminders \"you have only 5 days to ship your item\". How great. Absolutely no way to get in touch with anyone who can at least do something reasonable. \nSo, if there is anyone reasonable from VC who is reading it and can assist with the matter, please do it ASAP.\nUpdate: my item is being shipped now to the customer but response to this review was made only after I already went through enormous hassle and got all the updates.\nI would not change the rating though, firstly, because you really never ever ever can get in touch with anyone senior. The only communication you are dignified with is with very junior people in support, some of them are nice and some of them can be even rude. I am okay with cheaper items but for really valuable items (mine was about 20,000 dollars - for the record) and premium commission I am expecting smoothest possible communication which is not there.\nSecondly, communication again. Expected authentication time is within 6 days which did not happen. Why not dignify your clients with an update that it will take longer time? Instead, I am having stupid responses like \"oh we are swamped blah blah blah\". Really? I sold another item after my super valuable one (also jewellery but cheaper), passed authentication same day it was received.\nI will write special separate review about overall experience on VC as a seller and honestly people - you have to do something to treat your clients with more respect. Now as sellers we are again being stripped off completely with being punished for cancelling sales - while buyers can make offers and not pay while others can't buy the item. Enough said - will go to another review.","title":"Never can get proper customer support","stars":2,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"},{"date":"2020-09-05","author":"Elizabeth Sneeringer","text":"I sold an item on August 3rd and I've never received payment! I first messaged the company over a week ago and never heard back. I reached out again 3 days ago and I still have had no response. So much for receiving a reply within 24hrs. It shouldn't take a negative review for Vestiaire to engage with the most basic customer service. Please just pay me!","title":"Sold an Item and Never Got Paid!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/vestiairecollective.com?page=99&stars=1&stars=2&stars=3"}]