[{"date":"2022-04-25","author":"Junior","text":"Fees where high and slow","title":"Slow expensive","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Colton","text":"I never got the shoes bc they were fake \nSo i camt really gove more than 1 star","title":"I never got the shoes bc they were fake…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Filthy","text":"Horrible experience \nTook forever to get my shoe felt so sketchy they had to find another seller I definitely won’t be purxhasing from you guys again if I could send back the shoes I would !","title":"Horrible experience","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Evan","text":"Has not been shipped for 1 month","title":"Has not been shipped for 1 month","stars":1,"location":"TW","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Kawanna","text":"Because don’t not accept returns and I’m left with a shoe that I can’t wear.","title":"Because don’t not accept returns and…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Andrew","text":"this company sucks; the process sucks; no feed back; no place to call and find out about my order. Will not use this again after I get my package.","title":"this company sucks","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Missy","text":"They did alright I noticed some issues with one of the shoes and it almost looks like some type of glue was applied between the fabric and the sole. So the price to me was way too much for what I got. But overall they’re ok.","title":"They did alright I noticed some issues…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Nate","text":"I purchased a pair of shoes that came with a grey mark. When I contacted StockX they said this was 'normal and passable'. i will not be returning and do not recommend anyone else trust their obviously faulty QA mechanisms.","title":"BAD EXPERIENCE","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Amanda","text":"Took almost 2 weeks for order to be canceled due to an issue with the sneakers that were being sold and I guess they could not determine if they were real. Process should not take this long when buyer is being charged up front.","title":"Took almost 2 weeks for order to be…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Alexis","text":"Bought shoes that are fake.","title":"Bought shoes that are fake.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Lejla","text":"ordered a pair of nike dunks that would be brand new. But when I got them home they had several red dots on them, which looked like blood!","title":"ordered a pair of nike dunks that would…","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Adam","text":"Wish I had read more reviews before starting to use StockX. Ordered Nike Challenger OGs (fortunately just after everyday trainers) but the white tick had a yellow discolouration. No idea how this passed 'quality control' or if just simply shines a light on how bad a check they actually do or they actually have low standards. I wouldn't wear these and if tried to sell on eBay or elsewhere any buyer would no doubt, rightfully, complain. StockX thought free shipping on my next purchase. Firstly this c£15 offer is nowhere near sufficient, and secondly wrongly assumes that I will ever use StockX again. Unfortunately I recently ordered Patent Bred's so again at the mercy of StockX's so-called quality control. Wish I hadn't now. \n\nIf you are buying from StockX to guarantee you receive authentic and 'new' condition trainers then please manage your expectations as whilst I'm sure most are absolutely fine, for me personally I don't intend on taking another risk.\n\nUPDATE FOLLOWING RESPONSE - your own FAQs cite 5 years as when a customer should expect some level of aging, however these were released June 2020 - so not even 2 years old. Surely that should have been indication that they are either not authentic to show aging so soon or that the seller is selling damaged items that cant be classed as like new' as the product description listed on your website used to entice a purchase includes.\n\nStockX is clearly a site for protecting seller's and not purchases as the 'authentication stage' clearly isnt fit for purpose and from my own experience, and evidently based on other reviews, neither is the customer service department.","title":"Bad quality 'quality testing'","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"John","text":"Was $50 more than the price after fees and took over a week longer than expected to deliver.","title":"Was $50 more than the price after fees…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Michelle Evans","text":"Horrible Horrible service. Too many steps. Additional Fees...After waiting the shoe was finally authenticated. I thought the next step would be to ship. Checked on status..Nothing at all. Then received an email msg that order was canceled after waiting over a week. Speechless. Just Horrible service.","title":"Horrible Horrible service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Summer Phillips","text":"If you like customer service and being able to talk to someone if there’s a problem with your order… THIS ISNT FOR YOU! For the price if these shoes I want to be able to speak with a live person. My daughter ordered the wrong size and their response was of course to resell them on their site and take a hit… no thanks!","title":"If you like customer service and being…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Pedro","text":"too long to received the services was slow .","title":"too long to received the services was…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Murkcos","text":"Accidentally purchased a pair of shoes. Customer support was terrible and couldn’t cancel my order. Shoes also arrived damaged but I don’t think that’s stock x fault.","title":"No refunds and bad service","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Nour Zaki","text":"Shipping costed an extra 50 dollars and then i had to pay 400 dollars for ups so overall i payed for something that was around 200 hundred dollars and then had to pay an extra 450 dollars that was a scam.","title":"Shipping","stars":3,"location":"EG","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Araby Bey","text":"I was very disappointed to learn of the no return no exchange no refund policy of StockX.  I dont like the only option of reselling .  I was actually told by a consumer who buys of StockX that i would be able to return if i needed to.  i would of never made a 360 dollar purchse knowing of only 1option but i do understand the reason for it.","title":"I was very disappointed to learn of the…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Liza","text":"the shoelace was not good","title":"the shoelace was not good","stars":3,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=23&stars=1&stars=2&stars=3"}]