[{"date":"2021-12-26","author":"Jason ","text":"what a weird site. people trying to sell trainers for way over value and the site emails you every time somebody reduces their extortionate value by £1 (making the item still way too expensive)\n\nAmericans picking up shoes from outlets cheap then trying to make a killing LMAO","title":"what a weird site","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-27","author":"Arbi S.","text":"I sold an item and shipped it to them. The package was delivered to them. Few days went by with no movement on the authentication process so I contacted them. Turns out somehow my package is missing. They refused to help me because I have no drop off receipt even though there is proof of delivery. Long story short do not throw away your drop off receipt.  There is a reason why stockx is asking for a drop off receipt because it can not be reprinted if the label wasn't printed at the store.","title":"Keep your drop off receipt!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-27","author":"Tash","text":"They shipped me fake jordans.. it said it was verified but the gold in the site didn't mach up for the shoe string.. there is glue all over the shoes... PLEASE don't order from them. THEY DON'T OFFER REFUNDS EITHER.. NOT SO THEY WANT THEY FAKE SHOES BACK EITHER.","title":"They shipped me fake jordans.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-27","author":"Sheree Dancy","text":"I ordered a pair of Jordans for my son for Christmas on 12\/13\/21.  My status had been stuck on \"en route to StockX\" for two weeks.  I reached out to customer service to be told the original seller couldn't fulfill the order so instead of notifying me they took it upon themselves to find another pair.  As of today, I received an email that they shipped to me with tracking.  I tracked them and they are coming from HONG KONG.  By the time that we get them, it will be almost a month after purchasing them.  That is unacceptable & they have lost a customer that purchasing a lot of sneakers.","title":"I ordered a pair of Jordans for my son…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-28","author":"Percy Walker","text":"My Jordan 11 cool greys had many red flags-\nThey was shipped from Hong Kong- I think the selling UA from overseas at that resell price-\nNotified them and they  said there people  checked them and the passed  and I could resell them on stockx but no type of exchange or refund","title":"My Jordan 11 cool greys had many red…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-28","author":"Caleb Whittle","text":"I got some Jordan Hyper Royals for Christmas. As soon as I opened the box they were creased already. First time I’ve gotten anything from stockx and will be the last. That place is a joke. Order from GOAT. I’ve never had a single problem with ordering from there.","title":"I got some Jordan Hyper Royals for…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-28","author":"Ray walk","text":"Bought some cool grey 11’s from stockx that are fake never use this website it’s a complete rip off $400 for some fake shoes now I can’t get in touch with nobody","title":"Bought some cool grey 11’s from stockx…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-28","author":"Donna Marie","text":"I purchased a pair of Jordan from Stock X for my 11 year old son.  They arrived from Hong Kong and were fake.  They looked off so I compared them to my nephews authentic Jordan (same style) and the emblem on the tongue is not the same and the stitching is off\/loose.  Stock X will not give refund, credit or accept a return.  They asked me to resell it on their site.  Please do not buy from Stock X they are a scam and are making money off selling fake sneakers to parents and children.","title":"Purchased fake Jordan’s from Stock X","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-29","author":"David Aveyard","text":"scammers. holding onto ps5s and selling them well over rrp , disgusting.","title":"scammers","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-29","author":"Brandon Turner","text":"This is the most unreliable shoe app I ordered a size 9 Jordan unc SB but it was the wrong size I tried canceling the order but guess what I can’t I had to wait till they arrived and then had to sell them never got my full money back and I pauper way more than what they are worth. NEVER BUYING FROM THEM AGAIN","title":"This is the most unreliable shoe app I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-29","author":"Keriann","text":"StockX stole my UPS insurance claim money and won't pay me out. They are nothing but thieves!","title":"StockX stole my UPS insurance claim…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-29","author":"Sly Sly","text":"STOCKX IS FRAUD AND THEY Sell FAKE .. i bought Jordan 4 retro oreo white from STOCKX and is totally fake..how can I spend 550 euro on a fake sneakers ..stay away from this site","title":"STOCKX IS FRAUD AND THEY Sell FAKE .","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-29","author":"Susan Harris","text":"I am another victim of this company. Granddaughter in MD never received sneakers for Christmas. Received call from FedEx about location, Googled & directed him. They were dropped off at  garage, then when contacted FedEx with tracking #, states they were re addressed & sent. Contacted company told them everything. Sorry u need to write us a letter 3 days after receiving, & too much time has passed. Everyone needs to contact the Better Business. They need to be aware of this business, contact them & fill out the form!","title":"I am another victim of this company","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-30","author":"Celia Roemer","text":"Thank you so much for all of your bad reviews. I decided not to buy anything from XstockX. \nNo, thank you","title":"Thank you so much for all of your bad…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-30","author":"Nelly Arroyo","text":"Don’t ever buy from them they sell fake sneakers","title":"Don’t ever buy from them they sell fake…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-30","author":"Tom Gilmor","text":"Scott Cutler what are you going to do about this? I count a minimum of 15 1star reviews in the past few days.  I know I would have Greg Schwartz and Andy Lisk in my Office ASAP explaining what is going on and why you have so many VERY unsatisfied customers.  You need to start treating your customers with some respect and have some INTEGRITY.  \n\nBought a PS5 for my son for Christmas 12\/12.  It was \"supposed\" to ship on 12\/17 with latest delivery by 12\/29.  It is now 12\/30, no updates since the 17th, and we have no PS5 and am getting NO responses from Customer Service.  The Grinches who stole Christmas.  Of course they charged my credit card.  I'm wondering if it's a scam to artificially boost sales for year end so the Exec's can get their bonuses.\n\nBUYER BEWARE!!!!\n\nGot a no answer response from StockX.  They said the item was \"Authenticated\" and a label was printed for shipping on 12\/17.  Here's their explanation:\n\n\" We can see that there was an issue with order #30869159 after verification and we were unable to ship this item out to you for your sons Christmas present.\"\n\nWhat was the issue? One of your employees stole the PS4 before it got shipped? Occam's Razor would dictate that theft is the most likely \"issue.\"\n\nNever order from here again!","title":"PS5 never showed up.  Son's Xmas ruined!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-30","author":"Martha Derosia","text":"Ordered a beanie from StockX.  Never received the product.  Fed Ex states box was empty and stopped delivary.  Now four weeks later can not get a hold of anyone and Fed Ex only deals with the seller.  Out over one hundred bucks.  Stay away from dealing with this company.  No customer service!!","title":"Do not do business with this company","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-31","author":"Pissed customer ","text":"Never received order $300.00 shoes. Order was suppose to arrive December 17th order update has been saying nothing for over a week. Called fed ex they said call stockx tried emailing them 3 times they will not return my email. Do not order from these people I wonder why it’s so many people on here that have lost packages something is not right I’m writing the BBB and pissed that these shoes have no update or never arrived. Fed ex won’t even talk about the package they want you to call stockx but how can you call them with no phone number and they don’t return emails. I don’t understand why fed ex even does business with a company like that. They didn’t even try to investigate just oh well call them. Smh!!","title":"Never received order $300.00 shoes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2021-12-31","author":"Alan","text":"Sold a brand new supreme box logo hoodie on stockx. I then get a notification saying it had hair on it and it failed inspection. They said they would return it immediately. I have been in contact with Fedex and they said that stockx has not sent the hoodie yet even though it is scheduled to be delivered today. Made a case and contacted customer service only for them to respond saying that \"this email address is not associated with a stockx account.\" lol, really? Then how did you receive my request through the system? and how did you know which email to respond to?","title":"Sold a brand new supreme box logo…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"},{"date":"2022-01-01","author":"George Harris","text":"Order created by my 3 year old daughter who grabbed at my phone while I was looking at shoes, tried to cancel order 5 seconds later…. No way to do so, now I’m calling my bank to reverse charges and deleting app asap and recommending ALL my friends do it as well","title":"Order created by my 3 year old daughter…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=85&stars=1&stars=2&stars=3"}]