[{"date":"2022-04-22","author":"Juan","text":"this was the first time i ordered off this site. i dont know if i will do it again. for some reason my order hasnt showed up. on my tracking part it says it has arrived but i have not recieved nothing. i got an email back from andres but nothing has been done yet. i guess if they or andres cant address the problem i will never order off this site again.","title":"unimpressed","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"David","text":"Didn’t realize you can’t return items after purchase. My Yeezys came with a dent indentation on the toes. I always get a half a size up to make sure they fit. And since my big toe doesn’t reach the end of the shoe, the tip sinks in. Very dissatisfied, If I would have seen this same pair at a shoe store, I never would have bought them","title":"Didn’t realize you can’t return items…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"francisco","text":"Box kind of sat for a while considering I paid someone to inspect it.","title":"Box kind of sat for a while considering…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Michelle","text":"My son who is now deceased used to get a lot of his shoes from stocks so I recently purchased a pair or retro 5 raging bulls size 3.5 (GS)2021 for his son(my grandson)\nI got them in a few days BUT\nThe sneakers were different colors and one looked a bit dingy and worn and the suede is rougher on the used looking one.\nI was very unhappy so I did email them and sent all of their required pictures like below and they opened a claim\n\nTheir response was bs IMO\n\n******This was in their response\n\"They have informed me that the issue you are referring to has been a consistent manufacturing variance throughout its production. They took a look at your photos, and see that this item would be acceptable per our deadstock conditions and from the retail shop or manufacturer. \"******\n\nIm sorry but I'll show you the pics of how I got them\nAnd see what you think.\n\nI do not think this is acceptable as retail or the manufacturer like they said\n\nIf I thought I would be getting mismatched sneakers I would have NEVER ordered them.\n\nTheir trying to make it ok wasThis ….\n\n\"we, unfortunately, do not have control over the manufacturer's production standards and must work with products that they have cleared for release. Because of this, I can provide you with a $30-off discount code for your next purchase with us or a $20 partial refund for this purchase. You may also relist this item for sale on our platform if you would not like to keep the item.\n\nI won't be ordering from them again, and will either buy retail or use goat.\n\nThese cost 134 shipped\nWho would pay that for mismatched shoes.\nI know if it was a retail store they would probably have sent them back to the manufacturer and I don't think the manufacturer would have even shipped this pair out like this\n\nIIs this normal?\nImo NO they the colors should match and the suede shouldnt be rough like that on one and smooth on the other one\nTip for consumers:\nI wouldn’t suggest buying from stockx unless you want to be scammed","title":"Very disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Irie","text":"I ordered my husband Retro 11’s as a birthday gift. I placed my first order and it was supposedly shipped to Stockx but I received an email saying my order was canceled for unknown reasons and the $347 would return to my card within 3-5 business days. I then placed another order, determined to get my husband these shoes! I’m currently waiting for them to be shipped to me. It will not be in on time for my husband’s birthday and I still haven’t received my reimbursement for the first $347. I’ve sent several emails with no response. DO NOT ORDER!","title":"I ordered my husband Retro 11’s as a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Scot","text":"I ordered tennis shoes for a party. The original seller apparently could not fulfill the request so some one else did. I was wearing the shoes on April 23rd and booth on April 9. Unfortunately, the shoes are still not even at stock x. I tried to cancel the order today but it is almost impossible to figure out that process so I gave up. An absolutely disappointing and terrible experience.","title":"I ordered tennis shoes for a party","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Miguel","text":"There were a couple of smudges on the top of the sole after opening the box.","title":"There were a couple of smudges on the…","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Vane","text":"I been trying to contact them becusse I have not received my shoes I know FedEx said that they would deliver on a Tuesday and then all of the sudden they don't have an estimated date I just want to see what is going to happen","title":"I been trying to contact them becusse I… need to see where my package is","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Sam","text":"Shoes have scuffing on Nike tick on side of shoe and around sides of the soles, have pictures, the shoe laces are different lengths, could not get the right side shoe lace to tie up, so took them both off and the shoe laces are different lengths. \nI tried on an ugly yellow and white pair of these shoes in store, but they were so comfortable I thought it was worth ordering the triple blacks online, searched everywhere for them, and stock x was the only place that could source them.\nUnfortunately as soon as I put these shoes on I knew something was “odd” essentially they did not feel “new” as if a very heavy person had already out a lot of wear into the rebound the sole had in it. Took them into a Nike store and compared with a brand new TN in different colour. I was not wrong, and Nike employee agreed. \nSeems someone owned these for a while n just walked around their house in them, as bottom of shoes came covered in carpet and dog hair, dog hair in shoe as well. \nUnfortunately only thing I can prove with photos is the scuffing and different shoe laces, and how is it worth my time sending the shoes back over this, the shoes are still in “new” LOOKING condition, the rebound and cushion of the sole is very worn out, obviously someone’s house shoes for a while before they decided to resell them through stock X, would of been happy to pay for the shoes at a much lower price if they were listed as “used but new condition” \nso what’s the point in me sending them back and being left without shoes? When the only thing I can prove and u will accept is the shoe laces r different and the obvious scuff marks.\nHow these shoes got past a stock X “check” and sold as “brand new” is laughable, you don’t check the cushion quality to check for ware? the dog hair? The scuff marks? one of the shoe laces is not even long enough to tie up! \n\nabsolutely disgusted Stock X took money from me for “brand new” shoes, considering the dog hair and scuff marks and different length shoe laces alone, not to mention the actual worse part, the shoes feel like they have been worn in by someone who weighs 300 pounds.\nshoes should have been listed as “new condition, worn second hand” \nPretty much just feel robbed, will never use Stock X again.\n\nupdate: hilarious that stock x leaves a msg under my review saying \" oh we r so sorry, please just contact our support staff and we will resolve this\" stock x support staff will just completely ignore you because \" 3 days has elapsed\" ggggg sorry that i have a job n stuff guys n i had better things to do then worry about meeting a deadline to make a complaint about the second-hand shoes u sold me that was supposed to be brand new.\nalso, my roommate bought a pair of the \"white\" TN's n they are nearly yellow because of whatever conditions they were stored in. you would have to be mad to believe stock x is trustworthy and can source you \" brand new shoes\" they say they have \" and industry expert look at them\" well the guy who looked at my shoes could even be bothered to clean off all the dog hair and carpet that came on my shoes.","title":"SHOES WERE NOT BRAND NEW!!","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"James","text":"Still don’t have the item I bought","title":"Still don’t have the item I bought","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Andres Kievsky","text":"Their Australian pricing is buggy and will not correctly update, often showing the same amount in USD than in AUD and therefore misleading me into potentially buying an item cheaper than it is. Be sure to check their prices twice as they do not recognise this bug and will not return your money.","title":"Bugs in pricing","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"chris","text":"I question the authenticity of the sneakers I bought.","title":"I question the authenticity of the…","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Timyka","text":"I ordered a pair of Yeezys and the order got canceled because it couldn’t be verified. They sent an email saying that they found another  pair. Then that pair got canceled too","title":"Canceled","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Ke","text":"I been waiting  two weeks  to know what's going on with my shoes and still nothing","title":"I been waiting  two weeks  to know…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Ben","text":"My shoes should oh been at my house a week ago. The seller was so bad and the shipping hasn’t even started yet!","title":"Bad seller","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Dee","text":"The ordering process was really easy, my issue is with the cost of shipping and the long time it takes to receive the product. Shipping is way too long for the cost of the shipping.","title":"The ordering process was really easy","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Erica","text":"Ordered shoes 3 weeks ago and still haven't received them. I'm never ordering from this app again","title":"Ordered shoes 3 weeks ago and still…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Queena","text":"Its been 3 weeks and shoes haven’t even arrived at stockx","title":"Its been 3 weeks and shoes haven’t even…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Luke","text":"My parcel said it was delivered but never arrived","title":"My parcel said it was delivered but…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"},{"date":"2022-04-23","author":"Shahram","text":"Without permit of me , you have saved my payment information and your contact ways are very difficult. Normally you have to have a email address.","title":"Without permit of me","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=26&stars=1&stars=2&stars=3"}]