[{"date":"2022-04-25","author":"MR","text":"Takes a while","title":"Takes a while","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Maria","text":"I’am not satisfied with the purchase made at stockX. My shoes came with visible defects. I wrote to the company and did not do anything. Now I have to keep a pair of shoes that each look different","title":"Poor quality","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Leah","text":"I ordered this shoes because I have one that I really loved. But when the new one’s came, the craftmanship and materials does not look and feel the same. I really feel like this shoes is not authentic at all upon comparing them side by side. Too bad there’s no option to return it. I wasted $150 hard earney money.","title":"I ordered this shoes because I have one…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Larena","text":"I need to speak to someone I'm customer service I never received my order. UPDATE I RECEIVED A EMAIL AFTER I MADE THIS POST TO BE TOLD TO EMAIL A EMAIL ADDRESS THAT INVALID AND THE NUMBER ON THE INTERNET IS DICCONNECTED RUN ME MY $303.30 THAT YALL ROB ME FOR A 7C THAT WAS SUPPOSED TO BE A 7 IN BIG KIDS","title":"I need to speak to someone I'm customer…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Dylan","text":"I ordered a pair of shoes about two weeks ago and went to go check the status on them and there was no information as to where my shoes were. It looks like I have ordered nothing. Like I had made no purchase at all.","title":"I ordered a pair of shoes about two…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Shaun","text":"You guys are descent, it’s just this is the second time it took forever to get my shoes. I would have cancel my order but that process i can’t even imagine going through. Hopefully I will receive my order soon instead of lame ass excuses.","title":"You guys are descent","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Esteban","text":"My box was horrible and supposed that the box is to keep the shoes safe at the daily basis. My box looks like trash","title":"My box was horrible and supposed that…","stars":2,"location":"CR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Jim D","text":"Need I say more? I mistakenly ordered the wrong size. Yes my fault. BUT MISTAKES HAPPEN! There is NO RETURN policy with stockX. stockX's solution is to just relist the unwanted pair back on their platform. Problem solved right? Relist it on stockX. More money for stockX, more hassles for the consumer. Lesson learned. eBay is cheaper and easier than stockX... Ohh and they have a return policy too, wild concept. \n\nFollow up: I find it funny that they replied to the above message telling me to just relist it on stockX. Get bent.","title":"NO RETURN POLICY","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Miranda","text":"I was told my retro 3s we’re gonna be a brand new and verified I get them and they’re painted and all f*cked up they don’t even have fresh laces in them I guess I learned my lesson definitely not worth $300","title":"I was told my retro 3s we’re gonna be a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Oscar","text":"This is a game just like ebay stay away from it.","title":"This is a game just like ebay stay away…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Alex","text":"I ordered a pair of shoes and they are delayed and I haven't got any good explanation about why.","title":"I ordered a pair of shoes and they are…","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Seh","text":"I order shoe size 8.5 and I got 10.5 instead","title":"I order shoe size 8.5 and I got 10.5…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Danielle","text":"packing was horrible, put a crease in my air Jordan 1s.","title":"packing was horrible","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Jay","text":"It took a very long time to get to my house and there are a few scuffs on my shoes but I love them and am very happy with them.","title":"It took a very long time to get to my…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Victoria","text":"It took a month to even get a tracking number for my shoes. I still havent received my shoes its now April 25th and I ordered them March 30th","title":"It took a month to even get a tracking…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Sherry Helton","text":"If I could give no stars, I would.  I purchased a pair of the Yeezy cleats in April 2022. My grandson tried them on and put them up for his first game on April 23, he took all the tags off and wore them for the first time on that day.  He played his SECOND game on April 24, (the next day) and in the 4th inning the sole came off the shoe.  \nI contacted Stock X and was told due to me not reporting the issue WITHIN 3 DAYS OF RECIEVING the product, I will not get a refund.  \nHow do you report an issue 3 days after your receive a product when you haven't worn them on the ballfield yet?????  They tore up the 2nd time they were worn at a cost of $239!!!!!\nI sent them pictures of the shoe and they said due to the shoes being HEAVILY ( 1 1\/2 games) worn..... they would not refund but they were giving me $30 towards another purchase.....UMMMMM no thanks, 1st and last time I will deal with them!!!\nThey also wanted pictures of the shoe with the VERIFIED medallion attached to the shoe.... Now I don't know about you all but, I tend to take off stuff like that when I wear it especially running on a ball diamond.....QUESTION???? Did they actually VERIFY them, themselves before they shipped them to me and stole my $239????\n\nBuyers beware... I will only use GOAT for my purchases from now on and I will take every opportunity I can to tell about my experience with STOCK X.\n\n\nUPDATED:  After reading their response, I hope anyone else that is considering a purchase from Stock X will take note that they didn't even address that the product failed after 2 times of being worn.  I also have filed a claim with the BBB in Michigan. \n\nIf the shoes would have simply made it through one season I would not be upset but, 1 full game and 4 innings of another is not what I consider a good product - Right now I consider Stock X thieves of the $239 that I worked hard for.","title":"If I could give no stars","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Amy","text":"The shoes I received are fake. 100% certain. I bought the exact same pair of shoes from Nike originally and loved them so much I was willing to trust these charlatans, so I have perspective to know. Y’all. Put a little tassel on it and call it verified authenticity LOL the sole inserts have different numbers, they’re a FULL size smaller in fit and the material is clearly not the same- like putting on two burlaps sacks, they were so rough. STOCKX is either straight up thieving liars or they need to clean house in their authentication department, and since I can’t even get a straight answer to “can I make a return” without being redirected to their legal disclosure\/ terms and services page, I’m going with thieving liars. Never again will I ever give you a dime, and I’ll tell EVERYONE I meet the about my experience.","title":"The shoes I received are fake","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Chris","text":"package hasn’t come in and it’s set for the 19th through 26th and it’s the 25th still not here","title":"package hasn’t come in and it’s set for…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Molly Ann","text":"I ordered a pair of sneakers 👟 and when it came time to mail to me, you said they did not pass inspection, which was fine. \nThe confusing thing was then it said bid on another pair like these for double the price. So, confusing and seemed appeared less than honest.","title":"Confusing and sketchy","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Spunky","text":"I did not receive my shoes amd was not compensated.... will never use them again ... bad experience plus rep was very rude ....","title":"Never got shoes","stars":1,"location":"GD","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=22&stars=1&stars=2&stars=3"}]