[{"date":"2022-04-03","author":"Aliyah","text":"I have the wrong size","title":"I have the wrong size","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"TW","text":"The shoes I received are fake.  Since I can't return them, I'm keeping the shoes, but will not shop with StockX again.","title":"The shoes I received are fake","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Julien","text":"I returned a pair of shoes bought on this Stock X site (not the right size so not used). They refused to take them back on the pretext that they were not compliant. Yet they had validated them well before sending them to me! In addition they charged me 15€ for treatment. I advise you to avoid this site.","title":"I returned a pair of shoes bought on…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Customer","text":"Waiting for my order for about 2 weeks. Then StockX cancel it. Not received my order at all. In 2 words - F...uck you!","title":"Waiting for my order for about 2 weeks","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"GEORGE M LENOTTE","text":"I ordered a PS5 on 3\/17 and still have NOT received the product. The product has not even been shipped out to StockX to be verified. Complete BS!!","title":"PS5 ordered on 3\/17 and still have not received","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"jorge","text":"Fake sandals and very expensive to be fake never buy again","title":"Fake sandals and very expensive to be…","stars":1,"location":"MX","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Kier","text":"You Cancelled my order","title":"You Cancelled my order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Cody","text":"The biggest complaint I have is the lack of customer support. There are some avenues but it’s much worse than that of other places, like ebay.\n\nWhen I opened my xbox elite controller I was overwhelmed with the smell of cigarettes. It wasn’t just the packaging. The device itself was so saturated in cigarette smoke I feel disgusted touching it. There was no quality assurance at all when stockx received the package.\n4 days later and a half a bottle of rubbing alcohol I still can’t use it because it makes my hands smell like cigarettes. It should have never been accepted by Stockx and I have no avenues of rectifying this terrible  experience. The only recourse I have is sharing my experience and warning others","title":"The biggest complaint I have is the…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Joe","text":"Shipping takes absolutely forever!!!!!!!!!!","title":"Shipping takes absolutely…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Raul","text":"The service is bad both in the department of costumer service and in the verifing area. I can not believe what this page is, my problem didnt solve and customer service was absolute trash, never going to shop there again.\nI receive a cheaper pair and one fo the solutions was getting a 20 dollar discount on my next purchase??? like if i were ever going to shop there again","title":"The service is bad both in the…","stars":1,"location":"MX","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Alexis","text":"First time shopper on Stock x and they Sold me fake Jordans. Customer service is non existent and they were slightly damaged. Will never use their service again.","title":"First time shopper on Stock x and they…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Nicholas","text":"Communication with this company is horrible i am going to shop with another company that will prioritize helping me with my orders when there was a mistake out of my control ... my purchase that I received will be my last . I speak for all customer that want things done right , put all customers first not your pockets. Thank you for my purchase.  I am shopping no more with Stock X","title":"Communication with this company is…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Shane","text":"The fees are ridiculously high.","title":"The fees are ridiculously high.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Jane","text":"My box was damaged and I tryed to talk to support and was disconnected","title":"My box was damaged and I tryed to talk…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Gene","text":"The fact that there is no time limit on these items up for bid makes this worthless…. I’ve bid on something and it’s sat there for more than two weeks with my highest bid and no offer for sale.  How the hell long am I expected to wait until my bid is accepted or an offer is posted.  Ridiculous waste of time.  I’ll be pulling my bid and buying elsewhere.","title":"No time limit on Bid acceptance or Offer Shown… Waste of Time!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Kay Ric","text":"One of my shoes were send to me with a red stain that look like blood and it is a cloth white shoe which makes it very noticeable. I still can’t understand how StockX didn’t see that when they reviewed them. I will not order from them again!","title":"Never again!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Mohammed","text":"I received defective equipment. The PS5 console is not working. It’s for my son. And after paying $300 over price I receive a system that doesn’t work","title":"I received defective equipment","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Oscar","text":"I ordered a pair of Nike Dunks and my order was cancelled without a reason","title":"Order cancelled for no reason","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Val","text":"took way too long to ship, I ordered 3 weeks ago and it still hasn’t even left the stocks facility when it was supposed to get here the 31st of march","title":"took way too long to ship","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Lyndsay","text":"First time I purchased shoes, I clicked the “buy now button,” didn’t want to wait for a bid. The money was immediately taken, however, I waited 2 weeks before they cancelled the order and said “it didn’t meet their authenticity standard.” When I emailed to understand what happened, they said we couldn’t find a seller to fulfill the order, sorry if you want to repurchase the same item we can try again but we’ve refunded your money.  Feels like a wait and see game with my money tied up. When I buy now, I want to buy it now. If they didn’t actually tender the card until the purchase was actually verified and the item was in route to me, I would feel better about it. Bad experience.","title":"Not a happy buyer","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=54&stars=1&stars=2&stars=3"}]