[{"date":"2022-03-25","author":"Viraj","text":"You guys sold me a jacket I bought as a gift. It was lost in shipping. Then you offered me a refund. Now the price of the equivalent jacket is 70% higher and I do not want to pay that. This is not good customer service.","title":"You guys sold me a jacket I bought as a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Brittany","text":"I’m still waiting to hear back about missing order.","title":"Missing package","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Frank","text":"you claim to have a live chat system but dont have any. No contact info like a phone number. you ship with fedex when they are known thieves. I spent alot of money to be scammed by you guys","title":"you claim to have a live chat system…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Nelly","text":"I am still waiting on the shoes I ordered. I know it’s FedEx fault. I did my part in making the report to StockX and was informed someone will contact me in 24 hours. I’m still waiting. These were supposed to be a surprise gift for my son 15 birthday. I know you all will make this right. Sorry I have to give you’ll one star for No shoes.","title":"I am still waiting on the shoes I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Keena","text":"Did not receive my purchase… fed ex said they delivered but my camera showed that nobody ever came smh!","title":"Did not receive my purchase…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Heather","text":"Took way longer than expected but the purchase was legit .","title":"Took way longer than expected but the…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Amanda","text":"Stop using FedEx all they do is steal. I never received my package.","title":"Stop using FedEx all they do is steal","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"Ja'Meesa","text":"Horrible return policy.","title":"Horrible return policy.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"Donna","text":"I ordered one men size they send me a kid size and told me was the same size!  And its an unsure situation for me return it \n\nThey are asking me to put on the website and selling it again.   It’s too much waiting time and too much work …","title":"I ordered one men size they send me a…","stars":1,"location":"MX","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"Rocky","text":"I received damaged, worn, scuffed, dirty shoes after buying shoes advertised to be new. I contacted customer service and they offered me $35. I told them that is not sufficient for a purchase of over $300. They falsely advertised and “verified” the sneakers to be new but when I received them it was obvious they were worn, scuffed and visibly dirty. They should’ve sent the shoes back to the seller and\/or sold them as used sneakers. I paid money for new shoes as advertised and got used shoes. StockX is truly disappointing and only interested in their commission. No standards, no customer service. If I had a white name I’m sure they would have continued to speak to me after I requested the case be elevated to a manager. However my education is white and so is my lawyer. I will be pursuing this with all review sites, BBB and civil claims court. I’m the right one.","title":"Damaged\/ dirty\/ worn. Customer service ignores my emails!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"noprofit","text":"they take all my profits","title":"they take all my profits","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"Raymond","text":"The wrong shoes were sent to me and they don’t even know if I will get the shoes I ordered and won’t refund my money","title":"The wrong shoes were sent to me","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"Kayla","text":"While the whole process receiving the shoes was quick the customer service is severely lacking. The shoes I received were in poor quality. They were dirty, scuffed, already had slight creasing before even trying them on and the leather on one side of the shoe was completely wrinkled and warped. I emailed all photos (with all the flaws clearly visible) and received a quick response saying they would only refund $30 and there would be no exchanges.. but I could resell the shoes. I would not feel comfortable reselling the shoes in their current state knowing how unhappy I was receiving them myself. My replies have unfortunately gone unanswered for the last week. I realize StockX does authentication checks but quality checks should be just as important. These shoes should have never been sent out especially for a resell price and with them being labeled as brand new condition.","title":"Scuffed shoes, terrible customer service.","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"OSCAR CASTELLANOS","text":"Horrible service if a package gets lost they can’t help you at all. They won’t return your money or bother to even start a claim with fedEx","title":"Horrible service if a package gets lost…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"Tia","text":"I never received my package even though it says delivered.","title":"I never received my package.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"Ross","text":"Ordered shoes, now two weeks later still nothing. Received email telling me they were backed up but I didn’t need to do anything just wait. Ended up ordering the same shoes from goat a week after my StockX order and received them in four days. This will be my first and last order with StockX","title":"Ordered shoes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"Ricky","text":"StockX is trash. The no return policy is awful. When I try to resell back, there’s fees that come from unopened shoes that don’t get accepted for whatever reason. Stay away from StockX","title":"StockX is trash","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"KHADIJAH","text":"The shoes I ordered were very damaged","title":"The shoes I ordered were very damaged","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"Anthony","text":"Waited 17 days and received no update, just to be given a refund after contacting customer support. Waited that long for nothing. Plus refund takes 5-7 more days to return. So all in all, almost a month of waiting for nothing.","title":"Never received product I bought.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"},{"date":"2022-03-26","author":"Raul","text":"I never recived anything the shipping company stated dilvered but i never recived it i have been. Getting the run around and nothing is getting done what do i do from here","title":"I never recived anything the shipping…","stars":1,"location":"MX","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=67&stars=1&stars=2&stars=3"}]