[{"date":"2022-04-22","author":"Jayden","text":"order got cancelled after 3 weeks without communication. very disappointed as this was my first purchase with stockx","title":"order got cancelled after 3 weeks…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Stephen","text":"They say that they will check and verify the items you bought through their's website but they don't do it. Very dispointing!","title":"Not to be trusted","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Kendra","text":"I think the prices are a bit high and the shipping process takes a while. I understand the process, but it'll take a bit of getting used to. My son loves his shoes though!","title":"A bit high and…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Andrea","text":"I received shoes  that were not knew. I was under the impression that this site sales Only brand new shoe. For the amount I paid, I am very disappointed. We purchasing the show I was not informed that this pair was used.","title":"I received shoes  that were not knew","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Alice Smith","text":"I am very disappointed that I payed a lot of money for an item, not to mention ‘it got lost in the post’ the first time round and then they refused to give me back the money. They sent another one out that didn’t come for weeks. When the the item came and I received it, I realised it was FAKE. Now that is utterly ridiculous that you pay so much money for a ‘designer item’ and then it comes and it’s fake what a joke!!! WILL NEVER BE ORDERING FROM YOUS AGAIN AND WILL MAKE SURE THAT I LET OTHERS KNOW THAT TO! Also was a birthday present for someone and could clearly tell it was fake, so how embarrassing giving someone something they will know is fake.","title":"FAKE!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Lanaki","text":"I ordered from stock x and my order has been delayed twice and the fees are ridiculous. I still haven’t received any confirmation that I will actually receive what I ordered. I’m probably not going to use stock x again.","title":"I ordered from stock x and my order has…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Stephen","text":"Great product,  poor customer service and slow seller.  Took over a week to send to StockX for verification.","title":"Great product","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Jenson","text":"They sent the wrong size and you won’t make them send me the right size and I let you know before it got to stock x for authenticfication","title":"They sent the wrong size and you won’t…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Shavon","text":"I ordered this telfar bag as a gift. It’s delayed, and I have not even received an estimate arrival date! Just awful. I would give 0 stars if I could","title":"Late gift","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Mate Antal","text":"I ordered a pair of Nike Dunk Fossil Rose and it is scratched. What is more, inside the shoe, I suppose because of a production error, there is big bulge what hurts my feet a lot, so unfortunately I can't wear the sneaker. I noticed the problems after removing the StockX tag, so I suppose that there is nothing I could do.","title":"bulge in my shoe","stars":1,"location":"HU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Rachel","text":"Looked forever for this purse, y'all took my money and keep delaying shipments of my merchandise","title":"Looked forever for this purse","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Mandez","text":"Shoes took forever and longer than initially told… poor communication not clear overview","title":"Shoes took forever and longer than…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Ahmed","text":"All are good except one thing, you are i real need to put a restrictions on the buyers in regards of shipping their goods to StockX for authentication process. As it take too long only when it comes to the buyer to ship the item to StockX. Once it is there everything in more than perfect","title":"All are good except one thing","stars":3,"location":"QA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"anna","text":"Ordered weeks ago then notified that the first seller didn’t work. They confirmed I would get set up with another seller - that also failed and then got refunded close to 3 weeks after ordering.","title":"Ordered weeks ago then notified that…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Jordan","text":"Never received my order🙃","title":"Never received my order🙃","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Jacob","text":"Worst customer service. \nFedEx lost my shoes and Stockx give me the runaround to refund my payment. FedEx has case number and investigated that my shoes were lost but Stockx won’t refund me unless I submit a form which I cannot because I have no printer nor can download the form to fill it out. I requested to mail the form to me but you guys won’t.\n\nUpdate:\nI was able to download the PDF form but I have to Snip\/screenshot it to send it back to you guys. So far, haven’t heard from the customer support. \n\nWhy a $250 shoes is shipped without signature?","title":"WHERE IS MY REFUND???","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Sheshe","text":"Wish I was contacted sooner than later that my  order couldn’t be fulfilled and I was being refunded. I had an event to were those shoes to.","title":"Wish I was contacted sooner than later…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Maria","text":"I haven’t received the refound of one pair of sneakers, and I have been waiting one week","title":"I haven’t received the refound of one…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Giusy","text":"the service was perfect but the customs price was too high","title":"the service was perfect but the customs…","stars":3,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Ja'shirie","text":"Shipping is ass Flight Club is way better and faster than y’all","title":"Shipping is ass Flight Club is way…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=27&stars=1&stars=2&stars=3"}]