[{"date":"2021-11-12","author":"Concept Auto Solutions C.A.S.","text":"I trusted StockX, they promised authentic goods and supplied counterfeit! They give the seal of approval and refuse to acknowledge any attempt to rectify issues, no matter the issue.\nIf you try to discuss any problems they bury you with every obstacle that they are able to obtain and hope you will go away.\nI almost did.\nThere are so many other platforms available that will not shaft you, please look into them.\n\n👊🏼","title":"I trusted StockX","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-12","author":"Idk Ok","text":"I ordered the Jordan 1 Retro Seafoam on 06\/09\/2021 and it is now 11\/11\/2021. An issue occurred with the order so they said they’d refund me the money within 24 hours. I had by then paid twice, once via PayPal and once via IDEAL. I got the PayPal refund after I e-mailed them saying I haven’t received the refund within 24 hours but after then I still didn’t receive my IDEAL refund. Since then I’ve constantly contacted stockX demanding a refund and they are literally ignoring me. I also contacted IDEAL which contacted the PPRO company that is also not responding. About almost a week ago I e-mailed stockX again and they replied saying they’ll look into the case, I have e-mailed them twice since then demanding a reply and I still haven’t gotten one. A company that probably gets millions can’t refund €270 euro’s. They have scammed me and are treating me as if I can re-earn the money in a minute. This company is absolutely horrible with treating their costumers and the customer service couldn’t possibly get any worse! I’ve now on 13-11-2021 recontacted them via the app saying that they have to reply but still, no reply! Please be very cautious because this company is a complete scam!","title":"Scammed by stockX and then ignored.","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-12","author":"Marques","text":"No one has contacted me back regarding my case I opened.","title":"No one has contacted me back regarding…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-14","author":"Martin","text":"Good for selling but don't buy anything from StockX. Selling is easy albeit a high cost in seller fees you need to pay, unless you sell a lot.\nI will give them kudos for making a good iPhone app to track items and also make it easy to place a bid or ask on items. It's usually easy to find what you are looking for.\nWhen it comes to buying sneakers from StockX, I have had several issues over the years that were rarely rectified. They simply offer you $20 off your next buy to try rectify the situation. I have received damaged boxes, factory issues on sneakers, and even a fake pair of Yeezy QNTM sneakers with the fake receipt included in the box. People basically use StockX to dump grade B pairs of sneakers and they seem to pass.\nTheir support system is a joke. Each time you try to contact them in the app, it creates a new case. There's no way to track a case with them. I had situation recently where I spoke to someone via the chat in their iPhone app, with all the photos they needed and my information. Only to find out they never opened a case for me. If you have any issues (which you will) send them an email with all the details, if you want to get a response to an issue.","title":"Good for selling but don't buy anything…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-14","author":"Corin Giff","text":"I bought a pair of Travis Scott Fragment Jordan 1s - they not only did not arrive but after trying to get it sorted for a month StockX have told me they're refusing to even investigate\/talk to UPS about it. The tracking shows they're delivered in a separate part of the country to where they're meant to be, i received an email yesterday after having my emails ignored 5+ times informing me:\n\n\"I would love to do everything in my power to assist you. However, after further review, I found that our claims team denied your request for an investigation for this package.\"\n\nNOT that they had concluded it was delivered or anything like that (the tracking on it shows delivered 3 hours away from me to a name nowhere close to on the order), that they wouldn't even investigate it.\n\nThis is actually illegal and i'm in the process of reporting them to Trading Standards in the UK, and i've sent an email which has again been ignored that if it isn't refunded in the next week i'll be charging back via bank.\n\nI am surprised honestly that no one has brought them to court about something like this as not delivering and then refusing to investigate actually breaches the Consumer Rights Act of 2015 in the UK\n\n\"If you bought something from a business to be delivered, it’s the seller’s responsibility to make sure the item is delivered to you.\n\nIf the seller used a courier, they should chase the courier to find out what’s happened to your order - it’s not your responsibility.\" - Direct from Citizens Advice, a government ran legal advice site\n\nI honestly suggest anyone that's looking to buy to look elsewhere - keep in mind StockX will actually break the law if they don't deliver your shoes just to keep your money.\n\n\n\nEDIT: Hi StockX, I reported this the day after it was marked as delivered on UPS - your terrible support then did not respond until a week and a half later when I chatted with them","title":"StockX will not refund you if they don't deliver your items","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-14","author":"Dustin Giberson","text":"Stock x is terrible. they don't have a phone number to contact them. They're email response takes 2 days. The FedEx tracking says awaiting carrier pickup going on 5 days. I call FedEx n they say waiting on the shipper. Jesus i paid all but 1000 dollars for a ps5. Seller got paid, stock x got paid while I'm thumbing my ass. I tried to change address where I can go pick it up at a FedEx location so it's not on my doorstep but noooooo","title":"Stock x is terrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-15","author":"Caitlin","text":"0 STARS DO NOT RECOMMEND! STOCKX WILL ROB YOU OUT YOUR MONEY! MY SHOES WERE STOLEN & MY BOX WAS DELIVERED AS IT LOOK WET & WITH A BUNCH OF PLASTIC IN IT! I ORDERED MY SHOES FROM GOAT & THEY CAME PERFECT, STOCKX “LOST” MY PACKAGE & SAID THEY HAD TO CONTACT DHL TO DO A WAREHOUSE INVESTIGATION THAT TOOK 2 MONTHS TO COMPLETE I DISPUTED MY TRANSACTION THROUGH THE BANK THEY STILL KEEP CHARGING ME FOR SHOES I NEVER EVEN RECEIVED BECAUSE “I MADE THE TRANSACTION” I’LL NEVER PAY WITH APPLE CREDIT CARD PAY AGAIN !!! THEY BOTH ROBBED ME OUT $230 OF MY HARD EARNED MONEY. I’LL BE GETTING A LAWYER FOR SMALL CLAIMS FOR THIS SITUATION CAUSE THIS IS RIDICULOUS! YALL CANT REFUND ME MY MONEY AFTER WHAT I RECEIVED IN THE MAIL ! A DAMAGED WET NIKE BOX WITH PLASTIC IN IT !","title":"0 STARS DO NOT RECOMMEND","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-15","author":"Vince Howard","text":"I've been taken by this place 3 times, they'll send you any shoe that gets sent to them because of all the backend they'll have to do internally. They've sent me noticeably worn shoes 3 times, it's ridiculous because they ask for pics but pics don't see what the eye sees which is why you have inspectors, if they fail, the whole system falls. Why can't I just get \"NEW\" shoes from a place where I pay front and back (buy or sell) on top of my own shipping. I literally pay you to verify my shoes are new, failing model if you can't take responsibility for mistakes on your end","title":"Horrible business, doesn't follow its on practices and greedy","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-16","author":"Disappointed Customer","text":"I purchased a piece of artwork for $2300. They delayed the mailing saying they needed to make sure to authenticate the work. That slowed things down (and one assumes they'd authenticate before selling an item ...). When the box eventually arrived it was beyond damaged, as was the item inside. Oddly, the box had three pieces of tape on the outside and 1\/10th the bubble wrap required to protect the artwork. Of course, it arrived a damaged mess. Their business model seems to revolve largely around making it impossible to reach them by phone, and email requesting passport photo and facial recognition when filing a complaint (for damage they are responsible for since they did such a crappy job in packaging). Total time-consuming mess. Better Business Bureau now needs to get involved. NEVER BUY FROM THESE PIKERS! (Also, this is NOT a carrier issue. It's a packing issue ... looked like a 5 year old packed it ... but that's an insult to a 5 year old...) STAY AWAY FROM THESE THIEVES!!","title":"I purchased a piece of artwork for…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-16","author":"RD","text":"The first purchase failed validation after one week of taking my money. The second purchase came up with an \"error\" on completion so I tried again and once completed the purchase it turned out that my \"error\" order went through and I was charged twice... but trying to cancel the \"error\" order StockX suspended my account and cancelled my other order blaming me for the \"chargeback\" case that I raised for the error order... terrible customer services that only reply to you with a copy-paste template from their handbook and no real help... stop buying from them! this will stop the resellers to pile up and making money on us so we can one day just buy what we want in the shop!\n\nResponse to your reply: As expected you talk hot air but did nothing to help... big on words and not worthy of my time. 1 star is 1 too many for you...","title":"never ever again and that's for sure!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-16","author":"Elizabeth  ","text":"I  have had money taken from my account but told my bid for trainers has been declined. I have sent messages to customer services and left comments of their Facebook page but have heard nothing yet. Really worried as the trainers are for my sons Christmas present and are a lot of money.\n\nEDIT Thank you for the reply below but having sent you more details I have still had no contact. Very disappointed to be honest.","title":"I  have had money taken from my account…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-16","author":"Rachel","text":"Someone hacked into my account, stole all my information, ordered shoes to their house with my credit card by changing the shipping address. Changed my email and password with the account.  Stock X did nothing. They are not even reachable by phone and not trained to handle this via chat. I am having to wait on emails from them to even have assistance. No wonder people hack this account all the time. They don't have any customer service to respond immediately and help their customers.  Will never use them again.","title":"Someone hacked into my account","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-17","author":"Yasmine Arthur","text":"I ordered a Sony Playstation 5 PS5 Digital Console (US Plug) for around $700 which was supposed to be delivered September 2, 2021 and never received the package which FedEx confirmed that they delivered to the wrong address and were unable to retrieve it; I created a claim the same day and filled out the affidavit. The original case # was #09459173 but, after I filled out the affidavit on September 3, 2021, my case # was changed to #09467709. It is now more than 2 months later and I still have not received an update, new Playstation, or a refund and I have been reaching out almost every week in regard to an update since September 2 with no response or help.","title":"I ordered a Playstation 5 Digital…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-17","author":"Bell","text":"Whenever an issue appears it is never resolved. Customer support is non existent. All they are clearly instructed to do is give out random general information and never actually bother to solve the problem, hoping their customer gives up or if they don’t they simply stop replying altogether. This issue has come up again and again. Since august I have been unable to place asks or bids. After contacting them again and again and getting the same irrelevant information, almost 3 weeks ago I tried pushing even harder. They kept saying absolutely nothing useful regarding my issue, were unable to collect any actual data from my account and understand what could be causing it but kept thanking me for bringing up the issue. Mind you, the soonest each heartless pointless reply to my emails was coming 3 days later. Finally, 7 days ago they just stopped replying. Simply stopped. Their last email was, please place another ask or bid (as if I wasn’t already daily) so we can investigate, I instantly replied and haven’t heard from them since. The cases of people having issues with this platform is significantly higher than any other theoretically legitimate business. Find different ways to sell your products. STAY AWAY\n\nUpdate: They we’re pretty quick to reply here. They really wanted the issue resolved. They asked for my info and I gave it to them. 4 more days passed and I finally got a reply. They reply was:\n\nThank you for reaching out about your concern, I am not seeing any restrictions on our end prohibiting you from buying or selling on our platform. Has this been resolved, if not can you please attach a screenshot of the error that you are receiving?\n\nAfter 20 days, this. After tons of screenshots, this. After days of explaining, this. After so much money lost, this.\nA person getting payed to take a 20second look at something and not even bother to look for the template. 2 lines of nothing, thanking me once again for my concern. Who knows maybe in 20 more days someone will ask again if it was solved by itself or maybe, at some point is will get resolved by itself. \n\nSo, their practice is, as far as their customer support is concerned. One week goes by, you get a new agent that doesn’t read the previous communication and you start all over again. Till you give up, cos they won’t lose.","title":"STAY AWAY! NO SAFETY! THEY MESS UP, YOU GET SCAMMED","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-17","author":"Ash","text":"Trainers bought from this website however I got the wrong size . Due to the return\/exchange policy I couldn’t return them so I had to sell them on their website however they didn’t pass the authentication when they were in untouched perfect condition . So do not buy from here","title":"Trainers bought from this website…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-17","author":"Tonash Mahadeo","text":"The worst company ever, I tried to buy a shoe and my card was declined 2 times and it finally worked on the last try. stock x charged me 3 times and sent me two pairs of shoes for no reason when my transaction clearly said declined and then they charged me for a 3rd pair in which the transaction never went through. I tried to dispute the claim with my bank but they reversed, terrible company with no customer support whatsoever. Don’t waste your time w this piece of crap company.","title":"The worst company ever","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-17","author":"Euredice Perseit","text":"My 14 year old son bought shoes and did not get the shoes. The order don't show. Still no money back and no respond from customer. If the money is not back in 7 days. We will go to the police and a lawyer. And if its possible Dutch tv program about company like this one","title":"My 14 year old son bought shoes and did…","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-17","author":"John duff","text":"Better hope your shoes don't go missing as they won't refund or replace anything if you fail to report within 3 days. \n\nAGAINST the consumer rights act.\n\nThey need to be investigated and fined heavily for this conflict against your rights","title":"They breach consumer rights act","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-17","author":"Jo mcilquham","text":"Purchased trainers from them, however ordered wrong size due ineligible sizing chart!! They don’t except returns or exchanges  sold them on their website, trainers failed authentication, even thou they still verification tag on them","title":"Purchased trainers from them","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"},{"date":"2021-11-17","author":"Lynn Walker-Sanchez","text":"I’m revising my review from one star to 3 stars. It took a bad review and a couple of emails to get to a very nice customer service rep named Steven (also via email), but I did eventually get my order. I’m very happy I got the shoes for my grandson, but I never did get to talk to a live person and I’m not sure how I actually got the order bc it happened almost faster than was possible after they understood the problem, almost like they were already on the way, as I’ve read on other posts. Anyway, not sure if I will order from them again, but I did get what I wanted eventually and they were exactly what I ordered!","title":"If there was a minus star","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=95&stars=1&stars=2&stars=3"}]