[{"date":"2021-12-20","author":"William Gallagly","text":"StockX is a very deceiving company, I bought a pair of shoes as a Christmas gift, I was told the seller had two days to ship them, 6 days later I was told the seller had issues so they found a new seller. Now I have to play this waiting game all over again. If your seller can't complete their sale then they should be banned from selling on your website. The buyers money should automatically be returned ASAP, instead of holding onto their money for multiple weeks while we wonder if our item will show up or not.","title":"StockX is a very deceiving company, Stay away","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-21","author":"Pole Position hosted by Kyle B","text":"Still haven’t heard from StockX or FedEx regarding my daughters lost JORDAN Wolf Grey 11s. I filled out an affidavit (requirement of StockX) and tried to work with FedEx to locate my sneakers. I ordered a pair the week before for my son and it was an easy delivery. I live in an apartment building with a dedicated mail room. Most likely another internal theft for FedEx. \n\n However, StockX’s follow up on my case has been poor. I haven’t heard from their “agent” since December 8. I’m disappointed in StockX for the lack of care but the ability to keep my $300.","title":"Still haven’t heard from StockX or…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-21","author":"Daniel Smith","text":"I have used Stock X for a lot of collectibles the smaller stuff arrived unscathed packaging is everything to me but they are useless with bigger stuff. Considering I'm paying over the amount they were asking it's really disappointing the boxes have been knocked about.","title":"Packaging!","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-22","author":"Christina Santos","text":"Hi, \n\nSo my husband bought me a pair of Yeezys 350 from stockx, and they came defective, with like a bubble of glue, I sent photos, package, box, and tags still on sneakers, and all and they saying, I can’t return them this was a birthday gift from my husband I wouldn’t recommend them to my worst enemy!","title":"Yeezys 350 mx oat","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-22","author":"Sciara Donny","text":"Stockx has been my go to shoe reseller.\nI have purchased many shoes with no issues. But I purchased a pair of Jordan 4 Cement from Stockx for my young daughter when I opened the shoebox I found that the shoes were Yellow and Discolored. I asked Stockx and they sent a bylaw that will only be found if by chance you receive Low Quality Products. There is a Authentication process at Stockx to ensure they are authentic and deadstock but they say quality is not part of the Inspection so they will not return and refund.\nI paid almost $500 to get my daughter the shoes she wanted (just a task in itself) They offered me a $40 refund as well as told me I could resell the YELLOW sneakers that are supposed to be white to another unsuspecting person. Because they would pass them through authentication again at Very Low Quality. SERIOUSLY??? I am offered to disappoint another young person who wants new clean sneakers?\nI showed my daughter and she said\n“Are the supposed to be yellow daddy”\nNo baby they are NOT…..\nStockX Replied?? Did you see this??\nThe Shoes are Yellow From Discoloration based on the shoes not being in Sellable condition please look at shoes that come from factory the netting is WHITE\nThe reply says factory condition please know that pretty much every JORDAN 4 with white netting comes from the Factory WHITE.,\nI know this.    You know this\nUrine Yellow Netting IS NOT  a colorway from factory","title":"Flawed and Discolored sneakers","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-22","author":"Carl","text":"After purchasing a pair of Jordan’s for Christmas they was delivered completely to another area from where I live ! After days of chasing they decided to say there not ‘liable’ for these actions ! What a waste of £5400! Stay well away from this site there scammers and only care about there pockets the customers !","title":"After purchasing a pair of Jordan’s for…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-23","author":"Arnie Moore","text":"Terrible service bought some shoes the order got cancelled and its been weeks since i was promised my refund. Ive contacted them and still no refund","title":"Terrible service bought some shoes the…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-23","author":"msd","text":"Today I tried to buy an artistic pancake grill set . StockX gives a price, and when we accept it immediately asks for credit card information with no information as to where the set is coming from (considering import tax), the cost of shipping, who is selling ...\nWith this lack of information, whether they work well or not I'm afraid to put in my credit card information, especially with mixed reviews.","title":"Trying to buy an artistic pancake pan","stars":2,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-23","author":"Tim Prawdzik","text":"Waited a month for my daughter’s shoes. Just received an email, days before Christmas informing me the shoes are not arriving.  Very poor and sloppy way of doing business. No communication or updates, now taking forever to refund my money. This company is half fast at best. Please don’t buy from Stock X","title":"Stock x BAD","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-23","author":"Angela Aikens","text":"Horrible!! Cannot contact customer service and there’s nothing you can do when your purchase gets extremely delayed. Never again.","title":"Horrible!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-23","author":"JW","text":"This place is trash. Ordered a women's size 7 and got sent an 8.5?? Verification team made up of Stevie Wonder and Ray Charles looking at shoes. Even the box says 8.5... lol first and last time buying anything from this fraudulent ass website.","title":"This place is trash","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-23","author":"Dr._Andy","text":"I need an update on my order, delivery date was initially 12\/21\/2021. I still haven’t received my package. This is a Christmas gift and I need before Christmas. I’ve tried reaching out to the shipping company Tforce and they said their system shows they received the package but can’t find it. This is highly unacceptable. The worst part is not being able to contact StockX.","title":"Order #30985940-30885699","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-24","author":"Joseph Fisher","text":"DONT PLEASE DONT DO BUSINESS WITH THIS COMPANY!! Ups screwed up major and lost a $1100 package- ups stepped up and made it right and only gave me the gift and reimbursed me the $1100 they paid stock. Stock c was supposed to give me the $1100\nBack THEY NEVER DID!!’ Tried over 50 times to get my money they made it impossible- thieves are what this company is- please don’t trust you me Xmas gifts with this company or anything at that.","title":"DONT PLEASE DONT DO BUSINESS WITH THIS…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-24","author":"barbara colacurto","text":"Worst place to buy from!!   Ordered a gift on November 25th.  Received email that it was received on December 2nd for authentication.  Haven’t heard anything since.  Sent multiple emails, and no response.  I understand this might be backed up due to a pandemic , but any response would be nice!  Never will buy from this place again!   The absolute worst!","title":"Worst place to buy from!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-24","author":"anthony beck","text":"Just received a pair of reverse duck camo air max 90s from stock x ! Shoes are 100% fakes!!! I’ve spent good money with them over the years. This will be my last purchase.","title":"Just received a pair of reverse duck…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-25","author":"David Jones","text":"First and last purchase. I purchased the Nike golden gal dunk lows from StockX peeked inside the box and wrapped them up for Christmas. Once my daughter opened them she noticed they are black metallic (obviously fake because these don’t exist) instead of silver metallic. Nothing like the pictures of the shoes and of course all of the conditions for them to even review an issue makes it almost impossible to make a claim. Needless to say, won’t be wasting anymore money on fake shoes. Unfortunately, I tend to trust companies so I don’t review all the legal terms before doing business with them, so I guess lessons learned. Being unobservant.. my fault, trusting a company that seems reputable..again my fault, brokering fake merchandise under the assumption that you are qualified to assess authenticity… that’s all on StockX!!!","title":"First and last purchase","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-25","author":"Stefan","text":"The pokemon booster packs in the kangaskhan box have already been opened.","title":"Kangaskhan gx box","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-25","author":"Rebekka O'Melia","text":"Sold us $150 box of pokemon cards that were fake.  Worse yet, it took about a month to arrive!  My son’s heart was broken in xmas.  \n\nAVOID BUYING FROM THIS VENDOR!\nZERO STARS!!!  Total scam!!","title":"Sold us $150 box of pokemon cards that…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-25","author":"Lakhvear Singh","text":"I would give zero stars if I could….My Son purchased what he believed were a genuine pair of Nike shoes from this site. He resold them back on the site and didn’t hear back from them. It’s only when he went to track what had been going on with the item that he saw a message stating that the item could not be validated or something to that effect!! He purchased them from you?! If they can’t be validated why are you selling them to him for?! He paid £240 of his own saved pocket money…and he was in tears on Christmas day because of you!! I am a very concerned father who will be contacting trading standards in the uk…as this is basically day light robbery!!!","title":"I would give zero starts if I could….My…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"},{"date":"2021-12-26","author":"Suzanne","text":"I bought a womens size 7 sneakers for christmas for my daughter. That is her size but these sneakers came and she cant even get her foot into them!!!!! I tried to contact them but they dont do refunds. I wasted $111 I didnt have. They should take them back because they dont fit and it's not my fault!","title":"I bought a womens size 7 sneakers for…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=86&stars=1&stars=2&stars=3"}]