[{"date":"2022-02-14","author":"Daryl  Baker","text":"So this is the first time I have used stock X and will be the last! \n\nI brought a pair of trainers at the lowest ask price which was listed…. \n\nPaid via Apple Pay payment processed then cancelled and they then said I could buy at the new price which was higher!!! £40 more…??? \n\nPayment was taken from my account for shoes I didn’t even buy.. because they cancelled but still decided to take my money… why is this?? \n\nI then received an email to say there was a problem with my payment method which was too slow and that someone else had purchased the trainers? (These shoes are not hyped) \n\nI very much doubt that at that exact time some one else wanted said shoe! I was told that the order is cancelled and I will receive my refund in 7 working days….? Even tho I didn’t even buy them as the payment void??? \n\nFor such a big company this is a joke, Is this how they make their money taking peoples hard earned money for something they didn’t actually purchase because they cancelled on their account!! \n\nI have emailed got one response and haven’t heard anything for 24hrs and still nothing now I have no faith in hearing anything, going by all the reviews I have seen on here!! \n\nI have even contacted Stock X via Instagram and had short not helpful responses, told to contact my bank which I did today and wasted 1hour of my time to get no where… going round in circles is frustrating!!\n\nI think it’s damn right rude and terrible from a company that excels them self as such a big sneaker\/trainer site. \n\nI will never use this site ever again it has been the worst experience I have ever witnessed, I will also recommended to friends, family and social media too not bother to waste their time. \n\nSeems like GOAT or stadium goods will be the next option as I have read better reviews.. \n\nJust give me my money back…. Stop wasting my god dam time!!","title":"So this is the first time I have used…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Blah Blah","text":"Paid $300 for a pair of shoes and they shipped me a crushed order.  While the pair of shoes were not damaged, the box was, making my ability to trade and sell the shoes later, impossible.  They refused to provide me with a credit, or a box replacement.  They told me to send back the entire order, which meant I would have no birthday present for my son.  Their service is terrible.  No number to call.  No person to talk to.  They want you to upload pictures, but give you a terrible app to do so.  If you do not want to get screwed, and do not want to waste days of your life dealing with an issue they caused, do not buy from them.  You WILL regret it.  Guaranteed!","title":"Terrible company to work with","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"Ryan Chris","text":"I bought a Nike space hippie healing jade 03 and one of the shoe came with a missing Nike slogan. I emailed stock x about it last week and even sent the photos as requested last week Tuesday and I’m still waiting for their response.","title":"I bought a Nike space hippie healing…","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-15","author":"Steve Tucker","text":"Be very very careful doing business with this company. Customer service is horrible. Shipped my item 1 day before the deadline. Because the carrier scanned the item twice they cancelled my account and refuse to send my item back.","title":"Be very very careful doing business…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-16","author":"Mark","text":"I paid penalty by their mistake. Probably during opening the box with my shoes they ripped box labe by mistake and due to this fact my shoes didn't pass the verification...\nWhat's more, now i will have problem to return this pair to the shop...\nUnfortunetly I took a photo of box with label at the day of sent","title":"They, probably by mistake, ripped off box label and I paid penalty.","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"Manny Moore","text":"The sneakers arrived and clearly they are NOT authentic. The stitching of off by more than 1\/4 inch in several places …. We have returned the sneakers with pictures of other Nike products … it is comical that StockX would mail these sneakers out as “Authentic”. We plan on filing a law suit and exposing this unreliable business. We brought the sneakers to a Nike store and they laughed at us… I have $10 sneakers purchased at Walmart they have better cuts and stitching. Save your money and buy from the manufacturer or go without.","title":"The Nike sneakers were a “knock off”, according to local Nike store and in no way authentic.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"Devon Phillips","text":"I sold 2 pairs of shoes and a Nintendo switch lite all of which I never used but got denied anyway because apparently they were dirty or for my switch lite I guess it had dirty joysticks but what's funny is that I never even took the plastic wrap off so it's impossible for it to be dirty and then they charged me $15 PER ITEM so instead of me making money I lost $45\n\nTo stock x: this is the 5th time I have messaged you guys about this and all I get is the same exact response which is just that you guys will send it back to me for $15 and that's not what I want, I want to be able to sell my stuff and I can't if you guys aren't verifying stuff correctly","title":"They Want Your Money","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-17","author":"Ryan Bradley","text":"Do not bother wasting your time… \n\nBought 2 hoodies and I have been waiting 2 weeks for… they’re currently being “authenticated by stock x” it’s said this for the last week… \n\nUntil one of my orders disappeared so I connected Customer Support and they can’t fufill my order but I can repurchase the item now for an additional £40 and like magic they will be able to source me one… what an absolute joke of a company take money leave you waiting and then can’t do the one job they have and try to make you pay more money for something you’ve already bought but apparently can’t source… \n\nAVOID","title":"Do not bother wasting your time…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"Kandis Correa","text":"My shoes are color changing and immediately stopped working","title":"My shoes are color changing and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"Issie","text":"I have had so much trouble with this company and no one wants to help. I have spent over £180k with them and sold over 125 shoes on here. I have numerous items that are showing 'being authenticated' from months ago and i have never received them. Passed from team to team no response from emails only have a live chat which the people monitoring it do not have the authority to cancel or refund anything. Sold a £9000 item and have been isolating with COVID. emailed straight away for them to say i still have to send this within 2 business days. So they wanted me to leave the house with Covid to go to the post office for a shoe? After explaining that i cannot do this i was told the order would be cancelled at no fee. 2 days later heard nothing, and see my shipping was extended for 2 days. I message again explaining the situation. In this time i have sold the shoe elsewhere as i am told that its being cancelled as i couldn't ship in time due to my isolation. I then have a message to say my shipping has been extended again to cover my isolation period - when i had been told this whole time that this wasn't possible and my item is being cancelled. Messaged them every day since to have this cancelled as i no longer have the shoe from their misinformation and all i am told is that they have passed this to their team and someone will get back to me. I have also had about 10 shoes from 2019 that i haven't ever received and are showing as pending still on my account which they have just ignored all of my emails about. Having communication skills as a business is so important and this is something Stock X just doesn't have.","title":"I have had so much trouble with this…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"Nicole Leone","text":"Do Not Buy from this company!!!!!\nI bought a pair of shoes for my daughter for Christmas. When I received them they had ink stains all over the laces. I immediately emailed StockX sent them pictures of everything went through the whole process. Bought another pair of shoes the same ones for my daughter so that she had them for Christmas. They had the audacity to say that it was a manufacturers error which obviously I bought another pair and that’s not the case. It is now February and I am still fighting with them I got in contact with the Better Business Bureau and I am still receiving the same answer from StockX that they are sorry that I wasn’t happy and they giving me $20 I spent Over $180. I told them I do not want the damaged items I want to send them back I already bought another pair from your company. They will not take back their damaged shoes.\nDo not buy from this company!!!!!","title":"Do Not Buy from this company!!!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-18","author":"Simon Golightly","text":"Do not use Stockx, my son saved up and purchased an essentials hoodie through them, when the hoodie arrived it was much to big, he returned the hoodie in the exact same condition it arrived only to be told it was not genuine... how is this possible when they authenticate what they send out.... disgraceful shop...","title":"DO NOT USE Stockx","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-19","author":"Nathan Marley","text":"DONT USE STOCK X I HAVE SPENT £10,000+ With them and sold £8\/9000 worth of shoes to them.\n\nI sold a pair of shoes and took them to the ups drop off point, got the receipt to say I dropped them off. 2 days after I contact StockX and say my shoes still haven’t moved what’s going on they ensured me nothing to worry about as there’s a delay and my shoes where on the way. And before they deny this all this I have the email to dates to prove. 2 days later still no update on the ups tracking so I contact StockX again and they ensure me it’s on the way to StockX the day after which was a Friday and had been 5 days since I dropped them off at this point. So after I contacted them on the Friday they replied and told me not worry which at this point I was like no why don’t I have a update I get a response oh you appear to be right but because it’s out of the 72 hour time period there’s nothing stock x can do?\n\nYou having a f**king laugh I contacted you 3 times and first time within the 3 days period and you told me not to worry. \n\nAnyways so I asked them to contact UPS as they organised delivery, and they said that’s not something they do and I’d have to contact ups again. Ups sends me a claim form to fill out. Which after trying to claim was a warning message popped up and said only the organiser of this shipment can arrange this. So I contact stock x again! They ignored me.\nI did some research and I saw a review with somone saying they managed to get there money back by filling in this claim form third party. Is what I did. The claim took 10’days and the next step says we sent the details to StockX. So I have asked stock x to give me them details or help me get my money back and they won’t. \n\nHONEST WORST COMPANY DO NOT USE!","title":"DONT USE STOCK X I HAVE SPENT £10,000+…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-19","author":"Elizabeth","text":"Don’t buy from them, I’m convinced this company is fraudulent. I attempted to purchase a pair of sneakers for my spouse and my account was immediately changed but there system indicates that my payment was processing. I have made several purchases with their competitors and have never experienced any issues. My order status never changed than stockx made an additional attempt to charge my account an additional $300. INSANE ! I contacted support may time but have gotten nowhere. They are unable to identify the transaction because I don’t have an order number but  $ 300 has been withdrawn from my account and no one can tell me where it went. PLEASE SAVE YOURSELF THE HEADACHE.","title":"Don’t buy from them","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"Aram Minasyan","text":"I have been sold a fake product by StockX. To get my money back I have created a case and provided StockX customer service with multiple images justifying the issue and showing existing differences between the fake product that I have been sold and the original one,  had a terrible customer service experience handling the case, finally returned the fake product back to StockX, and have been refused to get reimbursed. I highly encourage everyone to stop buying from StockX since they have no sufficient controls in place to catch nonauthentic\/fake merchandise. The response from CS below has nothing to do with the refund. You got your fake product back so go ahead and issue my refund.","title":"I have been sold a fake product","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-20","author":"Doug","text":"My son learned the hard way to scrutinize a business, especially an Internet based one.  He thought some new Air Jordans ($120) would be bought by StockX for $160.  He didn't make the money and has wasted a lot of time.  Appreciate the valuable lesson he learned.","title":"My son learned the hard way…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"J.P.","text":"I paid $340 for a pair of Jordan 4s and when they arrived, had the StockX verified tag, but the shoes themselves didn’t even have the correct tags on them, no size tag inside or QR code that Jordan puts in their shoes. They do not verify you sneakers","title":"I paid $340 for a pair of Jordan 4s and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-21","author":"Terrance Mebane","text":"StockX claims to verify its shoes, but they do not. As long as the company gets its fee, it does not care whether the shoes are real or fake. I purchased a pair of Dunks that was obviously fake, but even with photo evidence, it does not matter. The company sent me a response about design flaws with Jordans, which isn’t even the shoe I purchased. \n\nHowever, StockX will allow you to resell the fake shoes to some other unsuspecting customer — just so they can receive another fee. This sounds more like a Ponzi scheme. I very much suspect legal action will be taken against the company soon — its fraud. \n\nYou’re better off taking your chances with eBay — at least eBay will give you a refund if there’s an issue. \n\nDO NOT TAKE A CHANCE!!","title":"StockX Sells FAKES - DO NOT TRUST","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"Marc","text":"I’ve been bidding on a pair of shoes for weeks and matched many asks but none got accepted like stockx claims they would when a bid matches an ask. When I submitted 2 different tickets on different days they sent me the exact same e-mail about how they are now matching european buyers with other european buyers, but the site is obviously broken. On the same note, if you are a european buyer stockx takes 5% off of your bid behind the scenes, making a 240 euro bid a 228 one. On the all bids list it shows up as 240 but if you are the highest bid it shows up as 228. They claim that not all things have been updated especially the view all asks and bids tabs, but this as been a common excuse since they introduced this update last year. Why launch an update that is clearly not finished and functional?","title":"I’ve been bidding on a pair of shoes…","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"},{"date":"2022-02-22","author":"Juan Shaakir","text":"I ordered a pair of shoes and waited days for seller to ship them to stockx to be verified. Stockx never received shoes and I am having to wait days for my money to be reimbursed to my account. My bank has the funds listed as pending and waiting on stockx to release the funds and stockx is taking their time and there is no one you can contact, they’re only reachable through a live chat on their site which is useless because its already preprogrammed to give you responses that have nothing to do with your issue.","title":"Reimbursement issue","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=78&stars=1&stars=2&stars=3"}]