[{"date":"2022-04-12","author":"PG","text":"Shoes did not come in correct box, hard to tell if they’re legit or not","title":"Shoes did not come in correct box","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"customer","text":"My grandson loved the shoes I purchased for him. However I made an error and somehow placed the order 3 times at 190.00 plus.  I called I sent messages and it was like big deal you were out another 380.00 plus.  I will urge my grandson NEVER  to use this site again.   It wasn't  like I did not reach out immediately.  So my business or word of mouth.  NO NOT SO MUCH which is a shame","title":"My grandson loved the shoes I purchased…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Emmy","text":"My shoes came a little scratched that’s all everything else was great","title":"My shoes came a little scratched that’s…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Brittany","text":"I was sent some else’s order and never sent the item I purchased!!","title":"I was sent some else’s order and never…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Freddy Kristiansen","text":"I did not get the product I ordered. I got the money back after almost 2 weeks and when I got them it was less than I first paid. Almost $60 less. I live in Europe, don't know if that's why, exchange rate or what ever. But this is BS. Never going to use this service ever again. I mean, AliExpress is even better! I'll give it 2 as I actually got some money back at least. This is a real review and I won't change it.","title":"No product and less money back!","stars":2,"location":"NO","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Jasbir","text":"Wanted to cancel but could not","title":"Wanted to cancel but could not","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Alex","text":"Never got my stuff.","title":"Where’s my shoes?","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"hassani","text":"I never got them","title":"I never got them","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Kyle","text":"I originally had bought a pair of Jordan 3 Tinker Hatfield black edition shoes from Stock X. The product was described as having no damage or defects to either the shoes or the box. A few days after purchasing the shoes I was informed by Stock X that there was an issue with my original seller and that Stock X found me another seller with the exact same item at no cost to me. Little did I know that item they found me was a destroyed box that I was not made aware of. Since Stock X does not offer returns or refunds, you can imagine how upsetting this was to find out after spending over $300 on a pair of shoes. At no point in their authentication process did they think to let the customer know that they were going to receive a lesser item at the same price line. So when I emailed customer service, their first solution was to just offer me a $30 voucher. Why was my account not automatically credited that amount when Stock X switched out my item for one of lesser value? That right there just seems like a slap in the face. After several back and forth emails, I just get the run around that Stock X accepts damaged boxes. I realize this and made it painstakingly so that I understand their policy. What I don’t understand is why I wasn’t notified that my replacement was damaged. I was told it meets their guidelines on not having “too” much damage, whatever the hell that means. The box is completely ripped in the corner which is the most stable part of the box which means it’s just going to fall apart with time. The box is also caved in and Stock X’s solution to this whole ordeal was just to tape the box, not notify the customer of the change in product quality, still charge me the full price, then offer me a $30 voucher for their mistake that they refuse to fix after emailing them of their error. For a company that claims they know shoes and care about their customers, this is almost laughable. Oh, and this was my first and only purchase with Stock X. Word of advice to any future buyer, I highly recommend using G.O.A.T., kickscrew, or Flight Club for any shoe purchases. Not only do you get exactly what is expected and described, but they actually have the ability to correct their mistakes. Too bad I can’t include any pictures so I can verify what I’m talking about but I conveniently am not able to upload any pictures with this review.\n\nPart 2: I am very aware of your verification process as I’ve previously stated. What you guys don’t seem to understand is how it’s ok to replace a non defective item with one that a customer can stick half of their hand through the product. Like I said, of course pictures can’t be uploaded to prove my point.","title":"Buyer Beware!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Jonathan","text":"Ordered some Yeezy Slides about a month ago and still not received them tf takin so long","title":"Ordered some Yeezy Slides about a month…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Liam","text":"Item was not delivered.\nThe item wasn't delivered... This is my first time shopping with Stockx and I will definitely not be doing this again. I went through their help team who rejected my claim without reasoning, despite my ID check being successful. For a first time buyer, this is not how you want to experience the company and then for your claim to be shut down without any reasoning is just beyond outrageous. Won't be using StockX ever again!","title":"Won't be buying from StockX ever again!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Jeff","text":"I purchased a rare, expensive LEGO kit.  You did verify the product correctly.  But the picture showed a perfect box (which is important!) and the reality was a bit different.  The box wasn't a complete disaster, but it was not in mint condition by any stretch.  Little disappointed that the product made it through the warehouse.\nHowever, the worst part is that you put a sticker on the box stating, \"Inspected by STOCKX\"!  How could you put a sticker on a collectible?  I tried to peel it off and it was a complete disaster.  The part of the box that the sticker covered is completely ruined.  Why would you throw one of your stickers on a collectible box like that?  That was extremely disappointing.","title":"I purchased a rare LEGO kit.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"VtwoTheizzO","text":"Product arrived on time and as described.  I  wish I would have ordered a smaller size, as this shirt runs down to the top of my knees.  And being supreme comes pre-washed, I doubt it will shirk as needed when I wash it.","title":"“They are who they thought we were”","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"louis","text":"I’ve tried to unsubscribe from your emails like 5 times. Please stop emailing me!","title":"I’ve tried to unsubscribe from your…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Katy","text":"Beware that you cannot return shoes if they don’t fit and your pretty well assured to loose money trying to resale them","title":"Beware that you cannot return shoes if…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Mike","text":"I accidentally ordered two of the same shoes back to back within seconds because I thought the first purchase didn’t go through. I immediately notified the site and Stockx said there is nothing that can be done. Basically I can’t cancel the order literally within seconds of releasing the error. That’s shady!!!! Last time I ever order shoes from this site.","title":"I accidentally ordered two of the same…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Muath","text":"You are cancel my order after many days without Justify or explain the reasons","title":"You are cancel my order after many days…","stars":1,"location":"SA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Tan","text":"The shoe i got was clearly worn prior to receiving it. Did not match the description","title":"The shoe i got was clearly worn prior…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Candice","text":"Ordered shoes.  4 days later my money was refunded.  The email said they were unable to fulfill my order.  First time using stock x and will be my last.","title":"Ordered shoes","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Rob","text":"Purchased the omega space master x swatch watch. Advertised as new however definite signs it has been worn previously. Have reported the issue through the help function and trust it will be sorted shortly although was disappointed this wasn’t checked before shipping.","title":"Purchased the omega space master x…","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=40&stars=1&stars=2&stars=3"}]