[{"date":"2022-03-31","author":"Brandon","text":"Shoes got delayed and there is no way to cancel my order","title":"No refunds","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Lamont","text":"why is is taking so long to get me my order","title":"why is is taking so long to get me my…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Denis","text":"Item is damaged","title":"Item is damaged","stars":3,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Emma","text":"The shoes are great and the postage was quick however the way they convert the money needs to be checked and clearly stated in the final amount.... my total was $221.42 but they took $314.42 from my account after already showing the total after conversion to australian dollars was $224.42 be careful!!!","title":"The shoes are great and the postage was…","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Francine","text":"Order was placed approx 3 weeks ago, the estimated delivery date has passed and i have not received my order.\nI have not received any updates in the past 7 days and I tried to contact via email to follow up and was told this email address is not monitored. No other contact details are provided.\nVery disappointed, no updates, no parcel delivered on expected delivery date, no contact available.","title":"Order not received","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Veronica","text":"Ordered shoes from Stockx, and took forever. Stockx said they give the seller 2 business days to ship the shoes. Which is untrue. After 4+ business days past of the seller not shipping my shoes to Stockx, they informed me the had to find another seller. Now I had to wait for new seller to ship my shoes to Stockx for verification. Then once shoes were delivered to Stockx it took another 4 business days for shoes to get to Stockx and be verified. I’ve had to wait over two weeks to get my shoes from Stockx, where my bf who ordered shoes on the same day as me received his over a week before mine. I’m more just unhappy with the lack of transparency and communication. Don’t say you’ll give the seller 2 business days to ship, when you don’t. Especially when I’m paying you these expensive verification and shipping fees. I will stick to goat next time.","title":"Ordered shoes from Stockx","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Mara","text":"refunded my order when i needed it soon, now I need to find something else","title":"refunded my order when i needed it…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"David","text":"why cant i send back my air jordan shue???? i need a half number biger","title":"why cant i send back my air jordan…","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Sakeena","text":"item was very scratched up and the box was dented. for a 350 pair of shoes i’d expect better quality","title":"item was very scratched up and the box…","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"dennis","text":"take very long for the item i had purchased to reach me","title":"take very long for the item i had…","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Amanda","text":"My order was cancelled with no email notification.","title":"My order was cancelled with no email…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"시형","text":"I bought a new product, but the sticker and free gift are not included\nI wish there was an explanation in advance","title":"I bought a new product","stars":1,"location":"KR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Jane","text":"I have ordered some trainers that are the wrong size.  It is not clear on the website that you cannot return these.  I am now left with £200 worth of trainers and no way of returning\/exchanging them.  Incredibly poor service.","title":"Terrible return policy","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Shane","text":"While I respect autheticating products to not sell people fakes, it takes entirely way to long to recieve the actual product. Doubt I'll ever order again.\n\nRe: Update\nSo now it's been over a month since I ordered and the money was deducted from my account and StockX customer service still doesn't any answers. I spoke to 2 different reps and neither have a clue and only saying \"we will look into it\". Apparently there is no communication between them and their own warehouse. Very disappointing experience that I would have to be running behind a respectable company like this. Will definitely use Ebay instead in the future.","title":"While I respect autheticating products…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"PST","text":"It took quite long for delivery and with admin. charge.","title":"It took quite long for delivery and…","stars":3,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Jorge","text":"The shoes I got are fakes the bottoms soles don't match the patterns are defective and there is a piece of rubber of another color embedded in the sole . The stitching on the side logo are not clean and the letters are poorly painted over,the suede is poor quality.stockx please give me a refund or an authentic pair of shoes!","title":"The shoes I got are fakes the bottoms…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"lukas","text":"Orders keep being refunded. All I want is the stuff I bought","title":"Orders keep being refunded","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Juelle","text":"Ordered twice and they said package was delivered but never received it for both orders","title":"Ordered twice and they said package was…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Jake","text":"It is poor because shipping is so easy in todays time and I think the company as a whole should make it to where there is a &5-10 shipping fee depending on how far but paying that much for shipping is too much. Other than that it has been great shopping with you and hopefully prices get cheaper and will see you again. Thank you","title":"It is poor because shipping is so easy…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Sneaker Head","text":"I would have loved to give you 4 starts more if you had offered expedited shipping. Charging 14.99 for shipping and offering ground shipping is already expensive on the top of it not allowing people who want a expedited shipping at-least after you validate in Michigan who might be willing to pay extra so that there gift can reach sooner is some thing you can work on.","title":"I would have loved to give you 4 starts…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=58&stars=1&stars=2&stars=3"}]