[{"date":"2022-04-13","author":"GwantsKicks","text":"I ordered shoes a month ago and they are still waiting for it to arrive to stockX before sending it out to me. What’s the number in which I can cancel my order to? I feel scammed. Great concept, but with terrible execution. This is such a shame because I could see the value in this being ran efficiently. Communication is non-existing.","title":"I ordered shoes a month ago and they…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Noury Fatih","text":"It takes too long to ship the orders.\nThis can be done faster.","title":"It takes too long to ship the orders.","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Angele","text":"I received another product ( other nike shoes) than \nWhat I ordered! It is unbelievable that tou don’t have a customer service to adress to for a return since its your fault.","title":"I received another product ( other nike…","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Emily","text":"Shoe size was not true. I now have a useless pair of shoes that I have to worry about selling for how much I got them for.","title":"Shoe size was not true","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Alexis","text":"Never received my order still waiting on a refund almost a month ago since I order the shoes .. this is crazy","title":"Never received my order still waiting…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Shannon","text":"No way to get in touch with customer service.","title":"No way to get in touch with customer…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Sarah Hopkins","text":"I would like to be reimbursed my money, ordered some shoes from stock X and never got my shoes and it’s been almost a month.","title":"I would like to be reimbursed my money","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Stephen Parker","text":"I have had a couple emails telling me what’s going on with my item but I ordered it on the 1st of this month and it still isn’t here it said it will be here by the 16th but then changed to the 19th but other than the waiting time it’s a decent website","title":"I have had a couple emails telling me…","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"TLynn","text":"This is the second time I have ordered from StockX. I only ordered a second time because my son wanted a pair of Nike shoes that are hard to find and begged me to order them. The first time I ordered, your company never received the shoes. This time the shoes were ordered on March 26th and I have yet to receive an email that you have received them from the seller to authenticate them. Extremely disappointed with your company.","title":"This is the second time I have ordered…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"ZB","text":"I mistakenly ordered the wrong size and immediately reached out- I was met with zero help or guidance  for cancelling or just getting the right size.\n\nCould never get a return e-mail or real person, was even willing to pay extra just to get the right size.  Now I'm stuck with an order that wouldn't fit my 7 yo niece. \n\nOne star only because ZERO wasn't an option.","title":"I mistakenly ordered the wrong size and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Tay","text":"I purchased the OG Bred 13’s 1998 and my order was cancelled because it didn’t make it through the authentication. Although they did give a full refund I am irritated I had to wait 5 days for someone to tell me that.","title":"I purchased the OG Bred 13’s 1998 and…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Lewis","text":"The product took very long to arrive, by the time it did, it ended up being more expensive to purchase from Stockx.com because the same item was already on sale at my local targets for less than what I had paid.","title":"The product took very long to arrive","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"aokiji","text":"screwed my first order maybe i was just unlucky but i waited a week for them to be “delivered” just to never receive them. luckily i did get fast customer service and a refund but i never thought my first order would be so nerve wracking. literally scared to reorder the shoes :\/","title":"screwed my first order maybe i was just…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Varis","text":"A lying, scam artist piece of crap company.\nRead my last review I wrote a few days ago if you want the full story.\n\nOrdered a hoodie, didn’t get it and they stopped replying to my emails when I tried to get a refund.\n\nPosted a review of these piece of crap crooks on here to which they replied saying that my case would be looked at and I’d receive an email within 24 hours.\n\nAs of now 48 hours have passed and surprise surprise no email.\nIt has been 10 days since the last email in which they asked me to send them an affidavit.\n\nSteer clear of this piece of crap company, it’s an absolute joke.","title":"Avoid at all costs. Lying scammers, will take your money and you will not see your goods.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Login","text":"Took too long and the sneakers I ordered were not approved with no alternative offer.","title":"Took too long and the sneakers I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Hyperbam","text":"Transaction was Seamless, I ordered a new pair of Nike Adapt BB 2.0 and they got to me a week faster. When the shoes arrived, I was a bit dissapointed to see they did NOT look BRAND NEW and NEVER WORN. I noticed scuff marks on the back of the shoes as if they were walked in or damaged during shipping. Very unfortunate as it makes me question the authenticity part. However, the rest of the transaction had no problems and like I said, got to me way earlier than expected. 3 out of 5 for the scuffing on the shoes and the damaged lid to the box.","title":"Transaction was Seamless","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Filip","text":"Never received my order... trash service. ill never buy anything on this scamsite...  Dont buy here.  There is zero service and if you dont receive the goods you payed for even though something clearly went wrong, their only reply is: too bad.\n\nEdit 28-4-2022.  After complaining to much about still not receiving the shoes i paid for, they close my account. Wich is actually good because i will never be so stupid again to order something here.  Buyer be warned!","title":"Never received my order..","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"ryan aninipok","text":"Tbh support system is ass the seller has 1-3 business days to send item to stock X to be verified and it’s been 2 weeks\n\n\nSecondly 500$ pair of Nikes came with a few small stains. Stinky stinky","title":"Tbh support system is ass the seller…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Eli","text":"Nice site \nBut didn’t get my product, they are saying it’s delayed but the problem is I paid $800 for a $250 watch based on getting it early so if it’s delayed it’s not worth $800 anymore.","title":"Nice site","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"},{"date":"2022-04-13","author":"Amanda","text":"Two weeks after getting the Xbox it wouldn’t turn on","title":"Two weeks after getting the Xbox it…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=39&stars=1&stars=2&stars=3"}]