[{"date":"2022-04-10","author":"madi","text":"it f took forever for my shoes to arrive at Stock x its self, and then when it finially did they just refunded my shoes. Sell shoes that you advertise, if you don’t have them don’t sell them.","title":"it f took forever for my shoes to…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"ANA ORTIZ","text":"They writte their own positive reviews\nThey writte their own positive reviews. Please dont trust in this people. Always suddenly 300 positive reviews wrotten at the exact hour. This has been happening for the past days and weeksit  has  happened so many times before . They are scammers and dont have a phone number. Returns are a pain, lpst packages, only contact via email, hard to follow a return lost pacakge, refinds take 3 months .They writte their own reviews whem they are going down in sales. Believe me . Avoid this site.","title":"They writte their own positive reviews","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Serena","text":"Idk how to rate something I don’t have but I’ll try. My order is still delayed, with no updates","title":"Idk how to rate something I don’t have…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Nader","text":"The  8.5 adidas Yazzy  that I bought from you is too small my shoes size is 8.5 but it’s very uncomfortable when I put on the adidas  Yazzy 8.5 \nThis is very disappointing to me . I got screwed on this transaction!!!","title":"The  8.5 adidas Yazzy  that I bought…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Naks","text":"Long wait for nothing.","title":"Long wait for nothing.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Omer","text":"First and last time buying from the site. I excitedly ordered a pair of Yeezys which I was hoping to get at a great price (has been inflated by over 20% since then) and the purchase was “verified” by StockX and I received the delivery a week later. Well, the box at least. Because there was NOTHING in the box. And I had to go through Amar droid return of the empty box process along with sending multiple pictures. Stick to GOAT for verified shoes","title":"First and last time buying here","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Henry","text":"My packet game damaged and it wasn’t what I expected","title":"My packet game damaged and it wasn’t…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Zuri M","text":"I brought a pair of Concept air max 1 Mellow’s for my daughter for our vacation. They sent me a different pair of concept Air Max (a more boyish style). My daughter was very upset because she was really looking forward to The concept Mellow’s for our vacation, had outfits picked out and everything. When I contacted customer service (Via Chat) they had me send several pictures as proof that they were wrong. Finally, when they felt the “proof” was satisfying enough they apologized and let me know that someone else would be contacting me from customer service. The Next day I was contacted via email by Austin who gave me two options, and that due to the unique circumstances of the situation and company they couldn’t send me the right sneaker, so either I  return the sneakers for a full refund or take $25 off of the next order I make. After talking it over we decided to take the $25 off even though I felt that it wasn’t really enough, but whatever…so be it . So now I email Austin back our decision, he replies and to add insult to injury he tells me that he sent a code and that I have 90 days to use it. So now I’m on a time limit to order for someone else’s error. I just feel very disregarded and highly disappointed in Stock X.","title":"I brought a pair of Concept air max 1…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Carol","text":"Took a long time to get my order.  I didn't like it but couldn't get in touch with anyone to cancel earlier and I don't want to deal with reselling with them.\nWon't shop here again most likely.","title":"Took a long time to get my order","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Ricksha","text":"Never had my shoe","title":"Never had my shoe","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Alissa","text":"My first order wasn’t real so it got canceled which bummed me out a-lot even though you can’t do anything about it (i think), and my second got delayed which also bummed me out…I ordered mine before my brother and he got his shoes within a week, it almost been 2 weeks since mine..","title":"My first order wasn’t real so it got…","stars":3,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Shirley","text":"Never got my shoes 😡","title":"Never got my shoes 😡","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Mikey","text":"the shoes came a little dirty","title":"the shoes came a little dirty","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Jessica","text":"I had an issue with the delivery it never came to me and is being returned to sender but it has taken almost a month from my money to get back into my account and for anyone to provide good customer service I am overly frustrated with this customer service experience and I will never stop it this place again and I'll make sure to tell everyone I know not to shop here because no one is trying to help me and everyone is just trying to make it harder for me especially whenever I'm going through an emergency financial situation that needed my funds back immediately and no one is trying to understand that the item shipping delays due to UPS not me so it shouldn't be my fault and I shouldn't have to suffer for it but no one cares so I am very angry at this company and their customer service sucks","title":"I had an issue with the delivery it…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"sarah","text":"Order never got sent to stockx and was never able to get the shoes I ordered abs wanted so much","title":"Order never got sent to stockx and was…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Someone","text":"Too long to deliver and the fees are way too expensive. My Air Force 1’s went from $110 to $140 from fees, that makes no sense and that makes me pretty angry.","title":"Too long to deliver and the fees are…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Jb","text":"Order A Pair Of Yezzy 350 First Time Using Stockx And Never Received My Package Its Been Going On For A Month Now You Can't Call The Help Center The Only Send You E-mail i Would Never Use This Site Again","title":"Order A Pair Of Yezzy 350 First Time…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Brie","text":"Shoe isn’t authentic been contacting seller since I received shipment want to return and get my money back!","title":"Shoe isn’t authentic been contacting…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Tahjae","text":"i Purchased shoes and they just sent the money back with no explanantion.","title":"i Purchased shoes and they just sent…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Verina","text":"Extremely disappointed.  I purchased a pair of LaMelo for my son.  StockX charged my credit card twice for 2 orders when I only ordered ONE PAIR.. ONE ORDER.\nI have tried to no avail to contact  STOCKX by phone. \nI would appreciate if STOCKX COULD CONTACT ME AND PROVIDE ME WITH A FULL REFUND. \nTHANK YOU\nSTEPHEN GREAVES and Verina Greaves","title":"Extremely disappointed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=43&stars=1&stars=2&stars=3"}]