[{"date":"2022-04-26","author":"Colette","text":"I purchased the wrong size item, I had no option to exchange it or cancel the order. I am so unhappy about this experience","title":"I purchased the wrong size item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"CHRISTIAN","text":"My orders are mostly more than 2 to 3 weeks and when it is being delivered it is delayed by fedx even though it will say it will arrive 1 day it doesn't","title":"My orders are mostly more than 2 to 3…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"hatsikidee","text":"Ordered shoes, never Came so after calling DHL express they saying it's lost  just filed a claim through paypal against stockx. HAHA u Know what they do? They block Ur account. Awesome business model I would say. 🤡 Clowns. Blocked account, no shoes, money gone and the same answers over and over again. Such a business and such a sad policy. Never again for me. Was always happy but if that is how they act It's a no for me from now on.","title":"Shitshow","stars":2,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Raymond Capellan","text":"Awful experience stay away from this company God for bid You as the  consumer order a pair of shoes and they are not true to size and you spend over $300 and cannot return that shoe stay away.This has to be against the law.They won’t even let you Cancel orders!!!..Be very mindful of that!!","title":"Awful experience stay away from this…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Trav","text":"Package was not delivered upon date specified.","title":"Package was not delivered upon date…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Michael","text":"First time using stock X. If I could give 0 stars I would. Wait over a week for them to say seller fell through and they have a second pair waiting for packing then ship. Then wait another another week for then to say they refunded me and are canceling my order. Now the shoes cost more than they did 2 weeks ago","title":"First time using stockx","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Sawyer","text":"Took quite awhile and I was upset because the order I bought previous was not authenticated so I got a refund to buy the same shoe again. I am praying that these shoes will get authenticated.","title":"Took quite awhile and I was upset…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Kareem","text":"It was my first time purchasing an item from Stock X and my order was not fulfilled.","title":"It was my first time purchasing an item…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Daniel","text":"Didn’t receive my orders","title":"Didn’t receive my orders","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Nicole","text":"I have not received my order or an update of any sort…..","title":"I have not received my order or an…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Brandon r Mcanderson","text":"Website is not easy to use, no upfront information about the unique buying process","title":"Website is not easy to use","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"DT","text":"It’s my first order from StockX and my product is delayed due to the authentication process. While I appreciate the authentication process, I wish there were clean updates on the status of authentication process and ETA of when I can expect my product.","title":"Delayed order","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Felicia Bynum","text":"It was my first time using it.   The product was smaller than I expected by looking at the pic.  I would try to use them once again to see if I really like them.","title":"It was my first time using it","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Herman","text":"Good service, but should make it so you can see where the shoes are being delivered from. I almost didn’t buy a pair of shoes because I thought they shipped from the US only and I would have to pay a huge fee\/duty because when you ship clothes from the US to Sweden it will be really expensive to receive the package. Luckily a friend of mine had bought shoes from StockX and they didn’t have to pay any extra fee\/duty.","title":"Lack of information","stars":3,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Bob","text":"No returns, no exchanges really make this a pretty bad option.","title":"No returns","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Cris","text":"I was disappointed by the integrity of the seller which it took 7 days to be cancelled. The seller should have replied 2 days after the confirmation as per policy of this system. It’s my sons birthday","title":"I was disappointed by the integrity of…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Big Feet","text":"Shoes ran small and there is no way to exchange. So I'm out $300. I even ordered a 1\/2 size up. There really needs to be a way to return or exchange merch.","title":"No exchange or returns","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Dominique","text":"The chat is not helpful my shoes have been at the plant for a month sold and I had to reach out to them why I haven’t gotten paid also I have authentic shoes that they continue to fail","title":"The chat is not helpful my shoes have…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Thomas martin","text":"F@CK THEM. I work out of town and my package was delivered while I was gone and couldn’t check until I got back from working out of town. Since it was past 3 days they won’t give me my money back when it was delivered to the wrong house. DHL won’t help you either. So because I was gone working I basically got screwed out of $200. Also customer service doesn’t even have someone to talk to.","title":"F@CK THEM","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"F.Justus","text":"You have announced that my order was delivered, when it was not! You asked for a review before any delivery. Very disappointing! I have written to you, no reply until now. I hope I will receive my item one day!","title":"You have announced that my order was…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=20&stars=1&stars=2&stars=3"}]