[{"date":"2022-04-06","author":"pt t1879","text":"Beware as a seller that if your sold item goes missing in transit through the mandatory stockx shipping provider then stockx will give you no help whatsoever \nA pair of trainers that were sold through stockx and shipped through ups (their default shipper) were dropped off at the access point with a receipt being issued via online \nThe parcel has now officially gone as \"lost\" by UPS customer services over the phone and they have asked for a claim form to be filled in online but the claim form needs an account number linked to the purchase of the postage (stockx account number)\nI have been on stockx live chat and informed them that I can't make a claim without the accoount number or if they could make the claim via their account on my behalf \nI was told by the lady on live chat that it has nothing to do with stockx if it goes missing once dropped off even though you can't choose your own shipper \nShocking and appalling customer service and in future I will stick to ebay as at least I can stick to Royal Mail for postage","title":"Shocking customer services - stick to ebay for selling","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Justin","text":"Decent product but incredibly slow time to receive  product after paying for it","title":"Decent product but incredibly slow time…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"S.D","text":"I think the 7y is fake!","title":"I think the 7y is fake!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Jarrod","text":"I tried to cancel the errant orders multiple times and have declined the payment and still you don’t contact me for a return of your merchandise. Please contact me to arrange a return.","title":"I tried to cancel the errant orders…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Lakesha","text":"I have not received my package yet it’s been over 2 weeks they gave me a date to receive and I have yet to receive I needed for an event and I did not have them and I am very upset","title":"I have not received my package yet it’s…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"NA","text":"Price is competitive. However, I do not receive any “verifying” status email as according to your flow chart, and I was very surprised that the parcel only take 1 working day from “arrival for verification” to arriving my address. \nThere is only a “sticker” that said verified but I have high doubts on how much time was spent on verifying, and if any verification points - as no sharing of reports on verification, but merely a sticker only, which on the time spent plus verification process feel a bit too scratchy.","title":"Good price, but “verifying authenticity”?","stars":3,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Bug","text":"I’m not one to leave a bad review but I am dissatisfied. Ordered a pair of Nike scrap sea glass 10.5 and the shoes were not authorized after being sent to StockX. I wish I could at least have the reasoning behind it as I’m not able to purchase the shoes again.","title":"Dissatisfied but understanding.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Sharon Duncan","text":"I had one bad experience with StockX and I decided to still give them another try. I regret that decision. Back in December I ordered the Cool Greys and after 3 weeks, they sat waiting to be verified and never made any movement. StockX was never able to tell me what happened to my shoe. Here I am again in March, I ordered a pair of yeezys. They were estimated to arrive to me and we are now beyond that timeframe. My shoe has been waiting to be verified yet again with no movement in quite some time. This is two times now that I have paid for a shoe and not received it. I understand that delays happen but in both scenarios, I have had to reach out to figure out what is going on. If you are experiencing delays then shouldn’t it be up to you to express that to the customer? Shouldn’t you have a system in place that alerts you if a customer’s product has been stuck in a certain status beyond the expected timeframe?","title":"Never receive product","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"JJ","text":"Delays , been 2 weeks still haven’t received item","title":"Delays","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Dawnxoxo","text":"Shoe box harmed","title":"Shoe box harmed","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Clement","text":"Only interested in selling afterward don't count on customer service\nSo just hope u have no problem of any sort with what u buy","title":"Only interested in selling afterward…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Carlos","text":"Takes way too long to be shipped.","title":"Time","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Anthony","text":"The sneakers may or may not be real.  Either way the left shoe is about a half inch larger than the right and there is a bulge of foam inside the heel which makes them unwearable.  No returns, no exchanges, and no customer service.  I can resell them on their platform at a significant loss.  Nice. Will not be buying from here ever again.  Would be better off buying on Ebay, at least they offer returns.","title":"The sneakers may or may not be real","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Lonzell","text":"Everything went well when I ordered,but it's been over two weeks still haven't received my order and don't know when.Plus no specific time they coming.l don't know if I wanna order anything else from here and that is a big \"maybe\".","title":"Everything went well when I ordered,but…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Al","text":"Worst website","title":"Worst website","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Merlin John","text":"Clicking on Buy and then I got the message, the article is no longer available for this price seems pretty much like fraud to me.\nSorry, i could not recommend to buy here, as long as there were any alternatives.","title":"Clicking on Buy and then I got the…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Trevor","text":"Slowest transactions ever","title":"Slowest transactions ever","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Khadijah","text":"I never received my packages I will never order from you guys again and still waiting on a refund","title":"I never receive my packages","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Drew","text":"My purchase has been delayed quite significantly.","title":"My purchase has been delayed quite…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Craig","text":"Random delays after an already month long delivery time. Can’t control that sometimes. No hate","title":"Random delays after an already month…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=50&stars=1&stars=2&stars=3"}]