[{"date":"2022-04-07","author":"Anonymous","text":"My problem was not solved and the case was ended","title":"My problem was not solved and the case…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Melanie","text":"slow service paid for a item and dint received yet","title":"slow service paid for a item and dint…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"kayleigh carson","text":"worst company and customer service","title":"terrible company","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Grady","text":"I tried buyer some Omega Swatches and in the couple of days my orders were being processed the price went up and my orders were cancelled.","title":"I tried buyer some Omega Swatches and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Randy","text":"My package was supposed to come on the April 5th and it did not come in","title":"My package was supposed to come on the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"K.B.","text":"Absolutely no guarantee for 100% authenticated items. You won’t be getting a sealed container or any supporting paperwork to help you authenticate your purchase. I messaged support and the essentially gave me their word and nothing else.\n\nI understand this may be a result of the “validation system” (that is a forced payment as well), however, I have no way to know if proper ethics are being conducted.\n\nThis is essentially a very elaborate gamble, and you may need to seek legal help if it goes south.\n\nBe warned~","title":"Absolutely no guarantee…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"no","text":"understand there’s covid delays, but ordered shows over 2 weeks ago and they’ve been stuck in the “authentication” process and won’t be shipped for another 1-2 weeks, which might get delayed. an email update would’ve helped since last week","title":"understand there’s covid delays","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Joshua","text":"The order got cancelled after 4 days and didn’t receive the item I bought. Much better verification of sellers needed…","title":"The order got cancelled after 4 days…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Asia","text":"It’s taking to long for me","title":"It’s taking to long for me","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Varis","text":"Where do I even begin. \n\nI placed an order (35467194-35366953) for an essentials hoodie on 28\/03\/2022. Despite 2 or my previous orders being cancelled as the hoodies didn't pass the authentication process this 3rd attempt actually went through. \n\nThe Hoodie was meant to be delivered on 31\/03\/2022 by UPS, however, all I got from UPS that day was an email saying that my order has been delivered, yet there was no order at the door (which is where UPS supposedly left it, even though I was home). \n\nSince I already once had such experience with StockX, I knew what to do. I filled out the \"begin investigation\" form on StockX website, provided all of my information, order numbers etc., attached a copy of the affidavit and submitted the case hoping that someone competent enough would be able to help. \n\nOn 01\/04\/2022 I was contacted by Dalma (CRM:04580001604) from StockX. She asked me to provide her with details about my account which I did, then she sent me another email asking me to send her a copy of an affidavit, which I did. While we are at it, why the F did I have to attach a copy of an affidavit when filling out the \"order missing\" form, if I end up sending it to the agent in the end anyway? \nAnyway, sent her a copy of the affidavit, twice actually since she was not happy with my handwriting in the first one and got sent a link to StockX identity verification. \n\nStandard procedure right? Been there, done that before. WRONG, as about 10 of my attempts to scan both my passport and national ID failed. I even tried uploading an image. \nBoth the webcam on my MacBook and the camera on my iPhone have high resolution, yet according to StockX the image was not clear.\n\nHaving been unable to complete my ID verification on StockX website, which if I may add is a f**ck up on their end not mine, I decided to email Dalma and let her know that the ID verification system on StockX must be experiencing technical difficulties so instead I attached a photo copy of my passport and sent it to Dalma, hoping that she would be competent enough to do something about it. \n\nAs of today, 7th April 2022, it's been 4 days without any reply from Dalma or any other StockX rep. I have tried to file a new case 3-4 times, however, it seems like StockX has decided to deliberately ignore me which is exactly what happened before when I tried to cancel one of my orders. \n\nThere is no such thing as customer support on StockX, none. The way they respond to every case on here is by redirecting us back to stockx\/contact page on their website, however, we all know that the reason why we post on here is that it's impossible to get anyone to reply through their website and it's a fact. \nI bet they won't even deal with my issue here directly, but will simply tell me to contact them on stockx support. It's a joke, this company takes your money, doesn't deliver the product, tries to create an illusion that you are getting help and then they just leave you with no contact, and obviously they keep your money. \n\nI strongly suggest potential customers look at other options like KLEKT or GOAT because StockX is a scam site. \n\nI will be opening a case with my bank so I can hopefully get my money back and I will doubt I will ever do any business with you crooks.","title":"Scam website, they will collect your money and you will never receive your product.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"KH","text":"I loved the swiftness of service but I don’t like that I can’t exchange or return items.","title":"I loved the swiftness of service but I…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"FedEx sucks ass","text":"FedEx sucks ass","title":"FedEx sucks ass","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"tiffany","text":"literally got completely different shoes and they wasn't even my size........","title":"literally got completely different…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Mike Roberts","text":"I attempted to cancel my order which was a duplicate of our grand daughters order.  Now she is forced to sell back her purchase to you and get whatever she can for the items.  You won't see our names on your rolls ever again.","title":"I attempted to cancel my order which…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Eduardo","text":"My experience was not what I expected,  I ordered 2 times and for both orders I had the delivery company spam emailing me asking for a copy of my passport in order to process the delivery, I didn't know it was a requirement to buy shoes to begin with. They make it rather hard to reach customer support, the help needed is hidden under layers of automated faq options.","title":"My experience was not what I expected","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Zachary","text":"Authentic and delivered as promised. That said, I do not appreciate stockx fueling the resale market for sneakers. I never buy to resell, I only ever buy to wear. Sites like this drive up prices and ruin sneakers for the folks that actually want to wear them. I know if it weren’t you it would be someone else, so I guess you’re the best of the worst. Congratulations!!\n\nPS: I only used this site because the kicks I had to have were sold out, because of sites like this.","title":"The best of the worst","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Sy","text":"1. Goods received but why the size smaller than the same size-number he tried at adidas shop. Please advise how to solve this problem.\n\n2. The carrier held the goods until I contacted and provided my address in Chinese per requested. Why did the carrier call me to ask? The result was NO.\n\nI look forward to hearing from you.\n\nBest regards,\nSY","title":"Seeking your HELP","stars":2,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"COLLEEN","text":"My shoes never came.  I have waited and watched the door, checked ring and my security cameras.  Never was there ever a delivery.  Either StockX never sent the shoes or the delivery guy at Fed Ex stole them.  The claim center does not provide you a live person to speak to.  There is no address for stockx and no email live feed to communicate.  My child is upset and I have wasted countless hours first trying to buy the shoes and then to make claims and to find a person to speak to.  Don't do it. I cant be the only one that this has happened to.  My only recourse may be to file a cause of action as I am that angry.  If we don't buy from these companies then the shoes will be available in the store and at a regular price and no shipping costs!","title":"My shoes never came","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Carnell","text":"I have not received my order yet","title":"I have not received my order yet","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Gilbert Rosas","text":"Placed order got the the delivery date and all I even got a text message about not signing for the package which I declined because who would spend 400 dollars and not want to sign and make sure they receive their package? But I got an email and a picture stating my package was delivered but I was home never got a knock and package wasn’t on doorstep. Everything seems suspicious because the investigation they performed StockX ended up telling me the package was lost during transit but DHL took a picture of said package outside my door but I never received , got a refund but the whole ordeal was just a headache! Had to jump thru all kinds of hoops and contact multiple agents and send multiple affidavits just to get the situation tooken care of. I wish they had a phone service rather then chat on app. First time and last I will ever use this site. It’s one thing to overpay like I was doing but for all this to transpire it just wasn’t worth it. Also the chats I was having with the agents kept getting left by said agents. Then they would email me and I would respond then they wouldn’t up until the very last agent got me tooken care of. Buyer beware my first experience was horrible.","title":"Placed order got the the delivery date…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=47&stars=1&stars=2&stars=3"}]