[{"date":"2022-04-11","author":"Jerome Tremblay","text":"Took way longuer than expected for 2 of my only 2 order…. But nice service","title":"Took way longuer than said and expected","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Elizabeth","text":"I purchased a pair of shoes for my brother for his birthday at a pretty great price. The shoes arrived on time, great. However, the shoes came with a giant dent in the toe box that was very noticeable. It’s as if they were not inspected prior to being sent to me as there was no damage to the shipping box, however the shoebox it came in was crunched. I was able to receive a refund for these shoes, however now the shoes are at a higher price and I am trying to wait for the price to come back to near what I originally paid for them. There should be some sort of additional compensation in place for customers who are screwed over by incompetent employees. This is frustrating and StockX just lost a customer, I’ll be taking my business to GOAT.","title":"Disappointing Transaction","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Andrew","text":"If I would have known it would have taken this long I would have chose another vendor or got my money back. I will not be using stock x any more","title":"If I would have known it would have…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Miguel","text":"I WAS CHARGED BUT NEVER RECEVED MY 2ND PURCHASE.\nORDERED 2 PAIRS OF JORDANS BUT ONLY RECEVED 1 AND HAVE NOT RECEVED A REFUND.","title":"I WAS CHARGED BUT NEVER RECEVED MY 2ND…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Emilio","text":"I was making 2 purchases, the first was made on March 30 and 11 days have passed and it has not arrived at the verification center, but the second was made on April 6 and they already sent it to me, it is on its way to my house, honestly, I do not know how to feel","title":"I was making 2 purchases","stars":3,"location":"MX","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Ari","text":"I bought Swatch watches and none of the orders were fulfilled. I did not even get a sorry note","title":"I bought Swatch watches and none of the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Fernando","text":"I received my order damaged and was only offered a $20 refund. I wanted something brand new and it was supposed to be certified new. No replacement or refund. Bad company. I will not be doing business with this company ever again.","title":"I received my order damaged and was…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Damon","text":"My box was ripped up and not in the condition I was hoping for it to be in. Kinda disappointing for a well represented company","title":"My box was ripped up and not in the…","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Tallulah","text":"My shoes came scuffed and also the leather was lifting from the shoe almost like they’d been worn before. Really disappointed tbh especially when it was supposed to be 100% brand new. Just wondering who verified it bc it’s a joke","title":"My shoes came worn","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"curry","text":"Pretty but not too great shipping takes some time but other than that everything is good","title":"Pretty but not too great shipping takes…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Brian","text":"I have unsubscribed from your emails 3 times already but you keep emailing me. Please stop","title":"I have unsubscribed from your emails 3…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"melissa","text":"I ordered a size 6 which is bigger size than shoes I have, but these must run very small because they are do not fit. I wanted to exchange for a different size. Can not exchange or return shoes on stockx so now I am stuck with shoes I can’t wear.","title":"No returns\/ exchanges","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Daniel","text":"unable to cancel purchase immediately after transaction","title":"unable to cancel purchase immediately…","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Jacob","text":"I never received the product order and there was no timely alert to indicate the status of my order. I will never order from the site again.","title":"Buyer beware","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Stephanie Zambrana","text":"My shoe came damaged and as per the email I received it is considered under the correct standards. For my troubles they offered me 20 dollar towards a new shoe. Who would buy a shoe after the first pair came damaged. Makes no sense.","title":"My shoe came damaged and as per the…ft","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Asya","text":"I never received my order","title":"I never received my order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Danial","text":"you can not cancel orders ,i ordered wrong size but straight away after transaction I messaged customer service no reply three days later they said we can not cancel order due to our cancel policy now I am stuck with 500 pound trainers not in my size","title":"you can not cancel orders ,i ordered…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Paolo","text":"Order 3 times…never received the product ! \nOf course I got money back… but unfortunately a lot of unreliable seller !","title":"A lot of unreliable seller","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"caprice","text":"Wasn't able to buy another pair of shoes I was blocked by stockx blocked to buy any more shoes","title":"3 different card was labeled with no funds","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"},{"date":"2022-04-12","author":"Gordon","text":"Worst experience buying trainers ever if I could have given no stars I would have. This was my first order from stockx I bought a pair of trainers after 2 weeks of no communication from stockx. I'm told there's been a problem and I won't receive my trainers. Now I'm going to have to wait another 3 to 5 days for my refund of my money and I have no birthday present for my son and no money to buy my son a birthday present either. I think I will stick to using eBay as I've never had any problems with my orders ever in 17 years of using eBay","title":"Worst experience buying trainers ever…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=41&stars=1&stars=2&stars=3"}]