[{"date":"2021-11-09","author":"Robert","text":"Unhappy with your service charges added on to the purchase. Seemingly reasonable prices become unreasonable. Could have exact same thing on another site for much less. Will not buy again unless something changes.","title":"Unhappy with your service charges added…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-09","author":"Cw","text":"It’s my first time using stockx. I accidentally purchased the same thing twice because their bid\/buy buttons are so similar that I found out through the email confirmation that I had bid on an item when I really wanted to buy it instead. I out put in my payment info thinking I was buying only to find out later it was a bid.so I selected the same product and purchased it right away because it said there was only one left. I figured I’d cancel my bid afterward. But there was no option to cancel and no chat or customer service phone number  anywhere and before I knew it it had shipped! Now I’m getting a duplicate order and no way to contact these people!","title":"It’s my first time using stockx","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-09","author":"Harald","text":"to reply to this comment - we have been reaching out to the support team several times, there was not reply. We have been sending emails with pictures of return deliveries including DHL return shippment delivery number. The very first reply came in today 09\/11 and the feedback was that refund is not possible due to missing shippment information. Although return shippment ahs been documented and all information has been sent (including return delivery number confirmed by DHL).\n\nAGAIN: be very careful with this company!!!!!!!!!!!!!!!!  \n\n\nHi Harald, hope you're doing well today. Sorry to hear about the troubles that arose after your son purchased shoes on our platform. We would be happy to look further into this for you and see what can be done. Please reach out to our support team at stockx for further assistance. Thank you!","title":"extremely poor experience","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"Ryan Henry","text":"There legit check department is fn f'n garbage! I've received fake shoes, worn shoes, and now I just got a used up sweater with a cut in it.. it f'n Furiates me, And of course they have no way for you to contact them so your basically just screwed.  So if you can afford to just straight get ripped off here and there this site is for you","title":"There legit check department is garbage","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"Hugo Jimenez","text":"Got shoes that was used and a cut in it.\nAnd i got suspended on the platform for a repotted it to PayPal. StockX is a joke!","title":"Got shoes that was used and a cut in it","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"Di Zip","text":"They got 2 times money from my account and the order couldn’t be processed. I recieved a email immediately after I tried to make my purchase where was said that i will be refunded within 24 hours, but it has been 10 days now that i dont get any refund! I contacted support where i provide them both statements of the payment transactions so they can see, and Lionel from costumer support with a so faceloss he said he cant see the files attached and asked me to send again which is something i can prove i have attached the files, then i got no awnser for days and then i get only a sorry and to send a order number when the order is not created but it just didnt went through even though I payed. The only thing i can do is show the statement that i got charged. If i will not get my money back within 3 days i will call my bank and also sue them. It was supposed to be a birthday gift and not only didnt went through anything but also my money is taken! Immagine 600 minus for somebody who work and have his money counted for everything and then this animals keep your money and dont help to give it back! Avoid buying here if you need something on the right time becouse you will put headache to yourself!","title":"Worst costumer support ever! Lionel!","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"Torenzio","text":"Too many fees","title":"Too many fees","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"KEKE","text":"Got fake shoes that also were painted and were obviously worn. Have talked to them for a week or two and told couldn’t get my money back and should just resell them on the app. What? Also got my card charged two times extra after getting a return issued.EDIT:Well one is obviously fake so you can’t say they are dead stock and any part of Nike company would let a shoe that looks painted on get through them and them sell the shoes to the public. You can keep on making up excuses for fake and beaten up shoes but the truth about your ‘Authentication’ is known to about everyone who has gotten shoes from you in probably about a year. Also the box was damaged which makes it not dead stock. And no it wasn’t shipping the box it was shipped in was fine but the shoes box was damaged. And every time I try and return the shoes you say they are not able to be returned like what?","title":"Got fake shoes that also were painted DONT BUY SHOES FROM HERE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"Jason","text":"The only answer I received, was I will consult my team and they will respond back by e-mail within 48hrs. This is poor! I am level 4\/5 I should have phone communication if need to a direct person.","title":"The only answer I received","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"Meredith","text":"I inadvertently ordered 2 pairs of same shoe.  An email did not come to say order went through.  Therefore, ordered again.  Still no email.  Ordered yet another pair of same shoe directly from Nike.  Started seeing emails from DSL (yellow truck delivery).  Deleted because I did not see order as going through.  Reached back out to your company to return both pairs.  You don't return, you buy back.  Won't be using you again, will not be giving this company any accolades at all.  Poor policy.","title":"I inadvertently ordered 2 pairs of same…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"Jose","text":"Box was damaged on sneakers","title":"Box was damaged on sneakers","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"Robert","text":"Way too expensive.","title":"Way too expensive.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"Carlos","text":"I sold a pair of shoes through stock x. Shipped through ups, they got lost. Till this day stock x has never reimbursed me. They also told me It was not their problem contact ups. I did ups said they would help. 3 months later still no answers","title":"I sold a pair of shoes through stock x","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"Ricardo Hiraldo","text":"Very high fees. StockX keeps most of the profit. If it wasn’t because of their authenticating service, I wouldn’t use it. It is agreat idea and interface, just too expensive for the buyer and seller. Lower the fees, help people out...you still going to make millions. #greed. I’m going to give ebay snickers a try. Sometimes I wonder about StockX’s validation process as I have seen a few shady deals. This is coming from a member that sold 25 and bought 20 pairs thru StockX. -Rick, Fairfield, CA.","title":"Very high fees!!!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"Melvin","text":"Box came all damaged dented etc","title":"Box came all damaged dented etc","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"Alex","text":"I have to wait months for my items","title":"I have to wait months for my items","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-11","author":"dustin","text":"It sucks that I can't just go buy these sets. Instead I have to pay someone who went and cleared out the shelves and marks them up.","title":"It sucks that I can't just go buy these…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-11","author":"Carlos Silva","text":"I advise Stockx, all the items I bought, have been received and corresponds as described.\n\nThe reason I didn't give it 5 stars is due to the fact that I have already received a pair of wrinkled sneakers, 1 damaged sneakers box and the last pair of sneakers I bought I did not receive the descriptive stating authentication document and the purchase amount.","title":"I advise Stockx","stars":3,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-11","author":"Corin","text":"I ordered a pair of Travis Scott Fragment Jordan 1s. They were clearly missdelivered and show on the tracking as delivered in Southampton - several hours away from the address on the order. I have now spent about a month attempting to sort this out with StockX, their live chat seems to only be open half the time it is advertised as open, and majority of my emails have been left unanswered; they have sent me links to verify my identity, after the first few didn't work they told me i needed a guardian to verify as i am under 18, after this ID was submitted they said they couldn't help as the ID doesn't match the order (obviously not as it's a guardians ID). I've been in live chat several times where it just kicks you out, and most recently i was told i was being transferred to a specialist team and they just ended the live chat.\n\nHonestly have never ever had worse service in my entire life. The tracking itself directly shows it was delivered like half the country away from me, and i'm convinced it's some elaborate scam that's preventing them from getting my money back.\n\n\n\nEDIT: \nI’m not posting all my order details on a public site, I’ve responded to your email asking for more information with order number, my phone number and email","title":"My order never arrived - have now contacted 10+ times and not been helped at all","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"},{"date":"2021-11-11","author":"SimpleSimon","text":"Unlike some people on this thread, I actually got my order. All well and good, but returning is another matter.\n\nAs I live in the UK, I contacted StockX to invoke the 14-day withdrawal from the contract, so I could send my order back. It's now been 17 days since my initial contact, and despite contacting them 6 times, they haven't done anything to help, except to tell me they're busy. \n\n***UPDATE*** I know this is a first-world problem, but it's now been 23 days since I initially contacted customer service and 6 days since they reached out for details. Nothing has happened at all - and it's not even the Christmas period.\n\nTruly shocking customer service and won't be using them again.","title":"StockX - possibly the worst customer service ever","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=96&stars=1&stars=2&stars=3"}]