[{"date":"2022-03-29","author":"Jenna","text":"My son spent his Birthday money on his shoes.  They came with a giant crease on the side.  I was a little upset as I assumed when they are verified this is something that would be seen and we would have been made aware.","title":"My son spent his Birthday money on his…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Sebastian","text":"Had a rust thing on my AF1 on my left side","title":"Had a rust thing on my AF1 on my left…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Alex","text":"WILL KEEP YOUR MONEY!!!! 5 DAYS AFTER LAST NEGATIVE FEEDBACK, STILL NOT BEEN PAYED \"MY MONEY\".  REALLY DOES SHOW WHAT A COMPLETE  \"TIN-POT\" COMPANY STOCKX IS... YOU COULD NOT MAKE IT UP.... DON\"T EXPECT TO GET PAYED ONCE ITEMS SOLD...","title":"WILL KEEP YOUR MONEY!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"דפנה","text":"I put 1 star because i had a purchase from you and it don't arrives and I'm very concerned that I tricked by you and I'm hopeful that the shoes that I bought from you will arrives soon.","title":"I put 1 star because i had a purchase…","stars":1,"location":"IL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Doug P.","text":"Way overpriced takes way too long to get your materials I've been waiting since March 18th 2022 and today is the 29th and I haven't even had so much as an update to my order! I will be doing business with Goat from now on!","title":"Way overpriced takes way too long to…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Cosmic","text":"It was good I guess but then days started to go by without any update on my shoes and was thinking it must take a while then I look at the help articles and it takes up to 12 days usually for the shoes to article but it was day 15 and then I email stockx they don't know where my shoes are so I refunded it and got my money back and this is my first time using stockx","title":"It was good I guess but then days…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Hal","text":"Shipping was a issue. I had been told that items would arrive via Fed Ex or UPS. USPS does not deliver to my home. DHL handed the package off to USPS for final delivery. I had to jump through additional hoops to get my item before it was returned to china. If I was given correct information, I could\/would have had it delivered elsewhere.","title":"Shipping was a issue","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"makayla","text":"I never got my shoes","title":"I never got my shoes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Brenda","text":"I still haven't received my shows. Its been a month","title":"I still haven't received my shows","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Vincent","text":"Still waiting on sneakers purchased with zero feed back.","title":"Still waiting on sneakers purchased…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Customer Ashlee Boswell","text":"I disagree with the determination of my review concerning authenticity. The details are what determine authenticity. The details on the shoes I was sent were sloppy at best. The 23 on the back bleeding on to the white part of the shoe is NOT typical. Jordan is synonymous with excellence. I have looked at other pairs of this shoe and none lack the details mine do. I want to be contacted regarding my purchase by a manager. I do not want to be contacted by Sarah again.","title":"I disagree with the determination of my…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Ashley","text":"Although the shoes go through inspection to verify authenticity, I’m guessing the inspection doesn’t check quality? My shoes (Huaraches) arrived with busted threads around the ankle like if someone tried them on and popped the threads. The paint was chipped off the toe area, glue slathered on all the crevices. My shoes definitely seemed worn once or twice but were advertised as new. I won’t purchase again through StockX unless the authenticity check is updated to include the quality of the product.","title":"Authentic yeah, Quality NOOOOO","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Justin","text":"I am currently waiting for my second attempted purchase from stockx to ship to stock x. It has been 8 full business days still no change. The 1-3 days is a lie. My first order was just randomly canceled by stockx 3 weeks after purchase after the claim that it was in shipping. No reasons or anything sent. So basically stockx just takes your money for a few weeks then gives it back. Waste of time just go somewhere else","title":"Do not waste your time waiting to recieve nothing","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Red Semper","text":"Ordered an oculus 128gb and it takes forever to arrive and it costs 20- 30 more dollars then it would off Amazon and takes way longer to arrive than Amazon I only recommend this site if your trying to find an item that's not on Amazon or eBay or is cheaper than the item from eBay or Amazon or any other site I don't really know only made one order so far","title":"Ordered an oculus 128gb and it takes…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Kisi","text":"Wrong order delivered with the wrong size. I ordered size 8 Air Jordan for my daughter only to receive a size 17. Submit a query and no one has reached to me. Very disappointed!!!","title":"Wrong order delivered with the wrong…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"M.D.","text":"I went on the website to see how much the actual purchase would be including shipping and sales tax. My credit card was saved which it should not have been. The order was placed. I was not able to cancel. Also, I was unable to take my credit card off the sight.","title":"I went on the website to see how much…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Yurie","text":"Fake Air Force","title":"Fake Air Force","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Bettina Parchment","text":"Ordered trainers on the 17th of march for my daughter's birthday which is the 29th, VERY disappointed as website stated it will take up to 12 days, her birthday has now come and still haven't received my order it hasn't even arrived at stockx for authentication yet, first time using the website and it will definitely be my last, NEVER AGAIN!!!!!","title":"DISAPPOINTED!!!!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Cameron","text":"Transaction was fine but item was not really described accurately as the one I received was in a little rough condition.  I paid premium price but box actually has several dings, bends and shelf ware but decided to not make an issue over it","title":"Condition not Accurately Described","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"},{"date":"2022-03-29","author":"Unhappy in MN","text":"The inability to make an immediate correction to our order caused us to get the wrong sized tee-shirt.  I tried 3 minute after the order was sent and not able to reckonified mistake.","title":"The inability to make an immediate…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=62&stars=1&stars=2&stars=3"}]