[{"date":"2022-05-02","author":"Ronnie","text":"Ordered item 2 months ago. Paid for shipping. haven’t received item. Did receive email saying that they are sorry for the delay. No customer service.","title":"Ordered item 2 months ago","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"James","text":"My order was cancelled and I received a refund.  While I appreciate the quality control, the fact that the very same shoes were still for sale at a slightly higher price was confusing.  If I order them again, will they be purchased form a different source, or will I just be repeating the same failed attempt?","title":"My order was cancelled.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Melissa","text":"Very questionable about purchasing anything. You receive no confirmation when ordering and wonder if this was a scam. My card was charged 7 days before receiving any form of verified and shipping. Wasn't please with the process. But did receive my shoes.Very please with them.","title":"Very questionable about purchasing…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Jiří","text":"Horrible. Tried to buy 1 hoodie for 5 times. The seller never shipped it. Lost money each time trying to buy it since i payed with paypal. Horrible service and for me it was just a waste of time since they take 5days to send the money back. Dont waste your time with StockX","title":"Stockx experience","stars":1,"location":"CZ","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Artem","text":"I still didn't received my item!  so i don't know in what reason you are sending me this reminder!! what is the point??","title":"I still didn't received my item","stars":3,"location":"MX","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Rick","text":"The entire process is taking way to long to receive my order!","title":"The entire process is taking way to…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Shannon","text":"The tongue on the sneaker is defective and stuck to the side of the shoe. After waiting longer than anticipated because of shipping delays was very upsetting after spending extra money for it to be on time. Nevermind the shoe is not to its best quality and defective.","title":"The tongue on the sneaker is defective","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Nikki","text":"I would think paying as much as I did, StockX would ship the item overnight or two-day from Arizona.  My delivery date keeps getting pushed.  I’m wondering if I will ever receive my item and in what condition it will arrive in.  I am not happy with FedEx delivery AT ALL!","title":"Shipping is a Joke","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Justin","text":"There was no transparency with my order. I never received a notification stating the initial seller never shipped the shoes. When I reached out to customer service five days after placing the order, they stated that they had issued a refund because the shoes never shipped. Around 3 days after this, I received an email stating that I was connected to another seller, when I was under the impression that I would be receiving a refund. Now the shoes are on the way to me, which is nice because that was the outcome that I had been hoping for, as I didn't want to restart the process if it would be as confusing again. I do appreciate being connected to another seller, however, I would just appreciate some more transparency on my next order. I do plan on continuing to use your services.\n\nThanks","title":"There was no transparency with my order","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"XxX","text":"My order delayed around half month and still have not received it. I paid the high price because I want it asap. If the products are not sent out on time, I think I should have the right of cancelling the order rather than forcing me to accept the delay.\n\nIf the price is fixed, I have no complaints about the delayed shipping.\n\nEven the price is floating but it is shipped on time, I would not have any complaints too.\n\nThe point is the price of the products on StockX are mostly floating. I paid the high price because I want it asap and I cannot wait until the price become stable. What is the point of I paying a higher price and still got the product at the same time of ppl who paying a lower price? Really disappointed. You shd also protect the customer’s right not only the seller’s right!","title":"My order delayed around half month and…","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Kay","text":"My shoes arrived with a stain. I am very disappointed","title":"My shoes arrived with a stain","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Keith","text":"Everything was perfect with StockX but the fact StockX used FedEx to ship my sneakers was the problem they did a poor job with delivery and lost my sneakers by chance I found my sneakers idk if I will use StockX again","title":"Everything was perfect with StockX but…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Miss CHAPMAN","text":"I’ve ordered from StockX several times in the last few years. I’ve had to return 2 pairs due to OBVIOUS inauthenticity!!! It was so apparent they were fake I’m not sure how it went through any sort of “process” before my delivery. I was sadly disappointed w them because they claim to have a rigorous process. Clearly they don’t. I won’t order again from them because it’s 1 time too many.","title":"Sent me Fake shoes 2X!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Kaelyn","text":"I ordered something over 2 weeks ago and it is still pending and I know things can be delayed. However, when i go to try and receive some help about my order, I have to deal with a live chat. The live chat can only answer questions that it is programmed to answer.","title":"I ordered something over 2 weeks ago…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"LaShaun","text":"Where is my package?","title":"Where is my package?","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Mona","text":"Nice to see a wide variety of shoes Available. But delivery takes way too long and my order is a gift which still hasn’t arrived.","title":"Nice to see a wide variety of shoes…","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Lakesha","text":"Never received my order","title":"Never received my order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Valerie Carrillo","text":"Horrible. Never got a confirmation email - never got a CANCELATION email. My money just 5 days after purchase got refunded. Would not recommend. Emails didn’t go to my junk box either. All I got was an email to review stockX lol.","title":"Horrible - would not recommend.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Estrella","text":"The purchase and authentication part of the transaction through StockX was very easy and smooth. When I was having delivery issues with FedEx I sent StockX an email to open a case to get their assistance (per their protocol) and there is no customer service number to call and speak to a person. I never heard back from customer service on my request. The order ended up being almost two weeks delayed through FedEx.","title":"No customer service available","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"AC","text":"I received the package within the estimated time frame. \nI was disappointed that stockx restricted the delivery to certain UPS locations. Unfortunately, this meant I needed to drive nearly 20 minutes one way to get the package within a 2hr time window. The box had seen better days and there was barely any packaging material inside the box to protect the item. Luckily, the item only had minor damage to the box (corners are damaged) and some shelf wear. If this was a rare collectable the shipping method\/protection would have been unacceptable. At the end of the day the item was new, as promised and I got a small discount over retail. However, with the hassle of dealing with delivery restrictions I'm not sure I'll shop stockx for items available at retail that can be delivered to my front door and in more secure packaging.","title":"I received the package within the…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=9&stars=1&stars=2&stars=3"}]