[{"date":"2022-04-09","author":"Alexandro","text":"Yall taking forever to send me my ps5 I bought 2 weeks ago","title":"Yall taking forever to send me my ps5 I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"Nicolas","text":"lmao got scammed and didnt get refunded the full amount paid for","title":"lmao got scammed and didnt get refunded…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"Sching Schong","text":"I Send a Return request and i didnt become one . I bought the wrong shoes and i want to Return them. In some days i can‘t Return them Because of the 8 days Limit .please help me.","title":"I Send a Return request and i didnt…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"Blerim","text":"Not good this","title":"Not good this","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"Mark","text":"Not so sure on your system of bidding and authenticity","title":"Not so sure on your system of bidding…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Ruben","text":"very bad service and after a week they canceled my purchase I wasted my time","title":"very bad service and after a week they…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Idania","text":"My bid would cancel for no reason, at first it would go through but then for no damn reason it cancels??????!!! I've made multiple purchases on stock x and this one time I wait 3 days for my bid to get accepted and once it does it gets cancelled?! Are you serious !!!!!!! This has to be fixed","title":"My bid would cancel for no reason","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"juan cruz","text":"They writte their own positive reviews. Please dont trust in this people. Always suddenly 200  positive reviews wrotten at the exact hour. This has been happening  for the past week adn ha happened so many times before . They are scammers and dont have a phone number. Returns are a paint  in the as....","title":"They writte their own positive reviews","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Smith","text":"I ordered my shoes two weeks ago and was told they would be at my house by 2 weeks, after the two weeks i got an email saying they had been delayed and could expect them to be delivered in another 1-2 weeks. so a total of a month after they arrived at stockx after a few days","title":"delay","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Jon","text":"I purched a sealed collectable and the plastic was torn in a few spots and the box had a few gouges in it so it's not really a sealed product with the packaging being torn and the box damaged I thought by going through stock x with them verifying the product they would have noted the damage and it was loosely packed in a box so it could just slide around not very happy especially after paying a large sum for a collectable","title":"I purched a sealed collectable and the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Greg","text":"This is the first time using this service and with the multiple delays I'm experiencing this will be the last time I use this service.","title":"This is the first time using this…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Toni","text":"Bad quality and got 14$ Free shipping :)","title":"Bad quality and got 14$ Free shipping :)","stars":2,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Shantah","text":"Horrible. Have not received my order. Never using site again","title":"Horrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Crispy","text":"TOTAL JOKE FROM START TO FINISH AND TO TOP IT OFF YOU SENT THE WRONG SIZE JORDAN’S BUT YOU WANT ME TO RESELL THEM…………JOKERS","title":"TOTAL JOKE FROM START TO FINISH AND TO…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Bladimir","text":"I order a electirc scooter and i have not recive the order number so i can be tracking my order the only thing ya did was take the money","title":"I order a electirc scooter and i have…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Cynthia","text":"I received FAKE Nike Dunks! I order a men’s 7.5 which is my usual size and the size I ALWAYS purchase in men’s Nike and I received a size 7.5 that’s fits like a boys size 6!  This size discrepancy is always synonymous with KNOCKOFFS! I’m still waiting on a resolution from Stock X after sending a bunch of photos at their request. I will never order from here again. I don’t understand how you guys authenticated this sneaker and I still received a fake sneaker. To date 4\/12\/22 .. it’s been 4 days and no response after I sent ALL of the requested photos. Still waiting on a resolution.","title":"I received FAKE Nike Dunks!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Maquitta","text":"The shoes had stains on them and they were ripped. I won't be ordering again from them","title":"The shoes had stains on them and they…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Elizabeth","text":"Shoes were 2 different colors after being “verified”. Reached out to stockx with no response. This was my first purchase through this site and only looked at 1 shoe upon arrival and didn’t get them back out to wear until my event. Disappointed because my only assumption can be that they in fact are not real after paying so much.","title":"“Verified” fake","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Víctor","text":"Good (original shoes and good operation of the app) but my shoes had 2 small stains in clearly visible areas (the management payment is supposed to be for someone to check it thoroughly) and the other complaint is that the chosen shipping company (UPS) decided to leave the package at a collection point marking that \"The addressee was not at the home\" when I had been waiting and no one called home or my phone (they always do) so having paid for an expensive shipment in the end I had that I go to pick it up.","title":"Good although some complaints","stars":3,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"},{"date":"2022-04-10","author":"Attila","text":"You can easily duplicate your order by mistake, and you can't cancel it. \nCostumer support is like inexistent.","title":"You can easily duplicate your order by…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=44&stars=1&stars=2&stars=3"}]