[{"date":"2022-04-01","author":"Latoya","text":"Each time I try to purchase my son some shoes, twice to be exact. They have to be returned due to the shoes being fake. I would not spend another dime or waste my time with this company again.","title":"Each time I try to purchase my son some…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Chanell","text":"So beware - I ordered some Jordan 12s \nThe tracking info did not circulate until after the “delivery” so I open the door to an empty box - that was taped back closed - I know my neighbors wouldn’t do that \nSo now I’m tryna figure out - who took the sneakers ( delivery person)  either way - I’m left holding the bag for sneakers I never rcvd \nI’m not sure why a more reputable delivery company wasn’t used - or why a signature was not required \nBut all I know is far fetched - made sure I got my merch \nI should’ve went they them again","title":"So beware","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Reggie","text":"I never Received My Sneakers So My Experience Was Not Good","title":"I never Received My Sneakers So My…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Kati","text":"Tried to cancel my order and it was still sent out. Package says delivered but I still haven’t got it. Emailed support and filled out all the paperwork and have emailed twice since then with no response. Over 700$ just gone.","title":"Tried to cancel my order and it was…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"mie","text":"No options to cancel a misplaced order, only get referred back to sell the product on their site, just a cash grab for them so you have to pay more fees.\nSo is eBay and Amazon and they all still allow for cancellation of placed orders within a period of time.","title":"Excuses for policy","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Charlotte Smith","text":"(For anyone living in the UK, make  sure you read your consumer rights act)\n\nThis is my third time buying from StockX and although the first 2 times were great, this time I am completely disappointed. Bought a pair of Airforces for a friend of mine and the moment I received it , I noticed the shoes had defects. I immediately submitted a case on  StockX as it is the only way to contact them( which I fond ridiculous as the app is not fully functioning). Just got back a reply saying they apologise but the defects are due to mass production! I am sorry but for the fee you charge you better be doing a good job of inspection and if you are super strict on your refund\/ exchange policy. Why do I have to buy a defected shoe? Ps please so not apologise and send an automated reply on how great your are at inspection and  you feel there are acceptable. If it was yourselves buying these trainers you would  of not accepted such condition but somewhat you expect us to pay for poor quality.","title":"Don’t buy from here","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Chris Brown","text":"What a garbage company. Sell nothing but ghetto gear, send insane ammount of spammy emails, and good luck if you want to delete your account. I can't believe their policies are so obnoxious that you have to submit a signed affadavitb through their \"trust center\". I don't even remember creating an account here, and I'm not interested in your ghetto gangbanger products or your spammy emails that I receive daily despite adjusting my notification preferences.","title":"What a garbage company","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Larry","text":"Order got canceled two weeks later.","title":"Order got canceled two weeks later.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Anonymous","text":"Never ever again","title":"Never again","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"customer","text":"No one answers rhe phone or an email. My ordered was canceled.  Just a big mess. Very frustrating!!!!","title":"No one answers rhe phone or an email","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"James","text":"Did not deliver and 0 help from customer service, just took my money and shut my account","title":"Robbed","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Unsatisfied customer","text":"It’s been three weeks. Still no tracking number or information about it. The event I purchased purse for has past. Want a refund asap. No communication from stock x","title":"It’s been three weeks","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Nevek CH","text":"My order was cancelled with no email notification after I waited for 4 days","title":"My order was cancelled with no email…","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Chastity Jazmeen","text":"I still haven't got an update on my shoes. It's been almost three weeks since I order them.","title":"I still haven't got an update on my…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Taylor","text":"Places a order March 20,2022 spent $360. Shoes were shipped to authenticate by March 24,2022. Sent a email on April 1,2022 about them choosing another seller and delay. I check the order status and it says ready for shipping. I attempt to reach out and there’s no one available to help me. I send a email and clearly no response. I have no idea when I’ll be receiving my package. I will not be ordering from this site again. I’m not satisfied with the communication process nor the customer service.","title":"Places a order March 20,2022 spent…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Cj","text":"i odered a pair of shoes and they never got sent and instead of sending me a pair or offereing too instead i got a refund","title":"i odered a pair of shoes and they never…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Lynn  Roberts","text":"Still haven't recie ed my merchandise after 2 weeks of the order. No response from customer service either. Never buying again!","title":"Still haven't recie ed my merchandise…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Santino","text":"Great website. Tons of shoes to pick from and a high diversity of colors, types of shoes, etc. The only bad thing is some shoes are never in stock for my size and if they are, a seller is asking for ridiculous prices. Besides that the only other bad thing about this website is that i get my money refunded quite often when i try to purchase a shoe because it’s never in stock","title":"Great website","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Kimberly","text":"Paid for shoes, never got them. No help from StockX. Beware!! And no phone number to call them. Still no shoes.","title":"Paid for shoes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"JOANNE","text":"Still didn’t get my shoes with no updates as to when.","title":"Still didn’t get my shoes with no update …","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=56&stars=1&stars=2&stars=3"}]