[{"date":"2022-03-31","author":"Wade","text":"I still haven’t even got confirmation about my purchase being authenticated and y’all still have to send it to me still after that. It’s been 2 weeks already and no more updates no nothing..","title":"I still haven’t even got confirmation…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Turk","text":"purchased swatch x omega and good price seller couldn’t fill order so stockx cancelled and refunded.\nThis is crap the fine that is assessed to seller should be given to buyer not stockx","title":"purchased swatch x omega and good price…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Angel","text":"The remote I received seems used. When I shake it it makes a loud noise.","title":"The remote I received seems used","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Rose","text":"Cancel my order and I still haven’t received my refund","title":"Cancel my order and I still haven’t…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Doug","text":"It was an ok experience.  Over seas sellers taking entirely to long to ship. Waited almost 3 weeks for item","title":"Over seas buyer","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Roi","text":"I got my item fast and I like receiving updates. Disappointed though that the box of my rebellionaire is ripped on the side.","title":"I got my item fast and I like receiving…","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Nadine","text":"I ordered a very special pair of sneakers for my son! I was told that my order was returned and my money was… Why? I had the money in my account and it hasn’t been returned yet! Why not just honor my order?","title":"Not Cool!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Rebeca","text":"There was no explanation given why I didn't get my product and I think that kind off discouraged me from using the application again. Too much advertisement too.","title":"There was no explanation given why I…","stars":2,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Dennis","text":"I did not receive my package","title":"I did not receive my package","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Frank Bommer","text":"Size is not a true 9 almost a 10 cant return so now have to try and sell. All reviews say these r true to size","title":"No return policy","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Michael","text":"shoe was damage and took way to long to receive","title":"shoe was damage and took way to long to…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Lupe Fiasco","text":"Once bought a jacket from stockx and when it arrived it wasn’t what I expected so I never wore it. Knowing StockX no return policy I had absolutely no problem with this. However Stockx of course does offer their platform to sell it back via them to another buyer. Now I kept the jacket in the box in its original packaging and never took it out after my first glance at the jacket when I received it. So I sold the jacket via stockx the exact same state I received it even incouding the stockx tag! Now I get the jacket sent back saying the materials were ‘inconsistent” They charged me 15 dollars for this and when I asked them why it was ok for them to sell it to me but not for me to sell it again via them and they didnt reply anymore and are now playing games with my account and not allowing me to buy any other products anymore from their platform. This is horrible service and I hope there will be another provider soon with a similar catalogue for resale goods.","title":"Once bought a jacket from stockx and…","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Bella","text":"I will never order from this site again. I usually order from Flightclub as my boys are sneaker heads. In error I ordered from StockX HUGE MISTAKE . It has been a month and no order. They say seller has 2 days to ship to stockX to be verified weeks later nothing . Then I received an email saying they ran into trouble but got a new seller . Why not give me the option as it had been weeks. OK then I got a tracking number but it was odd because it never showed the seller shipped it to StockX . Then I received an email 2 days ago saying my order was delivered!!!!! This Never happened. I have several emails throughout this entire order all everyone would say is Im sorry and offered 20$ off next order. Who would ever order from them again. We pay higher than retail as it is a 3rd party but to then also have me charged for an item that a month later is still not here!!!! I want my money back now!!!!!!!","title":"I will never order from this site…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"John","text":"Shoe didn't fit. Incredibly narrow. There is no reference of how narrow the shoe is on the website when purchased.","title":"Shoe didn't fit","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Dalton","text":"Took way to long for my sneakers to even be shipped to me. I purchased them on the 18th and they FINALLY are being shipped to me and won’t get here till April.","title":"Took way to long for my sneakers to…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"KaseyM","text":"I am happy with my purchase & feel grateful they are what they described on the site. However, after shopping around a little more I believe this site to price gouge & the “no returns or exchange” was the most nerve wrecking to deal with when spending this type of money. Love the shoes, hate the prices & guidelines.","title":"I am happy with my purchase & feel…pretty lucky my shoes came the way I had hoped.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Mark","text":"Y’all are trash, flightclub do it better. Could have been a great website but y’all dropped the ball and now y’all spam with me crap to my email","title":"Y’all are trash","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Deborah","text":"Shoes were 1 size too small. Very frustrating to return.","title":"Shoes were 1 size too small","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"Sarah","text":"Shoes had marks and appeared to be worn. How that passed inspection is beyond me","title":"waste of money","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"},{"date":"2022-03-31","author":"lawrence","text":"I Got my shoes 1 pair but different manufacturer date on label shoes..left foot 9\/12\/22 and right foot 10\/6\/22 different batches..","title":"I Got my shoes 1 pair but different…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=59&stars=1&stars=2&stars=3"}]