[{"date":"2022-04-07","author":"user","text":"My first order was never delivered, it was too hard to figure out how to get this issue fixed. so I ordered it again and if it doesn't come I will be very very very mad.","title":"My first order was never delivered","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Marc","text":"The price advertized was not the price I ended up with... Conversion ratés, delivery fées... I am Not very pleased with this purchase... I feel lije I thru monétaire away on an Item that is far more cheaper Elsewhere. Regards","title":"The price advertized was not the price…","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Gayla","text":"I’ve placed an order but haven’t received it yet. I was told the week that was supposed to be my delivery week that my item will not be arriving and did not say when it will arrive Still waiting in my son sneakers","title":"I’ve placed an order but haven’t…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Sharon","text":"I have no product to review,  my product says delivered and I've been searching high and low for my package. I have contacted stockX in regards to my missing package and they have failed to helped me locate it or offer a refund, I will no longer do business with this company. Good luck if you're ever missing a package.","title":"I have no product to review","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"A S","text":"I never received my parcel, UPS left it on my driveway, StockX investigated and seem to have dismissed my claim... As a result I am  out of pocket. Now I will have to call my bank. I was hoping StockX could resolve this.","title":"I never received my parcel","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Chanda","text":"Still haven't received the product. It shows delivered but no one even attempted delivery at my house. I reached out to stockx customer service who said they would reach back out to me. I haven't heard anything since we spoke in the live chat days ago. I'm very disappointed in this company. Now I have to figure out how to get my money back!","title":"Still haven't received the product","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Anon","text":"I ordered a gift for my friend on March 20th and now it is 3 weeks later and they haven’t even shipped.","title":"I ordered a gift for my friend on March…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Darryl","text":"This site is terrible description of shoes\nWe’re not correct can’t return policy is impossible to deal with DO NOT use this site for any purchase","title":"This site is terrible description of…","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Philip Capraro","text":"Not fair at all . Seems there are many issues with employees at  the Detroit location. I sent in a brand new shirt In the package , they opened up the package and verified it with foul odor . How ? It’s in the package. CHECK MY ACCOUNT AGAIN ON APRIL 1st I DELIVERED 5 ITEMS TO YOUR COMPANY  THAT SAT IN THE SAME DRAWER HERE TO SELL ALL 4 PASSED EXCEPT 1 THAT WAS IN THE PACKAGE.HOW CAN THAT BE . YOUR COMPANY IS TO ARROGANT TO ADMIT YOU ARE WRONG.","title":"Not fair at all","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Chad","text":"The added fees are wayyyy too high and the bidding process makes zero sense. If you aren’t doing the “buy it now” option then you might as well not try.","title":"The added fees are wayyyy too high and…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Riley","text":"Got charged 3 times then they canceled my order. Support told me they couldn’t do anything. Had to wait a week for pending charges to free up my over-drafted account which was unusable. Ended up finding the $2000 graphics card on the manufacturer’s website a week later for $500 less (msrp of $1495). Maybe I should be happy my first and last shopping experience on StockX went so terribly…","title":"Got charged 3 times then they canceled my order. Support told me they couldn’t do anything. Had to wait a week for pending charges to free up my over-drafted account.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Eve Farrah","text":"I ordered Shoes in a size five uk and they came as a size 3.5 I paid £150 ! Fuming and the best fk!ng bit is I can’t get a bloody refund","title":"I ordered Shoes in a size five uk","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Lucas Kristian Gernsbak","text":"Sold me a pair of shoes with marks and scratches. And support is being arrogant and cant see their mistakes. \nHave bought many shoes from them, but after this im done.","title":"Selling shoes with defects and bad service","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Antonio","text":"I Made a wrong size and now is impossible to Return the shoes","title":"I Made a wrong size and now is…","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Shannon","text":"There is no correspondence regarding my March order. I keep checking and I get no information.","title":"There is no correspondence regarding my…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Jan","text":"I recently purchased a pair of shoes that are what I’ve been told is delayed. I sent an email requesting a new arrival date. As it had been 3 times what I was told it took to have the shoes shipped to stock x to be authenticated. According to my order they have still not arrived to be authenticated and I have no update to my order. As stockx has some kind of tracking on the order I would like to be updated. All I have received is an email saying sorry order is delayed.","title":"I recently purchased a pair of shoes…","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"kelle","text":"Obviously the purchase process is easy when you're willing to just buy right out at the price requested but the instructions for bidding and the procedure for are inconsistent. I repeatedly bid on the same shoes and the site continues to say \"there is a new low ask\/bid\" the prove is still the same.","title":"Obviously the purchase process is easy…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"brandon","text":"It takes too long for my order to come to me and I ordered my shoes in March and now it is April and I'm still waiting on my Jordans","title":"It takes too long for my order to come…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Eduardo","text":"The shipment arrived on time as purchased, however, Customers should be able to update shipping information beflre delivery.","title":"The shipment arrived on time as…","stars":3,"location":"MX","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"},{"date":"2022-04-07","author":"Lashundra","text":"I’ve never received my order on the date I was given and yet still have not received nothing because the order got pushed back. It’s been over a month 😡😡","title":"My order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=48&stars=1&stars=2&stars=3"}]