[{"date":"2022-04-02","author":"Annie","text":"The legos inside the box did not match what was on the box. It was supposed to be the old fishing store, it was a bunch of Mario legos.","title":"The legos inside the box did not match…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Christopher","text":"Shipping is slow and have not received a single update since item was received at verification center","title":"Shipping is slow and have not received…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Joanca","text":"Well my sneakers came with a little stain . The tissue paper that the sneakers are wrapped in was all ripped and ugly . And also there was no tissue paper or cardboard in the inside of the shoe to keep its shape. Next time you guys say something is brand new dont lie be specific and say there were a few try on's or something. Unhappy with this purchase","title":"You guys need to verify correctly","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Harinder","text":"The whole thing around the seller shipping the item to stockx then to me doesn’t make sense stock x should have inventory of the items they are “selling”","title":"Work in progress","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"jenn","text":"the delivery time was horrible, it was delayed like 3 times with updates taking forever. to many charges for a pair of sneakers","title":"the delivery time was horrible","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"L.Holmes","text":"I purchased the new black Foamposites for about $500 the shipping was fast however they were supposed to authenticate these items they failed to do so because they're damaged stock and i refused the whole open up a case for the shoes because they absolutely are aware of the damage on one shoe because they tag the shoes authorized to sale to me i will only shop in regular shoe stores like nike or champs or Dtlr that accept returns and exchanges this mistake wont happen again no im not opening a case its bad business the damage made me question the authenticity of their shoes no thanks!!!","title":"I purchased the new black Foamposites…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Robert","text":"I bought a fear of god sweater for €245,-. After a few days I got a message that you are not sending me the sweater. Reason you gave, was that the purchase wasn’t authorised. I really do not understand this process and I am dissatisfied.","title":"I bought a fear of god sweater for…","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Donnevier","text":"Got my yeezies! It took much longer dan it should have. It took about two weeks or more to arive. But it was worth it!","title":"Got my yeezies!","stars":3,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Jessica","text":"Nothing against the site. However I had 2 orders cancelled because the seller didn’t send out the item..  because the price went up. Kinda defeats the purpose of bidding and getting the best price possible 🤷🏽‍♀️","title":"Nothing against the site","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"FastBatteryCharger","text":"It's a scam basically","title":"It's a scam basically","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-02","author":"Ali","text":"The product was fraudulent. Sockx caught it but it was still a pain to wait through the process only to have it fail.","title":"The product was fraudulent","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Argenis","text":"I was supposed to get my order by yesterday and it hasn't even been authenticated. I'll be leaving to Puerto Rico on the 5th. I bought the shoes to where out there but I'll have my girlfriend retrieve them and send them to me smh...","title":"I was supposed to get my order by…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Caleb","text":"I still have not received my order that I had placed more than a month ago it is fully paid for and everything","title":"I still have not received my order that…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Barbara","text":"We received the sneakers and they didn't fit. Same day we being trying to reach customer service and no answer. We need a return","title":"We received the sneakers and they…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Danielle Cutchlow","text":"Do not buy from Stockx.com.\nI placed an order for some shoes in a size 9 womens. My order confirmation says size 9 womens. I received a size 9 men. Stockx refuses to address the mistake made by the company. They have charged my credit card for the incorrect item, and will not refund me or send my the correct item. They are a horrible company who is openly committing fraud!\n\nI have an order confirmation that shows I purchased a US womens shoe!\nI also have pictures of the shoe being listed as a womens shoe, a picture of how it was changed to list as a mens shoe after my purchase, and then was charged again to list as unisex.\nI purchased the shoe as womens (the original listing), the company changed the description after my order was already placed.\nAlso, it interesting how they won’t respond to my direct emails, but will reply to a review.","title":"Do not buy from Stockx.com.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"lizzy AK","text":"I had used stockX in the past and was happy with my experience. The verification process always seemed to take too long, but I didn't have other complaints. This time I received a link that shows my item coming from Hong Kong, and another from China. I would not have purchased anything from stockX at all had I known the were going to ship me any items from outside the US. I do not shop in other countries and do not want any products from either of those places! The orders are of course non refundable and unable to be canceled or exchanged. I am not happy about this at all. StockX needs to let American consumers know this before purchase! Wish I would have known. No more business from stockX for me!","title":"I had used stockX in the past and was…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Monica","text":"Horrible to purchase from had my order on processing forever! To just be cancelled! Never again","title":"Horrible to purchase from had my order…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"KE","text":"I’ve been waiting for someone to get back to me after I signed an Affidavit. There is no customer service number to call and I went online to talk to the representatives, and one of them were unable to help me. I just want an update and answer on my case.","title":"Poor customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"LW","text":"I am trying to return an item and StockX are ignoring my email until the 14 day window has passed. \n\nDisgusting customer service and treatment.","title":"I am trying to return an item and…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"},{"date":"2022-04-03","author":"Sule Atagoz","text":"Last seven years I have only given two negative reviews to two separate services. I am usually encouraging five star review giver. First time I have used StockX this year in March, 2022. My son wanted to buy a per of air Jordan, he did well this year and earned some cash doing some chores, we ordered them on 22 March and they promptly  arrived 31 March but, our excitement was quickly dampen when we saw it was a child's 13, not adult.  The same day,  I contacted company through their complex website, downloaded item’s pictures, pictures, gave my order number, wrote them Email explaining the mishap.  Three days later,  I get an email, explaining they will not take returns or exchanges or give credit. But, I can sell them. I’m a very busy individual who works 12 hours shifts in a in a healthcare setting. I do not wish to be a shoe salesman as well with my hard earn money. I feel angry and disappointed.  This is a shady business’ practice. I spent $175.52 dollars and my son still needs shoes! I do not wish anyone to be in the situation. The time I spent with my own money to resolve this mess with StockX cost me a lot more than $175.52!!!  As I researched, I went into different website reviews and  noticed that this is a trend with this company. They  have poor 1 1\/2 star rating.  Many are complaining about no exchange refunds etc. some claim products are fake. I will be highly concerned when I’m purchasing from this  seller. Good luck!","title":"Buyer Be Very Careful with StockX!!!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=55&stars=1&stars=2&stars=3"}]