[{"date":"2022-03-24","author":"Jim","text":"Horrible site.  Bull@#$t sellers. Total letdown! My little girl was waiting for her shoes and these as$ h@#$s canceled them twice! Not happy","title":"Horrible site","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Jennifer","text":"Not 100% sure it’s authentic but I don’t want to resell them not knowing.","title":"Not 100% sure it’s authentic but I…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Aod","text":"My order got cancelled 4 times in a row","title":"My order got cancelled 4 times in a row","stars":2,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Kacper","text":"I paid stockx 90€ for a t-shirt, the seller didn't even end up sending it to them, so they returned the money, but currency exchange rate was different than the time i bought it so i lost about 7€ in the process. \nI don't envy people that bought something expensive like Dior's for 1500€ and lost hundreds.\nThis site is a scam! Don't buy.","title":"Currency return scam!","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Dorian","text":"The process takes to long it’s took 11 days to get my merchandise","title":"The process takes to long it’s took 11…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Albeda Murphy","text":"The app is not user friendly. The only way to communicate with customer service is via email or Live Chat. Live Chat provides “answers” that are found in the FAQ which isn’t specific to your situation. Since the consumer is paying more than retail I feel customer service; communication and\/or updates need to improve.","title":"Improve updates on purchases","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Alex","text":"Disgusting Company!!! Blatant thieves,, you could NOT make it up... Mickey Mouse set up.. Tried multiple times to get \"MY\" money from sales,,, almost $500.. Just had e-mail from \"Support\" Claiming reason cannot withdraw because account suspended!!! WDF... Be warned.. Use one the alternatives, plenty out there now tk goodness.","title":"Disgusting Thieving Company!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Jay","text":"Communication is horrible, there’s no way to contact ANYONE & my package says arrived but I still don’t have my shoes!","title":"Communication is horrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"DJ","text":"Super delayed.  Still waiting for the item.","title":"Super delayed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"rick","text":"literally received fake yeezy slides. They say the product is “verified” but I even called the number and the guy hung up with a quickness. After that experience I took it to the customer support and they were absolutely NO HELP, still haven’t even reached back to me about the situation yet. Completely unprofessional and totally disregarded their customer, if I could i’d rate this a 0\/5 stars since this is false advertisement.","title":"literally received fake yeezy slides","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Mark","text":"Overpriced, no returns allowed, merchandise did not even fit. Will not use again","title":"Overpriced","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Christian","text":"I didn’t even get my order","title":"I didn’t even get my order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Janelle Miller","text":"Process takes way too long. No reason for it.\n\nHow long can we use Covid as an excuse for poor communication.  When the order gives an expected date of delivery and that date comes and goes by 10 days with no communication that is not Covid, that is pour communication.  If you cannot handle the work load you have adjust your staffing or adjust the volume of business you conduct. Either way, as a society we have to move past the excuses and find a resolution to problems.  Covid is not the problem.","title":"Process takes way too long","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Seth","text":"L service bro I order 3 pair all got canceled","title":"L service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Jose","text":"The final price changed from the initial price.","title":"The final price changed from the…","stars":1,"location":"CO","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"ZOYA","text":"They AUTHENTICATED some all white nike air max that had light blue tint on the inside like someone wore jeans with them And tried to wash them. Somebody slow ass son of daughter needs to be fired and that Ben person was not helpful at all. Fuqe’ y’all","title":"They AUTHENTICATED some all white nike…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Jason","text":"It literally makes no sense to charge a fee to someone to buy an item when you are already charging one to the person that is selling it. I mean you already made it impossible for people to get what they want without paying an extra hundred","title":"Endless fees","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Nicholas","text":"My order was back up and delivery took longer than expected and I missed the occasion I bought my shoes for but other than that the service was good .","title":"My order was back up and delivery took…","stars":3,"location":"BB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Andy P","text":"These guys have so many glitches in their Australian service, then when you can’t get it shipped due to glitches, the customer service is in American time-zones, is slow and doesn’t respond to your actual question effectively so you run out of time. Then when you step it out and explain to them your problems what you’ve done etc they give you generic messages back not actually addressing what you ask. Terrible app in Australia.\n\nUpdate to above, StockX replies with a generic response saying contact a generic email which is the very department I’ve been dealing with. I expect more of the same but will update this review once I do.\n\nFinal update: Shipping label generated without a label, you get 2 days to ship. I contacted them and they responded 2 days later, sent the label and extended my shipping for 2 days. I shipped it on the morning of the 2nd day. I get a cancellation email 6 hours before my “time was up” item was already shipped. I assume they are operating of their own Timezone not mine which is why another glitch, incorrect cancellation. I contact their support and round and round in circles we go “you didn’t ship in 2 days” generic responses even when I set out above and refer them to prior tickets with my extension. They told me to contact them below, I did, 10 days later, you guessed it, ignored everything I said “you didn’t ship in 2 days”… they have crazy glitches and are built for America, their support is also based there and operate on their time zones. Absolute thieves.","title":"Don’t use in Australia they effectively steal your money with penalties","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"As","text":"The shipping took a bit long but everything else was good","title":"The shipping took a not long but…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=69&stars=1&stars=2&stars=3"}]