[{"date":"2022-04-20","author":"Nikki","text":"I have not received my order after over two months and no one from customer service is responding.","title":"I have not received my order after over…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"Dianne","text":"The shipping of my first shoe payment was sent back because of the authentication being canceled","title":"The shipping of my first shoe payment…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"Isaiah Thompson","text":"I ordered one size however when the order went thru it was 1\/2 smaller with a non refundable policy, from my understanding. So Not Good.","title":"I ordered one size however when the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Cesar","text":"The service was fast and had no issues with the purchase itself. However, the boots I purchased were defective. The issues is inside the boot so you would really have to examine the boots more than just looking at the exterior.","title":"Defective boots","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Nicola ward","text":"very upset i received my sons sneakers today ,only to find out there is no returns urggghhh frustrated ,they will buy back but only 1\/4 of the price \nnever will i shop here again","title":"very upset i received my sons sneakers…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"antoine","text":"I never received an update since i ordered 3weeks ago.was supposed to receive my item between april12 and 19.\nNo news no nothing","title":"I never received an update since i…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Lee Quainton","text":"My Order was processed and ‘on its way’ only to get an email a week later saying order was canceled.\nI lost $15 in the process due to exchange rate.\nHave tried to contact support but have been unsuccessful.","title":"Bad experience","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Anish","text":"F@@k worst service I ordered nike shoes on april 4th and i waited for very long time and on 20th april i got message saying sorry the product is unavailable this is really sh!t from your end i wasted my time compared with other sites the prices are high even though the stockx failed to deliver me the product never gonna recommend or buy from this site again.","title":"F@@k worst service I ordered nike shoes…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Abdel","text":"shoe came with the paper wrapping ripped. QC on shoe is quite awful, can see glue between the midsole and upper, faint scratch on shoe. frayed stitches. Not sure if I would buy from stockx again considering the no return policy.","title":"terrible experience","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"dominic","text":"Package got stolen","title":"Package got stolen","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"kei","text":"processing fee\/delivery fee too too too expensive","title":"processing fee\/delivery fee too too too…","stars":2,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Karyn Rusin","text":"Despite my concerns about ordering from StockX our son reassured us the product would be authenticated and as it was only $100 or so cheaper than ordering from the official Lego store we placed our order (assuming any knockoff would be hundreds of dollars cheaper). Upon delivery our 13 year old son could immediately see the \"authenticated\" Millennium Star Wars lego set we had purchased for his birthday was fake - not a single lego \"logo\" on any of the pieces, instructions marked \"Star Plan\" instead of \"Star Wars\" and packets not labelled. It has taken weeks, many emails, photos from us etc. just to get StockX to agree to take it back and give us a refund - and only after we purchased the \"same\" set directly from the official Lego store and could \"prove\" to StockX what they had sent was fake. Their courier has failed to collect their product today - and they won't give us a refund until they have their product back. Don't deal with this company under any circumstances.","title":"Lego FAKE","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Stevie","text":"I inadvertently ordered two pairs of shoes from Stockx and need to return one pair. I tried to make contact thru email and by phone several times but there was no response. For this reason, I’m hesitant to place anymore orders going forward.","title":"I inadvertently ordered two pairs of…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"David Myers","text":"Order is totally wrong . Wrong size and got a double order of same wrong shoes. Unable to contact anyone at stock x . NEVER ORDER FROM THEM. Total rip off .","title":"Order is totally wrong. NEVER ORDER FROM THEM","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Lucho","text":"No refunds! This is not a normal online shopping platform","title":"No refunds!","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"HAMID","text":"Shoes look  used ,worn, faded ..and the .Bottom of shoes both  look scraped .. like if someone stepped in gum\/Mudd. also the sides are  scratch on both shoes ..  ..","title":"Shoes look  used ,worn","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"G N","text":"unfortunately a very bad buying experience. The order status of the shoe was not changed for 3 weeks. After contacting StockX, they said that the shoe is currently on a small delay and gave me a 20€ voucher for my next purchase. I then asked again if the shoe would come at all or if I should rather cancel it and buy it again. I was assured that the shoe arrives 100%. After 1 week (a total of 4 1\/2 weeks after ordering) the purchase was canceled. \nThen I was sent an email that the shoe is not sent, reason \"\nDue to this setback, outside StockX\" and I was again given he said 20€ voucher. \n\nWaiting over a month, being assured several times that the shoe will come 100% (while the price continues to rise).\nWill not complain unnecessarily, but the next time I think 2 times whether I really want to buy a sneaker through stockX","title":"unfortunately a very bad buying…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"NNay","text":"I never got my package:( I am so sad and upset. It was literally my last dollar I spent on this gift.","title":"I never got my package:( I am so sad…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Chris","text":"I bought a ps5 for basically the base price and the order got canceled after waiting for a week of review. I’m over it now, because it’s my fault for trusting this website.","title":"I bought a ps5 for basically the base…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Max","text":"Order 35772889-35672648.\n\nWhen I opened the box I noticed an extraordinary amount of glue on the right shoe. The left shoe had StockX and Nike labels, while the right one did not. \n\nI thought about contacting support about the lousy quality of the right shoe. But after reading about the company’s support experience, I realized that it is not likely that my concern will be addressed. So I figured that I can go with those glue stains even though they were way too bad for a factory defect. So even though I had a suspicion that one of the shoes was fake, I kept them. \n\nI removed the tags. After I had worn shoes once for an hour, my suspicions that one shoe is fake got solid. There was disproportionate leather wear on the right shoe. After one walk it was too much. So now I am confident that StockX sent me the original left shoe and the counterfeit right one. \n\nI feel that this company will not help me with this situation for a couple of reasons. One, is I got to shoes one week after they were delivered. I was out of the house for a spring break, but StockX does not care since they leave only three business days for concerns. Two, I removed the StockX tag. It does not change the situation at all since the tag was only attached to the left shoe, which I have no concerns about. Three, their reputation for resolving issues suffers. \n\nI will probably never wear these shoes. I am disappointed that I have wasted $200 on something that does not meet not my expectations but fundamental integrity. \n\nI contacted support about this but do not expect my issue to be resolved. I have a friend running the sneaker youtube channel. I will get to him with this story if StockX does not provide an adequate solution by the end of the week. I am sure that people deserve to know how this company runs the business.","title":"That was my first and probably the last experience with StockX.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=29&stars=1&stars=2&stars=3"}]