[{"date":"2022-03-11","author":"CMD","text":"Sneaker quality inspection is a scam!  Don't buy or you will be stuck. \n\nI ordered a pair of sneakers from StockX for my wife.  StockX verified them and shipped them to me. My wife tried them on for 2 minutes inside.  They weren't comfortable so I listed them on StockX.    Someone purchased them from me so I shipped them back to StockX.  StockX said the condition was not up to their standards.  REDICULOUS since they are in exact condition that they approved when I bought them.  Now I am stuck with $300 shoes.  DON'T BE A FOOL.  They sent me pictures of their current review but couldn't produce the pictures of the original review when I bought them.\n-----------------\nAdding additional comments after StockX's response.   You can see StockX's response is vague and generalized, does not address specifics of my issue, and then put's the onus on me to contact them again after I've contact them about six directly.  They have no intent to resolve this.  They hope you think the issue ultimately gets resolved but it hasn't and I have no faith in StockX to do the right thing.\n\n----UPDATE---\nIt's now almost two months later and StockX is holding my shoes hostage.  They have neither paid me nor returned the shoes to me.  I highly recommend buying and selling sneakers elsewhere.","title":"Sneaker inspection is high risk gamble","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-11","author":"Lindsey Gannaway","text":"Do not trust this business.\n\nI placed an order, then asked a question about the shipment of the order via customer service email.  They then cancelled my order for no reason, stating it was for my protection.  They said I could re-place the order online, but now the prices available are much higher.\n\nComplete scam.","title":"Do not trust this business.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"Al Royster","text":"I bought a pair of Jordan 3 Retro Fire Red (2007)from Stockx and within two weeks the base of the shoes began to peel. I am very disappointed and will never use Stockx again","title":"I bought a pair of Jordan 3 Retro Fire…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"brynn","text":"stockx used to be the most trustworthy site for buying sought after items shoes clothes etc, but recently they get so much volume that i’m sure none of the lower priced items (under 1k) are actually reviewed. you have been warned","title":"stockx fell off","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-12","author":"Henry Asare","text":"Stock x refused to refund me due to my vulnerability as an orphan, i ordered shoes and i got an empty box which was very weird, i then email them and sent them proof such as photos,etc. they told me they will help me but i need to send my ID first through a link, i then went ahead and verified my ID, please tell me why they got back to me saying am 17 and i need to upload pictures of my parents ID, Unfortunately for me i lost both my parents in a car accident so I got my order brother to to verify it for me. I explained this to them and that, they didnt even have to let me clarify that because it just brings back bad memories, AFTER all this they refused to refund me my money and told me until they can tie profile of me parents (who are not alive), they refuse to refund me, Am 17. And i saved a lot for this shoe which i never got, please think twice before you shop from these people, it was my first time, but they already out me through enough stress and pain. My order number was crm:03230001322 and my order number was Order number: 33077768-32977527.\n\nI really regret buying here and i never wished i did, sometimes i feel like if my parents were alive, stuff like this would never happen","title":"Stock x refused to refund me due to my vulnerability as an orphan","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"customer","text":"StockX is doing lousy business\n\nThey do not accept refunds no matter what. Their refund policy is misleading. You only get the \"real\" policy sent to you after they will take you through the entire process to submit the claim. Customer service is a bot. There are no live representatives. And you are forced to sell it back with them, and the other customer who buys it will have the same issue—lousy business. \n\nI received sneakers that are not true to size.","title":"StockX is doing lousy business","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"Safou Benz","text":"I am in the process of opening fraud claim against them \nThey send me a shoes but the driver wasn’t able to deliver so it was returned to them \nThe minute they received it they ignored all my emails customers care no response \nIs been a week I haven’t go neither my shoes or money absolutely a fraud that you wouldn’t expect from this company \nTill this moment still waiting for them to respond to the ten emails but nothing","title":"…fraud fraud fraud","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-13","author":"Intangible","text":"I had successfully completed 16 sales on StockX before my most recent (and final) transaction with them. I shipped them a pair of Jordan 4 OREO's ($550USD), and UPS lost the package somewhere along the line. UPS then sent StockX an approved lost package claim email TWICE.\n\nI then asked StockX to respond to the claim, and to forward me the compensation amount. After going back and forth with email 'support' in 15+ emails, StockX is now denying working with UPS, or their lost package claim process. What??\n\nI am now out a pair of expensive Jordans, as they are pretending there's nothing they can do. Never thought I'd post on one of these sites, but this horribly lazy and nonsensical business practice brought it out of me.","title":"Started out fine...never again.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"Paul Reeves","text":"I order a pair of Air force 1's from Stock X, they elected UPS to deliver the package on a certain day. I rescheduled and UPS still delivered on the original say I was away for a week the package was lost. UPS admitted liability and have sent Stock the claims form 4 times. For weeks I have been asking Stock X to complete the paperwork and it hasn't been done. Stock X keeping referring to DLH its not it's UPS. All I want is the money back from UPS why won't Stock X help!!","title":"Poor customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"vadim zt","text":"Hello, money does not come 5 days have passed since the return.","title":"money doesn't come","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"Katie's & Dorina's Life","text":"The first time I ordered from StockEx it was the retro fours … I received the box and there was no sneakers  it .. I keep emailing stockx for my claim and they keep emailing me saying that they cannot understand the paperwork I just want my money back","title":"The first time I ordered from StockEx…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-14","author":"Tone ROD","text":"STOCK X is the worst with those possessing fees and everything else they add on!!","title":"STOCK X is the worst with those…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Don't Care","text":"I recently ordered a Nvidia 3090 FE(very expensive GPU) from stockx, and it came dead. Fans spin but no power being drawn and no image on the monitor. So I told myself its probably a dud from the factory, I could probably return it. To my surprise I could not return it and now I'm stuck with a dead GPU and thousands of dollars lost.","title":"Received a Dead GPU","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Jesse","text":"I bought a PlayStation 5 game that had a digital code to play the game that I can’t redeem because they’re US codes and I’m in Australia. When I was on the product page it says nothing about it being from the US or that I needed to be in the US to redeem it. So I’ve now wasted money on something I can’t play and I can’t even report it on the actual site so here I am.","title":"Never Using This Site Again","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-15","author":"Rim Mini","text":"Lots of hidden fees! First sale on stockx. Quick sale, but I in the end they transferred even less than promised ... without any explanation. \nVery disappointing. \n\nMy transaction code: 34688746-34588505","title":"Rip Off","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"DJ","text":"Zero customer service.  I ordered shoes that did not arrive on time.  I \"tried\" to contact StockX through the website but no one ever responds.  It has been 2 weeks and still no one has responded to any of the emails I have sent.  When you've spent hundreds of dollars and a company has no customer service in return, I would stay away from this company\n\nUpdate Mar 16, 2022: I received a generic response from StockX (here) to contact them by the same means I tried to contact them with no response from them previously.","title":"Zero customer service","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"Sergio","text":"Put in a bid for a pack of cards for $115 plus fees. A seller accepted the bid and I was immediately charged $143.33. Which was fine. According to their website and emails I received after my order went through the sellers have 2 business days to ship your item to StockX. My order went through on a Thursday. 2 business days meant that the seller had until the end of the day on Monday to ship my order out. I sent them a message on Tuesday asking why the seller never shipped my order. I was told they were giving the seller until midnight on Tuesday. (An extra day) The seller still did not ship my order and now I have to wait 3-7 business days for them to refund me my money. They are very strict about buyers not being allowed to cancel an order. However it appears sellers can take an order on have the money taken from your account and then just decide they don’t want to sell it anymore?!?","title":"Buyers are not the priority","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"David Williamson","text":"Stockx is a horrible company! They will not work with you if an item is lost and when it is their responsibility to file a claim with FedEx. They don’t provide customer service except to automated chat services. I would not sell or buy items from them ever again!\n\nResponse to the Auto Response below:\nStockx is really great at putting up responses on this platform…..it is interesting that you cannot speak to a customer service agent (nor was a number provided to resolve the issue even in the response below - just a link to a chat service where they don’t respond.) However, they found a way to respond here in less then an hour. That folks is their priority….The goal seems to be to take the money and not work to help or resolve issues to the customer (which are impossible to avoid) and supply any semblance of CS. This response below is nothing more then a smoke screen. The package did not come directly from the seller it goes through Stockx. So if the package is lost the only person who can file a claim to resolve the issue is Stockx. If you can’t reach Stockx they can’t file a claim. In my case Stockx knows I cannot file a claim from my end (hence the smoke screen.) However, with all the Mombo jumbo there is never an offer to file a claim, resend the merchandise or return the money back with the feedback provided below. That is why I will never, ever do busy with the company again….. Horrible is the term I think I used……I STAND BY THAT STATEMENT!","title":"Stockx is a horrible company","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"},{"date":"2022-03-16","author":"Byron Lopez","text":"I’m new to stock x and is it a scam?","title":"I’m new to stock x and is it a scam","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=75&stars=1&stars=2&stars=3"}]