[{"date":"2021-12-01","author":"Giannis Kazianis","text":"Probably one of the worst platforms that a person could use....\nI told them that I am diagnosed with covid-19 and that I can not ship my item and they said that I will be charged with 15% and\/or a permanent ban! \nR I D I CU L O U S !!!  I've been a memeber with them since 2017 and never have I ever done such a thing. They have asked me to put my health at risk just for them to make moeny. They do not take into account their customers and this is bad business and bad customer service from their end. I know several people that have canceled sales for no reason and did not have any pentalities. I've provided medical test proving that I cannot ship and all I got from them was \" sorry you will get charged 15% on the sale price\". \nCustomers do not forget!","title":"Probably one of the worst platforms…","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-01","author":"Aaron Thomas","text":"Truly horrible. Bought some Jordan 1 Electro Oranges and they came with a scuff and a stain. As they didn’t respond to my email on my complaint, I decided to resell them. When I resold them, they were flagged as stained and they cancelled my resale, even though they authenticated when they bought it the first time. I’m telling you right now, don’t ever shop with them. Their website charged me three times and luckily my bank got involved for them and refunded me once but I got 2 pairs. As I tried to resell the second pair, they kept making more and more excuses whenever I complained, how they didn’t get any emails from me, and they kept saying how much they felt bad and they couldn’t do anything!! Yes you could, you could refund it or get me a new pair or at least some sort of code or credit. Instead they just decided to time waste and keep talking about their so called “deadstock” trainers. Their customer service is absolutely shocking and they don’t have a proper phone line to contact, you have to email them and they take ages to reply. Save your money and buy off Goat, Ebay Authorised or Laced instead! Stay Clear","title":"Scammed! Do not buy from here!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-01","author":"Isaiah Ogunleye","text":"Duck this shiz company man how can I place my order for some trainers for them to tell me that there’s a glitch in there system and that the payment failed. This made my bank, hold onto the money for a week, unless stock x themselves help me out. All what they had to do is tell my bank that the transaction had failed to release the funds earlier. I emailed them multiple times telling them that and they did NOT help what so ever. Keeping in mind that this wasn’t my fault to begin with. \nDuck stock x no one buy from here it’s a waist of time energy and money I put my heart on it. If this is your first time again don’t bother these lot are bricks. Shiz company you would think that they would have enough money but now to make physical shop that you can go into, but when your staff is mad how do you expect to do any of that kmt broke dogs. \n\nPs trustpilot is an enemy of progress for not allowing to really stick it on these stock x yutes. Had to change up a FEW WORDS because it contains language they don’t like SHUT THE FRONT DOOR!!!!!","title":"Duck this shiz company man how can I…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-01","author":"Deborah Smith","text":"I ordered a pair of Jordan 1 High Dior for my daughter's Christmas present on the 19th November. I received an email to say they had  been shipped on the 20th. These have not arrived yet. I emailed on the 29th and 30th November but no reply. Thinking this might be a scam.","title":"No trainers yet!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-01","author":"CrazyIPairsoft","text":"Such a terrible experience dealing with StockX. I sold a pair of sneakers and shipped them out before the deadline providing the relevant shipping info, because THEY couldn't find the package they cancelled my order and then received them the following day! They shipped them back the following day however I never received a refund for the cost of shipping them, Awful customer service that wasn't helpful at all, clearly could barely speak english. I will never use stock x again, Grailed on the other hand is great, I have over a dozen sales on their and atleast their helpful and don't charge extortionate selling fees. DO NOT USE STOCKX!!","title":"Never got refunded for their error","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-02","author":"Ilia Azani","text":"I ordered a shoes about 2 weeks ago and I have recently moved to a new place and during the processing when I wanted to change the shipment information, it did not let me to do it.\nI changed the shipping information on my portfolio and hoped it worked, but did not. I could not find any contact information on the websit to solve the problem. \nI have not received my order and the UPS said they shipped back to the seller.\nHere the only place I can write to solve my problem.","title":"I ordered a shoes about 2 weeks ago and…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-02","author":"Jessica Davis","text":"I have bought about 6 pairs of shoes for my 2 teenagers over the past year. Today I received a pair I bought my 15 yo daughter for Christmas and they smell like weed. Not like a faint smell, like I checked to make sure someone didn’t leave a bag in there. Not impressed.","title":"Smells like weed 🙄","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-03","author":"bbdk","text":"I've never met such a badass customer service system before... I reveived totally wrong items and claimed them via chat. Which was 2 days after the receive. And they said its too late and could do nothing for this. Fisrt, its your fault to pass the wrong items. Can't you read style number? How come you guys misuderstood the numbers and letters? And you don't give a shxx to customers because 2 days are too late to claim a refund? Such a shxx policy and customer service","title":"No refund for the wrong item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-03","author":"Lynsey","text":"Ordered neon 95 trainers for my sons birthday today 4 weeks ago and still haven’t received them. I have emailed them asking for a full refund and been completely ignored. I would appreciate an update. Shocking communication and scamming single patents sadly at such a stressful time of the year.\n\n\n\nSeen your pathetic reply.. as a company you shouldn’t be making promises to customers and quickly taking their money! My bank has kindly refunded me my money today and I would never use this site again.","title":"Ordered neon 95 trainers for my sons…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-04","author":"customer","text":"I ordered the new xbox series x for my son at an inflated price of £607 which I was willing to pay to get it for Xmas. I paid by PayPal and then noticed I had been charged for 2. I've contacted them and they said I ordered 2 and 2 have been delivered but I only need 1. they have came with a receipt in dollars. Because they said they won't take it back I tried to sell it on Facebook sites but no-one will believe me and are calling me allsorts of names and of trying to scam people. what happens if it breaks and what will I do with the one I didn't want and have paid for. they don't want to know. I thought I was buying from a shop called stock x and had no idea what went on. don't go near this company and I'm contacting trading standards and watchdog about them...... just read their reply to my review and basically like they have done with everyone else is said we are sorry and not interested. shopping with these people has made me ill and I'm now out of pocket over £600 which I cannot afford. shop somewhere else. I do not know how on earth I got told this shop is not fake when I checked them out. this isn't right what they are doing to people.","title":"I ordered the new xbox series x for my…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-04","author":"Lauren ","text":"I received sneakers that were CLEARLY worn before they were sent to me. When I reached out to customer service, they asked for photograph proof. I sent 10 of all of the signs that they were clearly worn and did not even get a response for days. Once I finally received an email from them, they merely said that they never received any proof and that I was to pay for my own label to return them and await determination from their team. This process went on for almost an entire month and still never reached a resolution. Will never buy from them again.","title":"Sent me used sneakers","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-04","author":"sandra moreno","text":"If I could give zero stars I would. I was double charged for an order of shoes, this site clearly has a glitch and the company refuses to correct so they can scam customers. I reached out to them regarding this issue and instead of correcting the situation, they give the same idiotic response that I can turn and resell for a profit. Instead I reached out to my bank to dispute the double charges, you can see the charges were made within 6 seconds of each other. I suggest if you have been double charged by this company to dispute with your credit card company or bank company, especially when they see the charges are duplicated.","title":"Duplicate charge, customer service not willing to correct issue","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-05","author":"Neamh gilligan","text":"I ordered a pair of Black and White Dunk lows for a Christmas present in size UK11 and StockX sent me a pair of size UK8.5s in a size 11 box. The label inside the shoes clearly does not match. How did this even pass authentication? As someone who has sold many shoes through the site with no problem, I thought the authentication system was better than this. This is my first purchase through the site and most likely my last, which is upsetting as I still need these shoes as a Christmas present so will have to try purchase from GOAT. Currently in contact with customer support to arrange a refund but I’m not hopeful this will be resolved after reading some of these reviews.","title":"Sent wrong item","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-05","author":"User","text":"Horrible company to work for horrible management terrible atmosphere and a very uncomfortable place to work. You arent taken seriously and they dont care about your wellbeing. This company is the worse than amazon","title":"Horrible company to work for horrible…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-05","author":"richard fish","text":"Stock X haven’t paid my son!!!! Been over 6 weeks!!!\nOn the 13th of October my son sold 2 items. 1 pair of shoes being Jordan 1 pollens and a 5 panel Arabic logo Supreme hat, despite not being paid (as sometimes they do take longer) on the 21st  October my son sold another item to them being, a True religion Supreme Beanie hat. This now totalled 3 items totalling £237.28. Time went past and after realising the money wasn’t coming through on the 27th October my son raised a dispute with Stock X via an email.\nAfter weeks of back and forth with my son constantly been passed from one department to another within Stock X the issue was finally found. They told us the issue was with something that needed to be verified on the account. So again, we are left waiting but progress finally had seemed to have been made. After this verification, unknowingly my son had been flagged as an underage seller. Weeks of more battling pursued by my son and on instruction from Mary at Stock X we changed the account name and title to his mothers to reflect an adult or legal guardian. However even after verification of the new account in his mother’s name the payment still never came through.\nThis is now the 5 December 2021. My son\/His mother are owed £237.28. He is incredibly distressed about this as I’m sure we can all appreciate this is a lot of money to anyone especially a 17 year old still at school. I am now growing incredibly frustrated by Stock X’s lack of customer care and reluctance to pay us. They had these items and I guess have now profited from them. Whilst my son is still waiting to be paid. \nI am concerned that he now isn’t going to get paid and I want answers?","title":"Stock X haven’t paid my son!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-05","author":"Γιάννης Χριστοφορίδης","text":"3 months ago ι  bought a pair of jordan air 1 low.\nThe package arrived in acceptable time. After 3 weeks the shoes show a ware far beyond normal. I communicate with stockx and they told me that they can't help me with the return, and they can't bring me in touch with the seller to sort this out. When i told them i will go to the bank to get help they told me that \"Stockx has zero tolerance for disputes,and in that case the system automatically suspends the accounts\". ????\nI strongly believe that they have no professional attitude what so ever. Even more i doubt the authenticity of the products sold in Stockx.\nStay away or buy out you own risk.","title":"Stay Away","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-06","author":"Chris","text":"When I’m a buyer Service is excellent ,but when Im a seller Transaction fee is too high for us. If u can adjust the rate is better for all seller and buyer.","title":"Transaction fee is too high","stars":3,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-06","author":"Brandon B","text":"I’m not someone who writes reviews very often, but due to my most recent experience I feel that I have to. I purchased a pair of Nike Dunk Lows for $613.00. When I opened the package someone had swapped the shoes that I ordered out for a pair of used Nike Prestos that were in really bad shape. I reported this immediately and decided to file a claim. \n\nAfter I filed the claim I signed the affidavit and verified my identity etc. But it’s been 2 months since I filed my claim and StockX support has not provided updates, adequate support, or responded to my emails. I’ve bought many products through StockX with no problems, but the moment I had an issue they did not make an effort to make it right. I’ve deleted the app and will never use StockX again. My confidence in this company is gone. Awful customer service. Wasted $613.00. If you’re reading this, please shop with caution especially during the holidays.","title":"I will never use StockX again.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-06","author":"Mrs Sarah Chandler","text":"I have had 3 transactions with stockX 1st I do question if they are fake (took 4 weeks to arrive) 2nd arrived in 3 days\n\n3RD bought and paid for trainers for christmas but I hadn't had an update from stockX so emailed to see if they had been shipped only to be told no the buyer isn't selling them... Really!\n\n|So if I had not contacted then=m then I would have never known stockx shall we match you with another supplier or credit - asked to be matched 2 secs later get an email to say I had been refunded monies now stuck in the banking system for 3-5 days.\n\nDid me a favour really if your looking for trainers Go To: KICK GAME have a physical shop a good returns policy and cheaper than stock X with a 3 day delivery time","title":"I have had 3 transactions with stockX…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"},{"date":"2021-12-06","author":"Carvley Stulla Mcdonald","text":"This place  call stockx  iits the worst platform  to do business with,i have heard people  talk about them but  after  dealing with them over a 1 year period. \nI can truly say its the worst, I tell why\nCustomer service is absolutely worst as if they are program to say the same thing over and over again.  They take upto a week to respond to your emails. \n2) I spend 60k within  1 year buying shoes I was giving a lower shipping  fee because of the volume I bought.  November they hike up the shipping fees without  notifing me about  shipping increases \n3( they will accept  your bids and there policy is they will try to match you will a next seller.  You would think they would  hold your money for gods knows how long and give you some lame excuses about  item didn't make it tru the process when the item was never shipped.  You also get that story  when item  claim its in transit.  After  60k I can say there is better place to spend your money stockx aint it","title":"This place  call stockx  iits the worst…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=91&stars=1&stars=2&stars=3"}]