[{"date":"2022-01-18","author":"Andrea Fields","text":"I do not understand no return policy.  I wasted $149 dollars on a pair of sneakers I cannot wear.","title":"I do not understand no return policy","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-18","author":"Rodney Dangerfield","text":"StockX is a platform for scammers. They provide the greatest place to sell counterfeit collectables, while calling it a service that protects from counterfeits. I ordered two sealed Pokemon products. I took video of me opening the package and photos of the obvious opening and resealing of the product that occurred from the seller. I reported it to stockX with photo proof. They offered me a tiny $20 promo for my trouble and refuse to refund the money. Are you kidding??? The whole premise of your platform is a lie. You cannot deliver the service you are promising and you don't provide any guarantees to the purchaser for even a refund when you mess up. What is your service for then??? Even eBay provides a money back guarantee. You are taking advantage of people, getting a cut of the sale for simply putting a sticker on everything (which often damages sealed products) and passing it through a warehouse not actually inspecting it at all. To top it off, they packed it loosely in the box and it was damaged in shipping, further rendering it worthless. I am happy to provide photos and video.","title":"StockX is the perfect platform for scammers","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-18","author":"Ibeth Canas","text":"Horrible they said they have a personal specialized in authentication  the shoes i order for my son where fake and i pay $385 they even not  had the original soles . Very disappointing . Is hard to reach costumer service.  Never i will purchase again","title":"Horrible they said they have a personal…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-19","author":"Yvette","text":"I was browsing different Jordans for my son and checking the final check out price.   I ended up getting charged for the same shoe twice that I did not want to purchase.  I immediately tried emailing them and calling them.  The phone number just leads me to a busy signal over and over again.  I emailed them and recieve an automated email that just leads me to their website.  I had to dispute the purchases with Pay Pal since I can't get ahold of them.\n\nUpdate:  I did end up receiving an email from StockX and Pay Pal and did receive a one time only refund.  This really made my day.","title":"I was browsing different Jordans for my…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-20","author":"Kerty Operty","text":"The site is a great place at least in my experience of getting shoes at a bit of a discount, but the shipping cost is a bit high $14 in the U.S. and after shipping and other fees and tax you could be paying $20-$40 extra, if shipping was cheaper Id probably give it 5 stars","title":"Great Service but...","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-20","author":"claire carver","text":"What I don't understand us how can you not get a refund. I ordered a size 6W and got a size 6. How is that my fault that the wrong size was sent when it was plainly stated on the website it was a size 6W. I finally got my shoes today and definitely do not fit and I can't return them??? What kind of crap is that??? Stockx sucks and no one should buy from a company that will not offer a refund.","title":"What I don't understand us how can you…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-20","author":"jennifer r","text":"I ordered a concert T-shirt on the site that was supposed to be brand new. When I received it the original shirt tag was cut off. I sent pictures and filed a case about it to find out why. I had two different representatives email me to say they were sending the info to their senior advisors, but nothing after that. \nI spent $78 on this stupid shirt and don’t even think it’s the real deal. Just be careful what you buy, don’t waste your money! I would’ve never bought the shirt but it was a gift for my daughter-in-law, something she really wanted!\nUpdate after response, I tried contacting stockx at least 3 times and no one actually got back to me after the superior was supposed to take a look at my case. I really just wanted to know, why was the tag cut off? To me it seems like a way to use a cheap shirt to make one that you’re going to sell as authentic","title":"I ordered a concert T-shirt on the site…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-20","author":"Gavin Suarino","text":"You charged the credit card account twice when I bought one and now I can’t return the ****** shoes","title":"You charged the credit card account…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-21","author":"Ang Brewer","text":"I ordered a pair of 40 below boots for $500. Never received my shoes. The order number doesn’t work and you can’t even find my order. I will be reporting stock x. You guys are a rip off","title":"I ordered a pair of 40 below boots for…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-21","author":"Kabosh","text":"The item I received had been originally opened and resealed but still verified as legit from stockx.\nThe items inside were mostly present but had been opened thus breaching the integrity of the box.\nStockx reply was 'unless you have a video of the unboxing there is nothing we can do' unfortunately I'm not a YouTuber and obviously don't have this footage. \nAbsolutely ridiculous repsonse, enjoy the charge back claim","title":"The item I received had been originally…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-21","author":"Corperationtaxation","text":"DO NOT BUY FROM THIS WEBSITE!! \n\nvery thankful I put my cvc details in wrong as I was charged prior to actually confirming the purchase!! After seeing the TERRIBLE reviews I can only count my blessings 🙏🏻\n\nI Do plenty (aka way too much) online shopping and this website has all the hallmarks of a scam site. Constantly changing prices go back and Forth, going up substantially if on the website for some time and returning to the original if you reopen on a new tab. \n\nI WAS CHARGED PRIOR TO CONFIRMING ORDER!! \n \npeople in the reviews have also stated a pattern of \n\nA) double purchasing - again not done by you but by the website on your unwarranted behalf.\n\nB) Bad to VERY BAD customer service - almost like they don’t want to pick up? Once you manage to contact them they still are not much help as no refund, swap or return can or will be facilitated.\n\nC) ITEMS DO NOT MATCH DESCRIPTION \n\nafter reading many reviews on several platforms, this has stuck out pretty substantially. Remember NO RETURNS - aka if your sent a stagnant box of fermented sh*teit’s yours forever unless you resell back to them at a discounted price allowing the vehement cycle to continue. it’s laughable.\n\nWhoever is in charge of this operation is a genuine scammer and probably has more insidious working going on under the veil of this scheme also. \n\nSO I BEG. DO NOT!!! DO NOT!! GIVE THIS COMPANY OR ANY AFFILIATED COMPANY YOUR CREDIT\/DEBIT CARD DETAILS!! \n\nmany blessings to you and yoursx \n\nEqually, To whomever\/ heads this scheme - My only hope is that you get to reap what youv sowen and that youv not soley sowen insidious seeds.","title":"DO NOT BUY FROM THIS WEBSITE!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-21","author":"natalie rush","text":"Do NOT shop with Stockx! I ordered a pair of Nike Blazers and the seller mis-advertised the shoe for sale. I have in writing that Stockx would accept the return for a refund based on the circumstances. They even issued me a return shipping label. I shipped the item back only to have it arrive back at my door a week later in a destroyed box! Stockx refused the return and now claims they never agreed to accept the return. I have everything in writing. THE WORST. They lie.","title":"Do NOT shop with Stockx","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-22","author":"Antione Mitchell","text":"Please do not spend your money with this company and be very cautious of what you do they say they are authenticate shoes but they clearly do not know what real shoes are. They sold me fake shoes and won't refund my money","title":"Please do not spend your money with…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-23","author":"bodydelightsnj","text":"Why isn't there a No star rating?!  I was informed the 40 Below Timberland boots were out and I was all over it.  I purchased them and couldn't wait to get them.  \n\nNow I wish I would've never ordered from you guys!  Why say you go through and entire inspection process before you ship them out when that's an outright lie!  When I opened the box, I immediately saw scuffs on both of the boots!  The box you put them in is in great shape; good enough to wear the box if it fit me and I had another box for the other foot.  smh.  I'm saying this so you won't be able to blame UPS....again, the box was in pristine condition.\n\nDon't tell me you inspected these when you didn't. I NEVER had an issue with Timberland merchandise in my life. You guys absolutely either 1) sold me a pair of USED Timberland boots that you were wanting to finally get rid of 2) have a crappy inspection team 3) all of the above.\n\nThen to find out, after the fact, you state you don't take refunds or make exchanges.  I placed the bid, didn't hesitate on the price of $400 yet you sent me used boots?  You know I'm pissed when I'm a guy that NEVER EVER leaves bad reviews on a computer.  I prefer calling and talking or going to a store to figure things out... but you guys are so terrified of backlash... do the right thing!  THINK about it, after noticing the reviews you have a 51% to 30% Love \/ hate company.  That's a pretty bad ratio!  GIVE ME my $ back or unused boots.  I rather have the boots...  AND YES, I took pictures etc. sent them to you guys to have that bs email stating you guys don't respond to emails...\n\n\nTo answer your reply.... STOP LYING!  AND this is, in all likelihood, a \"cookie cutter\" response.  Again, STOP LYING!  YOU DID NOT inspect the product.  If you did, I would not have gotten scuffed up boots.  Cut it out.  Take the L.","title":"Why isn't there a No star rating?","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-23","author":"Enrique Dobles","text":"This is the worse place to buy sneakers I’ve should’ve just stuck to goat. I ordered shoes over three weeks ago and it’s being delayed cuz they can’t find my adress. Not only does Stockx have a terrible help center but no phone number. I told them my situation and they didn’t even call FedEx he just read me my tracking which haven’t changed in 5 days !!! When I asked FedEx if I could just pick it up they replied Stockx has restrictions on all the shoes so you can’t even go pick it up unless they call FedEx them self. Worst experience ever first and only time using Stockx","title":"This is the worse place to buy sneakers…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-24","author":"Alison","text":"Do not sell through this company. They rejected the pristine Air Jordans I  received directly from Nike as imperfect and although they said they’d send them back, it’s been a week and nothing.\n\nUpdate: The shoes finally came back after almost 2 weeks but the inside wrapping was totally ripped. I will never sell through them again","title":"Do not sell through this company","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-25","author":"Leon Johnson","text":"I’m sure when it works it works, for me unfortunately stockx has come up more than short, bought a ps5 for a birthday present for my son. Inspections must be non existent because not only was it missing a pad but also had water damage. £267 it has cost me to get repaired. Now stockx are trying to offer me discount codes and not reply to emails. Absolutely disgusted. will never use again. Don’t wanna see the copy and paste reply to this from stockx either. Don’t tell me to email when I’ve been contacting all day and been given the run around with no resolution to the problem\n\nUpdate: stockx replied to my review asking for more details, only to not follow up on that aswel. As of this time I’ve emailed 7 times with no reply. Supplied a repair receipt, and still nothing. Absolute joke!!!!!","title":"I’m sure when it works it works","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-25","author":"Josh P","text":"They sold fake Pokémon cards, and refuse to refund nor admit they’re fake after I’ve had several 3rd party unbiased companies review it. Not to mention they’re clearly fake to any true collector.\n(Look at my profile photo for example of their cheap fake).\n\nSee direct quote from Stock X regarding my concerns about their fraudulence. \n“Every country has its own design for Pokemon cards as are the Chinese edition. To provide some insight on the creation of Chinese and Japanese cards they are manufactured in this format, not the way the US makes their cards that if you rip a US card you can see a black lining in between the layers. Now what is special with these cards is that they are foiled so when ripping into these cards this is the outcome. These are 100% authentic.”………\n\n It’s amazing what this company can accomplish with their own biased “professionals”. I’ve now had no other option but file a complaint with the attorney general in Michigan and engage Stock X’s legal team. \n\nI suggest you all be aware of the hassle you’ll encounter with this company. I’ll update this post after response from their legal team.\n\nI’m an avid collector and have been collecting since Pokémon was released in the 90’s…. All this company did was slap an “authentic” sticker on the box and ship it out.    It’s failed the light test and openly transparent.. It’s a single piece of paper with printed images and doesn’t have the black gum-paper between the card. BUT APPARENTLY THIS IS DUE TO THEIR QUOTE ABOVE…. Funny isn’t is? \n\n\nDon’t use this company. I’m trying to protect others from the same scam and will take them to court, not for a refund, but for them to investigate all other sales\/trades they’ve made to unknowing consumers because they don’t care who they scam.  \n\nAny avid collectors? Let me show you what they’re selling.\nPlease, ask me for any evidence you need! I have emails from them to prove it.\n\nAND, in case you weren’t aware- it’s a federal offense to knowingly sell counterfeit\/fraudulent trademarked items in the United States. So, The company either doesn’t know they sold fake cards, which means they’re not professional. Or, they knowingly sold them.. Either option is terrible and they shouldn’t be trusted.","title":"They sold me fake Pokémon cards","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-26","author":"Venue","text":"My husband purchased gucci slides for me as a Christmas gift, Dec 2021 at the price of $429 from stock x.  They were verified as 100% new and authenticated.  When I tried the shoes on they were too small and appeared worn and used.  Since stock x does not have a return policy, I had to sell them on stock x's website, (January 2022).  After receiving a bid at a much lower price.  I sent them back through UPS.  Days after, I receive an email with pictures saying the shoes were worn and used and they could not accept them.  I have sent several emails with the original authenticator email attached.  The reply's I receive are from a different person each time saying the same thing, that they appear worn.  This email responses are so general and scripted.  Clearly the people responding are not reading to understand or care.  \n\nStock x is scam.  You sold me used shoes!  I never wore them!  I only had them in my possession about two weeks.  There is snow on the ground here and they were slides for the summer.  I\/we are now out of $429.00 dollars.  I have contacted the Detroit, MI attorney general's office and will be contacting the better business bureau.  I will never order from stock x again.","title":"My husband purchased gucci slides for…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"},{"date":"2022-01-27","author":"Louise","text":"I never received my item, contacted CS but they closed my case because they thought I was a minor? Even with a driving licence ID to prove my age they decided not to take my case further. A missing parcel is a retailer’s responsibility. I have reported to trading standards and WILL take to court if needed.","title":"NEEDS REPORTING","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=81&stars=1&stars=2&stars=3"}]