[{"date":"2021-11-23","author":"Jordan","text":"I have mixed views on StockX, it is the main place to cop new sneakers but everytime I receive a sneaker there is always one little thing wrong with the quality. Either there is creasing or damage on the sneakers already when they are supposed to arrive deadstock, or sometimes they are missing accessories or the box is damaged. There is just always one thing wrong. I have not had this experience with other websites when I purchase them but sometimes more sought after and rare sneakers are only on StockX","title":"I have mixed views on StockX","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-23","author":"Mitch","text":"i love stockx but the prices and bids are really confusing. plus quality controll Could be better. i want my thing in mint condition. that is not always the case with stockx","title":"i love stockx but the prices and bids…","stars":3,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-23","author":"LL","text":"Packing are poor even sneakers or Kaws figure s","title":"Packing are poor even sneakers or Kaws…","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-23","author":"Ehab","text":"Very difficult to get customer service. I received the wrong shoe similar look yet different shoe and they authenticated it even tho it’s the wrong shoe and I didn’t check it right away and when I try to get in touch with customer service it won’t let me thru because it’s past 3 days we’ll they sent the wrong shoe same colors but different shoe. Supposed to been reverse bred Jordan low 1 in gs and they sent the pebbled leather version that is different and I can’t even email them about it. Customer service is horrible I can’t even get thru because they added an automated layer that first asks a series of questions","title":"Very difficult to get customer service","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-24","author":"Brianna","text":"I feel that there should be more discounts offered to customers especially with adding all those processing fees to the amount","title":"I feel that there should be more…discounts or processing fee lower","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-24","author":"Aj","text":"I never received my package I ordered from y’all and I still never got a refund","title":"I want my money back","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-24","author":"JJ","text":"Working fine , just the seller fees are rising very fast. But snatch your under retail pair of sneakers and be happy.","title":"Working fine but horrible seller fees","stars":3,"location":"CZ","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-24","author":"Xavier","text":"I bought a bearbrick from StockX platform which is claimed to be new. However from the product’s condition it is very apparent that the bearbrick is in a used condition. Very scratchy at the foot and body. This is so disappointing where StockX is supposedly a very reputable global platform - consumers will just trust the description at the product page. I would assume if the product is claimed to be new, StockX will make endeavors to ensure the product be in new condition before it is passed to the buyer’s hands.","title":"I bought a bearbrick from StockX…","stars":2,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-24","author":"Sameer Malik","text":"Got the wrong size.","title":"Wrong size","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-24","author":"Jack","text":"They authentication is amazing","title":"They authentication is amazing","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-24","author":"Raphaël","text":"StockX is great as an intermediary that verifies authenticity of products sold by scalpers. However its list of bids, asks and sales are all wrong. Several times I placed bids that were higher than several asks and never once I got it accepted. And many many sales seem to be fake, as I tried to place some bids a bit higher than the sale prices that were happening on that day and it was impossible to get it matched. Only \"buy now\", which was overpriced, worked for me.","title":"Great intermediary, but asks, bids and sales are fake","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-25","author":"Daisuke","text":"The product arrived wet.","title":"The product arrived wet.","stars":1,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-25","author":"Char Pribble","text":"I ordered a “new black, small size Gap limited edition YZY hoodie from them. They claim to have a rigorous review process to authenticate their merchandise and claim this item passed inspection. When I received it, it was clearly worn, AND the shocking part was the tags had been sewn on the black jacket with brown thread which caught my eye. Upon further inspection, someone had taken a tag from a BROWN hoodie and sewn it onto the black jacket! It clearly says brown on the tag. I immediately filed an online complaint and attached all the pictures as requested on their site. I got a bounce back email with a case number that said it would be resolved in 24 hours and it’s now been four days and they won’t answer my emails. Very disappointed and completely fraudulent. Avoid this business!","title":"FAKE YZY HOODIE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-25","author":"Consumer","text":"I have emailed this company 4 times and not able to get any kind of help.  My status shows delivered but never got them. I called FedEx and THEY told me they delivered to the wrong address but were not able to tell me where. I called or rather emailed StockX and nothing worse CS ever and WTH no number to call a real person.","title":"After reading this I contacted them again. I do not understand why they replied this if when I wrote right after reading this they refused any help but told me to sell my original purchase???","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-25","author":"Keleey","text":"100% SCAM!!! SCAMMERS!!! My 17 year old son purchased Nike Jordans for £300 from stockx with his 1st wage packet. We are in UK, so I ordered UK11 for him...we received US11. My son is devastated!!! He's not very well and all stockx have done is made his situation worse. You ought to be ashamed! We don't have any contact details for this company at all, so how on God's earth are we supposed to return these for a refund? Absolute crooks, you're a disgrace and fake. I'm appalled at how you treat customers who line your very deep pockets. How dare you treat people the way you do, you've robbed a 17 year old child!","title":"100% SCAM!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-25","author":"Ian Bunning","text":"I bought a pair of Jordans yesterday and it was my first time buying from them. When I clicked buy now I got this error message saying that an error has occurred try again later something like that. I went to check my bank also stockx - buying section under my account to see if the transaction was successful, just in case. No money was withdrawn, no item showed on stockx page and no confirmation of purchase email received. So I thought the transaction didn't go through, I thought this happened because I'm a first time buyer and from Australia. I tried again few minutes later. Same thing occurred. I googled to see if anyone else had this issue and I found stockx's post on their website that this happens and you can try again few moments later. So I tried few more times as I really had to get those shoes yesterday so I could get them in time. In between I checked my bank and stockx, email - Nothing. At this stage I have given up and was looking for another site to buy from. Then probably half an hour later or so I ended up with 6 transactions with minus balance in my bank and up until that point I still hadn't received any order confirmation email from them. please be aware and I hope people don't make the same mistake I made. I will not buy from them again (I only bought from them as I thought GOAT didn't have the shoes I wanted but they did!)  I will stick to GOAT it is cheaper too - average of $50 cheaper on same product and faster shipping.\n\n* In addition to the above, I got refunded for the 5 additional transactions in error - i didn't have enough fund to cover the FIVE pairs in my bank account so more like the money bounced back with total of $25 bank fees so its not really a refund. Looks bad on my statement, what if I was getting a loan and they looked at this.","title":"I bought a pair of Jordans yesterday…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-27","author":"Mary Gill","text":"Money was taken from my account for a bid that does not exist or order that does not have a number. I received an email to say my payment had been declined?? Then looked at my bank and the money was gone. Spoke to 2 agents who told me it was just a pre authorised payment Wbd the money would drop back into my account which made sense whilst it was a pending payment but now it’s moved from\nPending to an actual transaction so I have been fully charged for an order that doesn’t exists","title":"Money was taken from my account for a…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-27","author":"olga ","text":"I orderd a pair of sneackers. The first two attempts to pay failed. It works on the third one. But guess who took the money 3 times and send just one pair of shoes ???\nIt's been 3 month now : no money back !\nAlways the same answer : somebody will contact me soon.\n***after this review, I send a new email where I complained again and explained I let a bad review. I received my money 5 days after.","title":"I orderd a pair of snickers","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-27","author":"Rachael","text":"Ordered two pairs of shoes. Have been charged twice for one of the shoes. First time I contacted them they said there was a hold only on the shoes and that this would be removed once my order was completed. Rang my bank. No hold three individual amounts have been taken out. Now when I send a query about this I get no response. Will never order from them again.","title":"Over charged","stars":1,"location":"NZ","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"},{"date":"2021-11-28","author":"Noor","text":"i contacted the support team to let them know my card was charged twice for the same item. they in return told me they can’t take back the item and i have to sell it myself. how is this my fault when you guys charged my card incorrectly ?? and on top of that they suspended my account. i just want to return the hat with full refund","title":"i contacted the support team to let…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=93&stars=1&stars=2&stars=3"}]