[{"date":"2021-10-31","author":"Jacob Ward","text":"I've used stockx many times. This time, i dropped my package off at a UPS drop point. The package has been lost by UPS and the shop say they don't have it... end result i lose £110 on the shoes and even have to pay a cancellation fee. Stockx say there's nothing they can do, but these are the spots we are instructed to drop our parcels off at. It's good whilst its good, but there's no customer support (3 weeks for a reply) and they're absolutely useless when they do get back to you.","title":"I've used stockx many times","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-10-31","author":"Chanchai S","text":"I purchase 3080 ti evga from stockx .\nPaid by paypal and transaction was finish. Then stockx told me payment incomplete and they reject my order. That was stupid. They get my money and reject my order!!!!! Scam website.\n\nDo not purchase anything on this scam website.","title":"I purchase 3080 ti evga from stockx .","stars":1,"location":"TH","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-01","author":"M. Schb","text":"28142120-28041879\n\nOrdered on October 13,2021. \nstatus  since October 21 until now is “item received on stockx”. So more than 10 days!!! How long do you guys have to authenticate the shoes???\n\nNo updates or email whatsoever since then!","title":"28142120-28041879","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-01","author":"Rena","text":"I bought a shoe from stockx and first the original seller didn't ship my shoe within 3 business days and I contacted them to cancel the order as the seller wouldn’t ship my order, the order was cancelled and I placed a new order and they  finally sent me a tracking number now I tracked the order it says delivered but I don't have it like this is crazy, as a first time buyer at stockx I have had nothing but bad experience and on top of that no real life person to talk to, I had to go to the general FAQ which says to fill out an affidavit form, I'm really tired of all this, it’s been 48hours and still no response from  customer service i want my money or the shoe i purchased and if I don't get a reply from stockx customer service by the end of today, I'm filing a dispute with my bank. Order number (28567628-28467387","title":"I bought a shoe from stockx and first…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-01","author":"Jason Barnette","text":"I ordered a pair of Yeezy 380 Stone Salt from Stoxk X. My very 1st order from this site, and they sent me a fake pair of Yeezy's. It is beyond me how they promote 100% authentic and even I spotted the shoe was fake before I took it out the box. \nI ordered my wife the exact same shoe from footlocker, so I had a valid pair to compare. The box label has 6 sizes listed, real 380's have 3. The shoe had 2 Adidas tags, real 380's have 1. Then the biggest and most evident issue was the design on the back of the shoe. The design should be on each side of the seam coming down the back, but the Stock X shoe was all together with no design separation. Then customer service is damn near impossible to reach. I filed a claim and still waiting!! I will never ever ever buy from them again.\nA claim was filed on the Stock X website at 12pm est on 11\/1\/21. I also emailed several pictures of my concerns, the code and the order number.","title":"Stock X sold me fake Yeezy's!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-01","author":"shaheer arif","text":"Scam and nothing else. Sold my guccis to this website. Never even brought the shoes near my feet. Gave it to them. They took 3 weeks to authenticate and then wrote back to me that my shoes have signs of use?! Asked for proof and they sent me a pic of my shoes where only one of them had dirt on the sole and the other was brand new!! Wth? My shoes were brand new and even if i did wear them (which i did not) how on earth will i only wear one shoe? They destroyed my shoes and never even sent them back. The costumer support is beyond useless. This is the last time i ever did business with these frauds!! Beware!!","title":"Scam and nothing else","stars":1,"location":"PK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-01","author":"Frankie S","text":"My son used all of his birthday money to buy a pair of shoes. We received them and they aren’t even the pair he ordered. What do I do with them now?","title":"Not even what was ordered","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-01","author":"Marissa Bradley","text":"I had an unworn collectors Travis Scott x Nike shirt that I have held onto for a few years now that I decided to sell. I sold it and shipped it the next day. My shirt got rejected during the authentication process because of a “cologne\/perfume odor” nothing else. Probably from being hung up in my closet around my other clothes. I then got charged a 15% sell price fee because of this. Pathetic. I will never try selling or buying from this company again and DO not recommend even trying. I’ve read multiple reviews that this has happened and people have gotten scammed for money.","title":"PLEASE READ REVIEW","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-02","author":"Dr. Henny","text":"Don’t buy ps5 from STOCK X. I bought a ps5 from stock x I received it on oct. 14 on oct.16 it stopped working. It would not turn on. I tried to contact Sony but no answer. When I tried to contact stock x it was passed the 3 day help support. I paid 900 for a ps5 for 3 days that’s not cool. I don’t recommend buying ps5 or Xbox series X from stock x.","title":"Don’t buy ps5 from STOCK X","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-02","author":"Keith S","text":"I bought 4 ETBs of Shining Fates Pokémon cards and despite being “authenticated” by StockX, all the packs have clear signs of being resealed! Buyer beware!!","title":"Do not buy Pokémon cards!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-02","author":"Nabilah","text":"I was charged twice by stockx with no order confirmation given or anything except an email saying my order was not accepted… I contacted the customer services about this and they said somebody would contact me back. Its been 5 days and I still have no refund or no explanation. Poor customer service.","title":"Charged twice. Poor customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-03","author":"paige bellwood","text":"Asked for a refund twice due too my order not been dispatched in the 2 business days stated on their site! Saying I have to wait until the end of today which is the 3rd business day, this is the second time this month this has happened with orders not been dispatched will never never order from here again (update due to response) I purchased Friday 29\/10\/21 so cutting out the weekend surely Monday 1\/11\/21 & 2\/11\/21 are two business days lol so today Wednesday is the 3rd business day! Honestly","title":"Asked for a refund twice due too my…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-03","author":"Camille M","text":"If I could give a zero I would.  They sent me a shoe that they verified.  But the shoes color was portrayed quite differently on their app then in person.  And the leather was loose and wrinkled.  It looks stretched out.  I am getting no help through their chat, then they sent me and email and are telling me that I can resell them….  What planet are they on?  They do NOT back their products.  They approved this and charged me $175 for a pair of stretched out leather neon shoes.  This site is a joke.  I doubt they are even real Jordan’s.  DO NOT BUY!!!","title":"If I could give a zero I would","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-03","author":"George Echeverri","text":"I am a first time customer of StockX, I made my purchase on 10\/31\/2021, I spent over $700 on my purchase, I waited 3 business days for the seller to ship my sneakers to StockX, I tried to contact StockX numerous times through chat, because there is no phone number to speak to a representative, once I did get in contact with them, they were unable to find another seller, and they will issue me a refund in 7 to 10 business days!!!!! W.T.F So basically, I wasted my time for nothing, this is totally unacceptable, StockX should compensate the customer with a discount or something. Not right!","title":"I am a first time customer of StockX","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-03","author":"J J","text":"Bought a hoodie on StockX, sold it on StockX, got an email saying that it didn’t pass the authentication process, lmao, HOW IS THAT EVEN POSSIBLE. When I sold the hoodie , I took it out the package for the 1st time then packed the hoodie as it was already wrapped in something in the box to ship it out. I ALSO LET THE STOCKX TAG ON THE ONE THAT CAME WITH IT WHEN I PURCHASED IT.","title":"AUTHENTICATION PROBLEM","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-04","author":"Harald","text":"Be careful with this company!\n\nMy underaged son bought shoes and by mistake he also ordered one pair of expensive shoes which he did not want to order. While the ordered shoes (two more pairs) have been delivered as ordered, the one pair of accidently ordered shoed was “over-delivered”, they shipped two pairs at costs of approx. 1.500 EUR. \n\nThis shipment (the two pairs) has been returned immediately, but despite several mails from our side we did not get any feedback. After 1 month all in a sudden 1 pair has been refunded, the second pair still is pending. We got an email from an Italian site, stating that from their perspective the refund has been done and no further transfer will be made. So it seems that they are now keeping the second pair which we returned and in addition they keep the payment which was made as well through Paypal.","title":"Be careful with this company!","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-04","author":"Tom","text":"Bought a pair of shoes, they were missing accessories, dumb live chat agent disputed that they even existed even when provided with plenty of evidence. I stated that NEW items should include EVERYTHING that is provided with the product when it is shipped from the factory UNLESS OTHERWISE STATED. Terrible customer support clearly trying to spend as little time as possible supporting their customers.\n\nSpoke to a different CS agent and he was very helpful...just hope you don't get a rude agent.","title":"Hit and miss customer support","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-04","author":"Boris Karloff","text":"On 20 october, 2021 I tried to buy a GPU. When the payment was made, the funds has been writed-off my bank account, but somehow hasn't been processed by stockx.\nAfter a 3-4 days of communication, I've found out that transaction has been \"voided\" and I was told that the refund will happen in 10 business days. So, when the time passed nothing happened. I wrote again, and guess what? They asked me to wait for 10 business days more.\n\nThe summary of using stockx:\nThey just \"stole\" 800$ from me for almost 2 weeks (after the answer it seems like 4 weeks).\n\nupd.: after  3.5 weeks the funds were returned","title":"That's just a nonsense.","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-05","author":"Roper Dope","text":"Ordered a pair of shoes October 6, 2021. It’s November 5, 2021 and no response. All it’s saying is en route to stock x. At this point I want my money back and I will never ever buy anything off this site again","title":"Ordered a pair of shoes October 6","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"},{"date":"2021-11-05","author":"Maya McClainn","text":"28839665-28739424\n\nI recently sent out an order for verification. For some reason the shoes failed the verification process and I received this message as being the reason \"1. Too many variances in materials and construction when compared to authorized, retail items.\" Can you further explain to me what exactly that means?","title":"28839665-28739424","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=98&stars=1&stars=2&stars=3"}]