[{"date":"2022-03-24","author":"Shauna","text":"Well first off I wanted to be change the size and no help with that. Then the package took long for it to ship. I won’t ever order from Stockx again.","title":"Well first off I wanted to be change…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Nikita","text":"didn't receive my items","title":"didn't receive my items","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Brittany","text":"I ordered 2 pair of shoes and didn’t receive them","title":"I ordered 2 pair of shoes and didn’t…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Mel","text":"The site is difficult to navigate and costly to make the slightest error.  All of this increases the profit to StockX  What's more, they hide behind the concept of service without actually providing any.  There is no one to chat online with and the help and faqs functions are circular links that do not resolve any questions of depth.  There is no way to understand the bidding\/asking function.  Poor!","title":"The site is difficult to navigate and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"Heather","text":"So it was the first time I have ever used StockX & I waited and waited on ordering\/making up my mind on the Electric Green 6s. So I finally ordered them for a decent $ tag & they came “verified” “brand new in box” - except when they came, the box was busted at the corners & the shoes literally are dirty and have blemishes in them. I wanted so badly for my shoes to come in pristine shape as it was my first 6, & my first experience in this site & honestly that ruined it for me. I love the shoes and I for sure want to have them in my collection, but that was poor quality and poor customer service on y’all’s part. \n\nThank you.","title":"1st Time Sadness","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"dedrick","text":"I chose a Men Shoe but then I was charged for a damn Pre School and can’t be refunded. I Will NEVER USE YOU AGAIN. LOSE MY EMAIL. I WILL LET EVERYONE KNOW HOW TERRIBLE  YOU ARE.","title":"MESSED UP SERVICE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-24","author":"J. N","text":"You guys use the third parties and they are not doing their part in delivering the purchase correctly. I been woth you guys for bout two years. This is not an exception. And will not go for it or deal with it. Hopefully you guys fix the mishap and try not for it to happen again. To me or any of your customers. \n\nJ. N. 😡😳🤦🏾‍♀️","title":"SMH!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Karlo","text":"I recently ordered a pair of panda dunks for my teenage cousin as a B day gift and had them shipped to her... she received a pair of damaged sneakers..Now I'm thinking these shoes are knock offs!!! I want my money back!","title":"I recently ordered a pair of panda…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Malachi","text":"Stop fu**ing sending me emails, and then adding bullsh*t code to your unsubscribe button so people can’t unsubscribe and have to keep receiving your junk mail.","title":"Stop Fu**ing sending me emails","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Taylor","text":"Repeatedly cancels orders unannounced when seller promises an item they don’t have or decide not to sell and cancel last minute. There should be a penalty for wasting the buyers time.","title":"Repeatedly cancels orders unannounced…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Greggory","text":"Item i purchased was manufactured incorrectly.\nStockx return policy sucks!!\nCustomer Service slacks.\nMy overall experience was horrible. \nI will not purchase, and will advise my family, coworkers and friends to not purchase from Stockx. \nThis is a 3rd party selling materials that may be suspect items.","title":"Item i purchased was manufactured…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"callum dixon","text":"Sold shoes, sent them in for verification. Failed due to a “defect sock liner glue stain” which wasn’t there previously. Not reliable will potentially damage your shoes.","title":"Sold shoes","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Victor","text":"I ordered my shoes weeks ago and still haven’t received them. Absolutely horrible. Should just stick with more reliable services that deliver efficiently. Just give me a refund StockX!","title":"I ordered my shoes weeks ago and still…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Misty","text":"My order was canceled for no reason after paid and waiting over a week.  I still have no clue what happened.  I will definitely not use this company for further purchases.","title":"My order was canceled for no reason…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Ashley Brown","text":"The transaction started out smoothly then the dates for my delivery changed about 2x. It went from arriving early to arriving after the initial date to now being delayed. A little irritated at the fact that I now have no clue when my shoes will arrive","title":"The transaction started out smoothly…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Endrit","text":"I order size 4 shoes and shoes for kids came instead. I contacted support and never got a response. Will never use this site ever again . Dissapointed","title":"I order size 4 shoes and shoes for kids…","stars":1,"location":"AL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Casey","text":"Purchased a pair of brand new shoes, and when they were delivered late, they were dirty. Normally if this was to happen I would just see if I could wipe it off, accidents happen, but these were a very light color and easily stainable material. So to get them dirty right from the start is pretty disappointing. I’m still dealing with customer support, and have sent multiple emails, yet still have not solved the issue.","title":"Dirty Shoes even after inspection","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Anthony","text":"Shipping kept getting delay after delay","title":"Shipping kept getting delay after delay","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Darren Yen","text":"I ordered a brand new pair of shoes, they passed it and sent it. Box was unopened or damaged. The shoe toebox on the right shoe was completely creased and damaged! How did they even pass the QC?! Means you didn’t even check the shoe correctly. Now you offer a refund OR $20 voucher?! That’s a joke! I paid $85 import charges on top of your price and you have the audacity to offer me $20 for a damaged shoe and if I return then I’m out $85!!! If this is how you do business, then you won’t have long to be outed as the leader in this business as this is poor quality shoe matches your poor quality service!","title":"I ordered a brand new pair of shoes","stars":1,"location":"ZA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"},{"date":"2022-03-25","author":"Faith","text":"I never received my sneakers","title":"Never received sneakers","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=68&stars=1&stars=2&stars=3"}]