[{"date":"2022-05-05","author":"Dummy","text":"The system I bought was broken when received.","title":"The system I bought was broken when…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Jack","text":"shoe box was messed up, shoes weren’t in best condition for what i paid for","title":"not worth what i paid for","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Arman","text":"Shoes are good qualit just wish I could return them for another size","title":"Shoes are good qualit just wish I could…","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"ChaCha","text":"STAIN EVERYWHERE","title":"STAIN EVERYWHERE","stars":1,"location":"KR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Andrew","text":"I attempted to sell a brand new bag from Bottega Veneta. I purchased it FROM an actual Bottega Veneta boutique WITH a receipt. Essentially, I was told that it did not pass the “authentication” stage because the “design” in stitching and a missing logo. Of course questioning this bag (and ignorant to believe StockX), I did my homework and Bottega Veneta swears by their product. After asking for a second reconsideration, Ben (from StockX) stated they will not reconsider authenticating it and will return because it “different than other bags we've seen.” \n\nEvidently, their authenticators either have no experience in the ACTUAL fashion industry or are not up-to-date with products. Therefore, it is interesting how they can “swear” by the fact that you will not receive a fake. Trust me, if something purchased from a boutique is what their calling “fake” (i.e., my situation)…they must not know the difference and you might be purchasing a fake yourself. Be warn! Be careful. This company may seem legit but customer should be questioning who (on their behalf) is authenticating products.\n\nNeedless to say, I am going to go into Bottega Veneta as well because now this whole situation has me second guessing on a $1600 purchase. Could the boutique have sold me a fake? I doubt it, but I am doing my research hard.\n\nSell StockX a fake, they may say it’s real.","title":"I attempted to sell a brand new bag…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Scott","text":"Stockx does a good job verifying to see if products are real or fake. However, Stockx needs to improve their customer service. It’s hard to email a customer support person and it’s impossible to call anyone because there’s no customer service phone number.","title":"Stockx does a good job verifying to see…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"nathan","text":"I was so excited to find my favorite shoes from my younger years. The stock picture of the Penny 1's was from when they were brand new. I didn't realize that air bubbles from nike would yellow so much over time. Thankfully the yellow bubbles weren't too terrible but I sure would have liked an accurate representation of the shoes I would be spending almost 400 dollars on. I have no issue with the logistics. I would like to warn other customers that the picture they see on the site may not be accurately representing  the condition of the actual shoes they receive","title":"Beware of discolored Nike air bubbles for older shoes","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Nothelpful","text":"Paid for my shoes. Multiple days went by without hearing from StockX. Then found out that they lost the shoes somewhere but took me having to ask what happened to find this out. Then they did not make any attempt to find the shoes for me at the same price. Now the same shoes cost $50 more than previous.","title":"Paid for my shoes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Stephen","text":"The website changed the shoe size to 8 and I indicated 10. Not a problem one would think given the competitiveness of E-commerce.\nLack of adequate customer service.","title":"The website changed the shoe size to 8…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"BA","text":"Order took over 7-12 days to process, and then was canceled for no reason","title":"Order Canceled","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Denita Price","text":"I bought 3 shirts a month ago I only have 2 shirts still waiting for one","title":"I bought 3 shirts a month ago I only…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Aislinn","text":"Worst customer service and rules!","title":"Worst customer service and rules!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Marc","text":"I bought some choes but the site was not so clear, that I took a very small Size (6 = 32) it s impossible to use it s why I would like to change it as I did in a multiple web site. But here impossible !!!! You have to stay with your mistake…","title":"No margining for error !","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"NaJae","text":"I still have not received my package","title":"I still have not received my package","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Jessica","text":"Fast shipping! Not really for certain of how the company can tell if a pair of shoes are authentic or not? Price a little bit high. 2 different shipping fees plus tax! A bit much!!","title":"Fast shipping","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Ciaran","text":"Fees were shocking","title":"Fees were shocking","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Brittney","text":"You all sent me a fake product. I initially sent the pics to the email address. You all asked for more pics this time to a different email and whenever I try it send it said mailer not found. And because you all couldn’t get the attachments you closed my case. I responded to someone to reopen the case and told her the same thing. I STILL haven’t heard anything!! I’m furious about this and my money and time wasted.","title":"You all sent me a fake product","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"meshal","text":"i was supposed to get it by 3rd of May but it’s 7th today and i still did not get it. I needed it asap since i’ll be leaving the town but well they delayed and i’ll not receive  it anytime soon.\nSo like when will i get my sneakers??","title":"late delivery","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Jay","text":"the fees and customer service","title":"the fees","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Michelle","text":"I'm a first time user.  My order was canceled because I didn't meet some sort of criteria(?).  I didn't understand and I needed the shoes for my son.  A terrible first impression.","title":"I'm a first time user","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=5&stars=1&stars=2&stars=3"}]