[{"date":"2022-04-15","author":"Will","text":"The shoes I ordered was in excellent condition, but took a loooong time to be delivered.....the shoe box was in terrible condition to say I just paid $316 for the shoes n the box is beat up🤬😡🤬😡","title":"Bad Box and Delivery","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Britt","text":"Horrible return policy , I’m stuck with 2 pairs of the same sneakers. Will never buy again from the site.","title":"Horrible return policy","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"AC","text":"They gave me a B grade shoe, which doesn’t bother me that much but it would have been good to know. Shipping was also kinda high, but it came on time\n\n\n(B grade shoe is a shoe with minor impurities like an extra stitching. They’re real just not ones that are perfect)","title":"B grade","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"七奈","text":"The size was too big.","title":"The size was too big.","stars":3,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Aresh","text":"On 04\/04\/2022 I bought some tennis shoes for my son and they sent me fake ones and now they don't want to return them I don't recommend anyone to buy on this page they scammed me","title":"On 04\/04\/2022 I bought some tennis…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Supermom","text":"I have to try again. My order was canceled after i reached out several tines. Its a seller issue. Glad Stockx was involved they refunded me in 24 hours and I placed a new order.","title":"Not sure yet","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Nikolai","text":"scam site\nnot accept returns.","title":"scam","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Patrick","text":"The box of the item I received was damaged (had a puncture hole) along with the shipping box being beat up by DHL. There was also a StockX sticker on the middle of the item box that when I tried to remove, pulled some of the box paper off. I am happy that StockX had the item I wanted, but I am not pleased with the process in which they provided it to me.","title":"Damaged Box(es)","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Michael","text":"Very bad. Shoes were fake, thankfully they rejected them. Took 2 weeks for them to tell me though.","title":"Very bad","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Jason","text":"My shoes were delivered somewhere else and I was told it’s up to me to go pick them up even though I was not given the address they were delivered to. Paid $235 for someone else to get my shoes. If it was delivered to my neighbour’s by mistake fair enough but it was delivered somewhere about 15-20 minutes away and I was not given the address to retrieve them.\n\nUpdate 29\/4\/2022\nStill waiting on shoes, have heard nothing from StockX but the delivery company UPS says they have located shoes and will be shipped to my address within 5 business days.","title":"Shoes delivered to wrong address no support given","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Alfredo","text":"xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx","title":"xxxxx","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Alessandro","text":"you wrote me that the process via credit card was ok, i also see my account of my bank without the right money for buy the shoes...and what happened some days later...you stop all the transaction, give back my money .... and now my grandson have no present for his birthday...congratulation and thanks for all.\nI will never try to buy no more on your site and i will tell everyone i know what happened.\nregards\n\nAlessandro Di Marco","title":"you wrote me that the process via…","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Dilusha","text":"I like this service, but it would be great if the currency is displayed clearly when you purchase on the payment screen.","title":"You need to display currency at checkout","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Johnathon","text":"Was unaware this is a biding site for merchandise. I should have done more research before moving forward on purchasing items. Personally I think there should be more communication and notification once a bid has been placed to let you know the status of the bid & the sellers approval or dissatisfaction. But otherwise not a bad deal or way to get exactly what your looking for without having to leave your personal residence.","title":"Was unaware this is a biding site for…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Dylan","text":"Received fake pair of yeezy foam runners","title":"Received fake pair of yeezy foam runners","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Telle ","text":"I purchased a t shirt that never came. After waiting 2 or 3 weeks with no word about my purchase I checked the website and found that my purchase had been cancelled without notice to when or why.","title":"I purchased a t shirt that never came","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Alice Schröer-Seitz","text":"Terrible experience. I actually wanted to buy a pair of sneakers there but the seller never replied. Anyways. I wanted to delete my account and this case is now open since 3 weeks. It seems to be impossible to delete the account, which can only be made of the “customer service”. In fact I think that this customer service is a bot and not able to help at all. \nI furthermore unsubscribed two weeks ago from this annoying spam newsletter and guess what? Still receiving this useless information. Never again. Hope to close this case soon. However, never experienced such a poor customer service before.","title":"Terrible experience","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Clara","text":"I purchase a cyclone sunglasses supposed to be brand new when I receive it it's already used with scratches with no authentication card from LV I believe this sunglasses is from China when I send them a picture they replied they need a clear picture anyway never again","title":"I purchase a cyclone sunglasses…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Natnael Tadele","text":"The shoe I’ve received had major defects!","title":"The shoe I’ve received had major…","stars":1,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Chua","text":"Order not updated for 1 week and in the end order cancelled because of authentication error","title":"Order not updated for 1 week and in the…","stars":3,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=37&stars=1&stars=2&stars=3"}]