[{"date":"2022-01-27","author":"Maritza Lopez","text":"I purshased a ps5 as a gift for my SON it overheats I want my money back, I could’ve got it for cheaper from someone in the street but decided to order it from you guys so I need answers.","title":"I purshased a ps5 as a gift for my SON…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-01-27","author":"lee worrall","text":"Call yourself the authentication professionals don’t make me laugh. I advertised and sold a brand new apple magic track pad through CrapX but after they had authenticated my item I received an email saying; Thank you for contacting StockX and hope you are well. I'm really sorry that your first sale didn't pass the verification! I appreciate you taking the time to follow up with us to gain clarity on your results for order ########.\n\nWe know that you sent us a genuine Apple product, but the product sold was an Apple Magic Trackpad 2 Space Gray with a code MRMF2LL\/A and we received a product with code: MRMF2Z\/A.\n\nWe know that both products seem to be the same, so we made an exception and we did not apply the penalty fee as per rule.\nThis joke of a company who has admitted my item was 100% authentic has cost me a buyer. Apple has two model codes for the same item but these morons only have the brains to acknowledge one of them and therefore failed the verification.","title":"Call yourself the authentication…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-01-28","author":"Silvia Palau","text":"No returns are allowed and it is impossible to contact them through the Website. The information you receive on your bids is not accurate and trustworthy. Customers must be careful because You are being charged without requesting your final confirmation. You should bé informed that a seller matched your bid to ask for your order final confirmation for your order before being charged. I do not reccomend to use this site until these problems are solved.","title":"No returns are allowed and it is…","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-01-28","author":"Jamie Payne","text":"Ups made receiving the item a lot more difficult as it wasn’t delivered to my address","title":"Delivery","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-01-28","author":"Mouse","text":"I got the package but it wasn’t the right size which is an shame, but it is OK it was my own negligence.","title":"I got the package but it wasn’t the…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-01-28","author":"Caroline Johnson","text":"I was told they would be a unisex size 8.5. Therefore, I ordered an 8.5, and received a mens size 8.5\/womens size 10.5.","title":"Misleading Size","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-01-29","author":"Leslie Santiago","text":"I bought a pair of sneakers but didn’t receive them. I reached out to Stockx but they wouldn’t file a claim. You can’t call or complain to anyone. Everything is done by email. This was a terrible experience and I will never buy from them again.","title":"Claim less in Cleveland …","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-01-31","author":"Jack Broad","text":"Ups claimed to have deliver the parcel to me in person but I have ring doorbell footage to show it was never delivered to me as I was at work. Stock x said they won’t process a slot claim as ups said it was delivered to me in person ! \n\nI have had to chargeback with my bank \n\nAvoid this conversation at any cost as they don’t offer returns. Also when I contact ups to find out if they have received a claim for missing parcel ups informed me they had not received anything from any company or person!!!\n\n\nLying company and stole my money !\n\nEdit - unprofessional response from the company not addressing the problem clearly a automated response to all reviews !","title":"Thief’s  !!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-01-31","author":"Salatiel Ventura","text":"Do not buy anything from stockx i just got scam 334.50 i was sent a pair of sneakers that cost 50$ instead the worst place ever to buy DO NOT BUY FROM STOCK X","title":"Do not buy anything from stockx i just…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-01","author":"Thomas odum","text":"My story is that I sold a shoe on stockx that eventually didn't pass inspection solely passed on the fact of the conversion. Prada x Adidas collaboration sneaker in black size 8 euro (Size 9 US). I admit that i made the mistake of putting the wrong size on stockx. I was expecting them to send my shoes back, however, they never did. A package tag was made and from the information I received from FedEx, the item was received by FedEx. So I'm under the impression that Stockx still had my shoes. I contacted stockx customer service which is a waste of time via chat and email. They contacted me back, kept telling me to be patient and that my case is top priority. It's been over 3 weeks I've seen my item. I finally received a email stating they are going to honor my payout which i was fine with since they lost my shoes or in my opinion was stolen by a employee. Now, I received a payout from stockx which is only 70% of the agreed payout based off a policy that I haven't read at all in terms and conditions. Their supposed policy states that if a item doesn't pass inspection and has to be sent back the seller, penalties will be put in place. And since my item didn't pass inspection and was lost\/ stolen by stockx that my payout will only 70% of the actual agreed payout. \n\nNow, this situation is oddly convenient for stockx to have that it caters to every issue I had with the company. Making it my fault that stockx lost my item and a accidental size conversion mistaken was made. \n\nI've spent of $20,000 with this company and this is the type of scams they run on individuals that they don't physically take too. Via phone or in person. The chat way of communication is jus a way to keep things distant from their customers who may actually have a problem. In this since I won't be purchasing anything from stockx anymore because they unfair and won't admit they are wrong. I literally live 15 mins from stockx headquarters in Detroit, MI. I could've gotten my shoes myself and resold them for substantial amount instead of taking at 30% loss. Stockx is a scam!","title":"Unfair practices and theft from Stockx","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"James Christopher","text":"This was the worst experience I've ever had with a company. Never got the product. Still waiting since December and it's February. Pathetic..","title":"This was the worst experience I've ever…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"Bvbm Bklyn","text":"A little update so they asked me to send the Jordan 11s back for another review that was almost a month ago and I haven’t heard back from them so now I’m out almost 400 and I have no shoes anybody know what to do ?","title":"A little update so they asked me to…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"Joshua Sawit","text":"Ordered a fw20 essentials medium heather oatmeal hoodie, what they gave me is a fw21 xlarge black hoodie.","title":"Ordered a fw20 essentials medium…","stars":1,"location":"PH","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"LaDonna Green","text":"This was my first experience utilizing this website. Sooo….I ordered the purple and black Jordan Retro 13 Preschool sized shoes for my 5 year old daughter. The order came in a timely manner, but as soon as I opened the box there was a VERY strong marijuana smell. I said to myself, ok, hopefully the smell can air out once air gets to them. I placed the shoes on my girl and she whined in pain and told me to take them off because they were too tight. My daughter has had had Jordan’s before and has never had a sizing issue. It makes me question the authenticity of the shoes overall.  I was so disappointed because I really wanted her to have these to match her school uniforms. I saw their return policy so I would have to take this as a loss. Also, a week later and the smell of the marijuana is still present! Makes it hard for me to resell these.","title":"Disappointed Mom","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"Andrew Hardy","text":"I’ve ordered from stock x before . Shoes were great. I just got another pair of shoes. Sb dunk fog lows. The suede on these shoes are in terrible condition. The suede looks like the shoe has been worn before, on the sides it looks like they have rubbed together causing the Suede to wear out. In the back of the Shoe there Are the most noticeable scuffs. How someone looked at these and said they were cool to ship to a customer worries me. NOT COOL!","title":"I’ve ordered from stock x before","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"Tyclonex","text":"Do not deal with this company!! They don't read emails and ask for the same details over and over. 'Unable to find transactions' in my account. Spend $$$ just destroy them on social media and call your bank. \nYou. Warned.","title":"Do not deal with this company!","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"Bvbm Bklyn","text":"I did email l. it says no one is monitoring this mailbox I email every email I can find no one reached back I have the email when it was returned to them and so far no answer. Please be advised when u purchase shoes from StockX once they certified a shoe that’s it . Write or wrong there’re right","title":"I did email l","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-05","author":"Mike","text":"stockx was sued by nike for fraud over NFTs . You can google it .also they Don't  have a phone number .and they writte their own positive reviews on trustpilot.com with suddenly 100 positive reviews wrotten at the same hour , the same day.  100 people won't writte 100 reviews ath the exact time. they always do that everytime they get  alot of bad review.  Dishonest fraudulent company.","title":"stockx was sued by nike for fraud over…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"YB","text":"Bought a pair of shoes on Stockx. Shipping, etc. was fast and smooth. Unfortunately the shoes were defective. After I wore them outside for the first time, the sole came off on both shoes. In theory I now have a legal right to reimbursement due to the material defect of the shoes. Even Stockx's own terms and conditions acknowledge that. However, customer support was \"unable to offer\" me a reimbursement. I'm going to return the shoes anyway and then sue, if necessary. Since Stockx is trying to transfer any risk with regard to the quality of the purchased goods to the customer I won't buy there again.\n\nEdit: After some further email exchange with customer support, I haven't returned the shoes but instead got my attorney involved. Stockx is quite clearly non-compliant with statutory warranty rights. I'll update once this has been upheld\/dismissed by the local court.\n\nOne can't really blame customer support because they clearly don't know any better. What was positive is that they were quite responsive which was generally nice. It is, however, quite frustrating emailing someone who has no idea when in addition the company policy seems to be \"just tell people complaining to f*** off\".","title":"Just don't (edited)","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"},{"date":"2022-02-07","author":"Mohammad Almizel ","text":"Baddest company ever !!!!\nI made a purchase on 28th of January 170$ \nUntil today there is no updates !!!\nOnce I mailed the company they charged me again 170$ \nThey took total 340$ there are thieves never trust them I will write everyday here to make sure all people know about them I have all evidence","title":"Baddest company ever !!!!","stars":1,"location":"KW","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=80&stars=1&stars=2&stars=3"}]