[{"date":"2022-01-14","author":"Dawid","text":"I was charged 15 USD cancellation fee for the item StockX agreed did not pass verification because of their mistake. However, they are not willing to pay 15 USD back to me.","title":"I was charged 15 USD cancellation fee…","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-14","author":"mark greenauer","text":"They will damage your products and then blame you and charge you $15 even though they are the ones who broke the products do not deal with this company as they practice scam artist tactics like telling you your item was broken and then swapping it out with one they already own that’s broken","title":"They will damage your products and then…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-14","author":"Dorett Lewis","text":"THANK YOU FOR ALL THE REVIEWS. I WAS JUST GETTING READY TO PART WITH OVER £1000 FOR MY SON'S JORDANS!! WOW THIS SOUNDS LIKE A TERRIBLE COMPANY. SO GLAD I DECIDED TO READ THE REVIEWS BEFORE PRESSING THAT BUTTON. YOU GUYS SHOULD SET UP A FACEBOOK GROUP, THEY MAY START TO TREAT THEIR CUSTOMERS A BIT BETTER","title":"THANK YOU FOR ALL THE REVIEWS","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-15","author":"Patrick","text":"NEVER AGAIN…I’m out $153! for EarPods that don’t work!\n\nSupport is through Chat or email, don’t accept calls. \n\nTheir response…\n\n“Hey Patrick, please note as per our FAQ Are returns or exchanges allowed? we do not allow returns or exchanges, because we are a two-sided marketplace. We do not house an inventory and each item you purchase comes from an individual Seller. Additionally, StockX is an anonymous marketplace, so we cannot facilitate a return with the Seller directly. However if you do have an issue with your product, you can reach out within 3 business days, and we will be happy to review the issue with you. Thank you for your patience and understanding.”\n\nAnother agent wrote\n\n“ After looking through your account, I notice your DropX exclusive JBL Freak edition headphones has been delivered. Due to the anonymous nature of our live marketplace, we are unable to offer returns, exchanges, or swaps of any kind - including if you ordered the wrong size. As we are not a regular retail store, we do not hold any inventory.”\n\nPathetic to say the least!!!\n\nEven if you respond in 3 days no luck just from reading other reviews!  No one should ever think of buying from StockX….never know what you’ll get….that’s if you get it. Reading other reviews see shipping issues with their package never delivered lost etc and you are still out of luck EVEN IF YOU NEVER RECEIVED IT!","title":"3 days return policy...horrible means nothing!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-16","author":"Larry Schmollinger","text":"I was just getting ready spend money with this stockx site then seen the piles of bad reviews on this site and many others. Thank you all who wrote reviews.  I go elsewhere.","title":"I was just getting ready spend money…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-16","author":"Jordan Samuel-Brown","text":"StockX declined my order but still took the money out of my account. When trying to speak to an “agent” they told me there was no order from them but PayPal had taken the money from my account. I am still in the process of trying to get this money back. The customer service is a disgrace!","title":"Taking money but declining order","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-16","author":"Khanh Van","text":"Packaging is not trustable","title":"Packaging is not trustable","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-16","author":"J Smiles","text":"The whole process takes too long!! The sellers take way to long until they send shoes to stock X. They should get rewarded for sending shoes quickly and penalties for taking there time.","title":"The whole process takes too long!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-16","author":"Heavyset _Mamma","text":"It was nice the shoe came in a day early then what it was said to but the shoe has little black smudges on the Mid soul and idk if the qr tag is supposed to do anything but when i scan it nothing does, other then that shoes are great","title":"good time but shoes could have been clean","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-16","author":"William Willard","text":"The item arrived a lot quicker than expected which was nice although When I opened it there were some things than seemed weird.  So I got this Pokémon box that came with 17 celebrations packs and 6 of the celebration packs had already been opened which I found a little strange, nothing was wrong with the cards inside of those packs though but still didn’t feel right.  It could’ve been a manufacturer’s error because the packs were all open from the top of the pack perfectly but that’s never happened to me before. Other than that no problems the two metal cards were very nice and every thing did arrive that was supposed to.","title":"Packs were open when I pulled them out of the box","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-16","author":"ßunrise No cap","text":"The shoes look kinda fake to me 🤷","title":"The shoes look kinda fake to me 🤷","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-16","author":"Abdulla","text":"Everything was great but the delivery time takes way to long","title":"Everything was great but the delivery…","stars":3,"location":"BH","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-16","author":"fernando garcia","text":"The Xbox I ordered did not work, paid resell and still didn’t get a working one.","title":"The Xbox I ordered did not work","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-16","author":"Lazerick Bennett","text":"Stockx makes it a priority to be dishonest with buyers and sellers. They train their customers service representatives to withhold valuable information while holding no type of accountability. If something goes wrong with a order on their end they tell the buyers a lie to keep their business and money. Their integrity is questionable and unreliable.","title":"Stockx makes it a priority to be…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-16","author":"craig davis","text":"Ordered pokemon cards, i received exactly what i ordered. Only issue i had was the cards were a bit damaged.","title":"Ordered pokemon cards","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-16","author":"Segev","text":"I got my shoes with a scratch and after four days they contacted me","title":"Damaged shoes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-17","author":"Customer","text":"Fast deliver, a bit expensive extra charges, but authentic","title":"Fast deliver","stars":3,"location":"HN","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-17","author":"Super.fly Oof","text":"The shoe was very dusty","title":"The shoe was very dusty","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-17","author":"Bvbm Bklyn","text":"I have ordered a few pair of shoes and I have had bad experiences 1 I waited 3 weeks then I got an email saying they were having a problem with the seller so they canceled that order 2 I bought another she they send it with the box bean badly damaged they never mentioned that 3 I order the cool 11 they just arrived the laces were undone they shoes have been tried on there is a crease the paper or hard paper that comes inside the shoes are missing that was it I’m done with StockX I’m gonna pay a litttle more but I’m gonna start ordering shoes from flight club or goat bcuz I’m very disappointed every time I ordered I had a problem except 2 pair of home along they came as expected and were never Troyes on but not good enough I collect sneakers and now I have a pair of cool grey that are missing things and been tried on it’s no longer DS once u try it and walk around ur house on it I don’t know how it passed authenticity they sole under u can see they been walked on I’m sorry but I don’t recommend StockX anymore !","title":"I have ordered a few pair of shoes and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"},{"date":"2022-01-17","author":"David Harman","text":"I have sold and bought numerous pairs of shoes on StockX.  Recently, I sold a pair of shoes and UPS lost the package around Christmas time.  UPS only shows I \"dropped off\" the package and it never shipped, because UPS lost the package.  StockX wouldn't honor a refund, and they didn't have enough protection on the package to cover the $339 sale of the shoes.  StockX refused to help in any way at all.  They also DO NOT HAVE A CUSTOMER SERVICE PHONE NUMBER, which is outlandish.  I will NEVER use StockX again, as they truly have the worst set up for customer care I have ever witnessed.\nEdit - It has been over a month.  I filed a claim and since StockX purchased the shipping label, I'm not able to even go through with the claim until StockX sends me a release of item for UPS.  Your customer care is completely worthless and literally said they cannot help with this issue, yet all I need is a letter of release for UPS to PAY ME MY MONEY.","title":"StockX WILL NOT HELP if UPS loses a package, YOU WILL BE OUT MONEY AND THE PRODUCT SOLD","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=82&stars=1&stars=2&stars=3"}]