[{"date":"2022-04-11","author":"T-","text":"Disgusting DO NOT order from here","title":"Disgusting DO NOT order from here","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Joseph","text":"Being that my shoes came from Hong Kong I had to use an app to make sure they were real. Even with a StockX tag I did not trust them coming from Asia. So I had to go through the CheckCheck app to make sure y’all are selling legit stuff. The Asian sticker with the shoe size on it was a big red flag","title":"Being that my shoes came from Hong Kong…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Adrian","text":"I'm still awaiting my sneakers for the past three weeks. Im also still waiting for an update onto what is going on with when I'm going to receive them.. this was my first time using stockx this may also be my last time.","title":"No answer to where my sneakers are.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"BA","text":"apaulling service, rip off, scammers, zero customer service - cant return or exchange - con merchants. do not buy from this company- crooks","title":"apaulling service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"nick","text":"Fees are too high on stock x side","title":"Fees are too high on stock x side","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Krista","text":"Ordered my son a pair of sneakers which cost me $331.70 & in 4 days they refunded my money back with no explanation whatsoever. Means less to say not good service, and a very disappointed boy. Will never order from this site again, first and last time","title":"Ordered my son a pair of sneakers which…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Ricardo","text":"The 1 star is due to the fact that you guys don’t allow someone to cancel an order, seconds after they placed it. “Goat” provides a cancellation button, so for that reason I would never purchase from stockx again.","title":"The 1 star is due to the fact that you…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Michael Trippi","text":"May be great for some, I am not a fan.","title":"Oh well...","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Soimu","text":"Buy a pair of AJ5 , stockx had problem with the seller","title":"Buy a pair of AJ5","stars":3,"location":"MD","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"April","text":"I received the wrong item\nAnd the reason I didn’t return was due to my son not having his shirt in time for his bday","title":"I received the wrong item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Mariam","text":"literally the worst, i placed an order online and they said it was delivered but i never received the package, after i made multiple claims to fedex, they tell me to reach out to my shipper and when i do that they tell me that they can’t do anything about it like what??!! It’s like they’ve never heard of waiting for your package, some people don’t know the policy especially when it’s your first time placing a delivery order with stock x.","title":"literally the worst","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Isabel","text":"I heard great things about stockX... suppose to have the best quality and you pay for that too... I ordered a rare collectors toy, suppose to be new and in GREAT condition. It came damaged making worthless... the toy itself was gross and beat up. do they not know what they are doing at the authorization center? worst experience could have gotten better off eBay! after contacting stockx they only wanted to give me 10$ refund which was rude considering the amount I paid for a now worthless purchase. Also contacted stockX support and they basically said there was nothing they could do about it.","title":"I heard great things, now will not ever be purchasing from here again...","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Unhappy","text":"Mistakenly ordered wrong size. No way to cancel order or return. No way to contact","title":"Mistakenly ordered wrong size","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Ruthann","text":"Did not realize I was ordering from a third party, thought it was Nike, we ordered the wrong size, now they are not wanting to return them, these were very expensive shoes!!","title":"Did not realize I was ordering from a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Rilee","text":"I purchased new jordan retro 12s. When I got my order in the mail, they were some really dirty old used Jordans! There was no stockx tag or receipt just old shoes in the box that said retro 12s. I feel scammed and want my full refund! Never using this site again! My outfit and plans were ruined!","title":"Terrible!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Heather Padget","text":"If u haven't got the stock don't bother taking peoples money, you left my daughter shattered for her bday when weeks later you emailed with no stock!","title":"If u haven't got the stock don't bother…","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Memphiz","text":"No product. Bad first time experience.","title":"No product","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Brendan","text":"Fix your exchange rate, I ordered shoes and it takes 2 weeks pshh thanks for the little bros gift but you enjoy your 1k shoes","title":"Fix your exchange rate","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"MS","text":"The shoes took a very long time to arrive. When they did arrive they appeared to be authentic but definitely were not new. I paid $270 total for a pair of used shoes. Definitely will not be doing business with them again.","title":"Bad experience","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"},{"date":"2022-04-11","author":"Lindsey","text":"The ordering process was tricky and unclear. It kept trying to take me to the app before I was finished ordering. As a result I accidentally ended up ordering two pair of shoes....both at over $300...unfortunately stockxxx doesn't offer refunds even though I discovered the problem almost immediately after it had occurred. \nLuckily however, because of the two-step authentication process, one of the pairs of shoes was found to not be authentic at which point the company sent the shoes back to the seller and issued me a full refund. I was very relieved because I needed that money. But if I ever order from stockx again, I will be using a prepaid card with only the correct amount needed for the item being purchased.","title":"The ordering process was tricky and…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=42&stars=1&stars=2&stars=3"}]