[{"date":"2022-04-18","author":"john","text":"Entire experience with StockX was 💯 SHADY!!\n\nPurchased an item that was up trending then all of a sudden money returned because item would be late…I NEVER SAID WHEN I WANTED ITEM!!!!","title":"Entire experience with StockX was 💯…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"Anonymous","text":"This is the second time I ordered and it says my package was unsuccessful","title":"This is the second time I ordered and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"Steven","text":"Poor customer service.. The website charge me in us dolloard. When I choose canadian currency for my Jordan. You won't know until the bill will show on your card after receiving your shoes. So I over paid 50buck and they didn't want to refund the overcharge.","title":"Currency issue","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"Bahareh","text":"I placed my order on 4\/6 the item has been sitting in “verified authentication” waiting for packaging for almost 10 days.\n\nThere is no contact form easily found to communicate what the holdup is.\n\nBut I have received 13 marketing emails (every-single-day get one) form you guys in the last 2 weeks.  Don’t email me every single day to buy more when I’m not even receiving what I’ve already bought.","title":"I placed my order on 4\/6 the item has…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"JD","text":"The process to order my product was extremely difficult. I’m not sure exactly what the problem was however, I could not purchase my product without a third-party. I had to go through PayPal because my credit card kept getting rejected… The same credit card I used through PayPal. Customer service was available to a degree. You can only communicate through email. There’s no phone number.","title":"Credit card issues","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"Will Wiseman","text":"Incredibly hard to do business with. Treat every customer like a suspected fraudster. Very frustrating to be spending $300+ on a product and be treated with suspicion and multiple security checks. I used my credits card 10+ other places during time that StockX denied it. Eventually went somewhere else because they made it so hard to convince them I as using my own credit card to lawfully by their shoes. Total pain int he neck.","title":"Incredibly hard to do business with","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-18","author":"Mk","text":"customer service takes too long to answer my questions and they sent me  fake shoes.","title":"customer service takes too long to…","stars":1,"location":"JO","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"Geoff","text":"Way too slow, don't understand how other online platforms can get something delivered in 2-3 days and you guys take two weeks minimum. The seller gets too much handling time and posts too slow, they should be made to express ship everything. If I am paying way over RRP for an item, I at least expect it delivered in a reasonable time....","title":"Too slow","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"Jonathan","text":"I made a purchase on March 31st it’s now April 18th and I still haven’t received my shirt. Hell of a first time buying experience on the app it still says no schedule delivery ? Like how am I suppose to get my shirt ?","title":"I made a purchase on March 31st it’s…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"RRR","text":"Out of the 5 items I have bought (not bidder but met the lowest price) only one has come through and not cancelled.","title":"Inconsistent","stars":3,"location":"OM","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"LM","text":"Took 15 days for Stock X to decide they couldn’t fulfill the order I’d placed. Won’t consider ordering from here again ☹️","title":"Took 15 days for Stock X to decide they…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"Shaniqua","text":"I still haven’t received my package","title":"I still haven’t received my package","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"An","text":"I ordered my shoes over two weeks ago and they haven’t even arrived to stockx.","title":"I ordered my shoes over two weeks ago…","stars":2,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"customer","text":"Shipping and fees are very high.  Shipping to receive order taking way to long.","title":"Shipping and fees are very high","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"Asmith","text":"DO NOT USE THIS SERVICE. We dropped the parcel off at the UPS collection point and obtained proof of this.  However, this parcel did not seem to made it anywhere else.  UPS have confirmed that they are able to trace the parcel, but the agreement is between StockX and UPS and not with you.  StockX refuse start an investigation because it hasn't started it's journey.  So even though you have done your bit and dropped it off with the StockX label at a recommended drop off point and even have proof of this, there is nothing you can do because StockX won't help you and UPS will only deal with StockX.  Our experience lost us £300. DONT USE THIS COMPANY...YOU ALSO CANNOT SPEAK TO ANYONE IT IS ONLY ONLINE.","title":"DO NOT USE THIS SERVICE","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"Mike Allen","text":"Buyer beware. Bought 7 pairs of trainers over the years. Last pair failed after 1 hour wearing. Nike Air cushion heel. ( $500 pair ). Zero support as I had taken the tag off even though I emailed 2 hours after the FedEx showed than arrived. Complete lack of true customer support. Obviously good fakes that failed at first wear. ( both heels ). Do not purchase here. The premium is not worth it, I pay them to spot fakes not me find out after wearing them within 1 hour and no recourse. $500 buck wasted. Like I said buyer beware.","title":"Buyer beware. $500 bucks wasted on fakes","stars":1,"location":"GY","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"Marina","text":"My experience with StockX was terrible!  I ordered 2 pairs of converse (spent $400) for my daughters birthday size US6 and have received Mens 6, Woman's 8.  Nowhere on StockX website does it say that US 6 is equivalent to men's 6 or woman's 8 so I am stuck with 2 pairs of limited addition shoes that are 2 sizes bigger than what I ordered. I have contacted them same day, spoke to a customer representative Myles who could not do anything for me.  I have provided StockX with all the information and pictures, asked to speak to a supervisor in hopes to resolve my issue and they are simply ignoring my request. I have also offered to pay for any shipping charges hopes in make an even exchange.  My daughter is devastated. I will make sure to share my experience with StockX on every social media so other people don't have to go through similar experience.","title":"My experience with StockX was terrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"bryan","text":"I am having issues with the time it takes for things to be processed and delivered. Other than that it has been great. I may be slightly impatient","title":"I am having issues with the time it…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"Sha","text":"Just wished shipping would of been quicker.took a while for stockx to get it and than for it to ship to me.i Paid like $20 for shipping and would of like for it to be received in 5 days or quicker.i mean footlocker doesn't charge for shipping and you still get your order from them in less than 7 days.","title":"Just wished shipping would of been…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"},{"date":"2022-04-19","author":"Cindy","text":"StockX should require orders to be signed for, when delivered. Or give an option to pick up at a location, since it’s common for shoe orders to be stolen. I should have received my order on 4\/12\/22, it is now 4\/18\/22 and FedEx is still giving me the runaround about my shipment. Saying it’s on a delivery truck out for delivery but “there is a high volume of orders” which is delaying it. There have been no more updates scans since 4\/12\/12 at 2:52 am when it was scanned onto the truck. Yeah I’m sure it’s because the driver knew what it was and came up. And FedEx nor StockX have been helpful at all!!","title":"StockX should require orders to be…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=32&stars=1&stars=2&stars=3"}]