[{"date":"2022-01-07","author":"Sapna","text":"This is the worst company ever. You can't review what you are purchasing as they have your payment details stored and if you click buy and expect to review your order then forget it. They have already taken your money out and confirmed it. I had  made a mistake and couldn't get through to anyone at StockX and they will only answer anything after you have had the shoes delivered. Its a scam. They are unwillingly leading people to buy things they don't want by pressing buttons incorrectly and no review and clarity on what you are buying. I'm not a trainer guru and didnt realise there are no protections with this site. Money making scammers","title":"This is the worst company ever","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-07","author":"Kevin Vue","text":"Stock X will scam you. I bought a pair of Saucony Shadow 6000 Food Fights and they sent me a worn pair. The images I clearly sent to their customer support team said that although they've been worn they still passed their deadstock process! Are you serious?! They would not compensate me for sending me worn shoes or provide me with a full refund. They told me to sell it back on their platform so that someone else can deal with this same problem. I sold it back on their platform and it's been over a month and it still says payment pending! Stock X is just out here taking our money! Scumbags!","title":"Stock X will scam you","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-07","author":"Bab Dylan","text":"Have been using StockX for multiple years without any problems, but now it was my time to get a bad experience with this company. As a EU resident you have your right of withdrawal, but when i tried to use my right, they start ignore me, and then suspend my account. Have now sent a complaint to EU Consumer rights. Can only recommend other people who has bad experince with this awful company, to write a complain, so they can get punished for now following the law in thoose countries they operate in.","title":"Shouldn't be allowed to run a business","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-07","author":"Keri Leigh","text":"I am so angry right now.  I ordered shoes for my daughter but they were too big.  The size on the box was right but the shoes were not. I didn’t check the shoes.  I resold them on stockx but when stockx received them and tried to authenticate, they failed because they were the wrong size.🤬 The original “authenticity” tag wax still on the shoes.\nThey charged me $15 and sent them back.  \nI WILL NEVER USE THIS COMPANY AGAIN","title":"So pissed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-07","author":"Joha","text":"Am very devasted ordered my son Jordan 400 dollar worth did not receive my package which says was delivered dec 26 th  but StockX shows my delivery is 01\/05\/22 was home the entire day n we didnt receive  it been emailed there in no customer service number nobody had even tried to contact me I wish I listened to my gutts  does anyone know how to go about it coz am not loosing 400 dollars no am not I have to get the shoe or the money","title":"Am very devasted ordered my son Jordan…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-08","author":"Tom ","text":"Do not do business with this company. Had an order placed for a PS5 on my account. I do not play video games, nor does my wife. Got a notification from PayPal with a deduction of 700 dollars. Changed my password, cancelled my pp agreement,  contacted stockx immediately. Was told I would hear back from a  representative in a few days. Been over a week and nothing. TERRIBLE customer service and terrible company. Will never order another pair of shoes with your company again.","title":"Account compromised, no response(32053796-31953555)","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-09","author":"End of Novelty dot com","text":"Don’t use StockX. \n\nIf you buy an item from stockX, and they send you a tampered-with item, this is their crappy condescending patronizing response (to someone who has spent thousands of dollars on their site):\n\nHello, we are sorry to hear about this issue! We can assure you that prior to shipping the item to the buyer, we verify it in-person with our authentication experts who inspect each item to ensure that it meets our condition standards. This is also stated on our FAQ, and you can always reach out to stockx if you have any questions regarding this. However once we take a look at the item and it is within the condition standards buyer are encouraged to resell on Stockx if they do not wish to keep. Thanks!\n\nDon’t use StockX. \n\nWatch. They’re probably going to copypasta the same response below.","title":"Don’t use StockX","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-09","author":"Holiday","text":"StockX sent me fake cool grey 11s. Please explain and how can I get my money back I don’t wear fake stuff i NEED my refund","title":"StockX sent me fake cool grey 11s","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-09","author":"meln","text":"Ordered a PS5 for my son on Tuesday Dec 17th. The seller shipped same day, and they got it on the 18th. Thursday the 19th it was verified. THEY SAT ON IT FOR 4 DAYS THE WEEK BEFORE CHRISTMAS, THEN MAILED IT VIA GROUND TRANSPORTATION!!! \n\nThis company literally exists for materialistic people - why didn't they have extra people working to get verified items out immediately during the most materialistic holiday? They never had an option for expedited shipping, and block their customers from calling the shipper directly to change it. Not surprising in December, the package was delayed by weather. It is now January 9th, and we STILL DON'T HAVE IT!\n\nThis is an excellent business model, but VERY poorly executed.","title":"Can't figure out how Christmas presents work","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-10","author":"Seth","text":"crappy UI, only worth while thing is the portfolio for tracking my collection. For some reason as of tonight they thought all the useful stuff on the portfolio tab, like pie chart and ranks, profit werent necessary. hopefully they are just updated all those analytics right now and werent dumb enough to remove them entirely. Itd be great if that were the case cause the ranking system previously sucked. of the 10 million users i was in the top 50k by number items, top 1%  but for some reason it made sense to them to put top 1% as the 99% rank in portfolio. besides that long tangent on how dumb their UI is and the portfolio tab. The company sucks, they heavily engage in fee sucking parasitic behavior. I wouldnt buy shoes from them ever again. the fees are absolutely absurd.","title":"crappy UI","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-10","author":"Danique","text":"Sold my shoes via them, never received my money. 350 euro down the drain.","title":"Still waiting for my money","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-11","author":"$!L¥€R_Fo×","text":"Be advised stay well clear of StockX. They're cowboys and will con you your family and your friends out of lots of money and there is absolutely nothing you can do about it. \n\nMy advice? Shop elsewhere and avoid the brain damage of having to deal with these clowns.","title":"Be advised stay well clear of StockX","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-11","author":"Joseph Brown","text":"Yes I bought some Jordans from them back in 2020 and they came with a verified tag but was not real a 💯 percent fake so I literally wasted my money on some fake Jordans they are some con artist putting verified tags making you think your shoes real don't waste your money they charge to much to get rip off","title":"Yes I bought some Jordans from them…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-11","author":"Brandon Gullatte","text":"Ordered my ps5 10\/22\/21 they didn't send my tracking info and by the time I did get the tracking number it's been in the same spot and it's almost a month later","title":"Ordered my ps5 10\/22\/21 they didn't…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-11","author":"John Smith","text":"This isn't the first time this has happened. Sold my shoes, accidently sent wrong size (my problem). Then they never returned my shoes. They \"claim they return your shoes\" by never sending you a tracking number. I waited 3 weeks to be returned. Now they're saying I'm not eligible to file a claim because I had 3 days to file.\nWELL HOW WAS I SUPPOSE TO FILE THE CLAIM IF I NEVER RECEIVED THE TRACKING NUMBER OR GIVEN A NOTIFICATION THAT MY SHOES WERE BEING SENT BACK.","title":"Stole my shoes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-11","author":"Eddie","text":"This company is a ripoff.  Read the fine print before ordering anything from this black market company. Buyer Be Aware!","title":"This company is a ripoff","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-11","author":"Kassius","text":"Trainer did not pass verification due to size discrepancy on the box.\nThese were “supposedly returned to me” \nNever made it back. And was NOT given a full refund \nStockX do not care about after Service- I am currently £220 down due to incompetence of StockX returning goods. Apparently the policy does not insure or care about items being returned to customer.","title":"Do Not Use StockX! Stick to other selling sites","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-12","author":"Vanessa Nyberg","text":"They will steal your money. Purchased shoes for the first time in December, was charged at $245. That's fine. But when I went and looked at my bank account, they charged the $245 (which again, thats fine) but then charged another $256. I have tried multiple times to reach someone and their \"help\" system IS AWFUL. I've shown them the proof of everything, but they keep going around the problem. Just recieved another email of them stating that they will not refund me the $256 that THEY messed up. I would HIGHLY recommend to never order from here.","title":"They will steal your money","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-13","author":"$!L¥€R_Fo×","text":"If I could give a zero I'd give a zero. \nBe well advised stay well away from this bunch of cowboys. Better than that read the TrustPilot reviews or visit their official Twitter page. One or two you can forget about but it's everyone who's had an experience with StockX has either been scammed or conned out of their money. On top of this they're oblivious to criticism and fully believes they're doing a good job. Sound familiar?","title":"If I could give a zero I'd give a zero","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"},{"date":"2022-01-13","author":"zendika","text":"They will steal your money i bought a Juice Wrld x Vlone Butterfly that costs 67$, they refounded my order an after that they didn't give my money back.","title":"scam","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=83&stars=1&stars=2&stars=3"}]