[{"date":"2021-12-09","author":"Michael","text":"All thanks to customer servant Diana.\nShe decided to cancel my order without consent. \n\nShe decided that she didn't like my emails and forced the shoes to send back to the seller. Making me reorder them and costing Stock x money in shipping fees.\n\nStock x needs to find better customer servants than Diana","title":"All thanks to customer servant Diana.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-09","author":"charlie Loss","text":"Ordered a pair of Jordan 1 High Retro Lucky Green sneakers from StockX. Had no email or confirmation on the app. Been trying to get hold of somebody from the company for the last 2 days but can’t get through. Money has been taking out of my account even though no sign of order on the app or via email. Now I am currently with no awareness of wether I have actually purchased my order whilst already having the money for the item withdrew from my account. Making me feel very anxious this close to Christmas very disappointing.","title":"Purchased item - no sign of confirmation","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-10","author":"Dreski NYC","text":"very expensive prices for no reason whatsoeva, fix the price and ill spend money stupid","title":"very expensive prices for no reason…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-10","author":"aleshia heggins","text":"This place is horrible they charged me twice for a purchase and still haven’t received the shoes. It was delivered to the wrong address. The delivery company dhl is also sketchy they went to great lengths to steal my shoes they created a fake invoice and sent my shoes to the wrong address and then accidentally sent me two different receipts one saying I signed and another with a pic of a box on a porch that wasn’t mine when I complained I was told I didn’t file a case within 3 days so my refund was denied! I spent 500 dollars and don’t get a shoe lace! I want my money back","title":"This place is horrible they charged me…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-10","author":"ビクトルチン","text":"Bought new deadstock item.\nDelivered item was 100% used with lot of scratches.\nZero interest to solve this problem.\n\nWill never buy shoes or somethin expensive from StockX again \nCoz Support wont help You\n\nI hope they enjoyed my 600$ fakrs.","title":"Bought new deadstock item came used one.","stars":1,"location":"CZ","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-10","author":"Vidalina Ruiz","text":"This place is horrible. I bought a pair of Lebrons abs the first day my daughter wore them they fell apart. They also make it so you can’t return the items once you purchase them. Do not order from them","title":"Do not order from stockx","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-10","author":"B Nice","text":"They charged me for something without my authorization.   My bank charged me for insufficient funds on the unauthorized charge.   BEWARE STOCKX!!! \n \n*I have sent emails to the suggested address, and I get emails back saying that email account is not valid.    \"Post all complaints into the void, and no one will get back to you\".       I get it though, scamming requires work.","title":"FRAUDULENT CHARGE FROM STOCKX","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-11","author":"Erik Nielsen","text":"Horrible. This company exists to limit shoes to normal people and make them only for resale. When one of you end up w a disable kid and just want nice things you’ll get it. Thanks for making a 17 cool gray unobtainable. Man Since the last president the country has turned people into self centered, greedy *******!","title":"Horrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-11","author":"Patricia Munday","text":"If I could give zero stars I would. Gave this place a second chance and again didn’t receive my son’s shoes that were for Christmas even though they marked that they were delivered…do not trust this company. I still can’t seem to reach anyone in customer service!!! Horrible company","title":"If I could give zero stars I would","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-11","author":"azooz","text":"The transaction has been canceled from stock X from twenty days ago and so far no refund has been received","title":"The transaction has been canceled from…","stars":1,"location":"SA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-11","author":"Maverik","text":"It was to long to receive an order","title":"It was to long to receive an order","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-11","author":"Brandon","text":"I filled out multiple forms to add a trading card to the marketplace for buy\/sell with no response","title":"I filled out multiple forms to add a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-11","author":"juan","text":"shoes and box came damaged","title":"shoes and box came damaged","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-11","author":"Manny","text":"I haven't had any type of follow up after I have sent 5+ emails across 7 weeks of trying to find the location of my missing shoes. I have followed up with several employees and none have been able to finish helping me with my situation","title":"I haven't had my missing shoes found","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-11","author":"Quan","text":"when i click wrong button to check the price of a products， the order place but can not cancel it","title":"when i click wrong button to check the…","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-12","author":"Ms Cheung","text":"An order never came and no one help to assist or reply to my emails","title":"An order never came and no one help to…","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-12","author":" Lindsay Wright","text":"I continue to try to buy items that in the long run get cancelled. The one thing in common is the value of the shoe skyrockets and the seller never sends the item I purchased. That’s why I’m done looking on stockx for this stuff.","title":"I continue to try to buy items that in…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-12","author":"reyhane","text":"There is no proper size chart when you order so i ordered and it was small i wanted to contact customer support but there is no the services is so bad it will be my last time ordering from stockX","title":"Bad services","stars":1,"location":"CY","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-12","author":"Chris","text":"Customer Service needs improvement. I moved between purchases and my shoes were sent to wrong address. Called customer service multiple times and 0 help. Called FedEx they could not change delivery address due to a hold by stock x. This policy should be changed.","title":"Customer Service needs improvement","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"},{"date":"2021-12-12","author":"Ezekiel","text":"I bought a PS5 system that broke within a few months of purchase from StockX. Because I bought it through them it was difficult for me to get it repaired and led to a lot of frustration.","title":"BROKEN PS5…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=89&stars=1&stars=2&stars=3"}]