[{"date":"2021-12-13","author":"Austin","text":"I’ve gotten a lot of scratches on my sneakers thanks to StockX. Plus the fees are way too high.","title":"I’ve gotten a lot of scratches on my…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-14","author":"Just Joris","text":"0% understandment. I needed to send the product but In that week I had problems with my local internet providers and I could not get any information that I sold the product. They gave me very huge cancelation fee that I saved money for my parents Christmas presents. I contacted them and they said they can not do anything...","title":"0% understandment","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-14","author":"Carlos Lopez","text":"Horrible customer service. There is no number to call and no live chat. Only prefilled answers to questions. Then they make you fill out a form that says a response can take up to 48 hrs. Which is a major issue because we only have 48 hrs to ship a product once sold. So if there is an issue there is no way to get ahold of someone to fix it. Then they charge you astronomical fees which makes selling on the platform pointless because you barely make any money after the fee or worse, lose money on my case.","title":"Horrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-14","author":"Lisa H","text":"Purchased a pair of shoes for an Xmas present for my son and was charged and given a delivery time of before Xmas.  One week later and still says \"waiting for seller to ship\".  After trying for hours to get a live answer, was told it was an \"oversight\" and \"for some reason\" the seller was given longer but now they can't guarantee I'll get by Xmas and that I'll even get product at all.  And they will not pay extra to expedite to a customer when they have made an error.  Offered me a refund since they did charge me one week ago but that obviously doesn't do me any good as now I don't have time to get the product for Xmas.  Waiting to see how this turns out and hopeful I can modify this review with a happy ending.\n\nUPDATE: Thank you for responding.  The sneakers I purchased were released in April.  My order was confirmed on Wednesday, December 8th and the seller was given until the end of the day today to ship.  That is four business days.  Not sure why that differs from your stated reply.","title":"Xmas disappointment","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-14","author":"Eric Collins","text":"I purchased a new pair of shoes that was scuffed and looked like they have been worn please don't get scammed purchasing shoes from them. The customer support is horrible and they do not take returns even if the item is used or in bad shape","title":"I purchased a new pair of shoes that…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-14","author":"Anthony Battaglia Vlogs","text":"Ordered a pair of sneakers and they shipped them to me and 3 days later got another pair and another charge. Contacted customer service just to tell me to put it back on their site to resell so they can make extra % .. been asking around and to find out they’ve been doing the same thing to many ppl  .. if you order something please check if they charged you twice cuz you can’t return after you get it .. scam scam scam","title":"Ordered a pair of sneakers and they…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-15","author":"Kenye Jones","text":"I ordered a pair of shoes today but I’m sad I probably won’t be getting them for Christmas and I cannot get a refund","title":"I ordered a pair of shoes today but I’m…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-15","author":"Lisa H.","text":"You are lucky if you get your order.  I placed my order and due to “problems with their system” didn’t realize the seller didn’t ship until six days later (seller had two days) when I contacted them.  Rather than provide me with a replacement - as stated on their website “no extra cost” to customer - they said “sometimes the system doesn’t work”and couldn’t find a replacement and decided to cancel my order and issue a refund (which I will receive in 2-7 days).  Yet, I can go back online and order my own replacement from their site for $30 more than original price.  When I inquired about this, customer service told me I didn’t understand their costing models.  This was their mistake.  They overlooked the seller shipping deadline.  I could of ordered a replacement item four days ago and would of received over holidays.  Why they wouldn’t of solved my problem immediately today by allowing me to buy replacement pair with a promo code to honour original price I don’t know.  Instead no solutions were offered, no attempts were made to offer any additional support.  I was also told their customer service doesn’t support a phone conversation.  Terrible.  First and last experience with StockX.","title":"You are lucky if you get your order","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-15","author":"Juan","text":"Hi I have not purchased any thing from stockx.com but did get here trying to get some shoes for Christmas for my kids. Thankfully I always read the reviews and policies of the company's I choose to do business with. Thanks to most of these reviews and company's policies I don't think I'm willing to do business with stockx.com at this time. What really didn't make sense to me is why would a company not refund a customer for some shoes that got ordered by mistake or better yet by pushing a back button. Hopefully stockx.com will try to have some better customer service in the near future as their prices seem very tempting but I'm not a gambler and would prefer paying a little more for a sure thing. Thanks for your time.","title":"Hi I have not purchased any thing from…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-15","author":"..","text":"I ordered a pair of shoes on nov 23 and it was supposed to be here dec 10 the latest. It’s dec 15 and it’s still not here I’m disappointed because it’s supposed to be a Christmas gift and idk when it’s gonna get here because stockx doesn’t even let you track the package. My order has been “en route to stockx” for damn near a week now.","title":"terrible service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-15","author":"Giovanni Lopez Cortes","text":"My experience with them has been bad in ordering the service was a deception. I ordered some jordan retro 2 off white they canceled the order in less than 24 hours saying that it did not pass authenticity tests. How can the merchandise arrive in 24 hours and be reviewed that is cheating the worst\n\n, They send me a service representative and she tells me that the seller made a mistake in the size, which cannot happen, the truth is that I made an offer and a good deal, the jordan raised the hours and therefore they canceled. 50 dollars which I tried to use and its page tells me that it is not valid .. it is a false people be careful when buying the market has more reliable pages more serious people to do business .","title":"My experience with them has been bad in…","stars":1,"location":"PR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-15","author":"Stephanie Leslie","text":"I recently made a purchase from Stock X and the shoes i received are poorly made contacted them and spoke with David and he did nothing.\n\nIn response it was not glue , it is a hole & a rip in the back. Let's be clear.","title":"Disappointed in reccent purchase","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-15","author":"erikas marciulevicius","text":"It’s a fake!! \nI received fake item and on top of that was wrong size. And of course they not accept returns. Don’t buy anything guys! Save your money!","title":"It’s a fake!","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-15","author":"Alex","text":"THESE GUYS MOVED FROM STREETWEAR, NOW TO PREMIUM BRANDS!!! OMG UK AUTHENTICATION IS BEYONG BAD.. FOR GOODNESS SAKE BUY NOTHING FROM THEM!!!!  AUTHENTICATION IS APPALING!!! THEY NOT A CLUE WHAT DOING... I LISTED BURBERRY BAG,, I HAVE RECEIPT FROM FROM SSENSE,, YES \"SSENSE\" (PREMIUM BRAND OUTLET IN UK)..I PREVIOUSLY E-MAILED STOCKX SUPPORT CLARIFYING SLIGHTLY DIFFERENT TO ONE ONLINE. \"ONLY INTERNALLY\" LABELS . YET FAILED VERIFICATION???? YOU CANNOT MAKE UP HOW BAD THEY ARE..EMBARRASING. THEY PAY PEANUTS,,, SEEMS EMPLOY MONKEYS!!! CLUELESS!!! DO NOT BUY FROM STOCKX.. ITS A SHAMBLES. A COMPLETE MESS.. THEY NEED TO STOP SELLING ITEMS NO IDEA HOW TO AUTHENTICATE.... JUST LOOK STUPID!!! CANNOT VERIFY 100% AUTHETIC ITEMS,,, GOODNESS KNOWS HOW MANY PEOPLE RECEIVE FAKES!!!!! NEVER EVER AGAIN... WHAT A MESS.. TERRIBLE COMPANY..    \n\nI CLEARLY SAID I BOUGHT FROM SSENSE!!!!! NOT EBAY!!!!!!   ARE YOU GUYS THAT WRITE REPLIES AS INCOMPETENT AS AUTHENTICATORS... NOTHING THIRD PARY ABOUT SSENSE....\n\nTHEY TREATING CUSTOMERS LIKE FOOLS!!!!\n\nWHAT A MESS UK END IS... \n\nSTOP SELLING BRANDS YOU NOT A CLUE ABOUT..\n\nI HONESTLY NOT KNOW HOW GET AWAY WITH IT!!!!","title":"READ THIS!!!!!!! UPDATE REPLY!!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-15","author":"Femi Adesanwo","text":"I have received the worst service from the ‘Stock X’ company, I placed an order earlier this December in anticipation to get it before the Christmas and a week later and email came and said it had been delivered despite me being at home the whole day, I then checked with all my neighbours to see if they have received it by accident and no one had received it, i then proceeded to tell stock x this problem and a week later today I have received an email saying they can’t help me with my situation. What kind of service is this, Christmas is a approaching and the present I had ordered is not here and I am completely out of pocket. With nothing to spend on my family members and no present for my sibling. This is honestly heart breaking and quite frankly hard to handle.","title":"I have received the worst service from…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-15","author":"Yasmin","text":"Do not use!!!! Ordered a £400 pair of trainers for my boyfriends Xmas and they took the money then 5 days later emailed me to say they have fully refunded me because they don’t have the trainers!! When they refunded me it was a “full” refund at all, when asking they made every excuse not to give me all of my money!!! First time trying stock x and I definitely won’t be back!!!","title":"Do not use!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-16","author":"TY","text":"After reading the reviews, it sounds like this is just another company who scam people in one way or another!! No refunds? No exchanges? No nothing!! Sad that people get away with this!! I won’t be doing business and I hope you change your ways or shut down for good!! REAL companies have a phone number to call… they are honest and put customer satisfaction first which then means everyone is happy!!","title":"After reading the reviews","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-16","author":"Timo","text":"I ordered some Nike Airforce one and received them. They have a color mark on the nike sign on the side which you can see clearly. I then contacted the support and they just say that they don‘t do any returns or exchanges. So please tell me stockx why the fck do you do inspections of the shoes and send them even if they are clearly not in good shape?","title":"Verification is just a joke","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-16","author":"Qwezii","text":"I ordered the retro Jordan 11 as a pre order but they decided to refund my order. I do not understand how their  able to falsely advertise items they cannot get? Now here it is 2 weeks before Christmas and this is what happens. Terrible service I WILL ADVISE NO ONE TO BUY FROM HERE THEY NEVER DELIVER ON TIME or DO AS THEY SAY#cancelStockX","title":"Terrible service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"},{"date":"2021-12-16","author":"KIm B","text":"I’m very confused right now I ended up paying $340 for a pair of Germantowns for my son a few days ago hoping that they would get here by Christmas.. My bank account was charged but I don’t see the shoes on my account as pending and no confirmation email. Tried contacting StockX twice within the last three days asking why I do not see them on my buying profile. WTH\nPLEASE RESPOND TO MY EMAILS!!! THIS IS THE ONE SPECIAL GIFT MY SON ASKED FOR!!!! WHATS WRONG WITH YOU PEOPLE??!!! ITS CHRISTMAS, TELL ME WHATS GOING ON!!!! ZERO STARS IF I COULD!!!","title":"I’m very confused right now I ended up…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=88&stars=1&stars=2&stars=3"}]