[{"date":"2022-04-15","author":"Jason","text":"Never notified me that order did not passed inspection than said they were gonna refund me.  But instead found a different seller and added an additional 3 weeks to I get product. Only was told this when I inquired why my ordered was still in pending mode. Worst experienced will never order on here again. Total scam\nAnd waste","title":"Never notified me that order did not…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Rodnesia","text":"I ordered shoes in hopes that I would receive them. My order was delayed several times and then canceled","title":"I ordered shoes in hopes that I would…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"ghulamnabi","text":"FedEx messed up","title":"FedEx","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Jason","text":"It seems way to complicated to buy something I put in a bid and nothing ever happens. I have no idea if someone out bids me or not I just sit and wait for it to expire basically, also when I accidentally did a buy now option I could t retract my purchase seconds later, stock x had zero support and user friendliness didn’t exist to figure out how to cancel it. Luckily I did it they PayPal, which refunded me my purchase right away, then stockx got “mad” at me cause I did this and said they were banning me, oh no I am so sad","title":"It seems way to complicated to buy…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Me","text":"You hijack a credit card and don’t allow easy removal. Shame on stock x","title":"You hijack a credit card and don’t…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"JEROME JOSEPH","text":"DO NOT BUY FROM STOCK X! Use other sources. I Purchased pair of shoes and tried Them on. Walked to my car less than 30 ft away and in 10 seconds my shoe disintegrated! Contacted stock x and they refused to refund or comp me for the 400+ dollar paid for the shoes they cited a hidden policy that you never see through the purchase of your selected shoe. In fact the customer service rep was mouthy and never gave me the support requested and left me waiting. You can get it elsewhere- Don’t buy from these guys. They do not stand behind their business, and will take your money and run!","title":"DO NOT BUY FROM STOCK X","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-15","author":"Britt","text":"The product was fake.","title":"The product was fake.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Kianna","text":"Ordered sneakers for my son for his birthday and never received them but got an email saying it was delivered.","title":"Ordered sneakers for my son for his…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Gabe","text":"After buying a product online, without any reason or communication of the cancellation, the product was never shipped in the first place and I was thus refunded the product. I was still looking to buy the product but had jumped in price significantly, which is unreasonable since I had previously purchased the product at a different price earlier.","title":"Unreasonable cancellation of purchase","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Mark","text":"I requested someone call me about my order, nobody did. It wasn’t indicated to be an international order and DHL told me I had to give them my SSN. I did not. The order was returned. Now I think I’m out 1200 dollars. Not happy and if it remains so, I won’t be recommending or using your service again. Terrible experience.","title":"I requested someone call me about my…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Sayde","text":"I ordered a jersey it was being checked for 4 days and then it got canceled. Nothing was said, sent an email… nothing.","title":"I ordered a jersey it was being checked…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Sarah","text":"This is the first Time ordering with you guys and this was a gift for my niece and I was expecting them to be already shipped out but then I got a message saying they were delayed and I still haven’t had any updates it’s just really frustrating","title":"This is the first Time ordering with…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Edgar Gonzalez","text":"My package wasn't delivered to the proper address. It was delivered in a whole different town.","title":"My package wasn't delivered to the right address.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Maico","text":"They haven reply to my email it been more then 2 days","title":"They haven reply to my email it been…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Ray","text":"Good morning","title":"Good","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"jord","text":"Was unable to ship my items due to getting Covid and having to isolate, I sent StockX my proof and they still charged me a fee of £31.80!! They have since been ignoring my emails, very poor communication.\n\nAlias is a much better platform to buy and sell your shoes on, I will not be using StockX again.","title":"Charged fee for having Covid","stars":1,"location":"JE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"Peggy","text":"It's been 2 weeks since I placed the order to buy my NikeXSacai Blazer sneakers. There has been no updates, no way to understand what's been pending, no place to ask questions and track what's going on. In the confirmation email it says I can expect my shoes to arrive 4\/12-19 but the last email I received was the original seller did not send the shoes to StockX. I checked the Q&A session and it says there is no way to cancel the order. Frankly I would have just cancel the order if it was Ebay or any online purchase platform and buy them somewhere else. It's such a hot item that it would become hard to buy again if I lost the opportunity to bid this week. And yet StockX does not tell me what's happening with my order up til now. Deleted my StockX app already and won't come back anymore. I could have spent this $150 somewhere else and got my pair already.","title":"Terrible Experience","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"R. Duke","text":"Order was paid for and then cancelled after 2 weeks  and another 2 weeks for the refund.","title":"Order was paid for and then cancelled…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"채윤","text":"too late\nso angry","title":"too late","stars":1,"location":"KR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"},{"date":"2022-04-16","author":"customer","text":"We specifically went to Puma to make sure our shoes would fit and they must run smaller than anything at the store. they are too small and nothing we can do.....","title":"We specifically went to Puma to make…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=36&stars=1&stars=2&stars=3"}]