[{"date":"2022-04-01","author":"Martina","text":"It took forever for it to ship and then I received a message saying that they were out of stock and they were going to give me a refund. I literally waited for about 3 weeks just to be refunded.","title":"It took forever for it to ship and then…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Stuart","text":"Not the correct colour","title":"Not the correct colour","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Danny","text":"App keeps saying I cant make a purchase because im flagged by their risk prevention partner. I reached out to customer support and they said they didnt see anything wrong and asked me to reach out to my bank\/paypal. Reached out to them twice and they said they werent blocking any payments. My bank even said they had to approve 3 times just fir stockx is to block my payment again. I mailed stockx with all this information and pointing iut the issue on their side and I get no reply anymore. If you look online there are plenty of people being lied to by stockx. Complaining will just lead ibto your account getting banned. Reaching out via review website wont get anywhere. They just tell you to cintact support just to ignore you again. They should audit this company. For context I have bought more than 30 products from them, but when they decided a jacket I biught from their platform that I wanted to resell to them was “fake” they pretty much blocked any further purchases I wanted to make. The jacket i submitted for a sell even still had their original stockx tag on it. This company is a joke.\n\nUpdate: so its been a week since I reached out and only yesterday they acknowledged there is an issue while 2 other colleagues said they don’t see an issue at all and tell me to go talk to my bank and paypal twice. Aside from the fact they make me wait 2 days between every reply, they haven’t made any progress as far as solving the issue. So the last employee who rplied finally acknlowedged the issue but that is literally all she did. Nowhere did she mention why this is happening and nowhere did she mention they will solve it and when. Had to send another email just to ask her to solve the issue and she says she just forwarded it to the team responsible for this and another day passes by… I dont know whether they are doing this on purpose but these people anything but customer friendly.\n\nAlso please stop telling people to reach out to customer support just to do nothing… please make an actual attempt at solving the issue.","title":"App keeps saying I cant make a purchase…","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Taylor","text":"Pretty sure the shoes were not brand new and. I swear I read that there's returns but you can't return you can only resale not satisfied at all","title":"Pretty sure the shoes were not brand…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Joe","text":"Couldnt delete billing, had to call customer service.","title":"Couldnt delete billing","stars":2,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Dome","text":"SCAM!!! I bought shoes that were suppose to be brand new but I was sent used shoes with several flaws. I sent several pictures with proof. When I requested a refund I was told to resell the damaged shoes on their website. Which would have resulted in StockX being paid again and another customer receiving damaged shoes. Horrible business practices. Filed a complaint with my bank for the blatant fraud. NEVER AGAIN, BUYERS BEWARE!!!!\n\n\nUPDATE: StockX response to my complaint was to band me from their website as if I would ever purchase anything from them again. So glad they responded so everyone can see how StockX responds to their customers with threats and no results.","title":"SCAM!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Gianna","text":"Still havent recieved my package , its been over 15 days !","title":"Still havent recieved my package m","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Anna","text":"I placed my first order weeks ago and just received an email stating my order had been cancelled. The explanation didn’t even make sense and I completed a contact me form and have yet to hear from anyone. These shoes were a  13th birthday present for my son so to say that I am disappointed is a major understatement.","title":"I placed my first order weeks ago and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Cobra","text":"Sad to say I can't keep using stockx as my number 1 site for sneakers. Ordered the wrong size shoe and got literally no help. The return\/exchange\/cancelation policy is just ridiculous. Goat will let me cancel orders and do returns in the first few days of getting an item so they will be my go to from here on out","title":"StockX < GOAT","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Dissatisfied","text":"Shipping time too long.  Ordered on 3\/20\/22 my item still hasn’t arrived.  If I could cancel this transaction I would.","title":"Shipping time too long","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Tamecka","text":"I have not received my merchandise and have yet been able to talk to anyone to try to resolve this issue….","title":"I have not received my merchandise and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Antonio Holt","text":"One shoe had paint scrapes or paint on it.","title":"One shoe had paint scrapes or paint on…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"kim","text":"Have not received shipment as the tracking keeps being delayed.","title":"Have not received shipment as the…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"User","text":"I was sexually harassed at the stockx warehouse in Mississauga and HR did nothing about it. The management doesnt take into consideration on how people act they force you to talk to eachother even when you feel uncomfortable and not safe. Worst company i ever worked for","title":"I was sexually harassed at the stockx…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Roger","text":"I’ve ordered a few pairs of sneakers from StockX and have been satisfied until recently. I ordered a pair of Jordan 1’s on the 24th of March and hadn’t gotten any updates on a delivery date. I was ordering them for someone as a birthday gift and it’s looking like I won’t receive them in time which is a bummer because I ordered way ahead of time. I just want to know the status of my order.","title":"I’ve ordered a few pairs of sneakers…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"William","text":"You canceled my order, my son was very upset!!!","title":"You canceled my order!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"unkown","text":"i had no idea that there was no returns.","title":"i had no idea that there was no returns.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"None","text":"Heard a lot of bad stuff about this company recently.","title":"Garbage","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"JC","text":"I ordered twice both times my order was refunded and both time I was not refunded the full amount, will never order from here again","title":"Never received product and never got full refund","stars":1,"location":"NZ","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"},{"date":"2022-04-01","author":"Randy","text":"The barcode and the stockx tag come back different items one is a car engine and the other says unknown so i feel u owe me some real jordans or my money back.","title":"The barcode and the stockx tag come…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=57&stars=1&stars=2&stars=3"}]