[{"date":"2022-04-30","author":"Rajesh Iyer","text":"Got charged for A 325 purchase for Nike Shows. Received acknowledgement and confirmation that the seller had sent to StockX on time. Right when I would have expected a notification of shipping of StockX to me, I have now been informed there will be a delay with no info on est delay. This service sucks","title":"Got charged for A 325 purchase for Nike…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Kenny","text":"took too long","title":"took too long","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Christian Penn","text":"Trash been waiting for 5 days for a T shirt to ship lmao and they said it’s on fed ex it hasn’t been picked up won’t be buying from them just saying I’m not the type to wait 3 weeks for them to ship.. 5 days and still says carrier delay damn joke","title":"Trash been waiting for 5 days for a T…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Nabila","text":"I am disappointed because i ordered the shoes size US 8 which supposed to be 39 european in women but it came size 41 men","title":"Wrong size…","stars":2,"location":"EG","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"flooker","text":"U didn't give me my refund yet","title":"U didn't give me my refund yet","stars":3,"location":"IL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Que","text":"I'm giving it a one star due to the fact that I haven't had any update on my order in a whole week. I don't have a number to call. Honestly I'm just over it.","title":"I'm giving it a one star due to the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Rafael","text":"There’s no duckin  way to get in contact with the customer service And now I know it was true what people say about this shitt page , once I get my money back I’m never buying or selling here again","title":"Terrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"JOEY","text":"Product never delivered. Money never refunded","title":"Product never delivered","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Nick","text":"I ordered a pair of sneakers and it was marked delivered but I never got them. I was told by FedEx to wait a couple of days because sometimes its marked as delivered but hasn’t been yet. Still til this day I haven’t gotten my sneakers. I contacted StockX on multiple occasions and they refuse to help me because they said it’s pass 3 days and I have lost a lot of money.","title":"I ordered a pair of sneakers and it was…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"john","text":"Had multiple issues with the same order, contacted customer support two separate times with no response, the delivery times were much longer than said on the site and in the end the shoes were not even delivered. Use goat instead.","title":"don't use stockx","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Paul","text":"My review is based on the amount of time it took for the sneakers to arrive.. way too long that’s why I only will give 3 starts and I don’t know if I order again just because I had to wait 3 weeks","title":"My review is based on the amount of…","stars":3,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"K. D.","text":"The ordering\/receiving process itself was fine, but Stock X does not do a good job w\/  authentication. I paid almost $300 for my Mocha peach Jordan’s (double the original price). Once I received my shoes & upon further inspection, I knew my R shoe was authentic & L shoe was a fake. I can tell by the deepness\/groove\/look of the logo, pattern of bottom of the sole, & other features. Still looks like the L shoe is genuine leather though & the difference is slight, so at the end of the day I just decided to keep the purchase because StockX return policy is a real hassle and the pain\/risk of having to go through the purchase process all over again of the same shoe is not worth it. It’s just sad for $300, I know in the back of my mind only 1\/2 of my Jordan’s are real :(( Sadly, I will not be purchasing again through StockX & risking receiving another fake.","title":"Be wary of Fakes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Andrea","text":"I loved the shoes perfect material and matches w everything and have gotten many compliments","title":"I loved the shoes perfect material and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Ripped Off","text":"Order never arrived","title":"Order never arrived","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Rob Wiseman","text":"I ordered shoes that I paid over $400, and never received. No one ever contacted me to discuss what happened nor tried to resolve the issue. I'm currently waiting to hear back from FedEx while they investigate the situation. I would be very cautious about ordering anything from this company","title":"I ordered shoes that I paid over $400","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Alesha","text":"My left shoe was damaged and it's unfortunate that I paid markup prices for a damaged shoe, that I cannot return. I will NEVER order from here again.","title":"Damaged product","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"John Palos","text":"Took way to long,","title":"Took way to long,","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Kenny","text":"It was been two weeks and my order has not been shipped, customer service has not been helpful. This was my first purchase and I can say I am not using their service again. Other websites have better customer service and protection for buyers and sellers.","title":"Terrible customer service","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Jeremy","text":"My very first time using stockx and I had my reservations. Well it came it true. Simply put either the seller of the shoes or stockx failed my son in delivering dirt shoes. \n\nThere’s multiple marks on the shoe on the bright parts of the shoe none the less. \n\nReally disappointed and feel even more disappointed for my son.","title":"My very first time using stockx and I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Jacky","text":"Even though I signed up using a Canadian address and country.  The currency defaulted to US dollars and I didn't realized until I made a purchase.  \n\nGood platform otherwise to find items to purchase.","title":"Currency","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=13&stars=1&stars=2&stars=3"}]