[{"date":"2022-03-21","author":"hariyadi tengjoyo","text":"Hi Stock X\n\nI did many times everyday since Jan 31,2022 contact your cs thru email and chat but still the payout doesnt want make the payment, I explained many times that its not my account number and I never change my my payment info but my payment info changed by you after I complaint on Jan 31,2022 , its been almost 3 months if you dont want make the payment just return my 3 pairs sneaker sold item","title":"Dont Sell your item at StockX","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Ryan","text":"Took too long for the order to ship an arrived.","title":"Took too long for the order to ship an…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Jayden","text":"Order was stopped by customs.","title":"Order was stopped by customs.","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Shannon","text":"I received a shoe that was entirely YELLOW when the pictured shoe was an ice clear sole, and I immediately inquired and was told that sneakerheads would know this is acceptable, and I can find a cobbler or self-proclaiming shoe restorer to possible make the shoes look like they are pictured on this site, but by no means would this qualify a return. Just WOW.","title":"Shoe looked ENTIRELY different, return refused","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"coley","text":"I did notice a defect in the heal on the grey it looks like a spot was repainted","title":"I did notice a defect in the heal on…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Toni Gaytan","text":"this site is pricey, and doesn't even allow returns, I will NEVER, buy from this company again, neither will I recomend to anyone.","title":"this site is pricey","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"sharitta","text":"Still have t gotten my order it’s been almost a month couldn’t even find a number to call … this is my first and last time I order","title":"First n last time I order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Jaida","text":"My shoes haven’t delivered yet and I need them by the 31st !!!","title":"My shoes haven’t delivered yet and I…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"HB","text":"a wrong pair of shoes was sent to me. i ordered a men pair of shoes and they sent me women.","title":"a wrong pair of shoes was sent to me","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Rylee Pere","text":"I purchased a $325.00 pair of shoes and after purchased had been complete my Mastercard had been charged $499.00 i am not happy","title":"I purchased a $325.00 pair of shoes and…","stars":1,"location":"NZ","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Andrew P","text":"Ordered my son Carmine 6’s on the 4th of march, paid in full. Update said they would arrive by the 18th. No updates until the 18th saying they “dropped the ball” on my order and it was taking longer than expected. I checked app today the 22nd and it said order was cancelled and money refunded. So almost a month of my son waiting on his birthday present for it to just be cancelled without even trying to get the order i paid for sent to me. Stock x is trash. Will never use again!","title":"Ordered my son Carmine 6’s on the 4th…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Lisa","text":"I don’t understand how the shoes passed inspection there cracked and had been colored over with a sharpie such a rip off","title":"I don’t understand how the shoes passed…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Edward","text":"The process was easy.  The issue is that StockX will place their verified sticker on the item which is very difficult to peal off and can tear part of the package.","title":"beware of their sticker","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Tony","text":"Ordered shoes two weeks ago and they still havent arrived at stockx. Last time i shop on the website.","title":"Ordered shoes two weeks ago and they…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Tony","text":"I never got my order and its taking forever for my items to arrived when i spent well over $600plus and it has pass the 1 to 3 days shipping to stock x to authenticate the items. I havent heard anything since. The delay turned days to weeks now. I dont know whats going on.\n\nUpdate: after this earlier review one of my items finally was updated. But the other items idk whats going on still with the delay.","title":"I never got my order and its taking…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Nick","text":"This company sucks, never buy from them. GOAT is 100 times better :)","title":"This company sucks","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"jonas","text":"i ordered a pair of jordan 1s and they should be already deliverd today, but the package hasnt even arrived at stokc x. So i have to wait so much longer, it is really annoying","title":"takes to long","stars":2,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"Andrea","text":"Fake products scam!","title":"Fake products scam!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"C.D.","text":"I would not recommend ordering luxury handbags from this company.  I made the mistake of ordering a handbag from StockX instead of spending a few extra hundred dollars to get it from the store.  I did receive the bag and it did look like it was in new condition and authentic.  However, the bag was supposed to have the pochette and that was not included.  The advertisement shows the pochette and there is no mention that it would not be included.  I have a very difficult time contacting Stockx in regards to this issue.  I relied heavily on reviews of this company before I made the purchase.  While the reviews were pretty good, they weren’t really specific to the handbags.  This company has more of a focus on sneakers\/shoes.  I think the handbag area may be fairly new.  They need to improve in a lot of areas if they want to continue to be a seller of luxury handbags.  The following are concerns I have with the company and reasons to suggest you consider not using them:\n-no phone number to contact anyone with questions or concerns. They have an email option, but that makes it very difficult when\/if you have an issue\n-they don’t show you pictures of the actual bag you will receive.  It is a picture they pull from somewhere online. \n-description for item is very vague and doesn’t necessarily let you know what is\/isn’t included.  \n-I’m not sure how knowledgeable the authenticators of the handbags are as they authenticated my handbag without the pochette.  \n-the prices aren’t necessarily cheap or cheap enough to risk purchasing from an outside company rather then going to the brand name store. In my case I could have spent 400.00 more and wouldn’t have had to question authenticity or deal with the back and forth on the missing pochette. Wasn’t worth it.","title":"luxury handbag buyer beware","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"},{"date":"2022-03-22","author":"David","text":"Still haven't received my shoes","title":"Still haven't received my shoes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=72&stars=1&stars=2&stars=3"}]