[{"date":"2022-04-08","author":"Adeline","text":"kept canceling my order.","title":"kept canceling my order.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Brandon","text":"Everything was in the up and up. I received a real Xbox Series X in a timely manner for the price that was advertised. Advertised price is deceptive. Just know you will pay almost $60 in taxes and another %12 processing fee above advertised cost and another $19.95 for shipping.\nXbox Series X advertized price: $590\nSales tax: $55.21\nProcessing fee: $ 26.55\nShipping: $19.95\nXBOX Series X total: $692. 21 HOLY Crap!! \nThat's a lot of extra fees! Be aware!","title":"Xbox Series X was delivered. Price is a little deceptive.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"matt forkan","text":"Charged $224 for a pair of sneakers but received no confirmation, no email, no nothing. Now have to wait at least 7 days for the charge to reverse and stock x are impossible to get ahold of to expedite the charge being returned. Yet another company willing to take money 24\/7 but not willing to offer support 24\/7. Should be a crime to operate a business like this","title":"Charged $224 for a pair of sneakers but…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Figura Boost","text":"This is not a normal store. Stockx is just a middle man between the seller and the buyer. The seller first has to ship to stockx  and stock x then ships to you which typically takes around two weeks for you to get your item( if lucky). Cancelling an order is difficult unless you wait 30 minutes to chat with a rep. The item i wanted was $236 and i found them in finish line for $222 and they were shipped directly to me in less than 4 days.","title":"Two weeks to receive item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Bryce","text":"Took a few weeks before they canceled and took even longer to get my money back.","title":"Canceled order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Potion","text":"My package was supposed to arrive a few days ago, it arrived at the facility over 2 weeks ago and was almost instantly authenticated but now its been awaiting packaging for over 2 weeks.","title":"Slow service","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Alishanae","text":"The return\/exchange policy sucks. Spending that kind of momey should come with those options. Email for contact is also a sucky way to communicate especially since you dont do exchanges. First and last time. Great product barrel customer service.","title":"The return\/exchange policy sucks","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Nathan","text":"Got a serious defect on the shoe I received. Has a big bulge on the side idk how they made it threw the inspection process very disappointed \n*update* inspect your shoes right away because anything over 3 days they will do nothing for you so reaching out will do u no good","title":"Got a serious defect on the shoe I…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Dustin Barnes","text":"You can't get a refund for shoes that don't fit they just expect you to re sell them when you get them and they are the wrong size.","title":"You can't get a refund for shoes that…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Jorge","text":"It asked me for an ID or passport and I'm not comfortable with that","title":"It asked me for an ID or passport and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"John Philip Ensafian","text":"No customer service to call about order issues and really bad shipping on their part. I won’t order from them again.","title":"No customer service to call about order…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Alejandro","text":"Apparently, my package was delivered, but I did not receive it.","title":"Apparently","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"danny","text":"Being a frequent customer for the last 3 years and speanding around 12k dollars in their platform I get 0 help from them solving issues with my payment. I suspect they did something with my account after 1 of my sells didnt pass authentication(mind you this was a product I received from stockx originally but was kept in the box until I sold it back to them incl the stockx tag still on the item)\n\nSo after speaking to 4 different customer service employees over the course of 2 weeks and having to wait a couple of days in between replies I have pretty much heard everything but the solution:\n\n1. Your paypal is rejecting the payment 2. your creditcard company is blocking the payment 3. “we do not recognize any issues but reset your payment information 4. We recognize the issue but wont do anything about it 5. Recognize the issue will firward to the right department and reset your payment information again. 6 now the app says my region is not correct while I made dozens of purchases with this region\/address.\n\nThey made me reach out to both paypal and the bank twice, the bank even told me stockx was blocking the transaction! And they are still pretending everything else but them is causing this issue!\n\nCan Stockx stop being shady and help me finally? Stop making me wait a couple of days in between replies. I haven’t received any help from you guys at all.","title":"stockx support doesnt care about its customers, either playing around or has no clue","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"John E","text":"Horrible customer service! StockX can't even afford a call center to deal with issues but reply with a low budget chat that are like robots. My product is held in customs because they don't know how to fill out custom forms. Don't buy here it will not be good","title":"Horrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Chip","text":"I ordered 1 pair of Jordan 1 pollen with a buy now bid. I was charged twice and sent 2 pair of Jordan 1 pollen. I only ordered 1 pair. There was no way for me to stop or cancel the 2nd pair. There was no number to call and the help tip didn’t provide me with the right information. So I’m stuck with 2 pair of the same shoe","title":"I ordered 1 pair of Jordan 1 pollen…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-08","author":"Patrick","text":"I ordered 2 pair of shoes the 1st pair I paid 199.00 and wasn't even the right shoes the 2nd pair was 150.00 and still have not received them I will not ever buy from here again","title":"I ordered 2 pair of shoes the 1st pair…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"Sergio Torres Sotelo","text":"I have been a customer of StockX for a while now, and I recently purchased some off-white shoes. The shoes I received where damaged, full of glue residue, logo damaged. I reached out to customer service thinking east simple return. I purchased $400 shoes, I received a damaged product, easy return like in any other company. To my surprise they are telling me that is passable to their standards that they can’t provide a refund.\nI am in shock and disbelief that in 2022 you buy a product get a damaged one, and they won’t refund you.","title":"Received damaged shoe and won’t get a refund.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"Kimberly ","text":"I was disappointed because the shoe box has a large dent. The shoes were expensive and I expected perfection.","title":"I was disappointed because the shoe box…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"Herwin Brown","text":"I haven’t received my order","title":"I haven’t received my order","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"},{"date":"2022-04-09","author":"Nikisha Crosby","text":"My shoe never got authenticated thus the poor rating","title":"My shoe never got authenticated thus…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=46&stars=1&stars=2&stars=3"}]