[{"date":"2022-05-03","author":"tk","text":"I was charged for two of the exact same shoe.  And was shipped both shoes.  \nI only ordered one. There is no way to contact anyone.","title":"I was charged for two of the exact same…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Cordaya Sla","text":"I love that stockx has almost any sneaker I’m looking for but I strongly dislike the shipping time frame from stockx … I feel they should give customers automatically free guaranteed 2 day shipping. The length of time to receive my order is the reason I started to shop online elsewhere.","title":"Shipping & receiving takes too long","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Hashirama","text":"Happy with delivery but my shoe came with a dirty finger print i phucking erks me","title":"Happy with delivery but my shoe came…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Adriana","text":"I send an email asking a simple question and till today I have not received any response.","title":"I send an email asking a simple…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Kudi","text":"Answering customers is not prompt at all. No phone call to call, no email to be sent. Live chat take for ever and orders are not updated or revisited its a crazy website.  I pray they shipped my order as promised today or I get a refund for.","title":"Answering customers is not prompt at…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Tyrone","text":"Process of even getting your order takes way too long.","title":"Process of even getting your order…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Alison","text":"Too small, wish I could return, try To sell for the price I bought them","title":"Too small","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Lisa","text":"I do not understand his site I  bought sneakers, they were too small ,I lost $120returning them","title":"I do not understand his site I  bought…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Kass","text":"I paid $276 dollars for a low-quality damaged replicated version of black and white Nike dunk lows. I opened the box and at first glance, the Nike box appeared off. I did a side-by-side comparison with multiple boxes from Nike.com and no match. The color, tag, and “Nike” sign are no match. The left shoe is ripped and the pair do not match one another in regard to stitching and material placement either. There is even a flaw in the stitching of the Nike symbol on the back of one of the shoes. Within the hour of the shoes being delivered to my home, I reached out on the StockX app in an attempt to do what I needed in order to return them and get a refund. You have to first take photos of the shoes and send them in in order to request the return of the item. StockX sent me an email requesting more photos. I emailed the requested photos back to them within the same day. After a few days of waiting to hear back, they tell me after reviewing the photos I sent to them, that the pair of shoes I have passes their authenticity test. This was my first time using this app and will definitely be my last. Such an absolutely pathetic excuse for a platform in place to make people feel comfortable purchasing \"authentic\" items. I will do everything in my power to spread the word to any and everyone I know or come in contact with about how disappointing and ridiculous of a platform this app is. Save yourself time and most importantly the money. You","title":"I paid $276 dollars for a low-quality…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Carlos","text":"One part of my purchase was cancelled because apparently the other part never shipped the shoes, but my credit card was charged as soon as I placed the order, then two weeks later you redounded me the money in another currency and I lost money in the exchange","title":"One part of my purchase was cancelled…","stars":2,"location":"DO","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"JUSTIN","text":"Pretty terrible first experience with the site. None of the suggested timelines for purchases applied and there is no way to contact customer service in order to get a real-time update. Ordered product on the April 16th and as of May 3rd it's still not here with no indication of when it will actually arrive.","title":"Pretty terrible first experience with…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Arohi","text":"The lace was broken","title":"The lace was broken","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Matt","text":"My product was sent back and I never received anything. It wasn’t the best first experience with your company.","title":"My product was sent back and I never…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Brenda","text":"The shipping took too long!","title":"The shipping took too long!","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Charles","text":"Item I ordered was missing something that came with sneakers. Verification process isn’t the best.","title":"Item I ordered was missing something…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Jasmine","text":"the shipping was the worse delivery through fed ex needed a signature coming at 5am and when you call can’t change to pick up very inconvenient then it says out for delivery and it wasn’t on sunday","title":"the shipping was the worse delivery…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"MD","text":"You buy and spend money then don’t get your purchase. Refund being sent","title":"You buy and spend money then don’t get…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"ahmad","text":"The service is too slow the order stop on every level three - seven days, and its too slow I expected I will get the shoes on 7-14 days . I order from 3 weeks and dont get the order😔😔","title":"The service is too slow the order stop…","stars":1,"location":"IL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"VLI","text":"First time to use stock x, \nthe seller did not send out the goods, \nOk, but then set up for another seller, \nNot clear what the status is after, just saying found another seller and will send to stock x for verification, no further update whatsoever   No details what the status is, then got the refund afterwards…. Not recommended for any high value item trade, will only get disappointment…","title":"First time no luck","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"priya","text":"everything was good but they charge me more but send me bill of it less. Thats not good","title":"everything was good but they charge me…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=8&stars=1&stars=2&stars=3"}]