[{"date":"2022-04-27","author":"Globus","text":"The chrome material (hole) was damaged on the back of the right shoe. I noticed this as soon as I took the shoes out of the box.","title":"The chrome material (hole) was damaged…","stars":2,"location":"LV","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Derrick","text":"Almost 4 weeks and haven't received shoes or an email back","title":"Almost 4 weeks and haven't received…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Greg Klatt","text":"Pretty positive I got fakes. The jade color isn't even fully around the whole shoe. I will be taking pictures and sending them back.","title":"Pretty positive I got fakes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Gabriella","text":"I ordered two shoes and got my money back because the process was not completed.","title":"I ordered two shoes and got my money…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Jeffry","text":"It would be good to have an update when the seller does not ship on time or at all. You get a message saying that sellers have 2 business days to ship, but in my case it took 2+ weeks. My order took longer than expected and I had to go search online to see what could be happening. There was no clear information on what was going on, I don't mind waiting more time but having a clear reasons why it was delayed.","title":"It would be good to have update when order is delayed","stars":3,"location":"CR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Poo","text":"I only gave 3 stars, not because of the item received, it was just what I ordered and came sooner than expected. The only problem I feel is all the extra fees are extremely overpriced, such as tax, processing fee, and shipping. totaled $38.09 which is very high. I probably won't purchase a lot of items because of that.","title":"I only gave 3 stars","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Nahdia","text":"Promised delivery Time is totally overdue but product is already paid","title":"Delivery Time","stars":2,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Juan Esparza","text":"Overpriced! It'll be 3 weeks before I get shoes that I paid double for. The last time though.","title":"Overpriced","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Erik","text":"I bought a NEW product , it was used. Never using StockX again. Scam and way over priced.","title":"It said NEW","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Lewis","text":"still waiting for delivery","title":"still waiting for delivery","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"SA","text":"This is my first time using StockX. I will know for the future that the purchase process can take longer. We appreciate that our first order couldn't be verified and StockX quickly refunded our money.\nOne thought for the future- perhaps StockX could offer an alternative buyer to the consumer instead of just a refund.  We are waiting on another pair of shoes that are taking longer than advertised and if StockX had verified sellers (like Amazon) we could mitigate delays by using this option.","title":"This is my first time using StockX","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Jesse","text":"Received shoes. Tag was bent in half \/ damaged not happy","title":"Received shoes","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Abs","text":"This was my first time ordering from Stockx and I’ve had wort customer experience ever. My order has been delayed beyond its due to date and all I got was sorry it’s due to covid that’s delaying the process. As a result, I requested for a express delivery to expedite the process but I was given a NO. Every other online store understands the urgency of customers but you guys clearly missed the point about customer satisfaction. This has now caused me to really think about if I should order from you again.","title":"This was my first time ordering from…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Guy","text":"Shoes looked used and lumpy like they where worn for a while. They were listed as new so I’m confused","title":"Shoes looked used instead of new, I feel overcharged","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Al","text":"A merchant on StockX tried to sell me broken item resulting in a cancelled order. Now they are asking me to review this.","title":"Cancelled order","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Poon Hunter","text":"First of all it would be 3.5 stars if I could rate this in that way. I've never had a negative experience with Stockx, BUT that being said I'd appreciate them much more if they incorporated some sort of shopping cart and actual codes for discounts, especially when an order is quite expensive. Otherwise the service works as intended and I've even double checked authenticity myself and by going to other professionals. No issues shipping, authenticity is assured, and if they had more customer perks I'd give this 4-4.5 stars.","title":"Consider it a 3.5","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Evan","text":"I still have not received my shoes that were supposed to be here last Weds the 20th.  Someone please call with an update (203) -982-8497.  Fedex tracking says pending with no update","title":"I still have not received my shoes that…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Snoop man","text":"Ordered this sick pare of shoes that was sold out on every other website I could find em on, payed for them on stockx and then 4-5 days later got an email saying I’m not getting my shoes and they’ll give me my money back in a few days. Got the money back all grand but had to go buy some other pair of shoes off jd I would’ve much rathered the shoes I payed for in the first place ygm","title":"I h8 stock ex","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Gabriel","text":"Shipping time was very inaccurate, had to cancel my order which I was counting on.","title":"Shipping time was very inaccurate","stars":2,"location":"PA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Adil","text":"Ordered Jordans. Seller never shipped them. Was informed a week later even though policy says 2 days.","title":"Ordered Jordans","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=18&stars=1&stars=2&stars=3"}]