[{"date":"2022-02-07","author":"Azemina Alovic","text":"I ordered 3 essentials hoodies in different colors all in the same size and were all identical 100% authentic. I decided to order another color and this one came unauthentic. The sizing was off the material was completely different and you can clearly see the tags were in different fonts. Everything about the hoodie was off when compared to the 3 other hoodies I already own. I contacted customer service  and provided an abundance amount of pictures and they 1. Took forever to get back to me via email and 2. Said that the item has been observed by several authenticators and said that it was 100% authentic. They didn’t even let me send it in for them to see it In person. The only option they gave me was to sell it back on StockX which they take a portion of the money anyway. Never buying from them again. Not worth it and the customer service is TRASH","title":"Horrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"Leslie Moore","text":"Placed an order 2,weeks ago, still hasn't arrived at StockX for authentication.  Got a generic email back explaining how my order was on its way 5 days ago but they provided no tracking info.  Spent $200 on a pair of shoes that I've paid for but have no idea where they're at.  Really unhappy with service.  Absolutely would not recommend to anyone and will absolutely not use again.","title":"Don't use StockX","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"Bvbm Bklyn","text":"Updated after a month waiting to here back they send me this msq keep in mind they authenticated the shoes send them to me and when I send them back with concern on the email they send we’ll see for your self .. \nAmount Refunded\n$388.68\nAs you know, we have a multi-step authentication process to ensure that your order is correct. Unfortunately, your recent order for the Jordan 11 Retro Cool Grey (2021) didn't make it through that process. As a result, we have canceled your order and have issued a full refund in the amount of $388.68.\nYou can expect this to hit your account within 3-5 business days. We apologize for the inconvenience and thank you for your continued support. \n\nYou be the judge and I’m tired of them saying we are sorry bla bla bla it’s been 6 weeeks I don’t have the shoes and I’m. Ow getting the money back to buy the shoes from someone else . I’m done last review bcuz I will never buy anything again ..","title":"Updated after a month waiting to here…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-08","author":"Rico Ruff","text":"Never ever ever shop with them","title":"Never ever ever shop with them","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"Trayshon Riggins","text":"THE SELLER WHO SELLS ANY SIZE EARLY RELEASES OF THE JORDAN RETRO 9 CHILE RED IS A FRAUD....I've been shopping with StockX for over 5 years. Had some good experiences and some bad. Here recently they've had this \"Early PayOut Program\" for sellers to receive your payment as soon as they \"ship the item\". This incentive creates avenues for rogue sellers to create shipping labels and cash out on your money without ever shipping the item. THIS HAS HAPPENED TO ME TWICE WHILE PURCHASING THE SAME SHOES FROM, WHICH IM SURE, THE SAME SELLER.","title":"Retro 9 Chile Red seller is a FRAUD","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"Ana Valdez","text":"I ordered the Yeezy 500 in Ash Grey and they were fake!","title":"I ordered the Yeezy 500 in Ash Grey and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-09","author":"Kyle Knoll","text":"Terrible.  Ordered a PS5 and was notified that it showed up within days of my order for authentication.  Weeks later (after they charged me) the status finally changed to shipped, but the track just said label created.  Weeks after that the status changed again several time to authentication and preparing to ship.  It’s been almost two months and no real update from Stock X.  Also no way to cancel your order using their website.","title":"Terrible, product never shipped","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"Rami Taweel","text":"Horrible shoe company. I ordered some af1 on 1\/5\/22 and now it’s 2\/10\/22. A WHOLE MONTH AND 5 DAYS LATER I still don’t have my shoes. Some plain ol af1’s. Y’all are ridiculous bro. Never ordering off of here again. How hard can it be?","title":"Horrible shoe company","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-11","author":"Jesse","text":"Have been waiting over a month for a pair of Jordan’s that I have paid over £400 for still not arrived and status of order tracking is saying still with authenticors. I’ve emails many times and only had one reply stating that there “ still with authenticators” clamming my money back this is discting customer service. There is no contact number or anything for help of this kind. And no specific details of your order is discussing! No reassurance or any kind!","title":"Have been waiting over a month for a…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"David","text":"The sent me fake Nike dunk pandas. At first they refused they were fakes but I had overwhelming evidence. They then finally budged and let me return them. They however blacklisted my address from buying again. Customer service was also very rude and unprofessional. Definitely don't use.","title":"Fake Nike dunk pandas","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"Carlo","text":"⚡️FAKES on StockX!!! ⚡️Soooooooo sad about my latest purchase on StockX!! 😩 Bought a pair of Nike air max 90 Dizzee Rascal “Tongue n Cheek” for 2100,- dollars and they are obviously fake!!! Saying cheek cheek on the tongue. I mailed them and they told me that I only had 3 days to issue a product complaint and they were sorry for the inconvenience. I just spend 2100 dollars on a fake pair of shoes and they verified them!! Now they are not willing to help at all!!!  I bought about 90 pairs of sneakers on StockX the last 3 years and I’m stating to wonder if there are more fakes among all my purchases!!! To all fellow sneaker heads out there!! Don’t ever buy anything from StockX again!!\n\nBad place, fakes!!\n\nRegards Carl","title":"⚡️FAKES on StockX!!","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-12","author":"mareshah cannon","text":"I bought a pair of Jordan 11 retro cool grey 2021 recently. the sneakers smelled like marijuana, stain on the tongue of the shoe and the Jordan symbol on the shoe looked like he’s holding Pom poms very disappointed","title":"I bought a pair of Jordan 11 retro cool…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"Richard Mills","text":"Not impressed at all with stock x. Attempted to buy 4 boxes of cards only have them tied up in their “verification” process, then they cancelled my order. I look the items up again on their app only to find them $20 higher. Extremely suspect. So if the price on the item spikes a bit expect them to cancel your order.","title":"Not impressed at all with stock x","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"Alpha bah","text":"Horrible, \nI bought yeezy sneakers here, Fedex deliver to the wrong location for them to tell me there is nothing they can do about. I want money back","title":"SCAM DO NOT BUY","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"AK","text":"Was in contact with StockX who agreed to do a refund months ago now after sending a damaged item. Wrote a negative review here and StockX pretended to take info about my customer support ticket, promised to be in touch to resolve the case but have since not responded to any emails or contacted me further. Absolutely atrocious customer service even after agreeing to resolve the issue.","title":"Absent customer support - shocking for a company of this size. Avoid at all costs !","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Linda Zhao","text":"So ... this is my second post on here ... and it's StockX again. Do their authentication center really work?? are they working? The first time I received the Off-white Jordan they said it was their mistake and they did a refund, however, I got a penalty on another platform since it was ' fake '. The second time, recently, I bought the TS Fragment High, and again, the platform I used it said fake. However, StockX has never improved their skills and I am just scared it will happen again, to me or to anyone who is out there. They will do a refund and give you a 100usd voucher and end up with saying: ' it does not meet our StockX brand standards '. Why we are here to bear their responsibilities? We need to be scared and double-check if the shoes are real or not, at the same time we pay for the service fee and stuff. Is it really fair? What should I do now? What else I could ask them to do?","title":"received fake shoes twice from StoxkX","stars":1,"location":"KR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Ethan G","text":"Stock x sent me damaged sneakers and would not refund.\n\nThe damage is a small scissor cut to the tongue of the sneakers.\n\nIt’s not easily visible when worn but noticeable when inspected.\n\nThey didn’t refund or help rectify this situation.\n\nI don’t know where along the line it was damaged but it’s insane given the price for them.","title":"Stock x sent me damaged sneakers.","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Dav S.","text":"They tell you all the products are original but unfortunately they are fake ffffffaaaaaaakkkkkeeeeeee !!!\nI bought Adidas ultraboost 19 when I got the parcel I was shocked of poor quality and materials!!!!! \nI have paid 166$ for one trainer and all I got a piece of shi* \nStockX you are on my black list now I hope all people think twice before purchasing any Items I lost my 166$ For a pair that costs 20$","title":"They tell you all the products are…","stars":1,"location":"KW","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"BSkel","text":"Bought a pair a shoes 1\/22\/22 and saw they had defects. Reached out to customer service about reselling and they said they should pass verification again since they had the first time. Sold and sent in on 2\/2\/22, and sale was cancelled. Reached out to customer service and was told the shoes had a \"foreign smell\". They never left the box in my possession. I asked for more verification and no response. Terrible experience and customer service - no consistency and no support.","title":"inconsistent verification process","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"},{"date":"2022-02-14","author":"Daryl Baker","text":"So this is the first time I have used stock X and will be the last! \n\nI brought a pair of trainers at the lowest ask price which was listed…. \n\nPaid via Apple Pay payment processed then cancelled and they then said I could buy at the new price which was higher!!! £40 more…??? \n\nPayment was taken from my account for shoes I didn’t even buy.. because they cancelled but still decided to take my money… why is this?? \n\nI then received an email to say there was a problem with my payment method which was too slow and that someone else had purchased the trainers? (These shoes are not hyped) \n\nI very much doubt that at that exact time some one else wanted said shoe! I was told that the order is cancelled and I will receive my refund in 7 working days….? Even tho I didn’t even buy them as the payment void??? \n\nFor such a big company this is a joke, Is this how they make their money taking peoples hard earned money for something they didn’t actually purchase because they cancelled on their account!! \n\nI have emailed got one response and haven’t heard anything for 24hrs and still nothing now I have no faith in hearing anything, going by all the reviews I have seen on here!! \n\nI have even contacted Stock X via Instagram and had short not helpful responses, told to contact my bank which I did today and wasted 1hour of my time to get no where… going round in circles is frustrating!!\n\nI think it’s damn right rude and terrible from a company that excels them self as such a big sneaker\/trainer site. \n\nI will never use this site ever again it has been the worst experience I have ever witnessed, I will also recommended to friends, family and social media too not bother to waste their time. \n\nSeems like GOAT or stadium goods will be the next option as I have read better reviews.. \n\nJust give me my money back…. Stop wasting my god dam time!!","title":"So this is the first time I have used…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=79&stars=1&stars=2&stars=3"}]