[{"date":"2022-03-20","author":"Michael","text":"I ordered a item on 3\/8 and I am still waiting on my item to be delivered to the authentication center. I reached out to coustmer service and all they said is it is delayed with no explanation as to where my item is. I feel it is very unacceptable that I have to wait this long for my item stock X already took my money for to be received by the stock x authentication center.","title":"Shipment issues.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"KC","text":"I bought a pair of triple black Jordan 1s. It was supposedly put through a verification process. However, when I received the sneakers, they were fakes. Now I'm out almost $200. StockX claims to verify authenticity, but how is that possible when I saw the mistakes that made it a fake 5 minutes after I got them. Smh I won't be ordering from there again.","title":"They sold me fake Jordan's","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Jasmine","text":"Shoes delayed. Still haven’t came, paid a lot on taxes with delivery","title":"Shoes delayed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Sara","text":"I’m frustrated that I purchased “new” condition shoes and the box came destroyed and with the label put on there from a different box. I’ve been trying to work things out with customer service but haven’t gotten a response back yet to try and get a return. Their no cancellation policy is frustrating. I’ll pay closer attention next time and won’t repurchase in the future.","title":"Wouldn’t recommend","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Jason","text":"I don’t know where this review goes but the last time StockX asked how my customer support went, I gave a one star review with details of how they’d lost me as a customer and nobody contacted me afterward. I think they don’t really care. Short summary is their fulfillment operations are broken, caused me to get multiple orders for the same thing, and that created a real mess given their “no returns” policy.","title":"Their fulfillment operations are broken","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Mike Shavers","text":"Just received my Jordan 12 playoff, and was very disappointed in StockX. The pair literally was wore and they still send them to me. I literally learned of the smell test from StockX and the shoes don’t even smell brand new. I have a pair of brand new twisted 12s, From months ago with a stronger new smell than these have. They had scuffs and stains that Stevie wonder or any blind person could see for that matter and creased. They still sent me the shoes. This isn’t the first time StockX has sent me a bad pair of shoes, but these were unacceptable. And if I ask for a new pair or money back, they won’t honor it even though it’s their fault. They told me before that a scuff was a manufacturer defect and their allowed to sent it to you.(as if you want to pay StockX prices for bad shoes. Right!). Your only option with StockX is to resell them and take a L because your not getting all your money back unless you sell them higher then what you paid plus StockX fees and shipping( good luck breaking even). Here’s the icing on cake. STOCKX WANTS YOU TO RESELL SO THEY GET PAID EVEN MORE MONEY FOR THERE MISTAKES. but as I said before these shoes were actually worn, without the new smell inside them and had badly visible stains, so how do I go about selling them, they’ll probably deny the bad pair they sent me, which is mind boggling to begin with. I will no longer buy from this company. Too many bad business practices. I only ever write reviews when I feel like I’ve been done so wrong that no one else should feel what I felt. You can take my review with a grain of salt or you could be smart and save your self the (Money)hassle with these Clowns\n\nThis part is for the StockX reply. These guys our lairs. How you send me a pair of shoes as bad as these and now you need to review it. It wasn’t reviewed when you sent them out. How about you guys take pictures of the shoes you review and the QR code and send the proof to us, so that when we get it we can know if they were swapped or something. I don’t have anything from your checking process so if I do send pictures (which I’m not)(waste of time like I said before)(not my first bad experience with StockX but definitely the last)your going to say that those aren’t the shoes or some BS so why even reply to my message. I know how GreedX works. I’ve bought a pair of white Oreo 5s Jordan that came beat up but new, and StockX just brushed it off and closed my case without giving me a chance to even argue the fact that they were beat up. The just sent a message saying the case was closed because their allowed to send manufacturer defective shoes to customers. But enough clearing up this smokescreen from StockX. Anyone who want to see my bad pair I got from StockX hit my email Freshwezy @ yahoo.com I will send you pictures so you can see this poor work performance. Since StockX hires Blind Workers(nothing against Blind Community). But let me say this, I’ve spent thousands on StockX and most times shoes our ok\/decent at the least. But I’ve brought at least 5 pair now that should have been returned to sender. Then I get stuck with them, after I paid StockX to make sure my shoes were good at the least. So Why would anyone want to pay for bad service when the our other companies doing the same and you can return them. Bye bye StockX, it’s been fun(sort of)\n\n3-23-22 this the last edit. I just received my 2nd of 3 pairs of shoes from StockX(not buying from them again, just waiting on my last orders). Upon inspection of my QR Tag of the shoes I just received and checking the playoff 12s shoes I got that were bad. The QR tag was tampered with. So this was an Employee who swapped the shoes. No other explanation. It went from StockX to me, with no other contact but the Qr Tag was tampered with, come on StockX you gotta do better. Your employees don’t get discounts to help prevent this type of stuff? Absolutely ridiculous and just another reason why I’m done with you guys. Be smart people","title":"VERY DISAPPOINTED IN YOU SMH","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Ronnie","text":"Shoes were in decent condition but the original box was in terrible condition has all coners busted up and scrapes on top","title":"Shoes were in decent condition but the…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"jag","text":"they lost my package and didn’t refund me lmao","title":"they lost my package and didn’t refund…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Joshua","text":"It takes weeks for shoes to get delivered i order weeks b4 the actual release date and the shoes that I order haven't came in yet and the shoes already came out on release date and I haven't received mines gotta work on that","title":"Bad timing","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Al","text":"My package got sent all over the place instead of just coming directly to me. I was home for two days to receive the package but it never showed up and they redirected it to a local access point several miles from my house. I contacted StockX about this and they just sent the item the same exact way again, wasting everyone’s time and my money.","title":"My package got sent all over the place…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Pissed off customer","text":"I didn’t  receive my shoes after trying many ways to contact them I was unsuccessful","title":"I didn’t  receive my shoes after trying…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Fotini","text":"The worst ever! You took my money suppost you sent the order then you cancel and give me buck 20dollars les imagine to do this in 100 customer you make money and fake","title":"Worst!","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"francesco","text":"the shoes (air force 1 low lv07) arrived in the wrong size. I ordered shoes size 43 and they came in size 42.5. sorry for that because the shipping and the rest they were perfect","title":"wrong size","stars":2,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"DJ","text":"I was asked by StockX to leave another review so here I am. There is no customer service if anything goes wrong.  They will however copy & paste a generic message when you post on Trustpilot.  Not sure how that works but that's what happens.  I finally received my item however I have not received any communication from the company.  What would I do if the items didn't show up?  I would be in the dark.","title":"I was asked by StockX to leave another…","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Amelia","text":"I still haven't received my shoes YET.. RECEIVED an email from DHL stating on Fri 3\/18. LIED and said NO ONE was home..YET I was.. have RING camera at my door noone showed up. Now delivery has been changed til today 3\/21.. unfortunately, and sadly my son missed his bday surprise","title":"I still haven't received my shoes YET.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Daniel","text":"Never received anything. Emailed customer support and never got a response either. Buyer beware. Scam website","title":"Never received anything","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Dyva","text":"First it was hard to get my tracking information then it took 3 weeks to deliver after paying 40 dollars for delivery which was a rip off and still waiting for my package","title":"First it was hard to get my tracking…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Jasmine Anderson","text":"I only purchased the shoes from stockx because it worked with my deadline of when I would need them. I ordered the shoes on March 9th,you all have had the shoes from the third party since March 14th. I reach out to your customer service on March 20th to understand why, I haven't received any tracking information. They say they will look into it and it may take 3 days. Time is a concern at this matter, so I don't have 3 days for you to find out why they are already late. The estimated arrival date for the shoes were March 23rd. I get an email today saying I may not receive my shoes for another week or 2 because they still need to be authenticated. I either want my money back or tell me how much it is to speed this process along, because you lied and now I'm stuck dealing with the problem. THAT IS BAD BUSINESS.","title":"I only purchased the shoes from stockx…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Kesheila","text":"Stock x takes to long to send merchandise. I’ve been waiting 3 weeks already and still have not received my item. Process is to long!!!","title":"Stock x takes to long to send…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"},{"date":"2022-03-21","author":"Luis","text":"Never received my package!!!! I will never buy anything for stockX again!!!!!","title":"Never received my package!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=73&stars=1&stars=2&stars=3"}]