[{"date":"2021-11-28","author":"Scott","text":"Shipping delay - purchased on 11\/16 and still have not received on 11\/28. A little disappointed in the timing","title":"Shipping delay","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-28","author":"Matthew","text":"For the most part very satisfied with StockX however I had a f-ed experience recently.  Bought a pair of Jordan 1 Sea Foams for my wife.. I screwed up and got the wrong size.   I just turned around and resold them on StockX… never even out of the box. They sold quickly however they didn’t pass inspection when I sold them!!!??? When I asked why StockX rep was a complete ass… basically sidestepped my issue and said I shouldn’t have accepted them when I bought them.  Obviously someone screwed up… not cool.","title":"For the most part very satisfied with…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-28","author":"Peggy","text":"I was excited to purchase these shoes for my grandson as a birthday gift. The buying process went smoothly and they arrived quickly.  However, I paid full price and they were guaranteed New, 100% authentic Nike shoes.  When they arrived and were opened, they were obviously not new, creased, and stitching on both shoes actually coming loose in a few spots.  I would advise anyone to take precautions when ordering, consider other option,  and if this is their experience, to file a complaint with the Better Business Bureau.","title":"I was excited to purchase these shoes…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-28","author":"Daniel","text":"My prizm hanger box only had 19 of the 20 cards","title":"My prizm hanger box only had 19 of the…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-28","author":"andree","text":"Website indicated price in Canadian dollars but final\nBill was way high because of American currency\nVery misleading","title":"Website indicated price in Canadian…","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-28","author":"jzzybb","text":"i have ordered through stockX before and the shoes were absolutely perfect but my last purchase i was not happy with. the shoes look like someone used white out on then and their was little stains all over the all white shoe, even though i bought them as deadstock.","title":"i have ordered through stockX before…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-28","author":"Annette","text":"Bought a pr of sneakers n wasn't sure if the purchase went through soooo I did it again,  not knowing that an EMAIL was sent acknowledging my purchase. SO LONG STORY SHORT I GOT 2 PR now. Other than that I do like my sneakers","title":"Bought a pr of sneakers n wasn't sure…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-28","author":"James","text":"The purchase in question was a fraudulent purchase and they have done nothing to make this right. Poor customer service. They collect their service fees then pretend like you do exist. Better re-buy websites","title":"The purchase in question was a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-28","author":"Sammy","text":"FedEx is being a pain with assisting but the package says delivered but was not and we were waiting by the window all day and did not see any delivery truck or person come near our gate entrance. Hoping the seller can assist with getting in contact with FedEx.","title":"FedEx is being a pain with assisting…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Brianna","text":"I had ordered a sweatshirt ain’t an XL, the order says XL, the paperwork says XL, the confirmation says XL. yet, I get my order and it’s a XXL. I could send it back but it would cause delays and I wanted a gift for a birthday present. It’s unfortunate, because I do not understand how it could have been successfully authenticated if the size did not match. They do not accept returns and it’s too late to do anything about it anyways. This is not the first time this has happened.","title":"Authenticated, but was the wrong size?","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Oscar","text":"Here’s the Situation. I bought 2 pair of the same shoes, total accident. Stockx, said you can resale them, can’t stop the order. Even tho the seller hadn’t even sent the sneakers to stockx yet. 2-4 hours had past. Stockx stood firm. Then I bought 2 pair of the off white Jordan 2s. Stockx canceled\/ refunded my money for my first pair for no reason. No explained. Horrible customer service. Now I’m up 1 pair that I accidentally bought and down 1 pair of an investment.","title":"Customer service is trash!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"David","text":"delivery way too slow","title":"delivery way too slow","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Ray Wells","text":"Not to be trusted, multiple get-out clauses, be wary any dealings with this company.","title":"Not to be trusted","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"GIOVANNI NASTI","text":"ho ricevuto delle scarpe diverse da quelle ordinate (scarpe antinfortunistiche usate), fatto reclamo al corriere che è in attesa di una risposta da Stockx per procedere al rimborso, ma stockx non risponde, ne al corriere ne alle mie mail. servizio post vendita INESISTENTE!!!! appena ho fatto reclamo su paypal mi è stato bloccato l'account su Stockx, tutto ciò che dico è dimostrabile con foto e video.\n\nI received shoes different from those ordered (used safety shoes), made a complaint to the courier who is waiting for a response from Stockx to proceed with the refund, but stockx does not reply, neither to the courier nor to my emails. NO after sales service !!!! \nas soon as I made a complaint on paypal my account on Stockx was blocked, everything I say is demonstrable with photos and videos.","title":"PEGGIOR ESPERIENZA DI SHOPPING ONLINE DELLA MIA VITA \/ WORST ONLINE SHOPPING EXPERIENCE OF MY LIFE","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Scott","text":"Still waiting for product to arrive.  I should have just bought from ebay","title":"Still waiting for product to arrive","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Kirk R.","text":"The worst! Steer clear! They advertise iterms as NEW \/ UNOPENED, then they send opened items and offer no refund. Completely false advertising. Scam.","title":"The worst","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-29","author":"Tonimarie","text":"Absolute jokes bought a pair of Nike sb travis Scott back in July and never been worn sold them on stockX and the didn’t pass verification even tho the stockX tags was still in the box!!!!","title":"Absolute jokes bought a pair of Nike sb…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-30","author":"Client","text":"too many fees ( both side ) and delivery price","title":"too many fees ( both side ) and…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-11-30","author":"K Fathi","text":"I sold a brand new Yeezy Gap hoodie that you returned to me because of a manufacturer defect.  The defect you identified was so ridiculous and only noticeable under your unnatural examination lights.  It's highly unlikely the buyer would have noticed or even cared.  I know I wouldn't have.\n\nIt makes me think about the items I've purchased from you that have had imperfections.  I wasn't 100% satisfied with them but I didn't return them.  Going forward maybe I will now that you've set this precedent.","title":"Good Enough For Yeezy But Not StockX","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"},{"date":"2021-12-01","author":"Ryan","text":"I was ordering a gift for Christmas when i was charged 3 times! I had ordered the shoe I wanted, but It timed out with a \"400\" error. I then refreshed two more times but resulted with the same error. Five minutes later, I get 3 emails saying my orders are confirmed. Of course, they have a no refunds. I had bought from here before, but will not be buying from this website anymore. Also, make it very difficult to reach customer service.","title":"Sketchy","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=92&stars=1&stars=2&stars=3"}]