[{"date":"2022-04-05","author":"Joriunna","text":"no longer my cup of tea i'll buy inside the store instead","title":"Last minute","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"customer","text":"I ordered a pair of shoes and I wasn't really sure of the size because I'm a woman and the shoes were men sizes. I received the shoes in a timely manner and they were too little I decided to send the shoes back and when I check the website you guys did not accept returns and I had to sell the shoes on your website which is fine but I sold the shoes for the exact amount that I paid for them but I lost $64 in the process Because I had paid for shipping in taxes and you  Guys charged me to sell my shoes on your site so I'm disappointed in the $64 loss that I took.  I was hoping that because the day that I received them was the day that I found that they were too little that there would be some type of grace period In there and it was none","title":"Make sure you order the correct size","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"sejal","text":"The quality of shoes we bought didn’t seem to be worth the price. Seems like they are fake copy","title":"The quality of shoes we bought didn’t…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Lionel","text":"You charge both my payment for shoes, trash won’t be doing  business again.","title":"You charge both my payment for shoes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Jacky","text":"My the bag of my shirt was all ripped up and it was for a present. Too expensive for my package to arrive  like that.","title":"My the bag of my shirt was all ripped…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Danny","text":"I ordered a pair of Jordan 6 unc and they said there was a problem with my card. I checked everything and the next morning I seen there was 2 orders placed and they sent me 2 pairs of shoes. They would not let me return a pair. I had my bank refund my money and now I have someone's shoes that I did not pay for. Some people might think that is good but I don't it's not the right thing to do. I will wait to see if anything happens and if not I will give the shoes to a kid that is less fortunate.","title":"I ordered a pair of Jordan 6 unc and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Wilber","text":"I ordered 100t x jbl headset, and order has been stuck on “on its way to stock x” for over a week now. Why does it even need to be verified for authenticity if it’s coming straight from the manufacturer. I also had to pay for shipping on a that $300 headset, and it’s still not even on its way to me","title":"100t x jbl headset","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Jason","text":"Transaction was simple but who ever packed the box my sneakers came needs to be fired. My Nike box should not be smashed. Better filler material to keep the contents damage free is highly recommended. Thank god it was on a shoe I’m wearing and not a collectible. I was close to sending the purchase back.","title":"Do better.","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Bree Stuckey","text":"It takes entirely to long to receive my purchase! And apparently the seller didn’t send what I needed so they found another seller. I only found out that information because I tracked my package never got an email stating my shoes would take longer. People are paying good money to be waiting forever to get a shoe.","title":"It takes entirely to long to receive my…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"The","text":"I never received my items and was recharged for a order that was supposedly “declined” ….. and you can’t make a claim after 3 days but the delivery estimate they give you is also never accurate.","title":"I never received my items and was…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Van","text":"Good product line but late on arrival, it would help to speak with an actual person and the tracking timeliness can also be improved.","title":"Good product line but late on arrival","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"DJ","text":"I’ve placed 3 total orders (to date) that have yet to deliver based on what is seemingly a poor StockX affiliation with sub-par sneaker re-sellers. 2 of the orders weren’t up to the quality standard StockX has in place which is great!!! But, as great as that is. I came for hot sneakers, you guys haven’t delivered. Too many other outlets nowadays to not deliver. Sounds like a catch 22.","title":"Not Impressed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Jesus","text":"I understand business days, but the Authentication seems to take quite a while; and having it ship out.","title":"Authentication Too Long","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Teresa","text":"very slow to receive order","title":"way too slow","stars":2,"location":"TW","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Tam","text":"I can't give a complete review because I have not yet recieved my order [from 2 weeks ago]. So far, I'm dissatisfied with the speed of not only the product delivery but the status updates. I'm admittedly new to StockX and was unaware of the process to recieve the shoes. Still, I order many shoes from many sites and these have taken the longest, by far. \nThe order itself was accidental and there was no cancel information readily available. There should be a grave period to change my mind. That's a major negative. Nike\/SNKRS are excellent in that aspect of customer service. I wanted the shoes, however, so I've waited for the order to be carried out. After 2 weeks I'm still waiting for the shoes to be recieved by StockX. That leaves me with no clear indication of when the shoes will get to me. Yet the money was deducted instantly. If this is how purchases are generally handled, the chances of me patronizing StockX in the future are slim. There are far too many other sneaker sources.","title":"Still waiting...","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Shay","text":"My package has not arrived and i don't have any tracking information available when in select tracking because the sender isn’t reachable.","title":"My package has not arrived and i don't…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Kelly","text":"I want to return the shoes they’re too big","title":"I want to return the shoes they’re too…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Oliver Alessio Roberti","text":"Expensive to buy and sell. Authentic checks failed a pair I was selling for a truly tiny tear on the box (<1mm) and returned the pair. I have since moved to selling on eBay and Laced which I recommend to all those still using stockx. Bought a pair last year with no issues but again it was expensive. Good for checking the price of shoes though which is all I use it for now. Won’t be selling or buying from here again unless I can avoid it.","title":"Expensive to buy and sell","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"jarod","text":"I didn’t receive my item during the expecting date and there no is customer service I can enquiry on.","title":"I didn’t receive my item during the…","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"},{"date":"2022-04-06","author":"Nancy","text":"This was 1st buying from the company.  This was a birthday present for my son.  I understand the process, and appreciate it; however, after waiting 2 weeks, the product was damaged.  \n\nPerhaps they need to check out the person\/seller of where this orginated and make sure they are credible.  There was no explanation of why it was damaged.\n\nHappy I did receive a refund.","title":"First Time Buyer","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=51&stars=1&stars=2&stars=3"}]