[{"date":"2022-04-04","author":"Princess","text":"Did not receive order","title":"Did not receive order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Vereika","text":"Wrong size they took to long to get here","title":"Wrong size they took to long to get here","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"CZ","text":"Misleading… sold me a fake Ivy Park dress and didn’t want to provide a refund with obvious stitching discrepancies proven by pictures","title":"Misleading… sold me a fake Ivy Park…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Wayne","text":"Trying to bid on or purchase men's gymshoes for a reasonable price on this site does not seem possible","title":"Trying to bid on or purchase men's…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Ryan L.","text":"Sold two new pairs of Dunk Lows through the app. They both sold on the same day so I shipped them both out on the same day. Both pairs of shoes arrived within the timeframe provided by StockX to not receive any late delay penalty. I received an email that one of the pairs failed authentication and they are sending them back. Whenever I looked at it I could tell they clearly switched the pairs up. So I reach out to customer support immediately to let them know they made a mistake. I received a response days later and they said they’re sorry they messed up but they can’t reverse the cancellation. But get this; they’re keeping the second pair as a verified sale. And they’re excuse to me was “the beauty of our platform is you can resell at anytime.” With no consideration to the time I have and will lose on this deal. And I also have lost value as the shoe\/size is not worth what it was when sold. StockX should’ve just paid me out and kept the shoes to resell themself if they “can’t reverse” a cancellation. It’s clear the original rep was just lazy. Does StockX not have sellers sending multiple pairs at a time? Is that not a thing? Terrible experience and will not be using the platform to sell again. I can’t even imagine the buying process and don’t even want to go there. They will tell me “the money didn’t come. We cancelled. That’s the beauty of our platform. You can buy and spend money at anytime”","title":"Selling is a HASSLE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Nathanl","text":"THIS COMPANY \"SUCKS\" & THE TIME REFRAME OF RECIEVEING YOUR PRODUCT IS TO LONG..IVE NEVER EXPERIENCE HAVEN TO PLACE MY ORDER, WAIT A WEEK FOR THE MIDDLE TO SHIP IT TO THIS STOCK X COMPANY FOR THEM TO SHIP IT TO ME..I WILL NEVER AGAIN ORDER FROM STOCK X.THEN LAST WEEK, I REACH OUT TO CUSTMER SERVICE AN IM SENT TO A VIRTUAL MACHINE TO ANSWER MY QUESTION ,IN WHICH I GOT NO UPDATED INFORMATION CAUSE THEY TELL ME TO SEND A EMAIL.I DID AN GOT SAME INFORMATION WHICH WAS MISLEADING.AN HAD TO WAIT ADDITIONAL THREE MORE DAYS AFTER GETTING EMAIL. OH ,STOCK X HAS RECIEVED YOUR PACKAGE.IVE BEEN WAITING SINCE 3\/23\/22 FOR A PAIR OF SHOES THAT I JUST RECIEVED TODAY..VERY PISSED AN DONT THINK AS A CUSTMER MY COMMUNICATION WAS UP TO CUSTMER STANDARDS OF FEELING LIKE MY MONEY WAS WELL SPENT..BEWARE OF THE LONG TIME,TO RECIEVE YOUR PURCHASE.TO SAVE A FEW PENNIES ITS NOT WORTH IT..\n                   A VERY UNPLEASED CUSTMER❗","title":"THIS COMPANY \"SUCKS\"","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"Charli","text":"What kind of company has a no refund or exchange policy","title":"What kind of company has a no refund or…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-04","author":"TheM","text":"Went I got the notification my Package was delivered I was very happy but it said delivered in Boston ( i don’t live in Boston) AND said it was signed for (I clearly did not sign) I contacted stockx and they pretty much said F you with a smile because they claimed someone signed it up which means stock x does not care about you.","title":"Almost went bad.....","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Mollo","text":"Banned my account for no reason? I made my first purchase, got my shoes, and then like a week later got an email saying I was banned for fraudulent activity. Super weird.  All I want is to buy shoes from you bruv sorry for giving you business","title":"Banned my account for no reason","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Arun Jayasekera","text":"too many notifications, very annoying","title":"too many notifications","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Derek","text":"3 weeks and still have not received my order. They been waiting verification from your company for over 2 weeks. Won't order from you ever again","title":"3 weeks and still have not received my…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"judith","text":"My package was supposedly delivered. Never saw it. Shipper claims it was recalled by stockx and sent to Hong Kong. Been on phone with PayPal, DHL several times. Can’t get through to stockx. Sent me an affidavit to fill out stating item never received. Filled it out and when I sent it I got a reply that the mail box was not monitored. Gave a new email in the message. Tried to send it to that email. Was told it was invalid. I’ll NEVER buy from stockx again. Useless group of customer reps. You’re on your own for sure. No sneakers, no money and hours on the phone with everyone but them!!!!!!! BEWARE","title":"Buyer Beware","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"BAUTISTA\/BRENDALEE ALBANO","text":"I purchased the Yeezy slide for my son’s bday gift,tho I knew it will get to him late but it turned out not to be the problem, the item gone missing which I was told by emails from FedEx it was delivered, but my son or neither one of his household said it wasnt delivered and no where to be found. The site charged too much and now it’s missing. What a bad and unfortunate experience! I will avoid purchasing from StockX & not to go through FedEx next time. Too expensive!! I had to just for my son but it will be the last!","title":"Never Again","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Ali","text":"I did not appreciate the shoes I purchased as new were obviously worn the shoes were dirty and labeled authentic and new and that was just not true.","title":"Not as described","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"MARYAM SANJABI","text":"I recently purchased a pair of Nikes from StockX, and was told I would receive a notification when the seller sent the item to StockX for authentication. Per StockX's website, the seller has 2 business days to send the item to StockX. I checked the status daily, and StockX was still waiting for the seller to send them the item even after 5 business days [7 days, including the weekend] -- they never received it for authentication, but a week after my purchase, sent me an email stating that the item didn't meet their authenticity standards. Normally, I would feel very appreciative of fakes being weeded out, but this cancellation of my order due to 'authenticity' came at the EXACT SAME TIME as a sudden jump in the price of the shoes I purchased. The price of the shoe jumped significantly the day AFTER my purchase was finalized. The timing is EXTREMELY fishy on this, and it seems that the seller and StockX determined that they could make more money by cancelling my order and putting the item back up for sale at a higher price. This was my first and only experience with StockX, but I won't be going back. The price of this item went back down after that brief jump in price, and I went straight to GOAT instead.","title":"TERRIBLE experience with StockX","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Jay","text":"Stock X wants me to write a review on shoes I don’t have. Been waiting on my shoes for about a month now…Oh and I’m still waiting","title":"How?","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Patrice","text":"You canceled my order but didn't tell me why. It may have been something I could correct or satisfy.","title":"You canceled my order but didn't tell…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Lovey","text":"Shoes were rejected","title":"Shoes were rejected","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Mark","text":"The shoes I finally got has a conspicuous flaw","title":"The shoes I finally got has a…","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"},{"date":"2022-04-05","author":"Matilyn","text":"I love Stock X but my package I had ordered took so long to get here and they changed the estimation date about 5 times.","title":"I love Stock X but my package…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=52&stars=1&stars=2&stars=3"}]