[{"date":"2022-04-21","author":"Cameron","text":"Taking forever to get my shoes. Still waiting","title":"Taking forever to get my shoes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"MsGrace","text":"It wasn’t my size it’s fake and the stitching is not the original but can’t return it or exchange it says so I paid for fakes","title":"It wasn’t my size it’s fake and the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"John","text":"Ordered a Men's Size 12. Received a Kids Size 12. No idea how a kids size was sent out because shoe had to be sent in and verified. After waiting a few weeks to receive now have to go out of my way to return for a refund.","title":"Ordered a Men's Size 12","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Elena","text":"I have these shoes in the adult versions size 9 & 10 and my babies shoes came in and the top part of the shoe isn’t shiny like the adult ones only the bottom is shiny so idk if that’s just the toddler ones???","title":"Toddler Size 5c Jordans 1 Mid Diamond Shorts","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Sammy","text":"I absolutely loved this. The shoes are great, they came fast and I was undated the whole time. 😁🫶","title":"❤️❤️❤️","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Tiffany","text":"Takes way too long and my order ended up being cancelled because it didn’t meet their authentication process.","title":"Takes way too long and my order ended…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Stephanie","text":"Never got my product because they were unable to verify shoes","title":"Never got my product because they were…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Donny","text":"I was sent size 10 1\/2 in kids shoes and I ordered a 10 in mens shoes. And yet I can’t return them. I’ll never use this website again!","title":"I was sent size 10 1\/2 in kids shoes…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Rana","text":"The good thing that the shoes are authentic, but the bad thing that i bought a wrong size shoes , and there is no exchange , no return . I tried to sell them through your app , it took me forever to register and put my info . After that i tried to log onto n , i received like 10 emails saying that i need to verify my email and i did , but it retake me to the same window where i need to verify my email again . Even though i was able to open the page through my email , still it didn’t work . On top of that i lost more than 100$ trying to resell it right the next day bcz this was the price they post for me in order to sell them fast .","title":"The good thing that the shoes are…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Adam","text":"Waited a month for nothing and was refunded….. was excited to get my shoes but nope…. Very slow also. Not satisfied to say the least","title":"Long wait for nothing","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Corey","text":"Didn’t receive item","title":"Didn’t receive item","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Jahcory","text":"You have said u would refund me with in 3-7 business days but I have yet to receive a refund it has been 8 days and I have not received a refund from a missing purchase","title":"No refund","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Andy","text":"My order was cancelled by StockX yet they kept most of my money. Their customer support was unhelpful. I'm in the process of filing a chargeback with my bank.","title":"My order was cancelled by StockX yet…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Viviana","text":"The shoes were great, but customer service is lacking. I tried contacting them multiple ways to see why it was taking so long to ship and there was no way to get ahold of them.","title":"The shoes were great","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Glockboii","text":"StockX  just robbed me for a Playstation 5 digital because the box looked \"Used\" honestly so baffled right now .. i have over 50k in sales threw them, And i was linked to there sales policy. \n\n\"Stockx has no obligation to return items that do not conform to the description (including, without limitation, that the item is not new and unworn, is not the correct identified size, or does not include the original box).\" \n\nIn this random fine print thats hard to even find on there site they state if they deny the sale they aren't required to return your item. I don't know how this is even legal .. so now I am out $697 and my playstation 5. Do not do business threw them unless you want to be robbed too.","title":"Beware of STOCKX fine print ...","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Zak","text":"It takes a really lomg time to ship","title":"It takes a really lomg time to ship","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"sarah","text":"So far, not great.  Took 12 days for my shoes to supposedly be “delivered” and they haven’t actually shown up at my door.  I have spent the past hour trying to figure out how to contact customer service.\nIncredibly difficult process where you have to fill out a (nonexistent\/won’t download) affidavit then attach it to a separate form to notify customer service that you haven’t received your package.  This is crazy. Maybe it was a fedex error, but if so, the company doesn’t make it easy to reach them to try to report\/figure it out.  \nI don’t think I will be seeing those $120 sneakers unfortunately.","title":"So far","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Ismael","text":"Look this might not be a bad website but so far my i teams have been refunded it’s great that I get my money but the i teams won’t come and it isn’t my card.","title":"Look this might not be a bad website…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Destinee  M","text":"So I ordered the shoes 3 weeks ago . Normally when using goat the verification process and stuff doesn’t take long it’s been going on a month & im yet to receive my item.","title":"So I ordered the shoes 3 weeks ago","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Matt","text":"This was my first order. Bought 350’s for my nephew. Order was stolen by a FedEx driver in New Jersey and StockX is showing it delivered.  How was my experience? Zero stars.\n\nEdit: Stockx customer support is of no help. They don’t actually have any customer support. All their “support” is a series of questions to click on that circle back around to you order status page. Useless.","title":"What a steal! (Literally)","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=28&stars=1&stars=2&stars=3"}]