[{"date":"2022-04-26","author":"Ron","text":"Very disappointed and scammers 2 times I placed my order after 10 days is canceled my order.","title":"Very disappointed and scammers 2 times…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Maurice","text":"It took a week just for the seller to ship the shoe to the facility.","title":"It took a week just for the seller to…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Carter","text":"The shoe is an 11.5 which is the size of lost all my other shoes. However, the shoe really doesn’t fit my 11.5 foot.","title":"The shoe is an 11.5 which is the size…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"Adrian","text":"Item was ordered 3 weeks ago, charged and still waiting for package","title":"Delivery tine","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Aaron","text":"Terrible customer service. I ordered a pair of Bape Stas but they were marked as delivered even though nothing came that day. Contacted StockX and was told to make sure I met requirements such as filling in their form within 3 days. I filled it in and then a day later I got told they cannot do anything about it! Thank god they apologised to me profusely though!!! That really helped me soothe the £350 loss I took. Any replies to their emails have gone unanswered. Please do not deal with StockX, find deals through trusted members on Facebook groups.","title":"Terrible customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Pride","text":"Both shoes I bought were scuffed. \nTerrible experience","title":"Both shoes I bought were scuffed","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Rob","text":"We paid for sneakers.  Tracking said they were delivered but we never received the product.  We waited a couple of days to see if they were just late and when we contacted the company they refused to give us a refund or look into it further.  This was a horrible experience and I would not advise anyone to enter payment info through this website.  The red flag is not being able to use the phone to contact them.","title":"Buyer Beware!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Randall","text":"Your site never updated the status of my order beyound it arriving to you, ehich caused me to miss the first delivery by DHL, and had to reschedule.","title":"Your site never updated the status of…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Nicole","text":"Did not receive my item.  Tried twice to get assistance and didn't get any.\n\nWho thinks it's a good idea to leave a StockX package sitting outside in a city?  Just hide it or give it to a neighbor.  I just threw away $75.","title":"Did not receive my item","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"JC","text":"This was my first purchase through StockX. The seller never responded. Did not send the shoes. Before this all happened I asked StockX to change the shipping address and I did everything they told me and it still didn't happen. I even asked them if they offered promo codes or something for my time with this unsuccessful order and they said no. So for all of this, I have to give a 1 out of 5.","title":"This was my first purchase through…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Oliver","text":"Slow service - Trainers were more expensive than I found elsewhere and was unable to cancel the order immediately after I placed it","title":"Slow service","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Don","text":"Stock X didn't keep me i formed during the process. I was told the sneakers were sent to them and arrived to them but i wasn't told if they were authe ticated or shipped to me. They arrived on a Saturday but Stock X sent me an email on Monday that they were being shipped. I still don't know if tbey authenticated them.","title":"Stock X didn't keep me i formed during…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Garima","text":"I thought this experience would be good but it was a mistake. I had ordered with confidence and my order far is more than 12 business days late. Next time I’ll use GOAT. Very disappointed as this was my boyfriends birthday gift!!!!!!!","title":"I thought this experience would be good…but wrong","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Sarah","text":"They screwed me over it’s impossible to get a hold of anyone","title":"They screwed me over it’s impossible to…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Randy Sheen","text":"Love the sneakers but they were delivered to the wrong address. Lucky I got them back!","title":"Love the sneakers but they were…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Darren","text":"Sold Yeezy mx rock using their shipping label. Item apparently never arrived, will never use again. Then they had the audacity to try and charge me for not sending the trainers. Something dodgy going on with this company","title":"Scammed","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Mark","text":"i bought the wrong size and would like to exhcnage but there is no options to do so. all in all will go to shop next time","title":"i bought the wrong size and would like…","stars":3,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Asmith","text":"Rated 1 out of 5 stars\n19 Apr 2022\nDO NOT USE THIS SERVICE Re-posting this due to StockX replying that they will sort this out on my initial post, yet the emails I have received simply say StockX will not contact UPS to find the parcel. STOCKX please don't reply to posts to convince other customers you are apologetic and helpful, when you are actually not doing anything!\nDO NOT USE THIS SERVICE. We dropped the parcel off at the UPS collection point and obtained proof of this. However, this parcel did not seem to made it anywhere else. UPS have confirmed that they are able to trace the parcel, but the agreement is between StockX and UPS and not with you. StockX refuse start an investigation because it hasn't started it's journey. So even though you have done your bit and dropped it off with the StockX label at a recommended drop off point and even have proof of this, there is nothing you can do because StockX won't help you and UPS will only deal with StockX. Our experience lost us £300. DONT USE THIS COMPANY...YOU ALSO CANNOT SPEAK TO ANYONE IT IS ONLY ONLINE.","title":"Rated 1 out of 5 stars","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Liu","text":"The product is damaged and you did not let me know before sending it, I am very disappointed and will never use you again","title":"The product is damaged and you did not…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"},{"date":"2022-04-27","author":"Juan","text":"I can not stress this enough I would not order from this place ever again.. I recommend other people do the same or have a lawyer fill out the paper work because that's what it takes to get a change of address or to fix a simple mistake to get your money back or to even get your product that you paid for. I can't get my money or my shoes now.. really disappointed with this web sight.. get a lawyer before ordering from this place ever.","title":"I can not stress this enough I would…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=19&stars=1&stars=2&stars=3"}]