[{"date":"2021-10-25","author":"Bear","text":"Price fixing , canceling orders allowing sellers to sell for higher once they know they sold for too low . Awful customer service they will offer you 10$ off when you lose 300$","title":"Price fixing","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-25","author":"Aj Marks","text":"Customer service is bad. Need a phone number you can call. Chat room is always closed. \nPrices are good on some others are to high. They do have good things on there but need better customer service.","title":"Customer service is bad","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-25","author":"Ricardo","text":"I have no recive the order #28079111. DHL did not delivered in the rigth door.\nnot because is problem of DHL, Stockx wash their hands. They must intervene in this case. You must talk whith DHL\nRicardo","title":"order #28079111","stars":1,"location":"MX","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-25","author":"Roger","text":"you guys suck you gave me one shoe size 8.5 and the other shoe size 8","title":"good","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-25","author":"peelson “Tcp” mandela","text":"Money grabbing resellers","title":"Money grabbing resellers","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-26","author":"Angry","text":"If I could 0 stars, I would.\n\nMoney has been taken from my account yet no transaction shows up on the stockx page. Customer service is giving me the runaround saying that it is my bank (!!!) who should repay the money. The bank says the money is 100% with stockx, which is obviously true. \nAlso, the customer service agent who replied to me said that I shouldn't worry because the same thing happened to him. I don't care for his anecdotes and attempt to build camaraderie. I just want my money back. The money that stockx has already received.\n\nTaking money and providing no product is no more than theft.\n\nWhat an awful way to do business.","title":"If I could 0 stars...","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-26","author":"Natty Trends","text":"Second update: I was able to return the shoes and get a refund.\n\nUpdate: I am being given an opportunity to return the shoes for further inspection. If approved, I will receive a refund.\n\nInitial review:\nDo not purchase from this company the authenticity of there products are hit and miss. They do not any provide any reasonable recourse  for authenticating damage\/fake shoes and sending them to the purchaser. Specifically, I purchased a new pair of Jordan Bordeaux 6. Immediately, when I open the shoe box, I noticed threads sticking out in numerous places. In my 20 years of buying Jordan's from Footlocker and Champ's I have never had this issue. I paid nearly $300 for a pair of shoes from Stockx with threads sticking out all over the tongue of the pair of Jordan's. The company advised me to relist them for purchase in which I will not due to them not being authentic.","title":"Do not purchase from this company the…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-26","author":"Kvplr III","text":"Biggest scam artists ever they sent me a damged shoe and told me once i return it i'd get my refund. After returning the shoe they sent me half the amount i paid which left me in big Loss. DO NOT PURCHASE FROM THESE CROOKS! THEY WILL EVEN CHARGE YOUR CREDIT CARD EITH RANDOM AMOUNTS MONTHS DOWN THE ROAD WHICH HAPPEN TO ME 300$ EXTRA 2MONTH AFTER THE CASE WAS CLOSED... FOR WHAT?","title":"Biggest scam artists ever they sent me…","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-27","author":"sherrea simmons","text":"I'm afraid I may have been Robbed by StockX for over $263. I purchased an Jordan Raging Bull (Red) for my son with Autism so I'm Especially upset that after I paid in Full the so called seller still has not shipped the shoes. I Hate Theives with a Passion because I work Hard for my 💰 and I don't like anyone to take advantage of my money much less dissapoint my kid on something that he's waiting for. I Smell a Rat 🐀 but I've Notified my financial Institution to STOP PAYMENT to Stockx. Disgraceful Company and Should Never be Trusted.","title":"I'm afraid I may have been Robbed by…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-28","author":"kaleb beil","text":"I was selling AirPods and AirPods Pro’s on stock x, they all have original boxing undamaged still wrapped in the plastic and they got denied for absolutely no reason. They are real AirPods from apple and all have DIFFERENT and WORKING serial numbers. Tired of trying to do business with these fraudulent companies.","title":"Selling on stockx","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-28","author":"Ryan Graham","text":"StockX canceled my order after waiting for a month on them to arrive without any context I WILL NEVER ORDER ANYTHING ELSE FROM STOCKX.","title":"StockX canceled my order after waiting…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-28","author":"Nootie","text":"So I got tired of waiting for a PS5 to come in stock for awhile, finally I decided to give stockx a try. Paid 800 for the DIGITAL EDITION, didn’t even realize I was paying for digital. Thought it was at least disc. Been waiting about a month now. Still not shipped. If we’re not paying our sellers until we get our items why can’t we get our money back? Biggest scam.","title":"Makes you pay far over the retail for a console, just to take weeks to months to even ship.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-29","author":"Aj","text":"Your fees are higher for some people who’s not much active","title":"High fees","stars":3,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-29","author":"Arron","text":"Ordered a pair of shoes from stock X they took to payments instead of one. A pair of trainers that should of cost £150 has now cost me £300.","title":"Ordered a pair of shoes from stock X…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-29","author":"Julia","text":"HORRIBLE! DO NOT PURCHASE FROM THIS SITE.\nOrder a pair of shoes back in Early Sept, they took the payment from my credit card right away. Checked the tracking # given which was invalid, contacted the customer service email and they provide new tracking #. Which in the end was shipped to another address across the country, not the my address on my order. Have sent several emails with screen shots of all the documents and no one is responding.","title":"HORRIBLE CUSTOMER SERVICE-","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-30","author":"Mitchell Campion","text":"Horrible service. Sent out a box of Pokemon Celebrations that was damaged and opened.\n\nUnable to get in contact with customer service for a refund or replacement. \n\nWon't ever be using them again","title":"Horrible","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-30","author":"Amy Halliday","text":"Been sent the same jumper twice ( no. Customer service & no help ) I’ve now had an email to say another had been sent !!!!! I don’t want this !!!! Please contact me urgently ‘","title":"Been sent the same jumper twice ( no","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-30","author":"Sunita Kaur","text":"My Son sold and shipped an essential Fear of God hoody. He has Proof of Postage but accidentally used the wrong label. He has NOT been Paid and customer services are saying there’s nothing they can do. His a uni student and has been selling through Stock X for a while. He can’t afford to lose £100. Really disappointed.","title":"My Son sold and shipped an essential…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-30","author":"Deborah Rehmer","text":"I had contacted customer service. Several days before shoes were sent out. I had never used this company before.  I never even realized it was a bid site.. I checked out as guest. I had no account. My credit card company flagged you as fraud. Tried contacting you. No phone number for customer service. OF COURSE!  In meantime AN EMAIL FOR  A Second pair of shoes and  came through . i am like what I didn't order a second pair of shoes.. I am locked out and have no idea how to get into account to fix this.  No phone number and customer service is super slow to respond. Like DAYS !!! SO at this time Customer service has not gotton ahold of me and Bank will not pay for shoes. I get the pair of shoes in mail. By the time I receive their email.. I explain to your customer service that they need to cancel the second pair and I will need to send these back or figure out payment. But they will not listen . And tell me it is my problem that my bank didn't pay..They said it was Fraud  and resell them them on your site What???? First I checked out as guest . I thought you were a legit company. I was buying from Wrong . So now I still can't talk to anyone and this is not resolved. I have tried over 6 days.","title":"Customer service is the worst !!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"},{"date":"2021-10-31","author":"Mocha_CN_","text":"I ordered multiple boxes of Pokémon cards and almost all of them had been opened and a failed attempt at resealing the packs, even though StockX “authenticated” them, currently trying to get my money back. Beyond angry.","title":"I ordered multiple boxes of Pokémon…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=99&stars=1&stars=2&stars=3"}]