[{"date":"2021-11-05","author":"Michaël","text":"Got for the 10th time a sneaker with a defect on it. I reached out to StockX, but ofcourse, they don’t answer. Great job guys!","title":"Got for the 10th time a sneaker with a…","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-05","author":"Papahoshi","text":"Selections are great but fees are insane and customer services isn’t great.","title":"Selections are great but fees are…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-05","author":"Li","text":"Poor buying experience, unprovoked risk labeling","title":"Poor buying experience","stars":1,"location":"CN","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-05","author":"Fendi","text":"Y’all just need better customer service","title":"Y’all just need better customer service","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-05","author":"Roberto","text":"Ya don’t reply to me in a timeble manner.","title":"Ya don’t reply to me in a timeble…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-05","author":"Jesse","text":"Too many\/too high of fees\n\nY’all’s fees (including\/mostly shipping) are extremely high. Y’all are making more money off shipping on top of what you get from fees for sellers and buyers, because you’re  over charging and just sending standard shipments. I wish yall would give discounts that automatically apply to repeat customers, because I really enjoy this marketplace and would like to use it more often!","title":"Too many\/too high of fees","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-05","author":"Cockx","text":"They got it all but at a price.  Fees\/taxes are insane and sometimes the shoe doesnt even ship.  No customer service phone to call and the email contact is terrible.  Theyll have 5 different agents ask the same questions as if they havent a clue what is going on.  Terrible terrible compant but unfortunately one of the few places to find sneakers available.","title":"They got it all but at a price","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-05","author":"Donavan","text":"There is a lot of customer service reps that are dealing with you ,who have no knowledge  that kinda leave you hangry.  Also stockx fees or too high for you tobe waiting  2 to 3days for a response","title":"Unconscious bias","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-05","author":"Rodney","text":"The fees are crazy","title":"The fees are crazy","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-05","author":"Alicia","text":"Hello, it seems like you guys deliberately giving the wrong size of shoes since you'd like to get rid of your stock of trainers. We spent money on Jordans for 150 and they took a week to come, now they arrived yesterday I ordered a size 8.5 and it came as a size 6. I am very disappointed and would like my money back immediately. I strongly advise anyone who reads this NOT to buy from this company.","title":"Hello","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-05","author":"Steven","text":"Shipping and to authenticated takes to long like 3 weeks sometimes and then it takes long to get to authenticator and when's it get there they take long to authenticated to find out its fake. Come on all that waiting and to find its fake is overwhelming and I understand i hate fake shoes and to get all the fake shoes out of here but it takes to long and another I dislike stockx is the process fee and shipping I really don't understand we pay 13$ shipping for the shipping for it to takes so long i wish they take that out unlike eBay they don't charge that and I get my shoes in 1 week I like eBay the only eBay is missing is they don have all the shoes but eBay is the best beside that 💯 .Other then that stock x  it's pretty good 👍🏻 \nIt have a lot shoes option you can buy thats what I love just please take out the fee and shipping","title":"Shipping and to authenticated takes to…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-05","author":"Michael","text":"Something seriously wrong with your payment system","title":"Something seriously wrong with your…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-05","author":"Joshua","text":"fees are too high","title":"fees are too high","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-06","author":"Joan Suarez","text":"I had a pending purchase, I only received a message from my means of purchase for my refund, I never received a single piece of information from stockx, I have no idea why they did not send me my purchase.","title":"I had a pending purchase, whitout information","stars":1,"location":"MX","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-06","author":"John","text":"Truth be told i got a great deal on my 3080 fe gpu but the packaging was poor for the price. The gpu came in a fairly large box with only one thing of bubble wrap that bairly filled the box. The gpu box came damaged but thankfully the product itself was in good condition.","title":"Truth be told i got a great deal on my…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-06","author":"Stefanos","text":"Site enables the chance for everyone to sell almost every pair, however they are trying constantly to find ways to earn more against customers (recent changes in seller categories, higher than reality visible lowest asks and lower than reality highest pids etc.)\nFurthermore their cs is poor, with no relevant replies and helping on solving cases (e.g. still waiting someone to add adidas eh3130 in list, so I can offer for selling, despite me opening 3+ times a ticket to have it solved)","title":"Needs further improvement to be customer \"friendly\"","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-06","author":"Joseph","text":"Item came different then what I ordered","title":"Item came different then what I ordered","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-06","author":"Alec","text":"Bought a pair of Jordan 1 lows and I was really disappointed with the quality of the shoe box, I open up the shipping box to see the shoe box with some tape in a random area and some of the paint on the box was ‘chipped off’ (not sure how to exactly describe it), the shoes themselves were basically normal, 1 tiny little thing which I cannot exactly identify, I tiny bit of excess glue possibly on the exterior of the shoe. Not really impressed and a bit disappointed with the quality that I received, I did expect better considering the price I paid, and I don’t know what to do with the actually scuffs on the box considering I bought this as a gift","title":"Scuffed box and excess glue on the shoe, not impressed considering i bought it as a gift","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-08","author":"Aaron","text":"STOP USING FEDEX!!!!!\n\nhave a blessed day.","title":"STOP USING FEDEX!!!!!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"},{"date":"2021-11-09","author":"dolaphut","text":"slow reply , no responsibility","title":"slow reply","stars":1,"location":"TH","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=97&stars=1&stars=2&stars=3"}]