[{"date":"2022-03-02","author":"Casey Weisbach","text":"Every time I get a pair of shoes from StockX they look like trash. So messed up they look weird on my feet. Shoes I never would’ve bought in person. Whoever verified my shoes should be fired. StockX is the biggest scam on internet. DO NOT BUY FROM STOCKX","title":"No one cares about the shoe quality at StockX","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"Nicole Heard","text":"I would like to make a purchase from stock x but I will pass too many bad reviews thank you everyone for your reviews","title":"I would like to make a purchase from…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"Dan Bonner","text":"I would never buy from them again.  They provided a delivery date of 2\/13 and it is 03\/02 and the item still has not shipped from their warehouse. It has been at their warehouse for more than three weeks.  They supplied me with tracking number which still show it has not shipped.","title":"I would never buy from them again","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"Y E","text":"F this app they let me order shoes and then they refunded them like I canceled the order I WILL NEVER IN MY LIFE ODER OFF THIS DUMB ASS APP AGAIN🖕🏽I WANT MY F’ing REFUND","title":"F this app they let me order shoes and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"Jason  L","text":"Everything seemed to be going well with StockX. Order done and payment went through. However there was an issue with paypal and when raising the issue with paypal, they resolved it, but also cancelled the order with stockX. StockX then blocked my account and said to speak to bank. Spoke to bank and paypal and they advised chargeback has finalised and they cant provide any proof of this. Explained all this to StockX and have not received a reply. Spoke to StockX on facebook and they advised that other team would get back to me and still nothing. Not really a good experience.\n\n*update to stockx reply. Its been nearly 2 weeks and still no response. So if the response time is 24 hours, there is something majorly wrong.","title":"Lack of customer service","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"Mark Whelan","text":"The site is unclear, i can bid for an item that won't get accepted but other bids at a much lower price get accepted, I believe its something to do with the region so, therefore, the site is terrible to use and I advise look elsewhere for your items.\n\nWhat a nonsense copy and paste reply, you should hang your head in shame StockX","title":"The site is unclear\/unusable","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-03","author":"India Noel","text":"I ordered a pair of Jordan 1 mid and they definitely are FAKE ! the stiching is uneven and falling apart. Worst site to ever order shoes from! Unless your okay with rocking fake shoes! DONT WASTE YOUR TIME AND MONEY! STOCKX IS A HUGE SCAM!","title":"I ordered a pair of Jordan 1 mid and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"Heron Samuel","text":"Ive only hear good stuff about the company but when I ordered I didn’t receive my package or any confirmation email when it was supposedly delivered. The customer service was also very sub-standard as I basically just burnt my money with this company. Not sure how to feel about the site because they do offer some good stuff but I just don’t feel like they really care about their customers.","title":"Ive only hear good stuff about the…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-04","author":"Andini Trisky","text":"Hi, I sold 3 pairs of shoes, but you didnt make the payment, you made the payment to someone else bank account, and my payment account information change to your account information( stock x recipient GA) when I questioned to your cs thru chat you , only asked me to reset password but you didnt send my payment, if you dont want make the payment dont try find the excuse, the mistaken made by you why I should lost my payment, please return my 3 pairs shoes if you dont want make the payment, I never change any my payment information on my hyperwallet, I asked your agent many times to investigate, because my bank said you never sent the payment, I made the selling with u for been 1 years and never had problem with the payment, suddenly now u didnt send me the payment, please make the payment for customer hariyadi tengjoyo","title":"please make the payment, I sold my 3 pairs sneakers","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"Hilaire Tucker","text":"Bitter Sweet Unfortunately. Like Mark Whelan in the comments below said, “The site is unclear, i can bid for an item that won't get accepted but other bids at a much lower price get accepted, I believe its something to do with the region so, therefore, the site is terrible to use and I advise look elsewhere for your items.”. \n\nI too has a similar experience. I had bid on a pair of Jordan Retro 6 DMP at $275 (2022-03-01 @ 9:15am) and someone won with a lower bid of $265 (2022-03-01 @ 9:35am). I reach out to Customer Service to ask why and they said, “Bids which are higher than those of other clients and even so you cannot buy the sneakers you want as in this case in which you had a $274 Bid for some Jordans 6 Retro DMP and another customer won them with a lower Bid of $266. \n \nThis normally happens when the buyer is located outside the country where the closest Ask is located and the difference in taxes and duties will mean that someone who has to pay less for this can match the seller.\n \nThe easiest option will always be to use the buy now button in which you will not have to wait and see how other buyers get the same product that you want while you are still waiting for some seller to offer them at a lower price.”.\n\nLuckily I took screenshots of my bid and the winning bid plus I have my email confirmation stating the time of my bid. I have screen shot of the winning bid on the site as I didn’t receive a next bid email. But why would I if it’s not higher than mine. Something is not right here!!!\n\nNow tell me how does that make sense. Am I not bidding to avoid having to pay the asking price? Am I not paying more in having to pay the $USD when I bid? I see the conversion to $CAD (0.79) so how is the seller loosing if I’m being charged by my creditor in $USD ($1) with all the additional fees applied on top? In the end it’s in my best interest to bid as I’m paying a lot more than what StockX states I’m paying because they cannot give an accurate currency exchange rate when it changes daily. \n\nAnother incident, I won a bid on Jordan Proto Max 720 Wolf Grey Volt (Size 9.5) for $100 on Sunday 2020-07-12. 4 days later they issue me a refund (Thank you) on Thursday 2020-07-16 to tell me that the sellers shoes did not pass the verification process. I was not pleased considering that I asked myself, how could the seller get them there so quick if shipping would start on Monday and to pay $$$ for overnight shipping to StockX by Tuesday, verified Wednesday, then send a refund email on the Thursday. Which seller pays for overnight shipping on a $100 pair of shoes to not pass and on top of that to receive a $15 penalty fee for a failed inspection. Clearly the shoes weren’t worth much to the seller to takes loss on their expenses. It just seemed suspicious. \n\nIn conclusion and to be honest, I feel something illegitimate is going on with the hole sneaker culture. I wish the brands would just allow pre-orders on shoes. This would eliminate 3rd party vendors, botts, and scammers. If I think this then they most likely have thought of it and don’t want to do it for some unexplained reasons.","title":"Bitter Sweet Unfortunately","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-05","author":"hariyadi tengjoyo","text":"Hi, I sold 3 pairs of shoes, but you didnt make the payment, you made the payment to someone else bank account, and my payment account information change to your account information( stock x recipient GA) when I questioned to your cs thru chat you , only asked me to reset password but you didnt send my payment, if you dont want make the payment dont try find the excuse, the mistaken made by you why I should lost my payment, please return my 3 pairs shoes if you dont want make the payment, I never change any my payment information on my hyperwallet, I asked your agent many times to investigate, because my bank said you never sent the payment, I made the selling with u for been 1 years and never had problem with the payment, suddenly now u didnt send me the payment, please make the payment","title":"Stock X doesnt paid my sold sneakers!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"ndene drane","text":"bought  some  adidas  zx   5000  no message  on  the  site  to  say  i  had  bought  the  trainers  no  e  mail   \ni had  to  go  the   bank and  get  a   bank  statement  to  prove  i  had paid  for  the  trainers  and  e mail   to  stock   x\nso  got  in  contact  with  them   basically  the  lied  and   messed me  about   refund  first  of  all  then  it didnt  happen  then  told    voided  charge  on  your  account  no  money  has  come   out   lying  again  so  i  used  agmail  e mail account  to  email the  boss  of  stock x    then  i  got  e   mail  saying  proof  of  purchase sent  to your gamail  e  mail  slight  problem  is  i  nevr  gave  them  my  gmail  e  mail   so  just  more  lies   \nand they  have deleted  my  stock  x  account  email  and  password  dont  work  anymore\nno  worries  im  gonna  keep   on  going  with  this    for wasting  my  time  and  messing  me  about  and  been  clever   and  ive  got  the  bank  onto  it  getting  my  refund  had  enough  of  clowns","title":"bought  some  adidas  zx   5000  no…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"Adam Greenwood","text":"Ordered some shoes, they were the wrong size and stock x don't offer returns. This is fine and i understand sometimes being a middle man company they don't actually sell you the shoes they facilitate it. I then sold the shoes to the same company a day later with their vetted tag on and had to pay another admission fee for work they had already done previous. Make a large amount of money for a middle man. - Customer service from Vincenzo was great though.","title":"Paid them to authenticate shoes they had already authenticated.","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"hariyadi tengjoyo","text":"I did for the past 2 months chat and emailed your representative but u sent to not my bank account number, someone else, I already asked them to investigate, you provided proof of transfer but it showed you sent to someone else account number not mine, where’s my payment, my order number sales #32727272, #32727378, and #32727232, you only asked order number many times, but still wont make the payment!!!","title":"Stock X doesnt make the payment for my sold items","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-07","author":"Bernard","text":"This is my 2nd time purchasing from Stockx giving them a 2nd chance with the discount code that they gave me during my first terrible experience and the same thing happened again the quality of the shoes was terrible and the shoes was defect and how did it even pass QC and authentication? Even if I were to resell it on Stockx but the next person who received it would received the same pair that I am reselling.\n\nI purchased a pair of Nike dunk Low grey fog and there was a black wire that came out nowhere from the side of the sole which can’t be removed and no way that I can hid it off as well. Your response won’t change anything even if I were to send it back for review as it’s already stated clearly that imperfection is normal and I wouldn’t want to waste any time and effort knowing that nothing is going to change. I’ve once contacted the support team but kept getting the same replies saying it’s normal. My qsn is why did the authentication team even accept a pair that is so terrible from the seller? \n\nTo that fellow who send in this pair you’re just lucky. I’m just unlucky to always received the one that is always with flaws. Honestly it’s okay for stockx to lose one customer but I’ll definitely not purchase from Stockx in the future anymore knowing that I just have to accept whatever I receive even though it looked terrible.\n\nImagine for someone less fortunate saving up for a pair of shoes that doesn’t even look good, and not knowing what it actually look like only upon receiving it.\n\nPs: I have already sold it back on Stockx at a lost of $60 (priced I paid for a bad experience and a lesson learnt) knowing that I would never want to wear this ugly pair I purchased and even if I had to sell it on other platform with photos uploaded I believe no one would ever want to buy it with such premium price that accompanied defect.. \nSO SINCE you accepted it from the beginning you shall take it back and I don’t need any compensation or another discount voucher to make another disappointing purchase because I know you are a big company and you don’t really care abt a small client like me.\n\nI should have trusted the reviews here and not trying to convince myself again and again by watching positive YouTube reviews.","title":"Poor QC check by authentication team.","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"Y E","text":"I still didn’t get my money from when they canceled my order…","title":"I still didn’t get my money from when…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-08","author":"Willem","text":"I sold a LV bag, tracking says its been delivered at stockx, STOCKx says we never got it. Someone stole it there. And i wont get my payment. Dirty thiefs they are. And now they want to close my account, because of this. SCAMMERS!!!\n\n\nReaction on stocks reaction. You ***holes don't react on my emails anymore. I lost an expensive item because of you, I will never do business with thiefs like you, dirty!!","title":"BIGGEST LYING SCAMMERS EVER!!","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"Amber Xoxo","text":"STOCK X, is a SCAM, I repeat, a SCAM! Buy at your own risk. 3 pairs of shoes, over 200 dollars each, so OVER 600$ down the drain, won't respond(except once to your negative review or run you in circles & shut down your StockX account completely), & DOES NOT offer returns, or refunds on \"ups confirmed received status\". If it does not fit or is fake, your out of luck! That fact alone tells me A LOT about this company. GOAT has higher prices for a reason! Shop Goat or footlocker at least you will get guaranteed authentic shoes & good quality shoes! These ppl sent me THREE fake shoes, and offers NO resolution. There so called \"authenticators\" are in on it & as mentioned below by stockX, the shoes can be \"hand delivered\" to their factories. Just know we ALL warned you & if you don't mind pay 100-400$ on FAKE, maybe decent or low quality shoes that don't last long, have at it. But best to shop elsewhere & don't believe their replies. They WONT help you. They are just trying to keep their scam up & running, cover is BLOWN StockX","title":"STOCK X, SCAM! FAKE, OVER PRICED SHOES","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"ndene drane","text":"14  days  later stock x  what  a  load  of  lyers just like  trump boris  johnson and  putin     no refund no  trainers no  worries  u  had  my  money  i  was  lied  to  many many  times  this  is  how  u  run  your  company  what a joke   ive been  refunded  my  bank","title":"14  days  later stock x  what  a  load …","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"},{"date":"2022-03-10","author":"Annette Lewis","text":"I bought a pair of trainers from this company, their sizing is confusing. They were the wrong size and I have had to return. In the uk it is the law. But this company really make it difficult, and shut down your case if you don’t reply in 24 hours. I would NEVER use them again. They are devious.","title":"I bought a pair of trainers from this…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=76&stars=1&stars=2&stars=3"}]