[{"date":"2022-05-05","author":"Rolland","text":"I needed a men's size 6 and received a 7.5. When I tried to get it corrected there was no way to send a message to anyone.  I wouldn't waste your time ordering. Do your research!","title":"I needed a men's size 6 and received a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Damian","text":"Would not recommend using this site, they do not accept returns or won’t exchange items if they are to small (ie shoes)","title":"Would not recommend using this site","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Sidra Ilahi","text":"This website is a scam. Fedex did not deliver my package. I literally showed them video proof. They want you to put in claims within three days and I did once they notified me a week later that it allegedly delivered. I sent them the report I conducted with fedex. I even messaged fedex and they said the vendor needs to start it.","title":"This website is a scam","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Katalina","text":"Horrible first experience, will never be buying anything from stockX again. They do not accept returns or do refunds. I ordered a pair of shoes for my brother they were way to big and he couldn’t even exchange for the right size.","title":"Horrible first experience","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Barbara","text":"The purchase was defective and my kid took the tag off but yea definitely not please for 500 shoes","title":"The purchase was defective and my kid…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Maygan","text":"I don’t understand how it says the item was delivered and I have not received it. I’m not sure who it was delivered to but I did not receive them","title":"I don’t understand how it says the item…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Jenise Hylton","text":"I was sent the wrong size, not once but twice. I was told I could not switch or get refunded, but I could sell it back to you guys for a price","title":"I was sent the wrong size","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Mike","text":"It says they have came and they haven’t","title":"Jordan 1 smoke grey","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"BBD","text":"I was new to stockx and my first order was stolen. I wasn't aware of the 3 day rule they have in place so I reached out to FedEx to open a claim for my items. FedEx couldn't find the shipment and stickx refuses to replace the items or my funds.","title":"Bad policy","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Peter","text":"How can u just cancel my order when it was in stock","title":"How can u just cancel my order when it…","stars":1,"location":"SK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"Miki","text":"they let me process my order and waited 5 days till they let me know they would not be ending it and they would provide a credit.. it was a birthday gift and they left me high and dry!!","title":"they let me process my order and waited…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"Sebastien","text":"I don’t receive the box. UPS told me deliver the box to a shop and the telle me not","title":"I don’t receive the box","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"martin","text":"Everything good except it tOok forever to get here","title":"Everything good except it tOok forever…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"connor","text":"the shoes i got were yellow on the soles more yellow than they should be signaling they’re reps","title":"the shoes i got were yellow on the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"Franklin  Drilon","text":"Okay whatever","title":"Okay","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"Danielle","text":"My purchased product didn’t meet guidelines. I understand that an invalid product is not necessarily the company’s fault since they use third party vendors but the experience was definitely not positive. It was an intended birthday present and now I have nothing.\n\nRe: per Stockx Reply, I purchased the product April 23. I received a verification that it was shipped April 26th. I then received a confirmation that Stockx received the product at the verification center on May 1. It even highlights the event on the order process checklist, and confirms that the next step is verification. The following email states \"As you know, we have a multi-step authentication process to ensure that your order is correct. Unfortunately, the Jordan 7 Retro Championship Pack Cigar you recently purchased didn't make it through that process.\" So are you telling me that because you didn't receive it in a certain timeframe that the order was denied? Because that is not what is indicated in the series of emails I have been tracking for the last couple weeks. It appears to me that this was a fraudulent product. I am thankful that Stockx verifies, but I am not going to pretend to be thankful for a full refund, as all I have received is wasted time.","title":"My purchased product didn’t meet…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"Jaden","text":"got what i wanted i just couldve got it for cheaper","title":"got what i wanted i just couldve got it…","stars":3,"location":"NZ","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"Rich","text":"Worst company I’ve dealt with ever. I had my sneakers canceled and they refunded me the same day. 10 days later I get the shoes, and then they recharge me for no reason without permission and I said I canceled my item and now you guys are recharging me and not refunding me. Under the law it states that a company cannot charge you for a item that you didn’t order and that they don’t have the rights to charge you if you didn’t want it but happen to receive it later one. Staff was really rude when I was talking with online chat and ended chat when I was still taking with them and they were not helpful. Had to contact them more than a month and they kept saying a stock x specialist will get back to you and I haven’t heard back from them. It’s been almost 2 months and they are dodging my messages when I’ve bought more than 10+ pairs from them. I’m no longer a loyal customer and don’t trust stock x. They are a company you don’t want to do business with. Currently Ive filed a dispute with them","title":"Worst company I’ve dealt with ever","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"Maggie Franco","text":"Shoes came broken. Stock x offered a $20 for the nxt purchase for a $200 pair of shoes. Really?  This site is scam. Will not buy or recommend.","title":"Shoes came broken","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"Andrew","text":"I ordered a pair of shoes that after three days, had not been shipped. They processed my refund at that point, so things worked out, but it is kind of weird how they do things.","title":"I ordered a pair of shoes that after…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=4&stars=1&stars=2&stars=3"}]