[{"date":"2021-12-06","author":"Deepak Kancharla","text":"I have read the terms and they are well established but after making the purchase nothing mentioned in terms are right. After 2 business days the seller didnot ship the item and there is no update from stockx. spending couple hundreds of bucks on this website is absolutely disaster and disappointing. If something is not met then there should be a refund  period. Customer service should be most priority for business which stockx sucks","title":"I have read the terms and they are well…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-06","author":"Mark","text":"Too many shoes have no asking price","title":"Too many shoes have no asking price","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-06","author":"Matthew","text":"Have had decent experiences with Stockx until the charge posted after I got an email that the payment method was declined. Also, filed a dispute with my credit card company and they tried to tell me that I had received the product even though I had in writing from Customer Service that there was no order. Their “evidence” was for a delivery address in another country and a completely different product… Good customer service response times though, and friendly staff.","title":"Decent. Not great service.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-06","author":"Victor","text":"Yah cool an all but 15% from a sale is ode","title":"Greed","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-07","author":"Sam","text":"I would never buy shoes here. They scam you and send you what you did not order. And then don't want you to return. The wrong item and in the wrong size for a refund. They expect  you to sell the item on stockX to get yoir money back. I will never buy here again. Spend your money elsewhere.  SCAM","title":"I would never buy shoes here","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-07","author":"Jasmin","text":"Every time I order some sneakers off StockX, I always run into problems. They will send you a severely damaged box without telling you. And when you contact them about it, the best they can do is give you a $40 off coupon. If they had it advertised that the box was damaged (like what GOAT does), I wouldn’t have bought the sneakers in the first place. It’s inconvenient and they don’t care about their customers.","title":"Every time I order some sneakers off…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-07","author":"FU","text":"Ruined the sneaker game","title":"Ruined the sneaker game","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-07","author":"Chief rocka","text":"Not true to there promises. It's been over 3 weeks since I purchased a item the money was taken immediately. I wanted the shoes before there were released in stores but that didn't happen.  Just like yall pay the seller once the shoe has been authorized take the money out customer accounts once the shoe is shipped.  Poor service without a customer service number","title":"Bad experience","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-07","author":"J.","text":"Processing and shipping fees are way too high! Perhaps, one flat fee of $10 for processing & shipping to the lower 48 if you spend less than $100, and free shipping for orders over $100 to lower 48.  Also, you all need a rewards program for loyal repeat customers! Customer loyalty is huge!  By rewarding\/incentivizing loyal customers, not only says thank you for your business, but most importantly, a Happy Loyal Customer is your best customer that will gladly spend their hard earn money with your establishment!!","title":"Processing and shipping fees are way…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-07","author":"Jake Burton","text":"Stock X is nothing but con artist and con men\/women. Scalpers buy what was once cheap and enjoyable goods and sell them at ridiculous prices. They “verify” items and you pay a fee for it, when in reality I bet all they do is look at an item and say it’s good and take your money. I know and I’ve seen multiple people get items from Stock X that were in fact fake. The worst part of stock X is they have a no return policy whatsoever. If you accidentally buy something, you can’t go back. If someone steals your credit card and buys something, you can’t get a refund either which is my case. Stock X is literal scum.\n\nUpdate: Stock X replied below and said they would resolve the issue and give me a refund. That was a lie. I reached out to their support and they said they can’t give me a refund even though the purchase was UNAUTHORIZED. Their suggestion is to sell the item back on their website so they can profit %13… Another large business screwing over its customers. Their reply was a lie and only said to make themselves look better. Do better Stock X.","title":"Stock X Con Artist\/Credit Card Fraud","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-07","author":"Kyle Bosket","text":"Wolf Grey Jordan 11s  ss 6.5 for my daughter were lost by FedEx. I followed the unbelievably unreasonable affidavit process and still haven’t heard back. I understand things get lost by carriers but the customer service and follow up is trash.\n\n12\/21 No follow up or sneakers; but they kept my $300.","title":"Lost my daughters Xmas gift","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-08","author":"Garry","text":"I ordered a T-shirt from VLONE and the seller did not ship in 2 full business days. So i request a cancel and refund for this ordered. After that I ordered a new one. What happens, the support told me: \"After reviewing order ... I see that it is a new release and as per our policy, the seller has 3 business days to ship the package, which means, everything is on the right track, the seller's \"ship by\" date is the 8th of December (today). Also, please keep in mind that it can take up to 48 hours for the tracking information to update, so please don't be alarmed if you don't see the most up-to-date information immediately.\" So basically I purchased something, then they change their policy back into the past, but still on the webpage it shows me 2 full buisness days. Try to bind me to both purchases now and i need to buy 2 t-shirts. They are basically thiefs!!! Need to buy identical T-shirts, just because they change their conditions, which will illegally affect all other purchases in the past, which iam pretty sure is not possible. I hope i win this case on paypal","title":"Scam and THIEFS","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-08","author":"Alberta","text":"I do not accept you cannot have a change in case you buy a wrong number. you pay a lot and you should have a chance to get  the right item.","title":"I do not accept you cannot have a…","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-08","author":"Margaux","text":"I bought a pair of Jordan's for about 300$. At first the seller didn't send them and I had to contact the client service after 1 week of waiting without any news. They canceled the order so I ordered the shoes again which I received in time and they clearly look like reps . The prices are also nonsense, you sell them a pair for 100 and they resell it 700?????","title":"Wouldn’t recommend","stars":2,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-08","author":"ro me","text":"Rubbish \nBuy and sell elsewhere\n\nNo customer service what so ever","title":"Rubbish","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-09","author":"Lisa Trocchio","text":"I am a mom of a teenager who loves sneakers. I just bought a pair of yeezy 700 mnvn. I am no expert but I could tell immediately that these were fakes. The box tag was fake. The sneaker tags were fake. How did this pass authentification?? Unfortunately after this i cant buy from stockx anymore. Very disappointed","title":"Fakes!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-09","author":"Jonathan","text":"I received a damaged product and sent out and email. It’s been two weeks and still no reply with a resolution for my purchase.","title":"Terrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-09","author":"Consumer","text":"I recently wrote a review where this company refused to refund my money for shoes I never received because THEY delivered to the wrong address. Well after my review I received an email stating I was going to get a full refund, WELL I HAVE NOT and after 5 emails asking where my refund was I have not heard back but one time from a Santiago that said he knows nothing and can’t refund my money SO I SENT HIM A PIC OF HIS EMAIL AND HAVE NOT HEARD FROM HIM SINCE. \nDO NOT DO BUSINESS WITH THESE PEOPLE THAT OBVIOUSLY CARE ABOUT STEALING FROM THEIR CUSTOMERS!. They take your money and could care less if you get your purchase or are satisfied.\n\nI have tried to contact you by email because you are o e of the only companies U know that does NOT have a CS number.  I emailed this you g man Santiago and he replied that he could not refund SO I then sent him a copy of the email U received from him stating I would get a refund in 5 to 7 days and I have not and now he will not reply.","title":"Money Stealing Company., still waiting for my refund!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-09","author":"vv","text":"I am sophisticated online shopper. I placed my first oder (and my last) and got duplicated and of course now I am stock with it and is my issue as the company conveniently does not assume any responsibility … back to shopping at amazon, ebay or Walmart where we the customers are protected","title":"Do not buy anything here!!!!!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"},{"date":"2021-12-09","author":"Joel Matthews","text":"I purchased a pair of sneakers for $2200 and everything was going good until it was shipped to the authenticator…once they received my purchase history disappeared and now I don’t know what’s going on and since I reached out to StockX the still haven’t responded since…It’s been 5 days and nothing from them..I feel like they took my money…I was scammed by StockX and I’m going to find a way to report them to the authorities…no one got money to give away like that to you frauds","title":"StockX stole $2200 from me…They’re frauds","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=90&stars=1&stars=2&stars=3"}]