[{"date":"2021-11-18","author":"Mozhtaba Mukhammad Dzhamil","text":"I bought jordans, it has been 5 days the seller still didn't ship my shoes. The website already took my money. When I try to contact them they just ignore. They have no customer support. If they don't contact me by tomorrow I am going to the police, because the promised to ship with 3 business days of give full refund, clearly this is a breach of their contract. This website is a scam I recommend everyone to stay out of it.","title":"I bought jordans but never received them","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-18","author":"Ринат","text":"Order # 9023065 where is my order?  10 days have passed and the goods have not been sent to the warehouse for inspection.  Scammers, do not respond to messages.  Forced to contact PayPal.","title":"scammers","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-18","author":"Brooke","text":"ABSOLUTELY AWFUL COMPANY. They have NO ONE you can speak to. Ordered from them three times, EVERYT SINGLE TIME A PROBLEM. The last time I paid $1500 for boots that never came. Had to TRY and contact Stock X SEVEN TIMES WITRH NO RESPONSE. Called my bank. AWFUL!!!!!!!!!!! GOAT IS BETTER!!!!!!!!\n\nStock x I already tried to contact you to resolve this with no reply but nice try","title":"ABSOLUTELY AWFUL COMPANY","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-18","author":"LachezarLazarov","text":"I sell on StockX regularly.\nLately, parts of my shipments to StockX end up missing and they refuse to do a single thing about it!\nIt's unbelievable how little they care about the fact, that someone is stealing from their customers!","title":"Someone is stealing my orders!","stars":1,"location":"BG","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-18","author":"Cody","text":"I’ve purchased 4 pairs of sneakers from StockX and the experience is super mixed. I’m pretty sure I received a pair of fake bodegas and I most recently I had a problem where the app said (when I went to complete my order) my request failed to process and so I re-ordered. I’m glad I checked because it submitted both orders, unfortunately there is no contact number so I had to wait 15 minutes for a chat rep. The rep was super professional and on top of it and able to get the second order canceled. If I started using StockX under the notion that it’s just an eBay that’s most known for sneakers I would’ve given them more than 3 stars, however StockX had boasted that they are much more than that and this is why I hold them to a higher standard than eBay.","title":"Very Mixed Experience","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-18","author":"Zayla Ghebremdhin","text":"My package says it was delivered on 11\/15 and FedEx did not follow delivery instructions to leave at my door. I have a ring camera and no packages were delivered to me that day. Fedex states they left the package in a locker but my building has an amazon hub locker which generates a code and texts it to my phone and email to retrieve a package. I never received a code and their is no log at the locker that I had a package in there that day. I already filed an investigation with Fedex and they closed the case without contacting me and when I called them they told me to contact the shipper. I put in a claim with StockX and still have not heard anything. I'm not understanding how my package was noted that it was placed in a locker and there is no proof of delivery or code confirmation that it was. I need this to be investigated ASAP because I am highly pissed off.","title":"My package says it was delivered on…11\/15\/2021","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-18","author":"jay rice","text":"Do not order from this place save yourself the stress it’s been over a week an it’s saying my order is still enroute to StockX !!!! I should of read reviews before I ordered","title":"Do not order from this place save…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-20","author":"Pablo Corredor","text":"I get the Jordan 4 retro from this website and when I get then the are fake the sneakers how I website like this one doing this to the people they are fake people too don’t buy nothing from this website","title":"I get the Jordan 4 retro from this…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-20","author":"VW","text":"Stock x charged me twice for the same shoe! Both transactions have posted. Can’t get in touch with a single cs rep. I usually order from the goat. Should’ve went with my first mind. First abs last time ever dealing with this company\n\n\nSince 10am today CT, I’ve been going back and forth with 2 different reps. My money still hasn’t been refunded. Provided all sorts of screenshots. Please be aware of this place. Especially when there is no phone number to reach out to anyone!!!","title":"Stock x charged me twice for the same…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-21","author":"AK","text":"Purchased a pair of trainers which arrived with scuffs\/marks. Contacted the support who, after originally disagreeing the extent of the damage, agreed to process a return, as per UK regulations. Support asked me to write a return request as per their format but, after me sending the request have been ignoring my multiple follow up emails over the space of two weeks. Contacting the retail ombudsman to take this further as am yet to hear anything from StockX themselves. Extremely disappointing and awful customer service !\nUpdate a week later: Received a request for order info from StockX via Trustpilot, sent them the relevant information - another week went by and I'm yet to get any sort of response again ... absolute shambles ... spoke about going to ambudsman earlier, received a response here and thought someone might actually do something ... alas, it clearly seems like I'm going to have to go the regulator way afterall as the company is clearly struggling to process incoming customer care requests","title":"Support refusing to respond faulty goods return","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-21","author":"Vahe  Aslanyan","text":"StockX has turned from a profitable business into scammers, by employing fools that have no idea about verification of luxury items. I sold 7 items, all of the 7 items got returned, because they somehow failed the verification. The reason for every single of them is \"too many variances in materials and construction when compared to authorized, retail items.\" When you don't know what is wrong with the item, then you write that down.\n\n They tried to charge me 7 times around 115CAD for every single item. Only 3 went through. But those 3 got disputed by RBC Royal Bank and StockX is about to be penalized for that. \n\nThe person verification the order 28410697-28310456 was so foolish, to write down FAKE on the return note. This is going to cost StockX. You see, Scott Cutler, Josh Luber, Greg Schwartz, John Kaelle,Terra Carmichael, executives of StockX are going to be emailed about the fact that NetAporter is going to sue them, for falsely accusing of selling fake items and that the employee has tried to scam me from 700$ hard earned money. \n\nDONT TRUST THIS SCAMMERS, THEY DONT KNOW WHAT THEY ARE DOING AND THEY WILL EASILY SCAM YOU OFF YOUR MONEY! \n\nBtw, I wish the employee who tried to scam me much luck, after all the executives are going to be emailed via private and company emails. Lol..","title":"FOOLISH SCAMMERS","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-22","author":"Aleks Aleks","text":"Account is on hold since 14.10\nToday is 22.11\n\nWrote about 20 emails about to solve this problem.\nHave received an answer once and followed instructions. After that total ignore from StockX\nI'm a seller with a more than 800 sales.\n+ I had a seller level 4, StockX made it level 3 without any informing!\n\nSo maybe now I will be contacted !!! =\/\/\/","title":"Account is on hold since 14.10","stars":1,"location":"LV","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-22","author":"gregory Stewart","text":"I OWNE A AIRCOMPRESSOR COMPANY CALLED STEWARTS AIRCOMPRESSORS PLUS INC. AND THEY HAD A AIRCOMPRESSOR I INSTALLED FOR THEM THEY ORDERED THE WRONG VOLTAGE SO HAD TO REWIRE THE WHOLE MACHINE LIKTED HAVE NEVER GOT PAYED THEN YEARS LATER THEY HAD A ELECTRONIC PROBLEM WITH A BAD SET OF N.O. NORNAL OPEN CONTACTS ON MAIN STARTER COULDN'T FIND THE PARTS SO THEY JUST DECIDED TO NOT PAY MY COMPANY GIVING ME THE MIDDLE FINGER THE BILL WAS $1031.00 ON 9\/8\/2021AND SIGHNED BY THERE NEW WAREHOUSE MANGER VICTOR WILSON I EMAILED THE INVOICE TO CORPORATE.THEY IGNORED IT SO IF YOU HAVE A AIRCOMPRESSOR COMPANY DO NOT DO BUSINESS WITH THEM I HIRED A PARTS LOCATOR OF 75 PEOPLE TRYING TO FIND THE PARTS AND DID NOW WE'RE STUCK WITH THE PARTS AND OUT OF ALL THAT MONEY AND WASTED ALL MY VENDERS TIME WHICH I BOUGHT THE PARTS JUST KEEP THEM IN GOOD STANDING WITH MY COMPANY I'VE BEEN IN BUSINESS SINCE 2000 AND HAVE 39 YEARS OF PERSONAL EXPERIENCE BUT CAN'T BELIVE HOW THIS COMPANY IS BEEING RUN A 2 MILLION DOLLAR A DAY COMPANY THIS SHOWS LIKE THE BIBBLE SAYS THE LOVE OF MONEY IS THE ROOT OF EVIL! I PAY ALL MY BILLS ON TIME NO MATTER WHAT THAT'S HOW A GOOD TRUE AMERICAN COMPANIES ARE RAN!","title":"AIR COMPRESSORS REPAIR","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-22","author":"Danielle Corelli","text":"Purchased a pair of sneakers and received notification 3 times that payment was declined.  4th attempt order went through.  Thankfully I ordered via PayPal and noticed 4 duplicate charges went through.  Then PayPal were good enough to refund my duplicate charges and the Stock X suspends MY account!  What a joke they are the biggest scammers and should be the ones suspended from trading.","title":"Purchased a pair of sneakers and…","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-23","author":"C. S.","text":"They do not accept my PayPal, my credit card as payment. The only time out of 3 requests I was answered by some useless idiot who lied to me that everything was OK and I could use the service. I described the problems of the site to the support in 9 points, with 4 screenshots - COMPLETE DISREGARD!!! They don't tell me in any way what's wrong with my payment methods, they didn't ask me for any documents to make sure that paypal and credit card belong to me. The worst marketplace I've ever seen on the Internet!!!\n\nUPD (25.11.2021): If someone read my review, the marketplace response below and decided that they fixed everything by showing concern in the comments, then NO! Their answer here is an automatic fake! COMPLETE ignoring of ANY appeals and letters!!! I was also very lucky that I couldn't spend some money with them!!! These scammers must be tried and put in jail!!!","title":"Total scammers","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-23","author":"Bob doe","text":"I can screen record me trying 20 different credit cards and they still don’t work ridiculous I can’t buy 1 pair of shoes error code 400 smh no customer service no help had the same problem for months amazing","title":"I can screen record me trying 20…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-23","author":"Yi","text":"I misclick and bid a thing, can’t cancel the order, it’s terrible","title":"I misclick and bid a thing","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-23","author":"Will","text":"No good support. Stole one of my shoes","title":"Review","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-23","author":"Littleg","text":"Too many fee’s too expensive\nLocal is better","title":"Too many fee’s too expensive","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"},{"date":"2021-11-23","author":"Khalid","text":"They send me a damage shoes and they said it’s a manufacture issue and it’s ok with StockX’s standard! Seriously? \n\nWhat in there mind to send a damage product to a customer","title":"They send me a damage shoes and they…","stars":1,"location":"SA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=94&stars=1&stars=2&stars=3"}]