[{"date":"2021-10-22","author":"Joseph Daniele","text":"When they got delivered they smelt terrible","title":"When they got delivered they smelt…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-22","author":"Tim","text":"stockx transaction fee is so high. \nwhen you buy an item from them, it can be delayed for 2 weeks and don't say a thing. \nWhile when you sell an item thru them, there is no grace period if you are behind. They'll cancel the purchase immediately.","title":"stockx transaction fee is so high","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-22","author":"Frankie","text":"I think the platform means well and I’m appreciative of it but I had a negative experience that leaves me cautious and exploring other options.\n\nI sold multiple pairs on here with no issues but one order got sent back because the sneakers didn’t pass a quality inspection. The issue with the sneaker was minor but the bigger issue is that the damage wasn’t mine. That was not the way the sneaker was sent and I’m positive of that.\n\nThere’s no way to plead a case, provide proof or even speak to someone about it. No matter what you’re shut down. That’s a big concern to me.\n\nMore transparency for those that keep the wheel turning at your company. After all without people selling, the market on the app would dry up. It’s a flywheel that needs to keep turning on all ends to work.\n\nI hope things get better in the future. One bad experience can last much longer than a few positive ones. That’s just the way it is.","title":"Lacks transparency with sellers","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-22","author":"Michael","text":"You need to show total price before final checkout. Other than that I can’t complain.","title":"Buying process","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-22","author":"Kelvin","text":"Ordered a pair of nike sb dunk high Rx-0 gundam banshee size 8.5. Received the shoes and found damage. There is suppose to be the word \"WARNING\" engraved on the left shoe heel portion but was completely missing. Shoes also have scuff marks and looks to be worn. Contacted customer support and sent pictures but so far no reply.\n\n*Update\nCustomer support replied after sending multiple pictures of the shoe and a week later they offered a partial refund of $40 for a $480 shoe.","title":"Shoes are not brand new and definitely worn","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-22","author":"Mike","text":"It’s difficult to list items. One of my packages never arrived - I am still dealing with the claim, StockX customer service is virtually non-existent.","title":"It’s difficult to list items","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-23","author":"Valued Customer","text":"Affirm sucks on your site but it works on its own. The Alipay has no translation option so not so user friendly.\n\nWhy not add Klarna and Afterpay","title":"Payment options could be better","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-23","author":"customer","text":"My first Experience wasn’t a good one!!!!!\nThe request was if the color of the shoe, could be change without out re-listing the shoe.\nI will never use Stock X ever again.\n\nAnd will make sure know one else will!!!!","title":"My first Experience wasn’t a good…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-23","author":"NA","text":"Great selection but multiple items never received due to authentication issues and very high fees.","title":"Good (when it works) but high fees","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-23","author":"Chris","text":"I made my first purchase on StockX in 2019 when there was just shipping and I really liked the platform and the layout.  But since May the fees have began to get a bit too much with tax now being added on top of shipping and the processing fee.  I feel like I’m being taxed on top of being taxed and then some.  I’m sure with all the revenue stockx has made off of people like me who have spent over $26,000 and almost a 100 pairs of shoes could get some kind of a loyalty discount or something but no, just some lame giveaway that I’ll never have a chance at winning is all that is offered.","title":"Not impressed with StockX lately…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-23","author":"Pauline  Craig","text":"Good for for getting deadstock at an occasional decent rate. Customer service is abysmal - need a better system.","title":"Simple system for getting deadstock items","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-23","author":"Martins","text":"Good platform, but I hate that it does not calculate and show highest bids or lowest asks properly. On the main page you see 1 amount of lowest ask, but when clicking to see more details, you can see that there are many more even lower asks.","title":"Good platform with bad problems","stars":3,"location":"LV","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-23","author":"MRd","text":"Given the price and return policy on the platform, The platform needs a way of letting buyers know how products will fit to their size.","title":"Fits are important","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-23","author":"Luke","text":"Absolutely terrible…ordered shoes for nearly £650 and never received them and I’m still waiting to hear back about my refund!!!!!","title":"Absolutely terrible…ordered shoes for…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-23","author":"Gavin Russell","text":"Not the seller - the goods are fine. StockX and UPS need to get their stuff together. \n\nThe delivery vendor failed to meet their emailed terms twice and then failed to call me to discuss it. Whatever arrangement SX and UPS have needs to be clearly communicated and followed through. The notice I got from UPS in an email was contradicted constantly via their depo and customer service teams. \n\nAs the recipient - I don't care as long as you meet the terms - but to fail leaves me peeing in the wind.\n\nWould love to rate higher - but cannot based on the bad experience.","title":"Not the seller","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-23","author":"Leo","text":"don't like the box from bearbrick always with damage","title":"don't like the box from bearbrick…","stars":3,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-23","author":"Jordan L","text":"0 stars isnt an option.  They take your money and then require email of Photo ID and payment card. Then they email saying they can’t process your order. When you call they say they have no idea why that happened and tel you to order again. Same thing happens and no one gets back to you. Take the $$ and your personal info with nothing in return. Great business model really","title":"0 stars isnt an option","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-23","author":"Antonio","text":"The Jordan that goes on the shoes lace there is only one just letting you guys know thank you","title":"The Jordan that goes on the shoes lace…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-23","author":"Gal Florsheim","text":"Buying and shipping was excellent, but now I get way too many emails a day and the unsubscribe just won't work, that's very frasturating!","title":"Buying abd shipping was excellent","stars":1,"location":"IL","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"},{"date":"2021-10-24","author":"Dan","text":"I have ordered trainers from stockx in the past and was satisfied that it was a great site. \n\nThen a couple of days ago £271 taken from my account by StockX for no apparent reason, no order placed, nothing sold and nothing received. When reported to PayPal, StockX proceeded to suspend my account. \n\nIf someone stole £271 cash from me so blatantly I’d probably report it to the police.","title":"Literally stole money from me.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=100&stars=1&stars=2&stars=3"}]