[{"date":"2022-04-28","author":"Alicia","text":"Item was not in stock","title":"Item was not in stock","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Ann Conlin","text":"I ordered a sweatshirt for my 12 yr old grandson and it came with no issues \nI have been trying before and after that to order a BAPE ABC SHARK Green hoodie for my 15 yr old grandson and it keeps getting rejected \nIt says bid rejected.   I just want to buy it not bid \nPlease assist me in buying a L Bape ABC Shark Green Hoodie","title":"I ordered a sweatshirt for my 12 yr old…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Ronney","text":"Need more shipping options that are faster.","title":"Need more shipping options that are…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Jose","text":"It took quite a long time.","title":"It took quite a long time.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Arthur Root","text":"My package never arrived and now I’ve been dealing w dhl","title":"Never arrived","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Danielle","text":"So after nearly a month now going back and forth via email, my issue still hasn’t been resolved. I ordered a G Shock watch for my partner to be delivered just the packaging with no watch inside! I’ve emailed and emailed, filled out forms, done everything asked of me. They have said there is nothing they can do unfortunately, so I’ve lost nearly £200. If your buying expensive items please do not trust this website! My only option now is to call up the credit card company and report as fraud. Disgusting customer service who refuse to have any responsibility at all!","title":"SCAM! AVOID","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Elizabeth","text":"StockX in general was good their customer service was excellent I think they need to pick a different company to ship their items out with!!  FedEx is horrible I have never ever dealt with them before and never will again. They shipped my husbands shoes out quickly and I tracked them all the way then FedEx marked as delivered but they never were I have security cameras all around our home and FedEx never was near our home. The customer service was amazing the man was very apologetic and after filling out their paperwork the refunded my money.","title":"StockX in general was good their…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"ALEXANDER","text":"I never received my order and they claimed I did","title":"I never received my order and they…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Peaches","text":"It take stockX forever to send your packages, also I order a lot from you guys their is never no rewards or discounts....","title":"It take stockX forever to send your…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Lisa","text":"I’m only giving a 3 star rating because it’s been about a month and I still don’t have my order.  However, StockX has communicated via email. I hope the wait is worth it.","title":"Still waiting","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Tim","text":"- The shipment was good and fast (Earlier than stated in the purchase.)\n- The item was used, rather than new as advertised.\n   - Unit is unusable by me due to the fact that a new unit is the only way\n     it can be useable. Otherwise, usability has to be transferred from the original purchaser. When set up by them, it is locked to them.\n- Return\/replacement practices are very hard to accomplish and lengthy.\n* As of this writing, a reverse charge process is being considered,\ndue to the fact that I still do not have a return\/credit plan from the company yet.\nThis action makes this company untrustworthy.","title":"- The shipment was good and fast…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Samy","text":"Wrong Size And i cant change thé pair","title":"Wrong Size And i cant change thé pair","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Edward","text":"My box was damaged, was not told in advance, No easy way to report damage to the box from mobile phone or return","title":"My box was damaged","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"JC","text":"I ordered 4 pairs of shoes on 3 different platforms in April. I ordered 2 pairs for my daughter on  April 14, 1 for my wife on April 16 (StockX) and another pair for my wife on April 19.  \n\nI have received all shoes except the ones ordered on your website. I paid full price ($150) upfront (no bid), agreed to pay $14 for shipping which is ridiculous considering I spent $150 on the shoes and none of the other websites charged any shipping for the amounts spent. \n\nI am beyond aggravated. I have received 0 updates with the exception of a “shoes en route to StockX” which was updated 4\/19. I have tried to communicate multiple times unsuccessfully through the apps “chat” option, never got a live agent, no follow up what so ever. \n\nI will seriously reconsider my options next time before using SockX and that also goes for making any recommendations to anybody that asks how reliable StockX has been. \n\nIf it wasn't for my wife really wanting the shoes I would have cancelled this purchase a few days ago but I assure you this has been a completely disappointing experience.","title":"Lost customer","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Clare","text":"Still haven’t gotten my order….","title":"Still haven’t gotten my order….","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Shavonnie D","text":"You Guys Suck...","title":"You Guys Suck...","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Joseph","text":"Horrible!!!! Horrible!!!! Put in my order over two weeks ago and shoes still have not shipped from stockx verification center.. or where ever they say the shoes are at..they told me my shoes would be at my house by April 27th. soon as I get my order I will be deleting my acct. And will NEVER order shoes from here again.","title":"Horrible!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Sara","text":"Terrible customer service. I never received a word about my order once it \"arrived\" at StockX for verification.  Since it had been 3 days and I had yet to receive any shipping notice, I had to open a case. Even then I only heard from one employee that I will \"hear back from someone\" in 1-2 days.  Order was placed on 4\/11 and as of today 4\/28 I'm still waiting on \"authentication.\"","title":"Terrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Camryn","text":"Send me two pairs and charged my card twice","title":"Send me two pairs and charged my card…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Ruben","text":"Put an order through for shoes, said they had 9 pairs left at time of order. 2 days later received an email saying my item was refunded due to no stock. Can still go on website & order same shoes in the same size. Stock levels should be updated regularly & refunds should be returned into accounts quicker than they were.","title":"Put an order through for shoes","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=16&stars=1&stars=2&stars=3"}]