[{"date":"2022-02-23","author":"Anthony","text":"Horrible experience worst way to handle a business. I waited two weeks and watched two different pairs get sent for \"authentication\" well when the second pair finally got there they canceled my order now I'm waiting a total of three weeks with over 500$ tied up for nothing they did nothing but get my hopes up. I will be reporting it to who needs to know. I will not ever order again from stock x worst experience I've ever had with a 500$ purchase. The best part no one will talk to you to inform me why this happed. Customer service coming in at 1 out of ten ill pay the extra 200 and get them local after my experience.","title":"Horrible experience worst way to handle…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"Eden McElhatton","text":"Awful company, bought Nike dunks that were a US 6, which equates to a UK 4, and a size UK3.5 came. The shoes are not authentic, I cannot receive my money back for shoes that don’t fit my feet & it won’t let me return them on the website - it keeps saying my card details are wrong and they aren’t!!","title":"Awful company","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-02-23","author":"alexis nguyen","text":"this is ridiculous. i ordered shoes december 28 2021 and they have been authenticated and everything but it hasnt been packaged and shipped yet. i have been waiting for my shoes for almost two months.","title":"this is ridiculous","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"Stockx Scam","text":"DO NOT PURCHASE FROM STOCKX! YOU HAVE BEEN WARNED!\nDO NOT BUY FROM THIS SCAMMING COMPANY. I HAVE COME TO THE CONCLUSION THAT STOCK X HAS WORKED OUT A SCAM WITH DELIVERY COMPANY UPS TO STEAL PRODUCTS FROM SELLERS AND BUYERS. THESE THIEVING CLOWNS CLAIM NO RESPONSIBILITY FOR LOST ITEMS WHICH I HAVE NOW FOUND THAT THEY INDEED ARE NOT LOST BUT STOLEN BY THE DELIVERY COMPANY. IMAGINE SELLING A HIGH PRICE ITEM AND THESE CLOWNS CLAIM ITS LOST AND THERE IS NOTHING THEY ARE GOING TO DO ABOUT IT. HOW LAUGHABLE BUT WE WILL DEFINITELY SEE! A CLASS ACTION LAWSUIT IS PENDING AGAINST STOCKX AND UPS. \n\nSTOCKX CLAIM THEY WANT TO TAKE THEIR COMPANY PUBLIC. BUT I AM NOT SURE HOW THEY EXPECT THAT TO BE SUCCESSFUL WHEN THEIR COMPANY IS BUILT ON STEALING FROM THEIR CUSTOMERS. GOD DOES NOT LIKE UGLY. MOST OF THEIR POSITIVE REVIEWS ARE FAKE! \n\nIf you are a disgruntled customer who has been scammed by stock x in any of these ways please contact stockxscam @ gmail.com. They need to be held to account before more people are scammed and they further ruin the sneaker market.\n\n1) Purchaed fake shoes which they are unwilling to refund.\n\n2) Sold an item and they claim it has gone missing. They have offered no resolution. \n\n3) If you have noticed unusual price fluctuations on their platform. \n\n4) Customer service has not helped in anyway. \n\n5) They have refused a refund even with the item not being as described. \n\n6) Bought a pair of shoes and they began to fall apart. \n\n7) Unauthorised payments taken from your card without confirmation or permission.\n\n8) They have refused a refund even though you have not received your item. \n\n9) Been sent the wrong size and told there is nothing they are going to do. (Stockx will send the wrong size and expect you to resell it on their platform for a lower price whilst taking a further profit from the customer) \n\nIf you have any evidence of these thieving charlatans please email; stockxscam @ gmail.com Please include as much evidence as possible. (Pictures, Screenshots, emails etc) \n\nStock x chargers the seller and buyer fees on the same product. They expect sellers to sell their items at a lower price meaning you make no profit whilst they sell the same item for significant amount more to the buyer than the seller of the item. Money hungry thieving clowns you will be held to account sooner or later!","title":"DO NOT PURCHASE FROM STOCKX","stars":1,"location":"NO","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"Dan","text":"£550 shoes sent to stock x no refund. \n\nUps lost my parcel and I filled a claims form and ups accepted they was lost and was willing to refund me. As stock x payed for the shipping label they had to process the refund for me. But they wasn’t even willing to process the refund for me. \n\n3 months later I’m £550 down with no refund even though I’m entitled to one!  stock x refuse to process it for me. \n\nScamming company never use them!!\n\nNow ignoring my emails","title":"AVOID THIS COMPANY AT ALL COST!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"AR","text":"First purchase on StockX, and it will be my last.\n\nI was delivered shoes that had a deformed section on the sole. They played it off as a “manufacturing defect”, saying it was considered acceptable by their standards as it would be deemed acceptable in a retail store. \n\nNow, I would love to see whoever created the horrendous policies at StockX to attempt to say to trading standards, with all seriousness, that they would expect a high-street store to sell defect goods on their shelves. \n\nUtterly ridiculous. Avoid, avoid, avoid. Zero integrity in their practice.\n\nUpdate: Completely unsurprised to see an equally unhelpful and useless response from the company. I can make an assurance myself; StockX and its lack of integrity is an insult to the service sector.","title":"Do yourself the favour.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-02-24","author":"Stefan Fane","text":"I bought a Vlone T-shirt, after 4 wears and 2 washes, the writing started to fade, the material is the thinnest I've ever seen on a T-shirt, the verification guarantee is a fake, the T-shirt is the biggest fake and  stockx are involved in this robbery","title":"I bought a Vlone T-shirt fake","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"Winta  Zegay","text":"UNACCEPTABLE SERVICE! \n\nI shipped a pair of Yeezy trainers for verification as I had a customer. They received the trainers but claimed the trainers failed verification, which is impossible as I have the receipt from Addidas and the item was shipped with all of the details provided from the manufacturer. \n\nThey tried to 'return' the trainers and in transit the trainers have been 'lost. They are now claiming that as the trainers 'failed verification', I can only be refunded 70% of the original cost. This is unacceptable as I have now incurred costs due to a failure on their part.\n\nIf they are unable to return the trainers, they should provide a full refund. Customer service have subsequently stopped communicating with me and is now ignoring my emails.","title":"UNACCEPTABLE SERVICE","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"DOESNT MATTER","text":"THEY TOOK MY DAMN MONEY! THEIR CUSTOMER SERVICE SUCKS! THEY DONY CARE ABOUT THEIR COMPANY! YOU CANT TALK TO ANYONE ON THE PHONE! THEY DONT HELP YOU! DONT EVER SHOP WITH THEM! THEY SENT A PACKAGE TO ME THAT DOESNT BELONG TO ME TO TRY AND BE FUNNY! I WILL BE SUEING THIS FRAUD ASS COMPANY! I hope y’all get SHUT DOWN! EVERYBODY WHO WORKS FOR THIS PIECE OF CRAP ARE WHACK ASF!","title":"THEY TOOK MY MONEY!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"Jaemar","text":"Ordered an item delivered on the 7-2-2022\nI thought they were fake initiated a refund request. Today is the 25-2-2022 and they are telling me that ups is still investigating. Started multiple chats with multiple advisors to get told we will contact the support team. Still not contract from the support team 7 days later. This is not a small sum of money\nPLEASE AVOID AVOID SCAMMERS!!!!","title":"REFUND NOT ISSUED","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-02-25","author":"Unhappy Customer","text":"I mistakingly received 2 pairs of Nike Air Zoom Pegasus Oregon.  I only wanted 1 pair.  There were 2 separate delivery dates separated by at least 1 week.  The second pair is unused and I want to return them and not be charged.  The second pair arrived around February 22, the first pair February 11.  I do not know how this could have happened.  The order # for the second pair is 33142918-33042677","title":"I mistakingly received 2 pairs of Nike…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"Chloe Dilman","text":"No refund on damage product\nI have gotten several damaged boxes from Stockxx, and every time they offer me $100, one item was worth $1,000!","title":"No refund on damage product","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-02-27","author":"Juan Carlos Almirola","text":"This is my first experience with trying to sell anything on stock x and its going terribly. Ive been selling on ebay for years and im trying to sell a pair of sneakers but for whatever reason when i try to post a listing it tells me that I need to add a payment method although i have 3 different payment methods added to my account. In summary, im very unhappy with stock x and their customer service as im not able to get any help and their stupid \"help\" bot is useless.","title":"This is my first experience with trying…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"MN ESS","text":"Bought a $450 pair of Jordan’s as well as a $350 Telfar bag . Both items were FAKE … There moto on everything being authentic is bull . I would never order from them again. And good look on trying to get a refund . Ha what a joke . They clearly specify on returns that your best option is reselling it on their site . With that being said, it clear as day that you careless if the items are fake or not .","title":"They sell fake merchandise!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"Vi Nguyen","text":"TERRIBLE EXPERIENCE. \n\nMy order was not processed apparently because most likely they went up in price and they did not want to ship it out for a cheaper price and i got refunded without notice and no response from customer service! They even took my money! I wasn't even refunded the right amount I paid! No point in contacting customer service cause they don't even respond. ABSOLUTELY TERRIBLE","title":"TERRIBLE EXPERIENCE","stars":1,"location":"NZ","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"Ryan Chris","text":"Dear StockX, I wrote a review here on the 15 of February. You guys replied me on the 18 of February saying “ you guys are working efficiently and I should receive an email shortly” . Up till now I have not gotten a response from you guys and I have emailed y’all countless times requesting for an update . Please do let me know how long I should wait as it’s almost a month right now.","title":"Costumer service","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-02-28","author":"Tarek Omar","text":"They have triple charged my CC for one item, acknowledged the mistake and did not refund the money for more than three months now!! \n\nThey do not respond to emails or phone calls.... Horrible experience... Never shopping from them again!!","title":"They have triple charged my CC for one…","stars":1,"location":"EG","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-01","author":"Nahom Beyene","text":"I ordered a pair of Yeezy slippers in stockx. I tried it for the first time. It said I could use the after pay method or something to that effect where you can pay monthly until it's paid up. When I placed my order they just took all the money at once from my bank. When I tried to cancel my order they said all sales are final. If all sales are final it should state that on the first page so people can decide for themselves if they want to continue. They are scammers.","title":"No canceling order after making it","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"german avetisov","text":"I put my Jordan Dior shoes up for sale, which I won in a raffle. The raffle was won by my father who passed away a year ago. When shipping the shoes, I packaged them very delicately and neat, with the original receipt of purchase. The next morning I received a notification saying my shoes are getting shipped back to me due to them not passing the authentication. I am not sure who is validating these shoes, but whoever is needs appropriate training because they clearly don't know what they are doing. they hit me with a fine of $15 which is mind-blowing. Today I received the shoes, I open the box and my shoes are all over the place and not as I packaged them. The main issue is that they did not include my original receipt in the box. I don't know if they swapped my shoes either. Reached out to customer support over live-chat and the guy goes \" Im sorry to hear that. You can go to the Dior store and reprint the receipt\". Yea thanks let me bring my father back from the dead and go reprint the receipt. This has been the worst experience ever and I would not recommend using StockX to anyone.","title":"Worst Selling experience ever!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"},{"date":"2022-03-02","author":"Zephaniah Amos","text":"Never ordering from this site again! I ordered some Jordan 5 in grape on (Mon 02\/21) for my son, I paid $272 after shipping, taxes, and processing fees were added, anyways It stated that I should've received the shoes by now by via FEDEX (expected date 02\/27) I have tracked the shoes only to recieve a message  saying \"DELAYED\" in NorthHampton, PA as of today!! I'm starting to feel that I've been scammed and robbed of over $200 dollars MAKE THIS MAKE SENSE, ARE YOU ALL GOING TO REPLACE THE SHOE I ordered or REFUND ME MY DAMN MONEY! Because it shouldn't take this long for the shoes I ordered to come from Moonachie, NJ to Jackson, MS! If this is the kinda business you all are running then you deserve \"THE BAD REVIEWS!! I hate writing bad reviews, but y'all just had to take me there. Lawsuit or Shoes!","title":"Never ordering from this site again","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=77&stars=1&stars=2&stars=3"}]