[{"date":"2022-05-06","author":"Rich","text":"Accidently ordered 2 pair of the same sneaker... couldn't cancel order, and no  one to talk to about it so had to eat it.... help section blows.","title":"Accidently ordered 2 pair of the same…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"Rodrigo","text":"I received my sneaker, it's more beautiful in person than in the photos and buying it at @stockx I'm sure the product is original! \n\nWhat disappointed was the dedicated hygiene in the inspection of my product.\n\nI found several strands of hair, inside one of the pairs, in the box stuck to the label at the bottom of the box and in the paper that wraps the sneakers. After a pandemic, I'm sure no health care was devoted to handling my Yeezy! \n\nI posted the photos on Twitter with the hashtag #GotItOnStockx\n\nBest,\nRodrigo","title":"Strands of hair inside the Yeezy box","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"LaDonna","text":"Bought a pair of shoes, my husband tried on one shoe, it was too small and he immediately took it off. Sent the shoes back and they could not be accepted because of “signs of wear”. He didn’t even walk around in the shoe, and didn’t crease it so how could it show wear signs. I was also told the box wasn’t perfect. IT WAS SENT TO ME IN THE SAME BOX! So the box was ok to send out but not to take back? Bullcrap. I’ve been telling everyone to use GOAT instead.","title":"Trash site","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"OneOSixNPark","text":"Scammers tell lies about product to get it sold!","title":"Scammers","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"Kristin","text":"Ordered shoes on April 27th for my daughters sweet 16 on may 15. They haven’t shipped to stock x and you refuse to refund me.  And I can’t find a phone number to speak to anyone","title":"Ordered shoes on April 27th for my…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-06","author":"raul","text":"Quality of the product isn't quite what I had expected. The shoe was scratched on the left side (left shoe) . I can live with it ... but I don't think this is ok at all considering the money I've paid. Might wanna add a quality check along the authenticity one.","title":"Quality of the product isn't quite what…","stars":3,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Elise","text":"I am in love with my shoes and I’m so excited about them!!!!!! But they took 2 1\/2 weeks to get to me which I would have been chill with if I had known where my shoes were and what was happening with them. After I bought my shoes I didn’t really hear anything about them for the first 2 weeks but I trusted the company and now I have my shoes which I am super happy with. The price was good and I love the shoes I just wish I could have been made more aware of what was happening with them in the time between the purchase and when I got them.","title":"I am in love with my shoes and I’m so…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Seppo Kylliäinen","text":"Scam! Do not buy!","title":"Scam","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Jason","text":"Although we found the shoes we were looking for, the hole idea of playing available inventory like an open market is unappealing. I'm sure we paid more than we should have. In the end we got what we were looking for though. Paying $200 for sneakers isn't a feel good experience.","title":"Although we found the shoes we were…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Linda Zhao","text":"even one star would too much.\n\nI have received 4 fake jackets in a row for: Our legacy x Stussy x Denim Tears Varsity Jackets (M,L,XL, and XXL) two have been refunded, and the other two are of the same quality they said its real. It gets really frustrating the fact that you know both of them are fake but they say it's deadstock. And since, 12 days ago they start not replying to my emails at all. How absurd of this? I really don't know what to do next, it's just beyond being dissatisfied.  In addition, to the point that we pay so much for authentication fee but still, we need to doubt the quality of it, is it acceptable? in my case not at all. just very shameful of being such a big company like them.","title":"4 fake jackets in a row","stars":1,"location":"KR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Beth","text":"There's no way to get in touch with customer service.  The converse I purchased had many loose threads on the tongue. I would've liked a different pair due to this but again couldn't get in touch with anyone. I would probably buy somewhere else next time.","title":"No customer service","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Armani","text":"Delivery was horrible I barely was able to get my shoes","title":"Delivery was horrible I barely was able…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"isaiah","text":"Never received my pair of sneakers","title":"Never received my pair of sneakers","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Darrish","text":"No good I want full refund","title":"No good I want full refund","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Valentin Lifar","text":"Bad service, don't recommend.","title":"Bad service","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Hieu Thai","text":"I would like Stockx change the platform policy. So I can edit my profile and payment. I don’t like to contact Stockx support for a little thing. Also the platform and commission fees was too high. eBay is lower fees and their platform more convenient. Thanks!\n\nRegards, \nCustomer","title":"I would like Stockx change the platform…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Tyler","text":"cool shoes and stuff but the return policy sucks. i’m a teen with a low amount of money and i get the wrong size and can’t return it which is why i won’t use this website again.","title":"cool shoes and stuff but the return…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Anonymous","text":"Despite still getting my item I don’t like the idea of stock x and strongly disliked having to pay another 80$ to get my item, and on top of that wait a whole two weeks before getting it! \nThis is ridiculous and it’s ruined the shoe game.","title":"Screw StockX!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Dwayne Armstrong","text":"This is my first and last ....i don't recommend buying from this website!...I receive a defective sneaker... One foot was very tight, i tried to do a exchange but in the process ran in to the great news of no return or exchange......","title":"Exchange!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-05-07","author":"Emma","text":"I like the accessibility. I like viewing items before purchases and see trends in price. I do not like the lack of transparency\/support. I ordered a pair of shoes and the “help bots” or whatever were not helpful and didn’t redirect me to a real person. Apparently the seller didn’t ship the shoes and I didn’t find out until over a week later. I still don’t know when the shoes will arrive and it’s been almost two weeks without any real updates :\/","title":"accessibility but lack of help\/transparency","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=2&stars=1&stars=2&stars=3"}]