[{"date":"2022-03-17","author":"Dustin Richerson","text":"Since when do you get Jordans from China then I pay stock x to verify them but are being ship from China to me got a funny feeling I just paid full price for some fake Jordans never will order from StockX again","title":"Since when do you get Jordans from…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"hariyadi tengjoyo","text":"Hi Stock X, please my make my 3 sold items at your company for my transaction Jan 25,2022, if you dont want make payment please return my item dont steal my money, dont said excuse that you already transfer payment, the proof of payment from you its not to my bank account, even my bank told me thats not my account n routing number, previous sales transacation on Jan 18,2022 I can received my payment from you, but Jan 25, 2022 transaction for 3 sold item you havent made any payment till today for sales #32727272 #32727378# 3273732, all your representative and hyperwallet team still couldnt solve this problem,  on Jan 31\/22 i called on your company report that why all my payment info change into someone else name(the name of recipient on your shipping label atock x GA) and then u just reset clear my data but u dont pay, its\nall I want make the payment or return my items","title":"Stock X doent make my 3 dold items","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-17","author":"Steve Gabler","text":"I ordered a $500 pair of shoes. They shipped the wrong pair and will not give me a refund or the correct shoe. Unbelievable! Buyers beware!","title":"I ordered a $500 pair of shoes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"Larry David","text":"Trash. Website sucks and you can plan on not receiving much support whether you are a buyer or a seller; Doesnt matter. StockX is in it to skim off the top and that's it.","title":"Trashy company. Slow communication","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"Evie","text":"I ordered shoes over 2 business days ago and I've received absolutely no information about where they are, or when they'll be shipped. Their website's policy is to ship them within 2 business days, and this has not happened - legally punishable breach of contract by the way StockX!\nThere is no email to contact them on, and the help\/contact page is completely useless and offers no actual support or way to get in contact with StockX unless your order has been delivered. \nStockX, if this is replied to, please give me an email to contact about my order, not a link to the help\/contact page on your website, as I've tried using it and it's useless for my situation.","title":"Order number 34916823-34816582","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"Nini","text":"Honestly, this review was a long time coming. I have been using stock x for a while to sell and buy sneakers. In the beginning this company was great and efficient but now they’re lacking extremely. Communication is KEY to everything and this company lacks extremely. Customer service is ehhh so so. They could do better. It’s really hard to get a hold of anyone and it’s only through email. How are you suppose to solve an issue Immediately when needed? There is no way! Buying and selling involves our money so there must be updates so we are aware of what is going on if things are taking longer then usual. There’s this new “bulk shipment” for sellers that sounded amazing. Faster shipping. Items stay together which means “faster payouts”. BS!! Total BS! I recently sold 3 pair of shoes and shipped them in bulk shipment and it is the worst thing ever! Shipment was delivered to StockX on Wed at 7am and only 1 pair of my 3 I sent in were accounted for. There have not been any updates as to where my 2 other pair of shoes are!!! I keep getting the run around from the employees of this company. So are they stealing? Are they swapping my shoes out for fakes? Is their customer service really just that bad? \nHonestly I have no idea! I have yet to get an answer, so I wouldn’t recommend bulk shipping. If you’re buying, make sure you buy everything 1 month in advance if needed for a specific date. If you’re Selling, record and take pictures of everything you are selling to protect yourself because this company won’t protect you. I understand we are all dealing with the aftermath of this pandemic but cmon. Management has to get their s**T together and take care of their employees to do better for their customers. A successful business cannot run without consumers. Shi**y customer service will bankrupt any company! Any service!","title":"Honesty! Sh** customer service! Lack of communication!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-18","author":"shannon brown","text":"I was able to track my package all the way to Fedex ground in Michigan and then according to Fedex, the package was unable to be located.  It then became a back and forth between Fedex and StockX as to whether a refund would be issued.  Spoke with Fedex but was never able to speak with a live person at StockX.  Situation is very frustrating and upsetting because a significant amount of money was spent on merchandise.  There should definitely be some protocols and safeguards in place to prevent, or at least lessen the risk of packages being, so called lost, but I say stolen.  There are cameras in fedex and I definitely think if footage was reviewed they would be able to see who stole my merchandise.","title":"I was able to track my package all the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"Reyes","text":"I will never order the shoe from StockX due to not able to return the item. will have to figure out how to get $$ back with it","title":"I will never order the shoe from StockX…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"Latoya","text":"Missing laces and have to jump through hoops after spending so much money.","title":"Missing laces and have to jump through…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"Colin","text":"1. When purchasing your time expectations are not clearly presented. You have to dig into help section to figure out it’s going to be 2-3 weeks to get your product. \n2. The seller didn’t send in their product so after 3 days then StockX said it was getting it somewhere else which added to the delay\n3. I got a notice that it shipped Thursday from StockX, but said I won’t get it till the following Thursday. Even UPS ground across the country is faster than that. Not sure if they are using turtles to deliver or what. \n\nOverall, the first experience will probably be my last. 3 weeks from purchase to receipt is too long in this day and age.","title":"Way too Long","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"Damon","text":"I didn’t get my sneakers","title":"I didn’t get my sneakers","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-19","author":"Jerald","text":"My essentials hoodie was in poor condition, the fibers and strings were falling apart and it just feels like it’s been used for a while.","title":"My essentials hoodie was in poor condition…..","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Paul","text":"Won the shoes in a bid for $80 cheaper but because my bank didn't recognize the site, it flagged it. I approved the purchase thru my bank but could not get the shoes at that price. Had to bid again after the price was already accepted and paid more (buy it now) because I needed the shoes by a certain date. They waved the shipping of $10 but I still overpay for something I bought for cheaper and they just couldn't fix the transaction.","title":"Won the shoes in a bid for $80 cheaper…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Cam","text":"Shoes came damaged","title":"Shoes came damaged","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Melissa","text":"Still have not received my order. Takes way too long to get what you purchased. Ordered on March 7.","title":"Still have not received my order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Joshua","text":"Shipped quickly just alot of extra fees otherwise 5 stars.","title":"Shipped quickly just alot of extra fees…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Giiuven","text":"They never reached out about my order that I never received.","title":"They never reached out about my order…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"selein","text":"First time i ordered no results 🙃","title":"First time i ordered no results 🙃","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Chase","text":"1st attempt a total fail. 2nd attempt was better with coupon but I really feel the box was resealed.","title":"1st attempt a total fail","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"},{"date":"2022-03-20","author":"Tierra","text":"I can’t purchase anymore This is horrible","title":"I can’t purchase anymore This is…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=74&stars=1&stars=2&stars=3"}]