[{"date":"2022-04-24","author":"doc","text":"Ordered 200.00 sneakers 4 my GS bday...said delivered but havent seen them!!! Wheres my refund??!!! 🤬","title":"Ordered 200.00 sneakers 4 my GS…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Inez Reyes","text":"This company allowed my 11 year old son to order and pay for a pair of shoes that cost $130. plus tax and shipping handling which brought total to$160. Without my permission. He used my credit card and I am not allowed to return or get a refund. This should have never been allowed.","title":"This company allowed my 11 year old son…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"JS","text":"Y’all cancelled my order for no reason.","title":"Y’all cancelled my order for no reason.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Ms. E","text":"They need a better return policy in place as well as a better way to communicate","title":"Ma. E","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Viktor","text":"The snickers is defective!","title":"The snickers is defective!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Tristaca","text":"My order was placed approximately 2 weeks ago and StockX has went through 2 different sellers to get these slippers. I doubt very seriously I’ll be making anymore purchases from this site again. I usually use GOAT but decided to give StockX a try and it failed miserably…","title":"Unhappy Buyer!!!…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Kornell","text":"Terrible won’t order from here again !!","title":"Terrible won’t order from here again !!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Ged","text":"Takes quite long to come other then that shoes do seem to be creased slightly with no wear","title":"Takes quite long to come other then…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Nooa","text":"I still haven’t received my order. Estimated arrival was the 21st of april.","title":"I still haven’t received my order","stars":3,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Lindsay","text":"No way to return, no contact info for Stock X. BUYER BEWARE. Size didn't fit.","title":"No way to return","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Vikram","text":"Ordered a product , only to be told 3 days later that it was a wrong order .","title":"Ordered a product","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Nancy","text":"Impossible to speek with somebody or get intouch with stockx when There is a problem.I dont recommand this site.","title":"Impossible to speek with somebody or…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Tomislav","text":"No sneakers were sent","title":"No sneakers were sent","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Andrea Renee mahdavi","text":"Making purchase seemed smooth and was looking forward to receiving product.  Several days later, I received a cancellation and refund notice with no explanation.  Very disappointed","title":"Order smooth - but CANCELED several days after purchasing with no explanation","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Customer","text":"Ordered a pair of air 1s for my husband for his birthday a few weeks before and found out they were fake and refunded two days before birthday … so I had to scramble. Not fun","title":"Ordered a pair of air 1s for my husband…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Jeta","text":"The merchandise sent was fake. I communicated with stockx about the problem and was sent an email directing me to follow up in a link that was just a list of FAQ. No solution provided. I sent another email to address the problem and received no reply. Overall a horrible cheating! Stocx receives a payment allegedly to ensure authenticity of the merchandise but does not take any responsibility when the merchandise it sells is fake. I lost 440 cad in a pair of shoes that are a joke. It is a cheating website that legitimizes the fraud of sellers. A totally dismissive approach of stocx which clearly shows that they are not serious but just cheaters. Never ever!\n….\nReferring to the reply below from Stocx- it is not glues and stitches- but nike logo in insoles is missing and the logo on the side of both shoes is not engraved as the authentic ones. Furthermore you did not provide me any opportunity to explain what is wrong with the shoes and why I believe they are fake- but closed any line of communication. Obviously you have not done your work to properly check what you delivered- regardless of being paid for that and your promise to verify before delivering!","title":"The merchandise sent was fake","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"james charters","text":"I initially thought I was paying one amount for shoes I bought, however, when the transaction was completed I paid $70 or so more. I think the pricing should be more transparent and in the amount you are actually going to pay. Apart from that it wasn’t bad.","title":"I initially thought I was paying one…","stars":3,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Jonathan Cooke","text":"I raised a query and received a fast, comprehensive response so I proceeded to purchase an item that I had previously been bidding on. A few days later I received an email stating the item had arrived at StockX to be checked. A week passed with no further updates so I looked on the website and was disappointed to discover that the item had not passed the verification process. Their online help section states that, if this happens, they try and match the winning bid with another seller; however, I subsequently received an email stating that they will be refunding my money within 3-7 working days. Whilst the initial customer support I received was excellent, clearly they have not followed company procedure as there are now several of the same item listed on the website for considerably less than what I was prepared to pay. Whilst I appreciate that it’s not their fault that the item couldn’t be verified, they have missed an opportunity to shift a different sellers’ item for quite a bit more than the current listed price. I am now praying that the refund is processed in a timely manner as I have seen the same item offered for sale elsewhere and it would be a shame to miss out twice!","title":"The good, the bad and the ugly","stars":3,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"Matthew","text":"I NEVER RECEIVED MY SHOES!!! They emailed me saying I got my shoes a week after fedex “delivered” then but when I checked my ring camera fedex did not show up on the day it said it was delivered. And stock X still had not responded regarding my shoes. NEVER using STOCKX again","title":"I NEVER RECEIVED MY SHOES!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"},{"date":"2022-04-25","author":"anonymous","text":"Horrible!! ordered a jumper two weeks ago and received an email two days prior to expected delivery saying my order was refunded with no explanation. this occurred three days ago and still haven’t received an explanation or a refund!!!","title":"Horrible!","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=24&stars=1&stars=2&stars=3"}]