[{"date":"2022-01-02","author":"Customer","text":"Tried to cancel an order 5min after placing it (order size 8 Toddler instead of Adult 8). The description was very misleading (TD) at end of description, small print... Spoke to 2 people that experienced the same issue. Send emails daily (while status showed not shipped yet from seller). They never responded. The shoes arrived at my house 1 week before estimated date (like if they rushed it) and then they said NO returns. I asked for a credit, NO response. Then they suggested I sell them on their site, after the price dropped and still charging me their 15% fee. Basically a 50% loss.\nHORRIBLE customer service. Rip off. NEVER Again.","title":"Tried to cancel an order 5min after…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-02","author":"Caleb Whittle","text":"Never will order anything from stockx again. Sent me deformed shoes with creases and they are going to tell me they passed inspection. Comical how low their expectations are for passing shoes. Unreliable site. Will be sticking with GOAT from now on. They know that the creases aren’t okay but want to act like they are. I don’t care what you say about manufacturing code. You know you wouldn’t want shoes creased or caved in. You would be pissed to @stockxanonymous","title":"stockx sucks and are unreliable","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-02","author":"Brian","text":"I Sent in a pair of Jordan’s a while back I believe they were a size six in grade school. But stock x was expecting a size 6 in men’s. Which were never made. But told me my shoes didn’t pass so they charged me and sent me my shoes back with the box all sliced up by a razor blade. They told me if I wanted to sell them to just put them under grade school and sell them again on stock x. I let them know my box came back to me all sliced up by razor blade. So I sent them again to stock x under the right size and was denied for cuts in the box.","title":"Sliced my box with razor blade then sent them back to me.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-03","author":"Naiche Ogude","text":"SELLING FAKE SHOES!!!","title":"SELLING FAKE SHOES!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-03","author":"Logan Jones","text":"Ordered my shoes a week before Christmas and still haven’t come it has says it has gone through the authentic process but still haven’t turned up","title":"Ordered my shoes a week before…","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-03","author":"James wright","text":"Bought some cool greys from stock x straight fake bad business will never buy from stock x again","title":"Bought some cool greys from stock x…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-03","author":"Sara Hausser","text":"Terrible experience.  Was looking at size 8 shoes for $118 and hit buy now only to find out that size 5 was the default.  Immediately tried to cancel the order, contact the company or exchange size.  There is no way to contact the company even though this was a technical issue.  Looks like they expect the buyer to become a seller and earn them more money.  Will never go to this site with no. Customer service again.  Stay away\n\nUpdate:  right there is no record of my reaching out to you because there is no way to do it.  Just like others commented this is the only way to reach you.  The policies you stated are exactly why people should shop elsewhere.  Warning!  My order was placed incorrectly due to your websites default for buy now.  I stand by my original review.","title":"Terrible experience","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-03","author":"Aiden Mora","text":"I’ve never been so disappointed and frustrated with a company in my life. I’ve seen many other reviews addressing the same problem and they all have the same response “email our support team” but their support team does nothing about it. I recently sold shoes for $500 and the shoes were “lost in transit” so I filed a claim with ups to get my money for my shoes. I’m assuming ups did their part all stock x has to do is confirm the claim. I’m assuming stock x already confirmed the claim and just ran away with my money, I’ve been emailing stock x for about 4 months about this issue and little to no responses. I’m using this as a last resort hoping they will do something about my money. My advice is to stay as far away as possible from a company like this.","title":"SCAMMERS!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-04","author":"3cn3pS","text":"Sell you damaged shoes that “ pass inspection “ then tell you too bad so sad you’re not getting your $ back!","title":"Trash","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-04","author":"Kenny Burchett","text":"I ordered an Xbox series x from Stockx on Christmas day. The total amounted to be over $700. My bank immediately flagged this site as a fraud, but I looked into it online and it seemed to be legit, so I held off on accepting it as fraud. However, the item was supposedly shipped to Stockx for \"authentication\" before New Years according to the APP. It's been over a week now and the APP STILL says they are awaiting the shipment. I've sent multiple messages to stockx via their app with absolutely NO response. You can't call them. It's BS. I'm not about to be out $700 over some fraud crap. If they can't have even the decency to respond to me then my next step will be to contact my bank for a charge back and the BBB. If they cant bother to even respond to that for an apology, then perhaps court or maybe the media WILL force these people to respond. What a joke this is.","title":"I ordered an Xbox series x from Stockx…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-04","author":"Leon Stratford","text":"I’ve never been so disappointed and frustrated with a company in my life. I’ve seen many other reviews addressing the same problem and they all have the same response “email our support team” but their support team does nothing about it. I recently bought shoes for nearly $500 and the shoes were “lost in transit” so I filed a claim with ups to get my money for my shoes. I’m assuming ups did their part all stock x has to do is confirm the claim. I’m assuming stock x already confirmed the claim and just ran away with my money, I’ve been emailing stock x for about 2 months about this issue with proof ups said my order cannot be located. I’m using this as a last resort hoping they will do something about my money. My advice is to stay as far away as possible from a company like this.","title":"I’ve never been so disappointed and…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-04","author":"Aleks Aleks","text":"Account is on hold since 14.10.21\nToday is 04.01.22\n\nProblem still not solved!\nIgnoring for a weeks =\/","title":"Account is on hold since 14.10.21","stars":1,"location":"LV","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-05","author":"Mike","text":"Frustrating , stressfull experience  we've been in so much stress because of this company,  stockx. Thanks for  hurting all our emotions.so . a disorganized company  with so many internal issues causing stresfull moments to peoples lives. And all this stress its in my job and around my family because of you guys.","title":"We've been in so much stress because of this company","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-05","author":"Josh James","text":"Shoes with Stock x  are authentic. But the shipping process is horrible. Sellers take extremely to long shipping items to Stock X after your money is withdrawn. The wait isn’t 7-14 days . More like 15-22 days. Thanks","title":"Shoes with Stock x  are authentic","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-05","author":"End of Novelty dot com","text":"I was away on vacation when several packages arrived from StockX. \n\nTwo of the packages were damaged beyond repair. \n\nBut three days had passed, so StockX didn’t do anything. \n\nOnce 3 days pass, you’re stuck with whatever garbage you got. \n\nAnd…I ordered a sealed collectible. The seal had been tampered with, but StockX passed it off. \n\nWould not give me a refund, but literally told me to sell the tampered product back to them at a lower price. \n\nDon’t use them.","title":"StockX SuckXxxxxx","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-05","author":"Susan Douglas","text":"£111.20 taken out of my sons account for Nike trousers. They asked him to verify his account and tried to take a second payment. He doesn’t have his order but they have his money!!! We have sent countless emails with proof of the money being taken out and no order. They are now ignoring us.","title":"£111.20 taken out of my sons account…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-06","author":"Shad","text":"StockX sold me Replica cool grey 11s made from there own manufacturer overseas. (Yes there own manufacturer, so look out if it’s authentication is being shipped from overseas)!I had a pair already so , I vividly showed the difference between the shoes. They just said I can post them on the market if unsatisfied.","title":"StockX sold me Replica cool grey 11s…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-06","author":"James","text":"This company are scammers. Ordered a us 8.5 as per size guide, expecting a UK 7.5 only to be sent a UK 6 (no use to me) I paid over $315\nNo returns but they'll offer to sell them on for you but at a reduced price. Then they take commission again for selling for you. Rip-off","title":"This company are a Rip-off","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-06","author":"Jennifer Walker","text":"So my purchase of the cool grey 11's for my husband's birthday went totally left. After comparing my stock x purchase to the pair directly from Nike we are convinced they are fakes. We checked the stitching, even the jumpman sits differently. It's money lost as there is no way to contact anyone. Planning to file a report with the better business bureau. They must be stopped.","title":"So my purchase of the cool grey 11's…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"},{"date":"2022-01-07","author":"Jennifer Grit","text":"When I was browsing my phone this morning I saw a news about StockX selling fake Jordan 11 Retro Cool Grey. I went ahead and watch videos people recently uploaded and I ran to my room and checked what I had purchased. And hell yeah!! I bought 2 Jordans, a size 6.5 and a 8.5. When I checked under the inner sole pad, mine (6.5) had a stitch of color red thread. For the size 8.5 the inner sole too has a mark of numbers that I don't know for what but looks fake because real Jordan's never have these. And the quality is not what I expected. There are some flaws too outside. If I never saw that news I will never have an idea I got fake Jordan 11!!! It is my present for my husband for Christmas last month and bought one for myself so we could have a couple shoes!! Now what can you do? I spend more for these purchase and I bought 2!! You have to do something!","title":"Bought 2 Jordan 11 and it is fake!!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=84&stars=1&stars=2&stars=3"}]