[{"date":"2021-12-16","author":"Colin","text":"SHOULD NOT BE SELLING PREMIUM BRANDS!!! THEY ARE BIGGEST AMATEURS ON THE PLANET...\n\nABSOLUTE DISGRACE..\n\nDO NOT USE UNDER ANY CIRCUMSTANCES!!!","title":"THEY ARE CLUELESS","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-16","author":"Rodney King","text":"They sell replicas, i have bought a whole offwhite which is fake, the shoe arrived i contacted their support which is almost non existent support, They keep sending me this useless kinda automated email “ Hi Rodney,\n \nThank you for contacting StockX regarding the information for your purchase, I understand your concern and I will be more than happy to assist you on this matter. I'm just following up on your previous reply.\n \nAfter reviewing your last email, would you please provide me pictures in PDF or JPG format of the item that you received, the StockX tag, and the QR code? I did not receive the PDF. \n \nOnce I receive the information requested, we will be able to further investigate this issue. Your cooperation is greatly appreciated. Thank you for choosing StockX!\n \nStay safe and have a wonderful day.\n \nBest Regards,\nMoises”\n\nMeanwhile i have replied with it so many time, this is totally ridiculous. I wish i could give them a  -5 (Negative 5 star review) worst company ever. the Current Order - Purchase CRM:03150000239“ \n\n\nhow the he*** do you let someone send me a totally fake shoe with a colorway which dont even exist , i will call my bank i cant spend this much money and no customer support but generated automated email, if the customer support real, moises need to be kicked out","title":"They sell replicas","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-18","author":"Ahmed Al Mansour","text":"I have sold almost 30 pairs of sneakers Through stockX but now they’re not willing to pay for the last one I have shipped out it’s been processed and verified. I made multiple complaints and reports open cases and they kept ignoring me. I had one reply and since then never had a reply again.","title":"They don’t pay sometimes","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-18","author":"Tom ","text":"Ill change this rating if the issue is rectified, I ordered a pair of Yeezy 350's on the 15th and I was charged the full amount yet immediately the website came up with bid was not accepted yet I did buy now not bid, I have not got an order number and nothing has come up on orders on my account. I emailed support and I got the standard email asking for images which I sent immediately yet I have still not heard back, it is a Christmas gift and I need the money back to buy something else if the order didn't work. Can someone please respond to the email and refund me its been over 2 working days.","title":"Charged the full amount without the order working.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-18","author":"Στελιος Μακρακης","text":"They sold me a pair of air jordan 1 banned, which was a Christmas gift for my daughter, without the original Jordan box and shoe wrap, but with an awful replacement box, and claimed to be authentic. How, can any pair of shoes, verify authentic, without the box and everything else that comes with it? Their suggestion to their mistake was to resell them, or to withdraw without saying anything about refund. Fake, fake, fake.","title":"air jordan 1 banned","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-18","author":"Andreas","text":"Don't buy there. rip-off, authentication means nothing and you will lose money. Just try and find a contact email... Good luck. So no, not a trusted shop, on the contrary.","title":"Don't buy there","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-18","author":"Melinda Atkins","text":"Absolutely horrendous people! They are in it for money only and don’t care for you or anything other than that! They don’t chase, check or validate your order unless it is last minute I suggest you use an alternative solution and source your product elsewhere","title":"Absolutely horrendous people","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-19","author":"Brent Bowen","text":"If 0 stars was an option I would give this -3.\n\nDo not buy from stockx. \n\nComplete disorganization. And no returns policy. \n\nTotal disgrace","title":"If 0 stars was an option I would give…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-19","author":"B F","text":"I'm a seller based in Hong Kong and just earned my Level 5 seller status. Within one month there's been 3 sales failing verification because 'item does not match listing'. I mainly deal with designer clothing and sneakers and it's a known fact one product style can carry different serial numbers due to re-releases, carry overs from past seasons, different manufacturing batches etc. \n\nThe verification process used to be smooth without many problems. Somehow within this month their 'authenticators' had taken a different approach of just matching items according to that one serial number listed without using any common sense, or having understanding of the brand and styles they are working with. I've sold Palm Angels t shirts from the same batch number on StockX before without any issue, and all of a sudden the latest sale got rejected because the serial number doesn't match the listing? Does your staff have any clue that the style gets re-released? What is going on?!?! \n\nAlso have noticed that multiple listings for the very same product has been appearing on StockX. Search Palm Angels Logo Print T Shirt Black VS Palm Angels Classic Logo Print T Shirt. They're both the same crewneck style that Palm Angels had manufactured for multiple seasons now!! \nI've used another app called POIZON to buy & sell before, I've pretty much lost interest in listing stuff to sell on there because these muppets have overpopulated their app with duplicate listings of the same product, all due to some rigid principle that they only verify through serial numbers. I can't imagine shopping on there with all sorts of duplicates presented as if they're all different products.\n If StockX is trying to replicate this approach then I highly suggest you not; this is the ultimate user experience fail which will lead to more confusion for both buyers & sellers alike, a super messy f'ed up interface and loss of any organization. The logic MAKES. NO. SENSE. And most of all you're wasting my time, effort and money in the process!\nAnd by the way, the items returned to me are now sent from Mainland China, which takes twice as long to get back to me. I am absolutely appalled at what my recent selling experience had been.","title":"Verification service took a nosedive overnight","stars":2,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-19","author":"Amy Knudsen","text":"We bought a pair of shoes, which we received and were charged for. Now I have 22 additional unauthorized charges totaling $4562 and there is no way to contact them to find out what is going on. I have contacted my credit card company. I would give these guys negative 100 stars if I could, if you are thinking of buying from them DO NOT!!!\n\nHow am I supposed to work with you if I literally cannot contact you. We have tried but there is no way to do it without an account because you have no phone number to call. We have tried to see about resetting a password or to request information and we never get an email. These are unauthorized fraudulent charges, I have every right to dispute these with my credit card company, especially when there is no way to resolve the issue with StockX.","title":"Fraudulent credit card charges","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-19","author":"Ms. Quita","text":"Brought a pair of vapormax and when I received them they looked glued so I said maybe the factory messed up but now me shoes are falling apart these shoes cost too much for this and they don’t have real customers service they have lost a customer I’ll advise people to go into the store so YOU,YOURSELF can see your shoes","title":"Don’t buy vapormax","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-19","author":"richard fish","text":"My son still hasn't been paid. This is disgusting!! This is nearly 3 months. There is no phone number for StockX to phone. I will get the usual response to this review of how there is a case open but nobody contacts us. Where is my sons money please?. Its out of order he's 17 and owed £237.28. He has been into your store followed all the guidance early on but is now being ignored. I don't know where to go from here. I guess a small claims court or financial ombudsman. Absolutely terrible!!","title":"My son still hasn't been paid!! BEEN 10 weeks!!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-19","author":"Jalen Dawkins","text":"I recently ordered shoes from stockx , they charged me twice for the same shoe and I ordered another pair of shoes they sent to the wrong house. I recommend people use goat or another shopping service for shoes","title":"I recently ordered shoes from stockx","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-19","author":"Earl","text":"I sell on all platforms and started using StockX this year.  Well they have a policy if item dropped off at UPS access point item is not covered by them if loss.  This is an absolute joke as you can’t claim through UPS as not your account so you are left with nothing thankfully the other platforms don’t have these issues","title":"Be careful with this company make sure to check t & c","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-19","author":"Mike","text":"StockX sent me a pair of fake retro 4 fibas there’s glue that leaked on 5 different parts of shoe they swear that it is real and offered me a 40$ credit for the inconvenience I took the shoe to 2 places to have them verified just in case I was mistaken both places agreed there’s no way Nike sent a shoe out with that much glue showing","title":"StockX sent me a pair of fake retro 4…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-19","author":"Korryn McLaughlin","text":"I logged in to StockX to purchase a pair of shoes for my son. I selected a size 8.5 shoe and completed the purchase. When I received my order confirmation it showed a size 9 shoe. I attempted to contact the company to have it corrected, but there is absolutely no way of contacting them. In addition, there is no way to cancel an order, even when it is incorrect. This is a bait and switch, I will be making sure that I alert everyone to their unscrupulous practices.","title":"Bait and Switch","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-19","author":"Alex","text":"LEFT BAD FEEDBACK LAST WEEK AS WAS COMPLETELY DISGUSTED WITH SERVICE.. THESE GUYS NOT A CLUE WHAT DOING!!! ADD INSULT FURTHER, THEY TRY TO MAKE OUT THEY ARE RIGHT!!! SO SO SO SO UN-PROFESSIONAL... I CLEARLY STATED IN LAST BAD FEEDBACK, BURBERRY BAG WAS BOUGHT FROM SSENSE (NOT EBAY) YET THIS KEYBOARD WARRIOR FOOL, THAT REPLIES TO FEEDBACK LEFT REPLY, SAYING \"WE REQUIRE CUSTOMERS TO PURCHASE FROM RETAILER NOT THIRD PARTY\",,,, \nTALK ABOUT INSULTING!!!! \n\nYOU GUYS ARE AT FAULT,,, NOT ME!!!! BEGGARS BELIEF TRY COVER OVER OBVIOUS ERRORS..  \n\nSTOCKX X ISSUE!!!! DON\"T BLAME ONE ME... I HAVE RECEIPT TO HAND!!!!!\n\nITEM BOUGHT FROM SSENSE,,, COULD NOT HAVE BEEN CLEARER!!!..(SSENSE A PREMIUM BRAND E-COMMERCE SITE IN EUROPE). DOOOOOOH!!!!\n\n5 SECONDS ON GOOGLE WOULD CLARIFY THAT!!!!\nYES EMPLOYING,, VERY INCOMPETENT STAFF AT EVERY PROCESS AS PROVEN...\nPRETTY USELESS HAVE TO SAY.\n\nHENCE REPLY JUST MAKING STOCKX LOOK EVEN MORE INCOMPETENT!!!  \n\nONE THING AFTER ANOTHER...\n\nWHAT A MESS!!!!!  \n\nWHO WOULD TRUST BUYING ANYTHING HERE?\n\nTHE WHOLE FORMAT FROM AUTHENTICATION,,, TO THESE INSANE REPLIES, IT  IS AN ABSOLUTE MESS!!!\n\nTHESE GUYS ARE SELLING PREMIUM BRANDS WITHOUT A \"SCOOBY DOO\" WHAT IS WHAT!!! GENUINE ITEMS FAILING,,, SO ASSUME VERIFYING A HUGE AMOUNT OF FAKE ITEMS AS GENUINE.. 100% THATS WHAT DOING..\n\nYOU COULD NOT MAKE IT UP.. JUST NOT GOOD ENOUGH.\n\nNOTHING PROFESSIONAL ABOUT STOCKX... HOW ANYONE CAN BUY ANYTHING WITH CONFIDENCE,, NEEDS A \"CHECK UP FROM THE NECK UP\"..\n\nTO CLARIFY,,, \"NOT A CLUE WHAT IS WHAT\"","title":"EVEN THE FEEDBACK REPLIES ARE UN-PROFESSIONAL!!! NOT A CLUE AS CLEARLY PROVEN...","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-20","author":"Adam Usmani","text":"Thieves, they have he audacity to cancel 4 of my sales due to there ‘website errors or courier errors’ and then despite the amount in compensation I am owed from them they still charge me 15% despite this being MY first cancellation to which I wasn’t graced. They owe me for beyond damaged Jordan 11, 3 week late vapormaxes, 3 week late payouts, couriers which break lockdown rules, rude customer service which never respond and ignore ignore and ignore. \n\nBuying\n \n10283824-10183583\nI never broke the box in shipping nor did I ever send my self or pay for a shoe with the thread all pulled. Out of the side. Now did I!!!! I did send the pictures as I was so shocked that passes stock x blind authentication team. I got can’t do anything sorry in response. That’s it ridiculous. \n \n12793614-12693373\nThe vapormax probably one of the most shocking I received this shoe almost 3 weeks late and it wasn’t even the shipping the authentication seemed to take so long needlessly. However this item came all in one piece unlike the jordan 11 so congrats.\n \n13601444-13501203\nFair enough you weren’t to know about the broken box but tbh I just didn’t see the worth if I all I get is after 2 emails I just get ignored for weeks upon end. Unlike goat.\n\nCrazy I planning on buying a pair of dunks from you within then next 2 weeks for my girlfriend. That’s more money I’m giving which is such a waste. What do you even use that commission on lol you should literally maybe spend it on auto response to respond at least they don’t take a week to respond and actually respond and not ignore for months on end now do they. \n \nSelling \n \n12961865-12861624\n\nNow my first sale tbh I wasn’t as knowledgeable about selling on stock x which meant I actually sold for very little profit lol however I do know how to read a box and a US shoe size on a box. As if I would ever get a 14 lol I won a 13 US Uk12 but for some reason your site thought it was a 14 tbh can’t expect much tbh I was using your website which is ten times worst than your app. The amount of times I have been the lowest ask and still not sold despite the item selling for more than me the lowest ask lol 🤦. Now also when I sold on the website literally in December last year I sold like 3 items and received notifications for them on the app but it never even delisted. Or ever got on the sale page it’s as if it just sent the notification to trick me it was for the dunk disrupt black\n \n14974227-14873986\nAh another size problem so I’m not sure if you guys didn’t know the sizing of the yeezy slide as tbh back then it was brand new however the sizing is the same both ways a uk12 is a us12. Not only that but you had the completely wrong size guide on site until I pointed it out and got support to put in a. Request to change it and correct it. This sizing problem I notice happens on kids shoes ALOT miss match sizing also you sometimes have sizes which literally don’t exist like how can a toddler jordan 1 uni blue have a 1Y lol. Don’t worry KLEKT often have this problem however seems like they are leading the pack with customer experience goes. \n\n15133937-15033696\nRight so this one probably one of the. Most stressful ones. I sold the shoe great I had the shoe double great however we was in a nation wide lockdown and it was illegal to leave house other than groceries essentially I’m not taking a £10000 fine for nobody when the army are patrolling the streets. So I requested and rightly so an alternative shipping. Label for home collection don’t worry I will cover the cost for the collection lol. Anyway that fell apart with your agents taking days to get back to me then they gave me a shipping extension when lol there wasn’t any shipping extension even thought I received an email for one I told the advisor and he said he is sorry the shipping extension didn’t work as. I never got one. I had to go back and collect the item from the drop off before get sent it as in the end I did risk it breaking. The law for you. \n \n15161823-15061582\nOk probably the most funniest literally the company who made the item laughed on the chat. Palace tri hoodie I got one from\nDiver street market and one from palace I sent the palace one to you in the palace packaging with the palace receipt. Then it took a week to authenticate I actually messaged saying this is taking too long then boom verification failed. I literally sent a screen shot to palace who then laughed on the email with emojis yeah a chat agent using emojis stating how authentic do they need these days. Lol considering it came straight from the manufacture that’s real worrying on your behalf I have heard you authenticate fakes and now fail legitimates ( although thank god I never have received fakes from you otherwise that would literally just make this 10 times. Than it already is.) \n \nSo yeah I am owed way more than $24 in compensation so either refund me or compensate after asking for 2 years now lol I have proof.","title":"The audacity","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-20","author":"Mrkay kay","text":"If It would allow me id rate stock x -1 I sold a pair of shoes which I dropped of at UPS access point and it never updated Now shoes are lost and stock x is saying they don not cover them because it wasn’t dropped of a designated UPS location however all the UPS drop offs with 10 miles of where I live are UPS access points! The closest UPS facility is 13.4 miles from me!! They will not cover me for my lost shoes and won’t allow me to open a claim directory with UPS As they are the ones who have purchased the shipping label!","title":"If It would allow me id rate stock x -1…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"},{"date":"2021-12-20","author":"Vidalina Ruiz","text":"This place is so bad and fake. I wouldn’t even leave them a 1 star but you have to click on one…… we paid $250 for my daughters Lebron 18 blue tint basketball sneakers. My daughter wore them once at practice for “5” minutes in the gym and the sneakers tongue started falling apart?????? Really that is horrible and to make it worse you tell me because the green label saying “100% authentic” on the back of the sneaker is taken off that I cannot return these sneakers and you will not give me a refund….. Wow you are disgusting and should be ashamed of yourselves…… now my daughter has no sneakers and I cannot afford to buy her another pair. Shame on you 💔","title":"This place is so bad and fake","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=87&stars=1&stars=2&stars=3"}]