[{"date":"2022-03-30","author":"Monte'","text":"One of my packages was stolen last week","title":"One of my packages was stolen last week","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Erin","text":"StockX is shady and I’ll never ever give them my business or encourage anyone else to use StockX moving forward.","title":"Don’t do it!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Tim","text":"They pander to the sellers. Shoes are way too overpriced. Customer service is non-existent. Been waiting a week for shoes I bought to be shipped to stockx and no word from anyone.","title":"Just bad","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Georgie","text":"Fees are ridiculous, and shipping takes too long. However, they did have a good selection of shoes, and I happened to find the ones I wanted cheaper than they were in the store.","title":"Fees are ridiculous","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Jessica Velasco","text":"Stockx has sold me a pair of fake yeezy 500s. I ordered the Ash Greys and they come out looking like the Blush colorway. I reached out to them and they refused to let me return the shoes and refund me rather they want me to resell the shoes on their site so they can make more of a profit. I have taken the shoes to 3 separate reseller shops in my town and they all informed me that the shoes are replicas. There is differences in the material (holding it under blacklight to see the flaws), font differences inside the shoe tags and on the box and the box is a different material and color than the authentic ones.\n\nIn response to Stockx’s response I have noticed it is a very generic response sent to anyone who states they’ve received a replica. I do not believe my shoe is inauthentic I KNOW it’s in authentic. Like I stated I’ve taken it to 3 shops to be verified and all stated the shoes are inauthentic.","title":"Stockx has sold me a pair of fake yeezy…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Snap","text":"Couple dirt spouts that should of been pointed out","title":"Couple dirt spouts that should of been…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Latoya","text":"Shoes are over priced and takes forever to get ‼️","title":"Shoes are over priced and takes forever…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Sacha J","text":"I ordered and paid for a pair of shoes. You guys took the money out of my PayPal. A week later you stated I didn’t authenticate my account. I did every prompt, email and everything. I have been talking negatively about your site since. Thanks stop emailing me. I will never use your site again.—- I’m responding in an edit to my review. StockX should have told me that the item wasn’t up to their satisfaction; NOT that I didn’t authenticate my account. So they need to get their business together all around. Which excuse is it? Lol smh","title":"I ordered and paid for a pair of shoes and you took my $$ then returned it for no reason","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Gee Luperena","text":"Bought a pair of sneakers and my left sneaker came badly creased. Upsetting .. Tho, my package arrived quickly.","title":"Bought a pair of sneakers and my left…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Bolt","text":"I hate that it took so long for the seller to ship and why is processing and shipping so expensive. Terrible.","title":"I hate that it took so long","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Travis","text":"Don't care for.","title":"Don't care for","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"erik","text":"I placed my order on the 18th and paid today 30 still have nothing says there coming on the 1st shouldn’t take that long kids ordered from goat 1 week ship time plus authenticate need to speed up time frame","title":"I placed my order on the 18th and paid…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Jaylynn","text":"my shoes came in bent and creased\nhad a stain on the inside of the show","title":"my shoes came in bent and creased","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Bs","text":"Too long stuff never arrives on time it’s just horrible every order","title":"Too long stuff never arrives on time…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Cece","text":"Never again will I order from Stock X. It says Stock X will inspect the shoes before they get shipped. Obviously the person who checked mine did not care because when I got mine I could tell as soon as I opened the box that the shoes were fake asf. And now I will never buy shoes from them.","title":"Never again will I order from Stock X","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Alicia Chan","text":"I do not recommend buying Funko PoP's from this website as I am currently having a massive issue with them at the moment regarding a damaged PoP. As collectors are aware, the value in Funko PoP's lie in the box and the sticker with both needing to be in mint condition.\n\nAt no point on the listing or anywhere that I can find on the website, there is no mention that it is possible for Funko PoPs to arrive damaged. The picture on the listing is generic as well so buyers are unable to see the condition and the listing stated that the condition was 'New'. The customer service rep that is handling my case tried to refer me to a page regarding trading card boxes ... which was honestly a little insulting but I haven't lost my temper at him yet.\n\nThey are refusing to take back the item and keep insisting on giving me a little discount on my next purchase, hilarious. One more exchange and I will be lodging complaints with the appropriate places.\n\nUpdate - They still refuse to take back the item so I will be making complaints to the appropriate channels","title":"I do not recommend buying Funko PoP's from StockX","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"John","text":"Shoes came Damaged","title":"Shoes came Damaged","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Dakota","text":"It's been 3 weeks since I ordered my item and it's been the authentication process for a week now. I emailed customer service and they still have yet to email me back.","title":"It's been 3 weeks since I ordered my…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Lakia","text":"I placed my order on March 18 and I understood that the seller has up to 72 hours to ship product to STOCKX, after a week I never received an update on my order, there’s no way to speak with a love person it’s just frustrating. The shoes were for a birthday gift, it was absolutely an inconvenience.","title":"Never Received My Order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"},{"date":"2022-03-30","author":"Ruben","text":"They allow sellers to sell and post items that they do not have in stock on new releases. Their Only solution is to find a reseller after they give the seller extra time to ship which takes way longer or refund if seller delays the shipping. It is more fitting for stock x to take a hit on their shipping and processing fee in order to not sell or post non stock items.","title":"They allow sellers to sell and post…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/stockx.com?page=60&stars=1&stars=2&stars=3"}]