[{"date":"2019-08-20","author":"Timothy  OHara","text":"Grailed let me down when I had a problem with counterfeit merchandise and told me to deal with PayPal. Highly disappointed","title":"Grailed let me down when I had a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"Jeff ","text":"Moderation could be bettter.","title":"Moderation could be bettter.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"axwell","text":"Filled with fakes and flakey buyers and sellers.  Customer service is nonexistent - they just punt you over to PayPal.  Wouldn’t recommend.","title":"Filled with fakes and flakey buyers and…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"cody","text":"Froze my account because some dumbass sent me fake yeezys and I refused to pay\nFor them (refunded me then sent the shoe anyway)","title":"Your staff is quite dense.","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"VBA","text":"They never protect you if you get scammed they just tell you to contact PayPal so their “Grailed protection” is a bunch of bull","title":"They never protect you if you get…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"Michael Tonello","text":"Have sent two messages to Grailed through their help\/message system both of which were never answered.\n\nAdditionally, Grailed sellers have a very poor record when it comes to shipping promptly. I've had several transactions that have taken nearly two weeks before the seller even shipped them. Grailed should be more aggressive about dealing with that issue. Its tedious and time consuming to have to go to PayPal to constantly resolve issues such as shipping.\n\ngraceofthegarden","title":"Have sent two messages to Grailed…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"MB Vancouver","text":"Great platform for selling designer clothing. However my experience with customer service has not been great. Grailed defaults to Paypal for any issues, without providing any real useful assistance when things go wrong.","title":"Great platform, but lacks customer service","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"Rrrooolll","text":"The new interface is really subpar. Ie: how it automatically shows what’s “ trending” when looking thru certain sections. Also when you enter the site how it doesn’t just show items you have to select, which makes it confusing for new users. Please just bring back the old layout, sometimes less is more. Grailed has turned to such crap now trying to keep up with competitors which in turns is making them fall behind because they’re blending in. Please just make the website more simple\/user friendly.","title":"make grailed great again","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"Michael Long","text":"The scamming on Grailed is running rampant, I almost had a hoodie stolen from me since the buyer on grailed stole someone’s paypal account to buy. It would’ve been stolen from me if it weren’t for the victim randomly emailing my paypal address to tell me what happened.","title":"The scamming on Grailed is running…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"Billy Gatt","text":"for how much money you charge people for the middle man fee and everything else it’s bullrear that you people don’t check for authentications and make it so easy to crap someone over. imagine some kid saving up all his money to buy something just for someone middle aged loser who doesn’t give a crap about them or their money to sell me something way more used than they say or it’s fake","title":"no mediators","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"William Nalley","text":"Seller was a scammer who never shipped item and was never contacted by grailed support. Had to spend time escalating to a PayPal claim. Have had this same experience on grailed far too many times.","title":"Scammed again","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"ZAM","text":"Terrible web application. New design of application is also a nuisance. I now have to scroll through their sub-par articles to look for anything. I also have to submit a blank search to see my saved filters. This company is basically an online consignment startup with poor software development.","title":"Terrible web application","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"Michael ProHypeBeast","text":"For this transaction, bad. I made the offer, the buyer accepted it, and then when I went to pay it wouldn’t let me. I had the money in my PayPal account and the Grailed server kept giving me error messages. The next day someone else had purchased the item that I wanted. It’s funny that I got a review request for a failed transaction. These failed transactions happen a lot on Grailed. I wonder how many times a buyer has tried to pay for my item and this has happened \n\nAlso, if a buyer makes an offer and the seller accepts and then the buyer never pays, nothing happens. This wastes a lot of time and makes the selling community not like Grailed. We talk about it. Thanks","title":"For this transaction","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"Nick Dahmen","text":"Talks and DCO are not nearly as interesting as 1-2 years back and I have the feeling you’re not really catching up with fashion with its accelerating speed. Sounds hard but I am an active user since years and have advised it to many of my friends so wish your team all the best.","title":"Talks and DCO are not nearly as…","stars":3,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"nairb49","text":"Terrific platform, but constant bugs in the app. Unfortunately due to nature of resellers, and consumer base who look to resell goods such as Supreme, limited Nikes etc, can be very annoying to deal with \"wuts ur lowest brah?\", but not necessarily Grailed's fault, though they could encourage better communication between members. \n\nMost aggravating is their policy to be able to accept as many offers as you like as a seller, and make as many offers as you like as a buyer, but then to have no obligation to follow through on any accepted offers. Ends up being a significant waste of time, why is this a policy? Really not sure what the impetus behind this policy is, or what they are aiming to achieve? Sellers trying to wheedle more out of buyers by artificially creating bidding wars?\n\nAccepted offers should be binding, unless there is a good reason to back out. \n\nQuick search for items shows tons of users with statements like \"Do not make offers unless you are prepared to pay within 24h of your offer being accepted\" etc etc","title":"Terrific platform-But needs changes","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"Dan","text":"Single worst online purchasing experience of my life. Customer support told me there was something wrong with my paypal sending payment when it was the seller that wasnt linked correctly. Took two weeks to convince both the customer support and the seller to fix their issues. Then seller misstated the worth of the item on his shipping form and forced me to pay an extra $109.30 just to pick up the item","title":"Single worst online purchasing…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"Michael Sanders Jr","text":"Need to go back to the old grailed. The new updates are terrible!! (Coming from buyer\/seller)","title":"Need to go back to the old grailed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"Steven Yang","text":"i dont like your website becasue u guys removed my legit item","title":"i dont like u guys","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"David D.","text":"I am giving this one too many star already. Been a Grailed user since 2015, have sold and purchase over 100+ items. But when it comes to an issue with me being scammed, zero responds. But when they do responds, their attitude is above the world, thinks they're better than you. I have stopped listing my stuff on Grailed since then, left a sour taste in my mouth. I would much rather pay more seller\/buyer fee for StockX than to use Grailed another time.","title":"As bad as it gets","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"},{"date":"2019-08-20","author":"1wdqwdqwd","text":"The platform is pretty useless. Had better luck using competitors.","title":"The platform is pretty useless","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=28&stars=1&stars=2&stars=3"}]