[{"date":"2019-01-14","author":"Nick","text":"I sold an Item on my Grailed account and proof messages where the buyer left 5 stars and even messaged me saying the item arrived and he was very happy but left 3 stars even though i did nothing wrong i replied quick and the person was very happy with the item but left 3 stars and now I CANT SELL a single item. Dont sell on grailed.","title":"Fake review on my account","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-01-14","author":"Qnik Qsy","text":"Both website and app super slow, otherwise no tragedy.","title":"Both website and app super slow","stars":2,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-01-15","author":"Ryan Wolfe","text":"Worst customer service possible. Received falsified feedback on an item that I didn’t even end up selling to the person. Emailed them about 8 times, DM’d then on Twitter did all that I could but all i get is an automatic reply email. Very terrible don’t use grailed.","title":"Worst customer service possible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-01-18","author":"gang gang","text":"My account was banned for NO REASON!!! They calim it to be \"offensive behavior\" but i barely even text people on grailed!! This unfair espically to the ones that care alot about their listings!!","title":"My account was banned for NO REASON!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-02-03","author":"John Smith","text":"LOL! This company is literally a joke. Got banned for no reason literally. Sold few $1000 items and they thought it was suspicious even after tagging my photos.","title":"LOL!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-02-05","author":"Adam Johnson","text":"They ban accounts for no reason. Really grateful I don't depend on this as a job or depend on grailed as a server. Completely unprofessional service, customer service is ridiculous and mostly automated, you get banned for no reason while the OG admins of grailed can do whatever they want. Try to link your instagram to a post and see what happens. And then look at how the top sellers can promote their twitter, insta, venmo, etc. Fck grailed and fck the customer service. Sell your things on etsy where the service is good and you're not dealing with complete asshles.","title":"Fck Grailed...Use etsy, yoox, ssense, fcking anything else","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-02-05","author":"Josh holtzscheiter","text":"I was about to make a sale and then they decide to ban my account for no reason after i had tried for days to sell my items because i needed the money. If you put anything on your account that links to another site like instagram you are screwed. If they ever unban me i will try to sell my items and not use them again. I have also tried contacting help@grailed where do I find my case number? I have sent through the website and just through a standard email because I have had this issue before. also my account email is josh.holtzscheiter@ gmail.com i think","title":"I get banned for no reason","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-02-05","author":"DJ","text":"Wish I saw these reviews before wasting my time.  Grailed is terrible.  I listed 3 authentic items following all their guidelines and they removed all three.  I told them I can send them any verification they need to prove my items were legit.  They didn't respond...  just froze my account and banned me.\n\nNext day, I successfully sold all my sneakers on GOAT with zero problems.\n\nSTAY AWAY FROM GRAILED","title":"Don't Sell On Grailed.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-02-06","author":"Dade Store","text":"Grailed is horrible! I have been selling on this platform for years and i have sold 1000+ items keep 5 star positive FEEDBACK and also made them tons of money over the years, and they decided to banned my account for no reason and they couldn't even give me a reason nor did they respond to my emails, horrible customer support better yet no customer support!","title":"Grailed is horrible","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-02-07","author":"Brett Power","text":"I JUST GOT SCAMMED FROM A MCM BACKPACK THAT LITERALLY HAS HOLES ALL OVER THE ZIPPERS AND THE STRAPS ARE FALLING OFF. SELLER LIED ABOUT CONDITION AND IF I WEAR THE BACKPACK I FEEL AS IF IT WILL JUST FALL OFF BECAUSE IT WILL RIP. I'VE EMAILED GRAILED 5 TIMES AND OF COURSE THEY DO NOT REPLY. THERE'S PROBABLY LIKE 3 CUSTOMER SERVICE REPS IN THE WHOLE COMPANY. ONE OF THEM IS PROBABLY THE CEO, JOKE OF A COMPANY!","title":"I JUST GOT SCAMMED FROM A MCM BACKPACK…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-02-10","author":"David Nastynas","text":"i got scammed on this website! I tried to contact the site several times but I never had an answer!\nI do not recommend it!","title":"i got scammed and the website doesn't respond to my email","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-02-10","author":"Justin Cheng","text":"My messaging privileges were banned on grailed because someone offered me an out of grailed transaction and I denied it. YET BECAUSE I WAS RELATED TO HIM IN ANY WAY I GOT BANNED AND THEY STILL HAVEN'T APPEALED MY BAN AFTER 4 EMAILS AND 5 WEEKS","title":"GRAILED DOESN'T RESPOND TO EMAILS AND BANS","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-02-12","author":"Brennan Lewis","text":"I received a warning once from grailed for asking a seller to send me an invoice so I can actually purchase the item I want since the PayPal checkout on the app never works. I deleted and reinstalled the app numerous times so I could complete a second purchase trough the grailed app. Since the checkout button is still broken on the app the only way I could complete the transaction to receive my item was to ask the seller to send me an invoice to my email a second time. I’m now banned and it’s been weeks since I left a few emails wanting my van to be appealed and no reply still.","title":"Grailed doesn’t respond and the app doesn’t work","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-02-13","author":"jake kachinko","text":"I have over 10 transactions on grailed and several 5 star reviews on things I’ve sold. I logged into my account and noticed it was banned. I’ve sent emails about the issue and just want my account back. I love the platform but the customer service is lacking and just want to use one of my favorite apps.","title":"Trusted Seller Banned","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-02-16","author":"Manny Rosales","text":"I purchased an item which was listed in perfect condition which it was not.  The seller was well aware of this but listed it as a 10\/10.  I've reached out to Grailed twice now with no follow up.  Please do not use Grailed, as they will not be there to help you if things go wrong.  The seller was listed as: mollitia_nesciunt_hyperion(1).  It's been a few days and I now see another person claiming this same person sold them a fake item.  This listing was not posted when I was purchasing.  I'm sad to say Grailed promotes fraud because they do not help you in these cases, which means it will encourage others to take advantage of the system.","title":"Grailed promotes fraud!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-02-20","author":"Mark James Jr.","text":"GRAILED HAS NO PHONE NUMBER FOR A REASON! THEY DO NOT CARE ABOUT HELPING YOU. Grailed is a site that will respond to everything you say with email Grailed. com\/support. They will not check to see if anything is real or fake so the items you receive are not 100% authentic. THE SITE IS FLOODED WITH FAKES. Great news for the buyers is that Grailed automatically blocks anyone accused of selling a fake. Sad news is for a seller one person having buyers remorse and just wants his money back he can just say they were fake. The seller instantly banned and no guarantee from grailed that you get your product back. Great news for the buyer is if you always wanted a pair or turtle doves to flex on Instagram you can just buy them wear them for what you need then a month later still get your full refund and possibly get to keep the shoes. They have blocked me on Instagram because i left negative reviews in comments of there pictures. DO NOT DO BUSINESS WITH THIS SCAM COMPANY WITH NO PHONE NUMBER FOR CUSTOMERS OR SELLERS TO GET AHOLD OF.","title":"GRAILED HAS NO PHONE NUMBER FOR A…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-02-23","author":"N Y","text":"Emailed them 4 times aboute getting scammed and no response. And I don’t know what a case number is. My email is 22nyagnala@ gmail.com","title":"Emailed them 4 times aboute getting…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-02-27","author":"Diego Taggart","text":"I do like Grailed but I think it lacks costumer service and I do believe they need to work on how they proceed on violations against the rules because simply banning sellers for breaking a rule or are excused of breaking a rule which is most cases (I was banned for \"suspicious activity\" which makes no sense because there was no suspicious activity) is not how it should work. Most or all of these sellers are young unexperienced. They also don't give you an explanation of really why you got banned.  Stock X is the way to go.","title":"GRAILED LACKS EVERYTHING","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-03-06","author":"Steven Cartampa","text":"Probably the most horrific experience of my life with regards to doing business on the  internet. Grailed has absolutely no way of talking with someone. They tell you to email them but all you get is one response (via email- computer generated) per day type service. No actual person to ever have a normal conversation with. I do not reccomend this website for high end products or customers that want an interactive experience with qualified staff and owner's who care about the integrity of there business . If you have cheap stuff or are looking to buy possibly replica, fake  products than Gailed may be more suitable for you.\n\nThere seller was trying to sell me fake Balenciaga runners. After i realized that and confronted them(of course via email) they concluded the shoes where real... Except by the time they finally got back to me ( way over 24 hrs) i had already gathered enough evidence for a slam dunk case to prove that the shoes are a total knock off..not impressed by there \"staff of authentication specialist\" do yourself a favor, do business with businesses that have a phone numbers and people who you can talk to. If something goes wrong with your sale or purchase on Grailed, prepare to be disappointed.\n\n***UPDATE****\n\nI've emailed Grailed at least 10 times with more evidence and my case number... if there reply was anything other than lip service they'd know this.  Don't be fooled as the other reviewers have claimed, absolutely no actual substance behind there reply. Saving face that's it.  \nI am speaking with news channel 10 my local station regarding this transaction. They were very receptive to know more about the process and nuances of doing business with this company.\n\n***Second update... complete and utterly disgraceful service. Grailed's reply is a computer generated automated response. No substances no intention to actually help. Stay away from this site if you dont want to loose your money\n\n****UPDATE 3\/20\/2019\nStill no resolution, Grailed still has my money in limbo. Worst of all, i still haven't gotten any correspondence from Grailed. \n**DO YOUR RESEARCH BEFORE YOU PUT ANYTHING OF VALUE ON THIS WEBSITE***,","title":"Probably the most horrific experience…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"},{"date":"2019-03-08","author":"WesWestCuhh","text":"Grailed is terrible I recommend you stay far away.","title":"Grailed is terrible I recommend you…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=34&stars=1&stars=2&stars=3"}]