[{"date":"2020-06-08","author":"Igor “Lait”","text":"Thank you for unbanning my account, but what will not happen again? I did not violate more than one of your rules, and what you wrote is not true.\n\nYou wrote that I have several accounts, and that I duplicate my announcements, show me at least one of my advertisements that are repeated.\nI have only 1 account.\n\nI hope you will not ban my account for no reason.\nthanks again","title":"Thank you for unbanning my account","stars":3,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-06-09","author":"Never_Sold_Out","text":"Grailed blocked my account 4\nMy shoes are confirmed to be inauthentic by WHO? Let me contact this man. Or let me see what proofs of inauthecity he gave to you, please.\nIf my shoes were fake I would just create another account and continue to sell fake. But I didn't tho. I will text you until you unban me.\n\nI dont have negative feedbacks, only 5 stars. www.grailed .com\/Never_Sold_Out\/feedback","title":"Grailed blocked my account 5","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-06-10","author":"K1","text":"Hi,\nMy account @k1merchofficial has just been frozen for no apparent reason. I have not purchased or sold anything.\nPlease sort this ASAP!","title":"Frozen Account","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-06-10","author":"Zack Cox","text":"My username is zackacox\n\nGrailed has banned my account for no reason. They accused me of doing the purchase off the app but I was just asking for more pictures. I tried contacting support dozens of times and when I call it just tells me to view the website which is no help. I continued with trying to make another account and they banned that as well. I just want to purchase some stuff and I can’t even. Please unban my account Grailed","title":"Unfreeze my account !","stars":1,"location":"KY","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-06-10","author":"Daniel","text":"So i had to edit my original positive review of grailed because now that I've used them for much longer I can see many deficiencies in them. First, the positives. Once your item sells and you Input the tracking you get paid. Now for the negatives. Constant emails about lowering price on products! Maybe if you lower your selling fees than I could price my items better! Next, there authentication process. I was emailed and warned about selling a replica supreme tee. If I did it again I would be banned. Now I bought and have the same tee in different colours and sizes and knew they were all authentic! They were all listed on grailed with no issues! Knowing my item wasn't a replica i relisted the item on grailed. Guess what?! It was authenticated and deemed legit! Love that consistency right? I had to contact there customer service to take that strike off my account because i didnt want to be banned if this ever happened again. They asked for all this proof of this and that. I told them to look at my listing that was deemed counterfeit and the listing that was up on grailed. All the same pictures and deemed authentic!  After 10 exchanges they said I shouldnt have  negative mark on my account. Another annoying thing about grailed is when your messaging with a potential buyer you will get pop ups about warning you that selling off site doesnt protect you or you could get banned or something like that when the messaging you're having with a buyer or seller has nothing to do with that. Grailed should find a different was with informing there buyers or sellers rather threatening them with being banned. It doesnt make us feel good and makes them look even more foolish when they're wrong. Hopefully I dont get banned from there overly sensitive customer service team for this review.","title":"Updated review of grailed","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-06-10","author":"Trenten Ratchford","text":"Hello, I recently just sold an item and the dude I sold it too was harassing me (mind you same day of him purchasing the item) I then decided I didn’t wanna do business with him so I refunded him and I was going to put it up again and Grailed kept taking it down (assuming dude got mad that I refunded and kept reporting it was unauthentic or something ) so I just stopped trying to repost and I got the email super late explaining that they took it down do to it being “unauthentic” yet it was up on Grailed for a week and I sold it no problem because it was REAL and I had proof but I’m assuming the dude That was harassing me and I refunded reported it cause he was salty I didn’t wanna do business with him! But after the listing never would go back up and was taken down always and then I wake up the next morning and my account is frozen for “unauthentic items” when in fact it was REAL and I have proof which is shown in the listing but clearly no one actually checks anything at Grailed it seems they go off of lies or assumptions, they just assume, when I have over 100+ transactions and 75 5 ⭐️ reviews and not 1 bad thing nor have a been frozen\/banned before in these 3 years of having the app, I’ve done nothing and followed there crappy guidelines and regulations to then be accused and banned and I’ve had this account since 2017!!! I mind u, so yeah it makes no sense they just throwing out bans like Oprah and Ellen throwing out free gifts\/prizes for there audiences it’s crazy to me and think this freeze\/ban should be lifted, it’s ridiculous I know Grailed makes good money and should have better precautions and customer service for issues like this! know a good customer from a bad cause I’ve had the app sense 2017 over 100+ transactions and yet i get accused or reported by someone who is mad and I get banned for not wanting to be harassed and wanting to deal and do business with someone else! \n\nmy account is - trentenratchford","title":"Unfreeze account!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-06-11","author":"Adam","text":"I run a limited company in the UK and we primarily sell wrist watches to customers in the UK\/USA. We first heard about Grailed this year and after reading their terms of service, we signed up to sell on the platform. In all honesty, I was impressed with the platform however similar to others, our account was frozen for listing inauthentic items despite our items being genuine.\n\nWe have listed and sold these same items on multiple e-commerce platforms (Amazon, Bonanza, eBay) without being accused of listing inauthentic items.\n\nTo add to the confusion, we currently have active transactions on Grailed which we have not been able to access since our account was frozen.\n\nI proceeded to contact Grailed through email and their initial response states \"the account was frozen for listing counterfeit items.\" While I understand Grailed has to maintain a safe community for it's customers, they have blatantly disregarded the seller and failed to provide a clear explanation of which items were supposedly counterfeit.\n\nIn summary, if you are a seller:\n- Potential to be a good platform for selling men's fashion\n- It's very likely you will be accused of listing inauthentic items at some point.\n- Your account will likely be frozen.\n\n\nI will be sure to provide an update if our account is reinstated.\n\n\n**Update 1: \nThanks for the response. Our username is Timeford.\n\n\n**Update 2: \nI sent an email to Grailed as suggested and their response was... \"the items listed are counterfeit\". \n\nI have received the exact same response each time. \n\nI've raised a few questions in my messages to Grailed and none of them have been answered.  There's been no further explanation of the issue and it seems like our message is being ignored as we have seen this exact same response to other reviews on trust pilot.\n\nIf you decide to use this platform to sell, be prepared to have your account frozen for listing counterfeit items. It doesn't matter if your items are authentic as this doesn't seem to impact the decision made by Grailed. \n\nIf you're looking to sell on Grailed, save yourself the trouble and list your items on another platform.","title":"An honest review of our experience selling with Grailed.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-06-11","author":"Mrs Burton","text":"My account has been frozen with no explanation in the middle of a transaction...\nThis has made me look dishonourable to the seller who I have been messaging for the last 2 days. There is no contact number for 'Grailed'. There has been no response to my messages. \nThis is not the first time this has happened. I am a 65 year old Registered Nurse in the NHS. I have never acted dishonourably at any time.\nI feel I have been treated unfairly on this and previous occasions.","title":"No Rationale for Freezing Account....","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-06-12","author":"Experienced User","text":"Hello, grailed\nso you banned my account for apparently selling a fake item\nthen unbanned me because you realized you made a mistake\nbut buyer, who you told to open a paypal dipsute to get the money back, decided to follow up with the dispute even after all evidence of authenticity was proven.\nand now, paypal is saying that buyer should send over the bag back to me and get a full refund.\nfor a bag that was sold like half a year ago and shes been wearing it all that time until they decided to sell it and got banned since you called the item fake at first\nNow im stuck dealing with this dispute, will I get any help from you or Im all on my own against paypal now? \n\nsn: flexxxin\n\nps: really getting tired of this. neither grailed or paypal even work in my favor. alwyas have to go thru mad problems just to proove that Im right.","title":"Hello","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-06-21","author":"Khris Newman","text":"My account was frozen for no reason of anything it wasn’t me requesting another part site threw Grailed can y’all please unfreeze my account it should be no reason y’all did this I was just bout to make a sale @lucianno3657","title":"My account was frozen for no reason of…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-06-22","author":"Igor “Lait”","text":"I got a message in the mail\n\n\"Hello,\n\nYour Grailed account has been frozen for violating our Terms of Service. Specifically, your account was frozen for not shipping items you sold. At Grailed, we value the safety of our community and activity like yours will result in an account freeze.\n\nWe always perform a thorough investigation before deciding to freeze an account. However, we understand that misunderstandings can happen. You can request more information and appeal our decision by emailing appeal grailed com\n\n\nletters are not sent to the specified mail (appeal grailed com)\n\n\nTo all my sold things have been sent and track numbers have been added everywhere. so why banned me?\n\n5th time ban just like that. \nit's some kind of circus\n\nmy nick name lait88\n\n\n\nyou wrote to me that you removed the connection because of which they are blocking my account for the umpteenth time ...","title":"I got a message in the mail","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-06-25","author":"Ezra Domingo","text":"Hi grailed, my username on the app is Vaultlab, I’ve been a loyal buyer\/seller on grailed since 2018, I have done over 200 plus successful transactions and kept a five star rating. I woke up yesterday and purchased two rick owen shoes for the price of 980 USD , I then told my buyer my phone number after I purchased the item for tracked shipping, few seconds after boom, my account is frozen... a few days later I get an email saying ..... (Hi,\n\nYour Grailed account has been frozen for repeated attempts to engage in offsite activity. Your account was previously reinstated on the grounds that this does not happen again and you have continued to attempt to engage in offsite activities. Unfortunately, we can no longer reinstate your account.) ...... \n\nWe can no longer reinstate my account but I have done nothing wrong..... you can even contact the seller and he would say the same. I just purchased something for 980 USD and gave grailed business , it’s ridiculous that you freeze my account for trying to do offsite activity. This is a mistake, please take a look again, my username is Vaultlab.","title":"Hi grailed","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-06-27","author":"Jonah Lamoureux","text":"Grailed account: YEGDesigner\n\nMy account was recently frozen for posting two inauthentic Off-White hoodies. I had no idea they were inauthentic I tried to explain this to Grailed but they didn’t seem to care that I made a mistake. I have over 140 transactions and a 4.9\/5 stars on 56 reviews. The only negative review I had is because I accidentally sent someone the wrong size once. Am I really banned forever because I made a mistake?!! I guess I will have to move over to eBay and Depop if this doesn’t get sorted.","title":"FROZEN ACCOUNT","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-06-27","author":"Dr Jacob Goldstein","text":"Grailed is run by incompetent amateurs. \n\nI get emails telling me my listings have been removed because my items are inauthentic. \n\nWhat's the joke?\n\nThe joke is I don't have anything for sale on Grailed, so there's nothing for them to remove.\n\nIs it any wonder Grailed gets a 50% negative review rating on Trustpilot ?\n\nNB: Just seen the nonsense response from Grailed saying perhaps someone else used my account without my knowledge. No, they have not. They are talking utter baloney. It's just typical amateur Grailed staff incompetence.","title":"Grailed is run by incompetent amateurs","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-06-28","author":"Ingrid","text":"Bought an item off Grailed almost 3 weeks ago now. Still got no tracking info and the seller isn't replying. I emailed grailed and all I get is auto-responses. They told me that if those are not helpful then I should reply to the emails and an agent will come help. 6 days after I replied and still no agent. It is 2 days until my item will not be protected by grailed anymore apparently and I got no help whatsoever. The seller is also putting new items up for sale but not replying to my messages so he is clearly ignoring me. Both grailed and the seller are ignoring me. Will never buy again from Grailed and I really don't reccomend it, full of incompetents.\n\nSeller is called: demnbish465","title":"Full of scammers and rubbish support team","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-06-28","author":"Davin Zhang","text":"I’ve sold many of the same pair of shoes on grailed using similar pictures and I keep taking new ones for their standards. But they keep removing my listings for no reason. I have great feedback from almost all my listings. This is so ridiculous.","title":"I’ve sold many of the same pair of…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-06-30","author":"Riicardi","text":"I'm writing about an item I sold a month ago the buyer left me five star review was very grateful for the item but a month later he says that he wasn't home to receive the package and that is going to be sent back to me I can either refund him or send them back what should I do and is this some kind of scam that I don't know about can you please look into this before I receive the item I don't do returns or refunds but I can send them back but the fact that I'm going to have to pay for shipping again I don't know if this is a scam please help","title":"A month later buyer says the item is being returned!?","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-07-10","author":"Muhammad Danial","text":"My account was recently frozen for posting. I have listed some invalid items because I was cheated by someone selling items from Japan. but there are also my items that I found original have been deleted by heroine and grailed for example Prada bag that I sell is original has serial number and uses zip ykk, a nike tshirt with tag and washtag on the side is original bought in nike boutique also has deleted by grailed too many items I uploaded digrailed most are not accepted and are said to be not genuine even though I bought them at a boutique. This should be taken seriously for the innocent seller in the freezing of his declaration, I request you to review first before making a decision. About any item grailed deleted I also did not know that the item is invalid inauthentic were inauthentic I tried to explain this to Grailed but they didn’t seem to care that I made a mistake. I have over 10 transactions and a 5\/5stars and 4 reviews I realize I just sold in grailed and should not be frozen forever, you should give me a chance to learn about luxury items, every human being does not run away from making mistakes.. The only negative review I had is because I accidentally sent someone the wrong size once. Am I really banned forever because I made a mistake?!! I guess I will have to move over to eBay and Depop if this doesn’t get sorted. I am not happy because you deleted and froze my account with valid items.That’s all,i hope you can give me chances for selling at grailed,please replay my comment and thanks you so much\n\nMy username: HYPExVINTAGE","title":"My account was recently frozen for …","stars":1,"location":"MY","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-07-11","author":"Gnargoyle","text":"EDIT: Grailed, as I stated in this review, at checkout it says \"All purchases made through a PayPal account are eligible for PayPal Protection. Guest Checkout purchases are not protected by PayPal.\" There is no mention of Grailed's own 100% money-back guarantee in that disclaimer.\n\nPaypal is not Grailed. You are not Paypal. Paypal's policy is not reflective of your own policy that you advertise on your site.\n\nAt the very least, since you won't assist in getting my money back as promised by the copy on your website, you should change that text to be clear for other customers so this doesn't happen to them. I'm not sure why you wouldn't do that unless you're actively trying to mislead people about your policy.\n\nI've had a really good experience for years on your website otherwise, which is why this is so frustrating and disappointing.\n\n--------\n\nI ordered something over a month ago that never arrived, and tracking stopped at the end of May, so I have to assume the package is lost. I - apparently - used PayPal guest checkout when I purchased because I can't find the transaction on my Paypal account (which I find odd since I'm permanently signed in, and I do have the receipt with the transaction ID).\n\nJordan at Grailed customer service is telling me it's not covered because I used guest checkout, and I have pointed out that the website advertises:\n\n\"Every purchase on Grailed is protected by our 100% money-back guarantee.\"\n\nAnd that: \"Orders that never arrive, inauthentic items, and items not as described will be refunded—your satisfaction, guaranteed.\"\n\nAnd that: \"Every transaction on Grailed is covered by PayPal Purchase Protection.\"\n\nWith NO mention of guest checkout on their main trust page or on the money-back-guarantee page in the FAQ. \n\nI would have had to go to the help section, then that separate FAQ section hidden below there, to find the phrase \"Guest Checkout purchases are not eligible for purchase protection,\" but even that implies it's Paypal's policy and not Grailed’s.\n\nAnd in the checkout process, it also only says that guest purchases are not covered by Paypal, with no mention of Grailed. I’m out $350, and if they don’t return my money I’m going to send screenshots of their false advertising and my communication with them to the Better Business Bureau, but I’m sure they’ll just delete my account or something.","title":"Grailed won’t honor their money back guarantee","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"},{"date":"2020-07-11","author":"Davin Zhang","text":"My account got frozen because Sam from grailed said I was selling fake Dior shoes on my account. But if you actually know the shoes - B23 high tops. You would know all my products are authentic. All my reviews but 1 are 5 stars with great comments! I have always respected your site and my listings for sold shoes were all authenticated by grailed and there was no issue. But recently there seems to be so much issues with my listings because even when they get approved, they get taken down again by someone else? And now today they froze my account because they said my sold listings which have been sold and left very good reviews has flaws in them?? Claiming that the products are unauthentic? You think I can sell 10 people the same product and none of them realize it’s fake? Of course not.. because all my items are authentic. Please help me fix this issue. I have done nothing wrong and it’s honestly super frustrating! Account name is Obbyplug","title":"Frozen account for no reason","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=14&stars=1&stars=2&stars=3"}]