[{"date":"2021-11-10","author":"LovesickStoner RIP JUICEWRLD","text":"Customer service is TERRIBLE. I went to call the customer service line and they said just to go to the website and then they hung up. A pre recorded message. No actual people. It’s bs. My money’s been on hold for so long and the item was already delivered","title":"Customer service is TERRIBLE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2021-11-13","author":"Игорь Прокопенко","text":"There is no answer to the mail for 2 weeks.\nModerators are so stupid that they cannot determine the originality of a thing. Removed the original item when half of the items on their website are fake","title":"There is no answer to the mail for 2…","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2021-11-15","author":"Methadone Doll","text":"Got banned for no reason after I tried to list an item for sale. Support doesn’t reply. My nickname is WillyDoll","title":"Got banned for no reason after I tried…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2021-12-05","author":"Kristijan Kofelenz","text":"So, my account got banned because they say that my Jacket is replica... Its checked on other site and they say that is original + there is QR CODE on jacket that i scanned and it redirected me on original site and says that its original.. I contacted them they said that they cannot unban me...","title":"So i got banned.","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2021-12-05","author":"C AMG Sedan","text":"Nice job grailed!!! \n\nMy account was blocked, because i‘am selling „replica“ stuff 😂 \n\nWell i have the receipt and the order number, so entblock my account!!\n\nYour team is just unprofessional!!!\n\nCheck the stuff correctly before you freeze a account who isn‘t selling fake stuff! \n\nThats just a joke!","title":"Frozen account for selling real stuff!!","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2021-12-07","author":"Sh8y 96","text":"Grailed banned my account after I made a sale and they are still holding on to my money. Nobody from Grailed has responded to my emails…this was back in November. What  garbage company.","title":"Grailed banned my account after I made…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2021-12-08","author":"Chris","text":"Hi my name is Chris and Grailed helped me lose over $200 this holiday season. Hooray! Grailed is 50\/50. You either get somebody honest who will send you what you paid for, or you will get a scammer. Some scammers have made it far in grailed because people do not know how to tell whether their item is authentic or not. Long story short, i received a fake from Grailed and they are not helping me with this purchase at all. They rely on a flawed photo authenticator to prove whether or not your item is real. Maybe you can fool some people, but for those of us who really know the truth, you know having a fake is blasphemy. I would rather die than wear a fake and because of Grailed i might be forced to wear a fake Vlone shirt i recently purchased from this garbage site. I might have to wear this fake Vlone shirt to take out the trash or go workout in the gym because Grailed \"buyer protection\" does not protect anybody at all. Good luck if you get scammed. The people who rated this site poorly did so for a reason. And im here to vouch for that reason. Dont waste your time here because once **it hits the fan there is nobody there to help clean it up. Hopefully you arent looking at this review after you made a bad purchase because im here to tell you that only luck is going to help at this point.","title":"Im in the red now","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2021-12-11","author":"Сергей Данилов","text":"My account was blocked for a strange reason. I made a sale of the bag, agreed with the buyer that I would send the goods the next day, and two hours later I received an email message that my account was blocked because I made the sale, but did not add information about the shipment. It's been 2 hours! The company contradicts itself because when selling, I received a letter that I have 7 days to ship the goods. This is very strange and inexplicable behavior. For the first time, I see that they gave only 2 hours to send the goods. Support is not responding to the message. nobelm account","title":"My account is frozen!","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2021-12-13","author":"RagsTillRiches","text":"Trying to sell my AUTHENTIC gucci hoodie from gucci.com with email confirmation and reciepts and they think its fake. How it doesnt make any sense. This is my first time trying to sell on grailed so im not too sure if that has anything to do with it. I hate fakes so much so would never dare to sell a fake product","title":"Trying to sell my AUTHENTIC gucci…","stars":1,"location":"NZ","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2021-12-17","author":"Jay Nattapon","text":"Terrible customer service. Can’t solve the problem. eBay is better.","title":"Terrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2021-12-31","author":"Andrew Tachiera","text":"Kevin, customer support at Grailed, refuses to offer me any recourse for a purchase made where the item differed from the post and description.\n\n Grailed is allowing incorrect posts to be listed until the item is bought. Then it appears no recourse is offered because they hide behind the \"significantly differs\" language in your purchase guarantee policy.\n\nIt is shady and sneaky to allow for sellers to sell items under incorrect descriptions, titles, filter, etc. \n\nI plan to never use Grailed, as I know I cannot trust what I am buying and know I will receive no help from the company or customer support either.","title":"Andrew","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-01-06","author":"barb","text":"after buying a new season balenciaga bag it got to me damaged and was an obvious fake. grailed took over a week to authenticate only to tell me i have to enter a 30 day case with paypal now. grailed said the bag was fake and froze the sellers account. now i’m out so much $$$ for a rip off.","title":"fake balenciaga bag and no resolution.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-01-12","author":"earl zuri","text":"I was recently banned on site for \"violating their policy \"fraduant activity\". I been a member of this platform since 2015 and handle 2 accounts. \n\nwhat exactly did I do that was fraudulent. There was no explanation. I only sell verified authentic items, all my buyers were happy, I got great reviews, I was respectful. I did absolutely nothing wrong and I got banned. This has to be a mistake...","title":"I was recently banned on site for…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-01-15","author":"Alexandre","text":"Insane fees for seller","title":"Insane fees for seller","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-01-21","author":"Natallia","text":"I've been using Grailed on and off to browse through listings without having done anything else (to my knowledge).\n\nAfter not using the app for a while I decided to reinstall it and unfortunately had to encounter that my account got frozen, because I allegedly violated their code of conduct.\n\nI tried contacting them through their contact form, which wasn't and still isn't working. As well as through 2 different emails to which I haven't received a response to this date (at least half a year ago). – I eventually gave up.\n\nNow I tried again through their Twitter support, which to my surprise replied and simply explained that I took part in fraudulent activity without giving me an exact case.\n\nIn conclusion: My account and therefore also my PayPal has been banned without me even knowing what I did wrong.","title":"Support non-existent: Account frozen for no reason","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-02-02","author":"Mr.igla","text":"I don't usually do this kind of review, but here's the thing,\n\nabout a week ago all my Boundages disappeared for no reason (trusted seller and fast answer) \nI tried to talk to the Grailed team to solve this problem and I did not receive any adequate answer, an answer from EMILY that she sent the information to the Site Operator, and two other different requests were generally ignored.\n\nwe are a seller for over 3 years on the platform with ± 380 feedback 5.0 and ± 775 sales.\n\nSad to see such an approach to the sellers on the platform!","title":"My boundages disappeared for no reason.","stars":2,"location":"MD","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-02-03","author":"Trung vu","text":"That very bad web , be carifull you  guy , ... they took your money ... but I believe the karma , all family that people they will get karma , they pay more and more then they took , they took us money then they get sick , , their family have a trouble , their life go down and down , ... do good thing and good thing come to you ! Karma","title":"That very bad web","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-02-04","author":"grailedsell","text":"Over time, the service has become good. But a couple of years ago my account was blocked for NO REASON! I ask the administration of the marketplace to check my account and make sure that I did not violate any policy and had no problems with sales. I wrote to the support mail after the freeze, but I did not receive any answers. After a while, I would like to use your marketplace again. I don't want to create new account. Thank you\n\nMy account on Grailed : trekov","title":"Account was blocked","stars":2,"location":"BY","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-02-13","author":"RoyWasTaken","text":"Never received my item. Money gone","title":"Never received my item","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"},{"date":"2022-02-16","author":"Kish S","text":"Hope you are doing well! For some reason my account has been frozen, it states some of the items listed is inauthentic. I got these items as a gift and it was supposedly purchased from a retail store. I would have not listed something if it was inauthentic, as you can see I am a loyal grailed user and have always followed the guidelines. I really need my account back as I have purchased things that I need tracking number for. Can you please reinstate my account, I did not know the items listed were inauthentic. Sorry. I got these items as a gift for my birthday and the person who bought it told me it was purchased from a retail store, I didn't know it was inauthentic, thats why I was confused when grailed sent email because I thought it was authentic. I love being on Grailed its my favourite clothing platform! I would never want to sell inauthentic items to buyers as that is incorrect behaviour. I myself  always scan through grailed and report inauthentic items so others dont get scammed. Please understand my situation, I would never want to list something that I knew was inauthentic. I truly appreciate you letting me know and creating awareness that the rhude tee item is inauthentic. I can guarntee this never happens again! If I am unaware of somethings authencity I will email you guys before listing so this way I will know forsure. I really need my account unfrozen as I have purchased hundreds of dollars worth of items and without my account, I will not know if they are shipped\/delivered as the tracking info is all on grailed. Please help me out, I am truly sorry this happened, and never will happen again! This platform means a lot to me, i hope you understand.","title":"Account Frozen Kingkesh","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=2&stars=1&stars=2&stars=3"}]