[{"date":"2017-01-18","author":"Alice","text":"I opened an account to sell a Supreme t-shirt I had for sale. At first everything was fine, but within an hour it was taken down for the reason of being ''fake.'' I emailed customer services, asked why they thought this. It was an ''error'' made by the computer. Fair enough - so I put it back on for sale the next day. Within a couple of hours AGAIN, the t-shirt had been removed. Again, I emailed them explaining the situation. They then decided to tell me they thought it wasn't legit due to ''insufficient'' pictures. 3rd time, I make sure I post clear pictures of everything: stitching, labelling, you name it. Removed again. Very frustrated as I thought it would be perfect for selling on such a highly sought after item of clothing. I'll stick with eBay and Depop next time...","title":"Confusing site to use...","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=37&stars=1&stars=2&stars=3"},{"date":"2017-03-06","author":"Hayden Hladysh","text":"i was a regular grailed user for like 4 months bought and sold like 15 items and i got banned for a stupid confusion between me and this guy, we were fine after and thats when i got banned, tried to get it back and they wont answer my emails, made another account under my dads name and i can no longer sign into it because theres no verification, but when you verify it it says its already verified.","title":"bad customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=37&stars=1&stars=2&stars=3"},{"date":"2017-04-27","author":"Rob Palmer","text":"Grailed knowingly and deliberately defamed me by libel and cost me a large amount of money then ignored my requests for service for weeks and denied and accountability.  Atrocious and frustrating customer service.  Self righteous and arrogant and steadfast in all the wrong ways.  Ises beware-you will be disappointed.","title":"Grailed and their criminal ways...","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=37&stars=1&stars=2&stars=3"},{"date":"2017-05-08","author":"dat guy","text":"Bought a item of grailed, seller corresponded well for a day, after that I was ignored and my item never got shipped. Very dissapointed as it was an expensive purchase. Frustrated and dissapointed.","title":"Scammed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=37&stars=1&stars=2&stars=3"},{"date":"2017-09-19","author":"K","text":"I've used grailed for over a year and their customer service is non existent. They never ban users who break rules or remove fake or joke listings. They won't even reply to questions. They removed one of my listings because \"my paypal wasn't verified\" in spite of the fact I'd been using it for 2 years and it was verified. You might as well just use ebay.","title":"Not worth using","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=37&stars=1&stars=2&stars=3"}]