[{"date":"2018-09-10","author":"Ludwig von Der groen","text":"Extremely poor customer service for what you pay in fees, very disappointed if you have any issues with chargebacks or fake items you will be redirected to PayPal even though they claim they have a special Grailed protection which is just a pile of bs, all they did is tell me to send PayPal my tracking details.","title":"Extremely poor customer service for…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-09-11","author":"Chun On Au","text":"Grailed just banned my account with no reason, their customer service are very bad and mean. Never selling in Grailed again, there is no protection for the Seller!!! They can ban you for nothing if they want!!\n\nI am selling over $3000 dollars things in Grailed, paid the 10% transaction fee and get a frozen account for no reason! Never use Grailed again!","title":"Grailed just banned my account with no…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-09-14","author":"Imjustbait","text":"Customer service is honestly terrible. They reply very late and do not answer the question at hand. They ban accounts for no reason while the admins can get away with anything.","title":"Customer service is honestly terrible","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-09-15","author":"Alan Suski","text":"Absolutely horrible admin team, my account was banned for using a bad word even though i had over 200 sales that were 100% satisfactory. The admin team bans without notice and they do not care. Terrible service to sell clothes on. Use BUMP instead, its alot easier once you get the feel for it. I have been scammed about 15 times on grailed yet they did nothing to stop that, while i use a bad word as a joke, they cant even furnish proof of where i used it or how, and i get banned. The website is a joke, they post pictures of clowns wearing overpriced homeless people clothes yet fail to help the sellers when they need it. get it together.","title":"TERRIBLE CUSTOMER SERIVCE","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-10-02","author":"Reagan","text":"Since the beginning of September 2018, grailed banished more and more account without reason ! Grailed and Paypal are professional scammers !","title":"SCAM WEBSITE","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-10-05","author":"Flint","text":"Just got banned during checking out to purchase a hat :)))). I had 10+ positive reviews, all of which being 5 stars. FVCK GRAILED","title":"FVCK GRAILED","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-10-06","author":"cha cha","text":"I bought a pair of trousers that were falsely advertised as far as the measurements on Grailed. When i explained this to customer service their suggestion was to repost the pants and re-sell them on their site. Such helpful advice. It’s called customer service, not customer disservice! But they’re is nothing that keeps their service team accountable, there isn’t even a phone number you can call to speak to someone directly. Oh and the “person” who sold the pants his username is ericjscott. Buyer beware! He admitted to falsely advertising the pants 4 pant sizes bigger than they actually are, and what does Grailed do??? Literally nothing.","title":"Grailed has the worst customer service.","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-10-30","author":"Ano","text":"When everything goes according to the plan, it's a great platform to acquire cool pieces of clothing. However, when something goes wrong - don't expect much. The customer support can't handle anything and they'll just ignore you, if they can't find a solution beneficial to them.  Like seriously they'll just stop answering your emails, plain silence.\n\nI lost a lot of money, but thankfully I lost it while making a purchase that was only several hundreds of dollars. Now I know that this service can't be trusted and I won't be using it anymore. Had I been buying some actual grail worth thousands and something had gone wrong, I would've lost all of my money.","title":"When everything goes according to the…","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-11-01","author":"W","text":"Grailed has horrible customer service. \nAs a seller, I had 2 items flagged as inauthentic and when I attempted to appeal, they ignored me after I submitted evidence. Even now, I have an open service ticket which is actively being ignored. I sent a message on Twitter and it's still being ignored.\n\nEdit : Replying to Grailed : I have already tried posting on reddit. My post was deleted. I sent a reddit PM. Never got a response.\n\nDon't claim \"you're trying to respond in 24 hours\" when its been 2 weeks since the incident.","title":"Grailed has horrible customer service","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-11-06","author":"JackH","text":"Other than a cool font\/nice page Grailed is just a haven for scammers.  You can literally post anything and leave it up forever.  No rules or accountability.  I just bought an item and the seller ghosted.  I got a message from Grailed support saying they will email the scammer.  Uh...that’s it?   Then they close the scammer’s account and I have to deal with PayPal and pray I get my money back.  Never again.  Use eBay or The Real Reall, where there are  rules, guarantees and professional buyer support.  **Update** Grailed put this sugar sweet response on my review to try and save face.  I contacted them and their response was that it was PayPal's problem now.  Grailed DOES NOT have any buyer protection plan.  They are liars.  DO NOT be fooled by these crooks.","title":"Crooked Liars","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-11-10","author":"Tanase Celino","text":"Other than a cool font\/nice page Grailed is just a haven for scammers. You can literally post anything and leave it up forever. No rules or accountability. I just bought an item and the seller ghosted. I got a message from Grailed support saying they will email the scammer. Uh...that’s it? Then they close the scammer’s account and I have to deal with PayPal and pray I get my money back. Never again. Use eBay or The Real Reall, where there are rules, guarantees and professional buyer support. **Update** Grailed put this sugar sweet response on my review to try and save face. I contacted them and their response was that it was PayPal's problem now. Grailed DOES NOT have any buyer protection plan. They are liars. DO NOT be fooled by these crooks.","title":"Other than a cool font\/nice page…","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-11-12","author":"Steven Crosato","text":"I'm really astonished those very bad scores on Trustpilot about Grailed. In my opinion, yes the experience wasn't so good. After waiting days and days for customer care solves some issues, I've decided to delete my items for sell....then I will post again, but I don't trust so much at all. I'm sorry and I can understand Grailed still a small company with few employees maybe, but as its fee is a 6% on every item sold, I would really appreciate a better service.","title":"I'm really astonished those very bad…","stars":2,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-11-17","author":"Eldar Kabiri","text":"Hi, I have been selling on grailed around an year now, i am a professional seller using plenty of platforms like eBay, alibaba, amazon, videdressing, postmark etc. grailed is one of the worst experience i had so far... I have been scammed there over 3 times so far, people are rude and very impolite, they makings offers but never proceed with actual buying, Cheaters and crooks. Nevertheless my last experience being crooked on this platform was case where i sold the pants by Dolce&Gabbana the client described it as it doesn't much to description got full refund from PayPal and stayed with an item. Unbelievable of course i tried to contact the support team of grailed many times however over 6 months i am still waiting for an answer... thank you the best team ever!","title":"The worst experience ever","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-11-22","author":"igorshkau","text":"Got banned during checking out to purchase. Didn’t explain and no reasons.. Didn’t  receive email about it. Banned ip and I can't write to seller, no information about shipping of bought items some hours ago.. Real fascism!","title":"Really worst experience ever","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-11-26","author":"Javid F","text":"Buyer Protection is an absolute scam. Provides no benefit above and beyond standard PayPal protection, not sure how they can claim that this is Grailed protection at all?\n\nPurchasesd a jacket which was identified as counterfeit by Grailed after I brought it to their attention. Sent the item back to the seller as per PayPal rules, however PayPal failed to provide a refund, and Grailed failed to provide any mediation, support, or service regarding the matter - simply referred to PayPal claims. After Grailed wiped their hands of the issue my following emails have been totally ignored. \n\nBetter off paying retail. Over $400 out of pocket for absolutely nothing.","title":"Buyer Protection is an absolute scam","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-12-08","author":"Mary Lynne Rainey","text":"Grailed is a scam.  My son bought a $130 sweatshirt and it never got delivered.  The customer service wont give us a tracking number and there is no resolution.  A total scam - I will be broadcasting it.","title":"Grailed is a scam","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-12-15","author":"Mikey Tommy","text":"I wish I can give this website less than 1 star. Emailed grailed 3 times with no response. I’m currently getting scammed by a seller. Does grailed care, no! $460 down the drain. Never buy from this website!","title":"Grailed is a scam!!!!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2018-12-21","author":"Ro","text":"I just got banned and Grailed has a system where they message ALL your buyers that your items are fake without giving you time to dispute. I just lost £2700 in one day.\n\nDo not sell on this website. I had receipts on my listings. I am trying to contact their email however, they don't reply.\n\nYou can't even call them. \n\nI am currently sick and dying from anorexia and now I have to deal with this while in hospital.\n\nI have contacted the appeal email and their help email.\n\nDisneykilledrocknroll is my username.\nin reference to Case #317198","title":"I just got banned and Grailed has a…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2019-01-01","author":"BOB","text":"Grailed is the absolute worst, most unprofessional and outright horrid platform I have ever sold on. I am such a reputable instagram seller but Grailed doesn't give a damn! a buyer didn't want his item so he claims its fake hours after purchase; without even a question I am instantly banned I appeal to this stupid ban no reply after 1 week of writing to every email I can find. I even messaged there instagram where I got my first reply \"support is looking in to it\" Great absolutely horse ****! support doesn't read a ******* word, now an hour later support replies \"we can't unban you your items are fake\". Do not sell here. Horrible scamming dirty business.","title":"Grailed is Disgusting on Terrible","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"},{"date":"2019-01-07","author":"Steven Crosato","text":"Second evaluation: totally bad, bad and bad again. The website doesn't work, from Firefox since 3 days. From the app, seems work, BUT, I cannot find my items for sale, they seem totally disappears.\nFurthermore, I would accept an offer from a customer, BUT I cannot see my items, neither my message. \nFrom the app I cannot also contact the customer care.\nI've contacted them through an old email, but totally no answer at the moment.\nI feel disgustated from Grailed, is a wasting time marketplace, for my opinion. \nMy experience is very very very bad. \n\nI'm astonished how those kind of company survives. At least they should say \"sorry\" to me, really. (as I do with my customer if I do something wrong).","title":"Second evaluation","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=35&stars=1&stars=2&stars=3"}]