[{"date":"2019-07-18","author":"Dreadnought","text":"Grailed offers no protection to the sellers, nothing whatsoever. It relies heavily on PayPal for any type of protection (and PayPal is horrible at it). I had a crazy buyer who reported “item not received” on PayPal while the package was in transit to his address, and accused me of generating a false shipping label to avoid him. I, as the seller, was completely unable to report his negative review or inappropriate behavior regarding the transaction. I will be deleting all my listings on Grailed tomorrow. The sooner people realize Grailed is a toxic platform, the better it is for everyone.","title":"Grailed offers no protection to the…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-07-19","author":"tom","text":"So, my account was frozen for a deleted listing which hypothetically it was a counterfeit item. Although lots of other sellers sell the same thing without being banned and they banned me for this listing which they alreay have deleted for a month already?! \nAlso I did not know that this item was fake in first place since it was a damn gift!!\nMy account has 50+ transactions 5\/5 feedback and I have it for over two years now!\nI tried to contact them but they will not even try to discuss my issue.\nThey don't give me another chance other than to give this bad review and to go to another platform!\nThey treated me so badly for being already an effective user for two years now!!\n\nYour team must be revaluated this is unacceptable!\n\nTicket ID: 77170","title":"Grailed froze my account for a deleted list?!","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-07-19","author":"Matt","text":"Absolutely terrible customer service for sellers.\nAn item I sold was claimed to be fake by a buyer and grailed froze my account, claiming they would unfreeze my account. I had no problem with this and after some problems with paypal I refunded the entire transaction. Now they have gone over a week without contacting me at all, I've even brought this up on their subreddit AND THEY REMOVED MY POST!!! What they hell is the problem with this staff? They charge sellers 10% of each of their transactions and they do NOTHING to help or protect them, in fact they seem like they actively want to f*#k me over for some reason when i've done nothing but make them money. I was promised in cold hard text that if I refunded I would be unfrozen and I did just that, there's no justifying not unfreezing me.\n\nMy ticket ID is 71545.\nIf it don't get a response here I'll keep posting, I know people on discord.\n\nResponse to grailed teams reply: Those items were reported but never sold, I took them down and NEVER SOLD THEM. I even supplied the grailed team with PROOF that I bought these items thinking they were real. And then you mention other fraudulent items, what other fraudulent items?? All of my listings were legitimate, they didn't even have fakes as far as I know.","title":"Staff hates sellers","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-07-21","author":"Kj Ward","text":"I was basically banned for asking for another users pay pal because every time I hit tried to buy through Grailed a message popped up telling me “Sorry, we can’t complete your purchase at this time Please return to the merchant.” So then I took it upon myself that it would be best to buy the shoes through regular pay pal and then y’all banned me with no warning or nothing. I believed this message was due to me getting scamed a couple of days prior to that.Then it took 3 whole days for y’all to respond and tell me y’all reinstated my account and that it was my finally warning . When I try to access my account it still says I’m banned! So one thing I know that’s for sure is that I’m telling everyone I know to stay tf away from Grailed! Y’alls whole setup is complete crap!\n\nUsername: kpopi2","title":"Banned for no reason","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-07-23","author":"Alex","text":"My Grailed user name, ikea_photo_shoot \nEmail: alexpolitis2011(At)gmail.com\nIt appears as tho my account has been banned because a seller reported me for not send an item back. In this case, the buyer sent me an item that was significantly not  as described. I filed a claim with PayPal and due to the months of the sellers unresponsiveness, the case was won in my favor. PayPal gave me the refund and stated that \"I didn't have to take any further action\".  Grailed or Paypal NEVER told me to return the item nor did I recive a return lable or return adress. Shame on whoever banned my account without looking into the case. I have a perfect 5 star feedback rating have paid a crap load of 10% fees just to be banned. I have never done anything that goes against the graild terms of service. I have tried emailing the dispute email adress many times with no reply.","title":"Banned me because a seller told them to.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-07-23","author":"Austin Rossi","text":"I have completed nearly 20 transactions to this point using platform and am frustrated to see that my account has been frozen with 0 room to provide more info. I have extremely positive feedback from all parties on all past transactions.\n\nWhile Grailed has refused to provide me even a hint of info (after following up with an appeal, to which they essentially replied \"Your account is frozen due to inauthentic items\", again without further context) I am assuming it is involving my recent sale of Yeezy Pirate Black 350s. I would like to note that I have a receipt from Adidas and purchased these on release from Adidas themselves. I am happy to pull up the receipt and bank statements or any further information that can further verify this sale. I have the feeling that this buyer is attempting to scam me out of the sneakers as I noticed during sale that he had 0 feedback and a freshly created account.\n\nPayPal has requested for the buyer to simply return the shoes but I fear he will ship back a pair of fakes. I have been put in a difficult position because Grailed failed to take into account any context around the situation because the buyer sent a message simply saying \"shoes were fake\" with 0 additional info.\n\nCase ID: 79501\n\nEdit: Thank you Grailed team for getting back to me, but again I am being told these are \"clearly fakes\" when I literally bought them from Adidas upon release and provided the original purchase receipt *facepalm*","title":"Frustrated Grailed User of 3+ Years","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-07-23","author":"Zully","text":"My son got a pair of pants sent to him which were not as described at all. They were sent at the end of May and were so badly stiched and put together, that maybe they come from a 2nd hand bargain Cheapest place. They also had a whole in the back (by the belt). He paid $ 75 of his hard earned money as a teen. The Support from Grailed was allegedly escalated last July 15th with NO response from Paypal as he was instructed to do. We are in Canada and he has so far lost on the shipping expense as well  since no feedback response has come. I took to helping him as I want this matter .\nresolved and not have him tossed aside by unscrupulous sellers. We brought this to the attention of Grailed a while back. The seller has resorted to being verbally abusive and  frankly he can barely spell. His childlike writing leaves much to be desired, yet he sells often (from reviews). He has had quite a mix of reviews...yet for us it did not work out. I have the mercahndise sitting right next to me now. Envelope and all. If only grailed could answer and keep their word up (By Wyatt @ Support last July 15th 2019) . Any suggestions> There is no Phone  # to reach Grailed either that I can see.\n\nUPDATE#1 : Both my son and I keep getting standarized answers with a code # attached to them in Emails, yet no one answers to the questions. It has been 2 months of waiting. Paypal, to whom Grailed directed us to, is not responding as well. I am very dissappointed and sad for my son who works minimun wage in a hot kitchen to make this purchase. Since Grailled is the body that works with the sellers, one would think that they would step up to honor the situation and help to restore funds back to my son. The seller ( Jade Green) is a dark and abusive person.....My son would sell the jeans to a friend at the risk of the losing his friendship over how poorly done this jeans were custom- stiched. Grailled, Please help.\n\nUPDATE #2...Still after countless emails, we still get a generic answer with a # attached to it. Only Wyatt (Support) so far seems to have been a bit more engaging.yet that was days ago.  Paypal has not responded to my son....and we still have these pair of 'not as described' pair of ill put together jeans. I can see how a much younger person, would give up with Grailled unresponsiveness...yet thank God for caring moms who will see to it that a resolution is reached. I wish I could get feedback or help from some of the reviewers here......Grailled, please answer. Please.\n\n**UPDATE 3**...We still are to resolve this matter from the end of May.So that is 2 + months now. Am I to publish my son's email and user name publicly here as 'Grailled' requested it in this forum?? I emailed them directly. The problem also is in having 'Paypal' help me help my son. What to do next?? The thing is that the 'Updates' as recommended by 'Trust Pilot' are not getting Grailled's attention as their original answer has been the same: No change\n\nUpgrade # 4...I figured Grailed's emails and responses for the past 2 months. They create a \"Ticket#\" which changes for each email, hence it does not reflect a genuine answer to your case at all. IT IS 100% GENERIC or FIXED.  Even when a Support person's name is given out, that 'person' has no  'knowledge' of your case by the next response. It will refer to you as the 'purchaser' or the' seller' equally. They also create different Subject lines and print the same content on separate emails.  This company needs to be reported with Better Business Bureau, or its equivalent, in USA. They pray on the young who, for some, might be inclined to let go and move on. I wish there was feedback from other Trust Pilot readers on this page....Signed: a Very displeased parent to a young customer.","title":"My son got a pair of DEFECTIVE pants sent to him…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-07-25","author":"Jordan","text":"I recently sold a legitimate item on Grailed. I followed instructions perfectly, including adding a tracking number to the delivery. Everything seemed to be ok, as the PayPal funds were released into my account. About 2 weeks later, I received an email informing me that my account had been frozen for listing inauthentic items. I then checked my PayPal account and the funds had been taken back out. I was not given any opportunity to respond and no evidence was provided to me as to why my account had been frozen. I have proof of purchase for the item but was not able to log in to my Grailed account. I have sent 3 follow up emails over the last 6 days but have not heard back. I am extremely disappointed, considering I have done everything legitimately and have had no opportunity to respond to the false claims.\n\nCase ID:80314","title":"No response after selling legitimate item","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-07-25","author":"Matt C","text":"Quite disappointed with the interaction between the Grailed team and their users, you'd think that with such popularity they must have a good team behind the app that communicates with their users... I was wrong to think this. This is the first time I've had a problem with a seller not shipping an item out and I am out my money and have no item in hand. \n\nI used the request refund button, as my transaction was eligible since the seller had not added a valid tracking number and was being very unresponsive, however, there was no confirmation email sent to me that notified me that I had succeeded in sending in a request. Additionally, there is no way for me to track the progress of that refund request... Not good.\n\nSo now I am out money and this item with no way of telling whether I'll get the money back, or if I successfully sent a request\/progress of a refund request.\n\nReply to Grailed:\nHi, appreciate a reply, my username is mattchoy","title":"Grailed doesn't seem to want to help its users","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-07-25","author":"Kalin","text":"I really enjoy the app as it has helped me sell a few items and made me some money but today as I was scrolling through, my items weren’t loading so I checked my email and I had one fro Grailed saying I’ve been suspended for fraudulent activity.\n\nI hope I get this issue resolved as I like the app a lot.\n\nMy username is FlyKicksSuppliers","title":"My account got suspended for “fraudulent activity” which was not the case!","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-07-31","author":"Brian Rundle","text":"No tracking number. Item not sent. Refund button doesn’t work. No response from seller. No response from Grailed customer service. Do not use this app!\n\nThey sent the response below, but still have not responded to any of my attempts to contact them!! I had to go through the banking system to get my money back!  DO NOT USE THIS APP!!!","title":"Don’t use this APP!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-08-03","author":"Logan Burris","text":"I sold two items to the same person using Grailed. I shipped the same day the items were sold and entered the tracking number for the package on the first item. Of course I shipped the two items together since they were going to one person. When I attempt to enter the tracking number for the second item, I am told \"This tracking number already exists.\" and so my funds are still being held. This is a glitch in the system and I am extremely frustrated. I have already contacted them through the site but based on the reviews here I may never hear back. Disappointing experience with Grailed and I hope they get in touch to fix this asap because as of now I have lost money by selling through their site.\n\nUsername is APRTRCLT","title":"Funds held by Grailed, This tracking number already exists..","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-08-04","author":"Rocco Zunino","text":"I am trying to log into my account but it says I am banned. I do not know why or how but I have done nothing wrong to warrant this. It is extremely frustrating since this is the main place I sell my clothing.","title":"Banned for no reason","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-08-05","author":"kris genther","text":"Was very happy with this site. A simple and user friendly way to buy and sell high end and rare\/limited release stuff. HOWEVER, after a ban months ago due to an unforeseen family emergency which caused me to be away from email (and by extension Grailed) I was permanently banned. They say you have the ability to appeal but after multiple emails over several weeks I have yet to get anything other than an automated email telling me they have received my email. No phone number listed. I was able to track a few down but am waiting to see if I hear back before I start down that route. Customer service is SEVERELY lacking. All this after I had been a user for probably close to 5 years.","title":"Terrible customer service! Nice platform and users though...","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-08-09","author":"Lets Q","text":"my account got frozen and they told me it was listing counterfeit items\ncontacted grailed and give proof of authentication, order confirmation from the official store. but they still froze my account. I bet grailed don't know how to legit check on an item. \nthe ticket ID is 88480. to kelly, go improve your knowledge on item authenticity.  thanks..","title":"account froze due CS who dont know to legit check","stars":1,"location":"MY","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-08-09","author":"Ed","text":"I'm updating my review based on the response from Grailed to this review and the resolution they sent me over email.\n\nI received a response from Nico that was very helpful where he honored Grailed's buyer protection and refunded my shipping cost. He also explained why the company relies on PayPal as well as their authentication processes. This is how the case should've been handled from the get go.\n\nI applaud Grailed and particularly Nico for taking the right steps in addressing my issues which have made this experience better. While I can't sincerely give a 5 star review based on the earlier experience, I'm updating my rating from 1 to 3 stars given the resolution and Grailed's earnest attempts to amend the situation.\n\nI'll leave my points of feedback that I sent to Grailed for everyone to see so they know what the current situation is and hopefully what the future may be should Grailed implement more support and control over the process to prevent fraudulent sellers and handle situations that do slip through.\n\n1. A clearer explanation of the the process in your FAQs to get refunded and support should cases such as this happen\n2. A customer service phone line or live chat where customers don't have to wait a full day for an email response. I think it took far too many days to get the proper support I needed\n3. Customers shouldn't be sent canned responses if their questions require different responses (i.e. authentication or refund questions that are outside of the PayPal $30 reimbursement).\n4. Transparency about your authentication guarantee and what that means. \n\n\n-------------------------Original Review------------------------------------\nI purchased a really expensive bag after doing research and reading how Grailed 1) checks for authenticity and 2) Offers total buyer protection and guarantees to help you get your money back if you're sold a fake. Unfortunately I've learned that all of this is just lip service and basically the only thing you can do is go through PayPal.\n\nWhen I received the bag, it was clear the seller sent me a bag that was completely different from the bag in his original picture and clearly counterfeit. First note that Grailed doesn't have any phone number, you can only email in and they always take at minimum a full day to respond. Secondly, they send you to PayPal and basically the resolution is for you to ship the item at your OWN expense to get a refund. After many days of back and forth(ticket #93117) , Grailed's own moderators have deemed the item inauthentic. That being said, all they've done is frozen the seller's account. What a punishment, the seller probably doesn't even care, he not receiving any financial punishment for being a malicious seller. Once they get this fake item back, I'm sure they'll just go and try to scam another buyer again.\n\nOn my end, I have to now ship the item back from the USA to the Netherlands and PayPal will only reimburse $30. The shipping is going to cost over $100 to insure, and add signature confirmation. I've sent Grailed 3 emails specifically (ticket # 93117) asking how to get this shipping refunded and they keep sending me canned responses to ask Paypal event though I've already mentioned the $30 limit on the shipping reimbursement (which I confirmed with PayPal on the phone). Honestly, Grailed does NOT protect you at all. All the onus is going to be on the buyer... YOU Have to return the item... PAY for return shipping.. .be OUT of money on the return shipping...YOU talk to PayPal..... Grailed's whole thing about how they guarantee Authenticity is a lie . Their customer service is non existent... highly suggest you avoid Grailed and go with other services that actually stand on their word about authenticity and actually do something to protect the buyer. Otherwise, be prepared to likely get a fake item and then be out the shipping cost that you're going to have to spend to return the item.","title":"Updated (resolved) - Worst buying experience. Grailed does NOT protect the buyer.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-08-12","author":"Sara Vitrio","text":"UPDATE \n\n I've received your reply but you advertise your protection as fast and guaranteed... You just told me I have to wait PayPal solution in 30 days... IS THIS FAST FOR YOU? \n30 DAYS WITH 540 DOLLARS STUCK?? IN THIS WAY YOU ENCOURAGE PEOPLE TO SCAM, AT LEAST THEY CAN HAVE EXTRA MONEY FOR 30 DAYS!!!! Bought a coat paid 540 usd from a seller called \"ricycled\" . No response or evidence of posting after purchase within 11 days. Had to open more than one ticket to get an email just saying they're investigating and they froze the seller account. I have 540 dollars stuck in the scammer seller account and potentially I have to wait PayPal solution by the 13th of September. I thought it was a reliable marketplace but I have to say it's too easy to get scammed because of their extremely low buyer protection... Very disappointed as it clearly a scam since we are talking about 11 DAYS WHERE NOTHING HAPPENED, and they should refund immediately... It's MONEY not nuts\n\nMy ticket is 96197 username archivio","title":"No buyer protection GOT SCAMMED","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-08-16","author":"Дмитрий Здравствуй","text":"I was selling clothes for about a year, everything went fine, reviews 5\/5. I was very like the trading platform before some incidents. The first is that one person bought a sweater from me and the buyer’s national mail simply did not update the track code information and he received my clothes (Have a proofs) and returned the money. Support did not help at all.\nThe second is that I was banned\n for selling fake burberry, (despite the fact that I am 100% sure that all my items are original. I selling luxury since 2014 ) without any proofs and all my messages are ignored.\nAs a result, I have a loss and a lost account that I developed for a long time.\nMany Thanks for Kelly for all of that.\n\n!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\nMY GRAILED NAME IS BADVIBESUA\nMY GRAILED NAME IS BADVIBESUA\nMY GRAILED NAME IS BADVIBESUA\nMY GRAILED NAME IS BADVIBESUA\nMY GRAILED NAME IS BADVIBESUA","title":"!!!UPDATED!!! Banned for no reason and lost my money thx Grailed team !!!UPDATED!!!","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-08-16","author":"Ben Eva","text":"I purchased some sneakers on Grailed for $250 in July.  It turned out to be a complete scam and this seller had many other listings. \n\nI emailed Grailed 5 times and when they didn't respond I DMd them 11 times on Insta and posted 4 times on their FB feed.  \n\nEventually Laura (help@grailed) contacted me.  I replied and gave her all of the details about the scam.  She never replied again so I sent another 5 emails, 3 DMs on Insta.  \n\nLaura (help@grailed) eventually replied saying that she would investigate the seller and reverse the payment.  \n\nI heard nothing back from Laura (help@grailed) so I emailed again, she did reply this time saying that she had frozen the sellers account and that I should ask for a refund from PayPal.  \n\nI notice that the seller still has scam listings on the Grailed site.  I then emailed Laura (help@grailed) 14 times asking for a phone number for Grailed and she never replied.\n\nDon't use this web site","title":"SCAM SCAM SCAM - No Customer service - they don't care","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"},{"date":"2019-08-19","author":"Bhavani Chigullapalli","text":"Thank you for replying faster than your emails i appreciate that its been irritating having to wait 3-4 days per reply when all they say is its thru PayPal even though they don't see the transaction to begin with. I appreciate you guys stepping up and trying to help by contacting them i had to delete my other review to post this but here's my ticket number you asked for: 100495","title":"Thank you for replying fast i need the money asap for rent","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=29&stars=1&stars=2&stars=3"}]