[{"date":"2020-03-14","author":"Alessandro V","text":"Grailed refused my appeal to be unbanned because apparently i “repeatedly relisted the items after being taken down multiple times” when this isn’t the truth. I NEVER resisted an item after being told it was inauthentic besides when grailed emailed me TELLING ME TO RELIST with “tagging” or a “clearer picture” *at this point grailed didn’t officially say that the item was inauthentic* (i just assumed that grailed needed more pics not that they were telling me that my item was fake!). Can you guys PLEASE reconsider being this harsh on me and at least let me BUY ONLY on the app?? This was literally a MISTAKE! Could you guys give the benefit of the doubt to a customer of 4 YEARS when i tell you guys that I really had no idea that the items were inauthentic? I know listing inauthentic items is against TOS but i’m convinced that most of the items we’re indeed authentic. (I might even be able to find email receipts from the web store that some of the items were bought from). Even if they did happen to be inauthentic i promise you guys that I had absolutely NO KNOWLEDGE of this. Another thing that astonished me is that in grailed’s response to my original review they told me that i’ve listed multiple fake bape pieces as well as various other brands but the ONLY bape peice i ever posted WAS SOLD AND HAD A DIGITALLY AUTHENTICATED BADGE from you guys and was never taken down! This really makes no sense to me, I really hope you can reconsider because this isn’t the way to treat a loyal customer that made a simple mistake. The fact that I believed that items that I bought on grailed were authentic and felt no need to legit check them before posting shouldn’t be held against me. If the item wasn’t taken down from the original seller I bought it from on grailed then why should it be taken down when I relist! You guys didn’t even give me a single warning before deciding to completely perm ban me. All I ask for is 1 more chance, i assure you guys that this kind of misunderstanding will never happen again. Again my usernames are @_alealeale and @alessandrov\nBy the way: I also ended up GETTING RID OF THESE ITEMS through a different app so you won’t ever have to worry about me relisting any of those pieces (that you guys claim are “inauthentic”) on Grailed.\nThanks For Your Time","title":"Grailed Refuses To Unban Me When I’ve Done Nothing Wrong","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-03-14","author":"Paul","text":"This website seems so cool at first, so many cool items listed there. A few weeks ago, I purchased from their platform for the first time, a vintage Moncler ski jacket. The listing mentioned \"size WOMENS L\" but I didn't really care, the measurements were good for me and the jacket looked cool, not feminine at all. Once I received it, I didn't like it as much as I did in the pictures. The seller doesn't want it back, that's fair. I decide to relist it. One day later, Grailed sends me an email telling me they removed it because it's womenswear. Lol this seems completely moronic to me. I was able to purchase an item on this website that was not flagged and removed by their curators, so I expect to be able to resell it on that very same platform if I want to. I didn't change a single word from the first listing when I tried to resell it, so it's really beyond me why they didn't take it down a loooong time ago if it was against their rules. What an amateurish job. \n\nObviously I contacted the customer service. Two weeks ago for the first time, and a few times since. Never heard back once from them. \n\nI wish I had read the some of the reviews here before I took a chance with them ! Well, you live and you learn. I'm never going near that website ever again :D.\n\nEDIT - Thanks for the reply. My username is richeverland683. At this point I kinda expect you're gonna tell me you can't do anything, but it feels a little bit less frustrating to finally hear from you.\n\nEDIT EDIT - I changed my one star rating to a 3 star one, since they corrected their mistake. Still, I wish we could have done it sooner through their customer service.","title":"Resolved - cannot resell an item purchased on their platform","stars":3,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-03-16","author":"Grandthefthead","text":"I love the site, but I don't understand why I deserve this treatment, I have already sold things here, I bought things from a friend to sell here, everything was fine, people wrote to me they liked my offer, but at one point my ads were removed in a minute all at once, explained that my things are not authentic, that is, my ad hung for several days, and they just deleted them, I wrote to the support service and then my account was immediately frozen, for which I do not understand, restore my account please, I put my soul into it and all my stuff is authentic. Grandthefthead\nUPDATE\nAnd Yes, I only received one notification, and I thought that I made bad photos that do not match, I did not see a repeat, let me post again that you would check, my hoodies are authentic","title":"Random frozen","stars":3,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-03-16","author":"Alessandro V","text":"Terrible Support and Ridiculous Bans\nI was banned for no reason and grailed's support never responded. I decided to then write a trust pilot review to try to get a response and I pretty much just got a robot response saying they won't urban me for selling fakes (and relisting them multiple times) *WHICH I NEVER DID*. I had multiple 5 star reviews and many of the items I was selling had a \"digitally authenticated\" badge from grailed. I'm convinced that these items were not fake (I might even be able to find old receipts from when I bought them). I've been buying and selling on grailed for 4 years and this is how they treat me :\/ worst support i've ever seen in my life. Also there's a frequent pattern of people complaining about unfair bans on here so I think that it says something about their customer service. This is a huge disappointment as grailed was one of my favorite apps to find rare pieces.","title":"Terrible Support and Ridiculous Bans","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-03-17","author":"Alessandro V","text":"My grailed account was frozen with no warnings due to me apparently selling counterfeit items. First of all, I had no idea these items were inauthentic and I said this to grailed. They refuse to give a loyal customer of 4 years 1 more chance even when I said that I would stop selling on the app and that all I wanted to do from now on is buy. I am also positive that not all of these items are inauthentic because (as indicated in grailed's response to me) I had listed a fake supreme piece. This makes no sense because the only supreme piece I ever posted on there was bought directly from the supreme web store *supreme x north face metallic logo hoodie*. I know that writing this review probably won't do anything but get me a useless \"we are not able to reinstate your account\" reply but I'm writing it anyway because think this is just unfair. I didn't even know I was doing anything wrong and I didn't even get a single warning. I never relisted ANY of these items unless grailed asked me for a clearer picture of a specific part of the garment. I don't understand what they get out of being ridiculously harsh on loyal customers that spend thousands of dollars MONTHLY on their app. This is just unfair... I would understand a ban of a few weeks or even a few months but a PERMANENT ban over a single mistake is just stupid. I don't see what the harm is in giving me one more chance or banning me from SELLING on the app while letting me continue to buy. You guys also just need to add more support in general (for example: a line that people can call where you actually talk to someone *not some prerecorded voicemail*). This used to be my favorite app for shopping. I'm very disappointed in grailed and their team they've really let me down :\/\n\nI also already sold all of these items on a separate app so I really have no need to continue selling on grailed.\n\n I even offered to try to find PROOF of authenticity for some of these items but all they did Is give me the same pre-written response as always. smh... at least give me a chance","title":"No Second Chances (even for simple mistakes)","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-03-20","author":"Igor “Lait”","text":"I sell on grailed since 2017.My account has been blocked. The reasons were not given to me.\nI have not had a single bad review.\nI wrote to you in the mail 2 times. I did not receive an answer. why you blocked my account I do not understand. I would like to hear some explanations.\nmy nick name in grailed lait88","title":"My account has been blocked","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-03-21","author":"tenkokgya","text":"how I can communicate with customer support ?no reply at all. I am asking about frozen my account \"honsin5423 at g mai l\" but no responce . no idea this situation.","title":"how I can communicate with customer…","stars":1,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-03-21","author":"andywho","text":"I was on grailed more than 3years as seller and more than 260 plus feedback but suddenly my account was froze n . I hope grailed can check my account again. my user name is idasiaasia .\nI hope I can join grailed community again.","title":"I was on grailed more than 3years as…","stars":1,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-03-22","author":"Joshua Guloy","text":"My account was taken down due to a mistake. I appealed to Grailed through email and sent them all the evidence in order to have my account reinstated but I feel like my emails that I send to them get sent straight to the trash. \n\nI do like selling on this app but I need them to respond to my email so that this partnership can continue.\n\nusername - romelguloy","title":"DOES NOT RESPOND TO EMAILS\/APPEALS","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-03-23","author":"DoYouKnowKoko","text":"ADMINISTRATION, read full, please.\n\nOne month ago I added authentic LV jeans on my account ( DoUKnowKoko ), Grailed team checked them and marked as authentic (“Digitally Authenticated” tab).\n\nIn the beginning of March someone with new account from 2020 and with 0 transactions bought them for 895$( hongduck2357 ). It was usual scam, but i understood it much latter, because i'm a beginner on Grailed.\n\nI shipped via DHL, in four days he opened case of inauthencity on PP without any replies to me. And, if I understand correctly, wrote claim to Grailed.\n\nI wrote to Grailed about this situation immediately, but still have no reply( request #350174 since 15th March).\n( UPDATED 24.03 Received email, it was saying that after buyer's claim Grailed team change their decision after further review and determined that item is not authentic. I didn't know it and, especially, after receiving \"Digitally Authentic\" tab i was sure that item is original. Why was my account frozen for moderator's mistake? PayPal will refund buyer anyway. )\n\nINSTEAD OF GETTING HELP friday ( 20.03 ) morning MY ACCOUNT WAS FROSEN and saturday ( 21.03 ) morning my case was closed to the buyer side because of my Grailed account blocking. I lost item, which i bought for 600$, i lost money for DHL shipping, i lost 100$ for Grailed and PayPal fees.\n\nToday morning ( 23.03) another buyer opened case, this time for an unauthorized payment on order \"someone\" made FOR HIS OWN NAME.\nIt seems that there are a lot of scammers among buyers and this is frustrating.\nI urgently need access to my correspondence on Grailed for argumentation on PayPal. If they'll close this case not to my side too, summary my losts will be MORE THEN 1000$. Cool story.\n\nHelp with this situation, please, reinstate my profile and connect me via instagram @doyouknowkoko for direct communication. I am a honest seller with great experience, I want to continue selling on Grailed. I had 5.0 feedback. I never sold fake items intentionally. Grailed deleted my authenthic ( on my mind ) Palm Angeles hoodie and i didn't even try to relist it. I've refunded one sold listing to my last buyer since blocking of my page because i couldn't even add tracking number of package which i have already sent.\n\nMy Grailed : douknowkoko\nMy email: doyouknowkoko gmail.com","title":"Account blocking instead of seller's protection","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-03-26","author":"DoYouKnowKoko","text":"Looks like you can get email reply only after writing here. I wrote situation below.\nGavin, answer my emails, please. \nPayPal asked me to send them our correspondence with dishonest buyer, I urgently need access to my account or they will close case and I will lose my items and my money.  \n\nDouknowkoko on grailed \nDoyouknowkoko gmail.com","title":"Looks like you can get email reply only…","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-03-27","author":"Maximus","text":"Hi grailed staff team I I listed 3 posts on grailed and I woke up to an account freeze saying I had listed in authentic items, this makes absolutely\nNo sense , and I made an other email asking the grailed staff team about which item was In-authentic because the only things I had listed were bought from the boutique , this is not right and it made my grailed experience terrible ,also I believe that grailed should have told me which listing was considered in-authentic ! Also I do believe in second chances for peoplè who did nothing wrong!My username is maximusrobinson6965 ,thank you.\nAlso I have purchased all items I listed from either Louis Vuitton or saks fifth avenue. If you need me to provide receipts for these items I will be more then happy to do so !!!","title":"Hi grailed staff team I Listed 3 items","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-03-30","author":"Igor “Lait”","text":"Not long ago my account was blocked for no reason. When I wrote a review on this site I was unblocked.\nThe reason why he was supposedly blocked (this is a win-up of likes) Although if you go to my account and click on the heart. You can see that I did not like absolutely nothing! Was the reason invented?\nToday my account was frozen again. And again, it is not clear why and for what? I don’t understand how to sell something on this site, if it’s constantly being blocked for no reason!\n\nmy nick name on grailed lait88","title":"Not long ago my account was blocked for…","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-04-01","author":"Igor “Lait”","text":"Another ridiculous reason. I have only one account. Why are you lying brazenly and come up with nonsense ?? Before that, you wrote that the ban is because of the likes, but I didn’t like what.\nI do not advise anyone to use this from the site. you are banned just like that and come up with some reason.","title":"Another ridiculous reason","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-04-03","author":"Jonathan Yomtobian","text":"My username is jonycash3000\nThis is to Reference 2872674\nI sell only Authentic items, I have never bought or sold anything off site. I have been following all of the terms of Grailed for ever since I was a member. My ratings are 5 stars and I really needed this app to sell my items because of the financial crisis Me and my family is going through during this time. I ship out all of my items as soon as possible, I message and respond to each and every customer quickly. I Would really appreciate it if you can remove this freeze from my account. \nPlease let me know as soon as possible.","title":"Reference 2872674","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-04-04","author":"Kevin B9S5","text":"My username: Everything_VTG\nCurrently 9 reviews, 5 stars, 19 sales, made only one refund to a customer due to he has not received item even I already shipped to him.\n----------------------------\nOriginal Mail:\nHey,\nThanks for putting your listings on Grailed – we really appreciate it. However, after further review  Fear of God Satin Hooded Bomber Jacket was removed from the site by the moderators.\nOur moderators have reviewed this item and it appears to be inauthentic. Please do not relist it. Repeatedly listing inauthentic items will result in the suspension of your account. If you believe your item is authentic and have sufficient evidence to prove it.\nThanks again for using Grailed! Hope to see more of your stuff on the site.\nBest,\nGrailed Team\n--------------------------------\nWhen I listed my \"suspicious\" item first time, they deleted without email telling me, I thought it was normal, because I ran into same situation when I tried to sell my Yeezy due to lack of details photos, so I listed again, they deleted again and I received a mail from them informed me that I should not list this item again, and I didn't. After couple days, they sent me an email told me that my account is frozen, I was like what the hell.\nSo I sent my item's detail to appeal at grailed.com,  along with purchase proof (I bought it from FWRD) , they said my purchase proof is INVALID, I don't understand how come an order confirmation email from FWRD's official can be determined as INVALID, LMFAO, then they banned my account instantly WITHOUT telling me how can I prove my item is authentic, I gave them wash tag, zippers photos, I don't know if they really made close comparison with other same items that are currently on sale on Grailed.\nAlso, I can't even open their app or open their website with my account, I have to delete the app and view as guest, what is this about??????\nI'm really hoping they can resolve my account and give me an apology, I understand buyers are always first, because I'm a seller, I take full responsibility for my customer, I never dealt with them offsite, but if a third party can't put some effort on sellers, no one would come and sell their item on Grailed again.","title":"Everything_VTG","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-04-06","author":"Kevin B9S5","text":"Are you freakin kidding me? I said font size changed due to dry clean, there are so many items’ tag from fear of god even completed faded, and your moderator can determine that as authentic? What a joke","title":"Are you freakin kidding me","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-04-06","author":"Jonathan Yomtobian","text":"I am unsure why I am being frozen. I fully understand the terms of service. I am being 100% an honest seller. I just shipped items todays to CANADA!! I respect all of my customers and would never do anything offsite so this must be a mistake. Please remove the freeze from my account I do not understand why the system is targeting me.\n\nReference 2883340\nUsername Jonycash3000\nThank You","title":"Frozen Account- Mistake","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-04-08","author":"Seller","text":"Grailed is ignoring me! I have sent them numerous emails and still haven’t heard back since Sunday. I see that they are replying to people on trustpilot so maybe I can get their attention this way.\nMy account was frozen due to some mistakes that I’ve made and honestly it was just that honest mistakes nothing intentional. Please Grailed reply back to my emails and read in detail what I wrote back.\n\nGrailed username is sanamsikander21","title":"Grailed please stop ignoring me!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"},{"date":"2020-04-10","author":"emily taylor","text":"I have used Grailed a fair bit and already twice I have received inauthentic pieces.\nI have reported these and thankfully had Paypal help me with this but Grailed doesn't seem to take enquiries of users selling fake items seriously they just ignore it.","title":"I have used Grailed a fair bit and…","stars":1,"location":"NZ","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=19&stars=1&stars=2&stars=3"}]