[{"date":"2020-10-10","author":"Patrik Peterdi","text":"Don't expect them to ever help you with anything, worst customer service if any problem, your only hope is the buyer protection from paypal, but as a seller you can go and get f, they really doesn'tcare. Just take your 9% and .. on your face. There are a thousand better sites where they care more about both their sellers and buyers and not just money..","title":"Avoid the site!","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-10-13","author":"Jerome","text":"Had various listings removed for them not being able to be authenticated(like thats my fault) then had my account frozen for listing an “inauthentic item”...when I’ve bought the shoes from an Chanel boutique in New Bond Street for £780. Which was in 2015, so I’m obviously not going to still have the receipt in 2020.\n“Everything_new”- My username","title":"Terrible customer service, terrible moderators\/authenticators","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-10-13","author":"Matti Hau","text":"It's a nice website and store. But brutally bad short-term and greedy business idea. Threatens to ban you if you buy the product but do not complete the purchase on their website, but have insanely expensive fees. Follow the development and reduce the fees, or you will lose all customers quickly.","title":"Greedy owners","stars":1,"location":"NO","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-10-13","author":"Pete Livene","text":"Stupid. They freeze your account when you send messages that they think is about continuing the sale through one other site. Well, of course no one wants to pay more than 10 % in fees when other sites has the half or free sales (like ebay). If people don't want to do the sales through Grailed, they should simply understand that something is wrong with their fees..","title":"Stupid","stars":1,"location":"NO","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-10-13","author":"Tina Make","text":"I was a great seller on this site. I had sales, reviews, this is generally my main job! But one day I logged from IP and my store was blocked.\nI wrote to the support mail and they do not respond. I am very upset and disappointed. Awful.\nHas anyone encountered such a situation? Can it be solved somehow? My store on this site is important to me.\nmy store was named grailslover","title":"Very disappointed","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-10-16","author":"Alexander Azar","text":"I emailed Grailed after they raised their fees asking if I relisted my items with the original followers, if the fees would remain at 6%. They replied yes, however, after selling the items, the Grailed fee was at 9%. I emailed them 4 times asking for a refund and they never responded.","title":"I emailed Grailed after they raised…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-10-17","author":"Jorge ","text":"Worst customer service ever\n\nSold items on Grailed for 3 years. More than 100 items sold and aprox 50 feedbacks after (ALL the feedbacks I received were 5*), my account was simply deleted or \"Frozen\". After one week not being able to reach the website (I thought the site was down), I found out a message on my email box saying \"You're account was permanently frozen for selling not genuine products\". I emailed them asking the reason behind that accusation and they just didn't give me one. Since than I send them 3 more emails about the subject trying to figure it out the reasons for this disclosure and I got zero answers. I'm really disappointed with Grailed and the way they treat their partners","title":"Worst customer service ever","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-10-17","author":"TetaBongkus","text":"Account was frozen for \"listing inauthentic item\" when the item itself was AUTHENTICATED TWICE BY GRAILED THEMSELVES.\n\n2 freaking authentication rounds which succeeded and now they proceed to throw me under the damn bus for \"listing inauthentic items\". This is mental, I was a seller with a moral compass. Refunding my buyers whenever there was a hiccup and being nice to them and your support team whenever I needed some help.\n\nYou authenticated my items TWICE. 2 DAMN TIMES YOU AUTHENTICATED MY ITEMS AND NOW YOU WANNA FREEZE MY ACCOUNT? WHAT WRONG DID I DO TO YOU GUYS? SHOE BOUGHT FROM GOAT, AUTHENTICATED FROM GOAT. SHOE LISTED ON GRAILED, AUTHENTICATED TWICE BY GRAILED. \n\nAND YOU STILL CALL MY SHOE FAKE? THERE ARE LISTINGS SIMILAR TO MINE THAT HAVE WORSE SHOE CONDITIONS AND YOU CALL MINE THAT FAKE EVEN THOUGH MINE IS VERIFIED FROM GOAT, AUTHENTICATED AND IS ACTUALLY FREAKING AUTHENTIC?\n\nI WANT TO KILL MYSELF HOLY SMOKES.","title":"FROZEN ACCOUNT FOR NO REASON.","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-10-19","author":"Gene Winda","text":"Account user: livingincolour\nwhen it comes to service fees grailed isnt so bad compared to other platforms. But customer care is a bit different. I got banned a few weeks ago due to offsite transactions. Though this was my fault, grailed doesnt seem give any warnings. I understand users are sent flags, but many times its outta context. Like many others on here, ratings don't seem to matter nor do complete transactions. Ive been a member for 3 years with a 4.4 rating yet, as soon as \"invoice\" or Instagram\" get flagged im ban. I admit, i  was wrong, but didnt realize it was that serious.  I tried to plea my case but graileds administration team dont respond.","title":"frozen account","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-10-21","author":"irorman","text":"I don't understand how this could happen?! \nMy account has been deleted! I didn't even receive any email, they just deleted it! I made 8 sales on it and got my first 5 star review yesterday! The buyer was very pleased, everything was good! I also have other packages on the way! All the shoes I sold were LEGIT!\nI ask you please restore my account!\nPLEASE!\nName on Grailed: irorman","title":"BANNED FOR NOTHING!","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-10-22","author":"Tom","text":"Hi,\n\nI just got an email that my account got frozen for selling counterfeit? \nI only sold high end authentic items in the past and already had listings with historical meaning in fashion from Tom Ford and Gucci.\n\nSo can you tell me what’s happening all of a sudden ? \nI did not even get any warning, you just straight ban me!\n\nThis is absurd!\n\nAccount: designersway","title":"Frozen account without warning","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-10-27","author":"Andre Monteiro","text":"Just sold 2 items so far, 79 likes on one item for example, but no request. To high fees imo. \n\nBiggest con:\nYou create a nice description, invest time and effort, you choose \"publish\" button, then they review your item, and list it or JUST DELETE it. \nThey want to have a prove younhave item in hands, but, first they dont mention before, second, which is worse, even if you upload a picture with item and a piece of paper with your username,still deleted....#nogo \nWont use again, cause you have to choose and mention a lot of details to describe your item (takes like 10 minutes to create an offer), and then they might just delete it and ask you to create a new offer to your item.🤔","title":"Unreasonable offer deletings, high selling fee, wont use it often","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-10-29","author":"Jonathan","text":"I am having such difficulty getting in contact with grailed team. I have a simple question and tried calling but it went right to voicemail and hung up. I have had other problems about grailed saying one of my items is fake and emailed them about it on multiple occasions and have not once gotten an email back.","title":"Unhappy with customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-11-02","author":"Me","text":"It's hit or miss.  Some sellers are good and others are wholly dishonest.  There's no customer service.  I would highly recommend people NOT use this site.","title":"It's hit or miss","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-11-04","author":"Tom","text":"Hey,\n\nI’m leaving another message because of the whole delay of this situation getting really frustrated.\n\nBoth PayPal and grailed can’t assist me in this weird situation.\nMy item got authenticated and when it sold I got banned without even a warning even tho there are same Louis Vuitton jacket all over your site and past sales as well!\n\nNow you told me that if PayPal can’t assist me to message you but a week now I messaged you without getting an answer.\nThis is insane!\n\nI just want to sell my clothes there and you just don’t let me do that because of your huge delays and this lack of communication all over grailed after getting in some ‘trouble’\n\nGrailed account: designersway","title":"Frozen account without warning","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-11-05","author":"selling community","text":"I advise customers to not use Grailed Unprofessional very slow responding to emails.\n\nThey blocked my account for accusing me selling fakes with non professional evidence or proof , all my items are included original purchase receipts .  I am well internationally high end luxury collector\/seller known seller..","title":"Worse horrible not professional Grailed…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-11-09","author":"Chen David Misgav Hauftman","text":"I purchased two items and paid 650$ via PayPal. Then, few days ago, before I received the items I couldn't enter my profile and one of the sellers sent me an email asking why my account is frozen! I wrote Grailed few times on the customer service page and e-mail but got zero reply. My money was taken and I found myself without  the items I bought and without an answers for the seller who afraid to send them so they won't receive the money. My profile nickname is AL27TLV and my name is Chen Misgav","title":"Frozen account without warning or explanations","stars":1,"location":"IL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-11-11","author":"Tom","text":"Hi,\n\nYou straight told me to to full refund the buyer and then you will unban me and now you’re telling me that you can’t eventually unban my account even tho I refunded the buyer?\n\nIs this a joke?\n\nThey state that I sold a fake lv jacket even tho my jacket is real and exactly the same as the ones that they have on their website and sold many of them as well !!!\n\n\nI wrote another review on trustpilot and you even here you stated that you gave me directions of how I should react to this matter but you’re all lies in the end!!!\n\nThis is absurd!!!\n\nStay away from their website!\n\nCustomer service is full of lies and they won’t even bother solving your problem!","title":"I’m out of words, just bad bad bad!","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-11-12","author":"Hoon Kim","text":"I recently received an email that my account has been frozen due to the reason \"listing inauthentic items\". This is not acceptable to me and I have been trying to contact customer service several times about this particular issue I am having! (NO RESPONSE AT ALL)\n\nThe inauthentic item I am mentioning is the Jordan 4 Union that I am actually trying to relist and sell due to the sizing being a bit small on me. I have actually purchased this product originally through Grailed from the seller shellystrick4l which you can contact to confirm(He has been more helpful than the Grailed Team). I have also even posted a screenshot of my paypal transaction to show authentication and seller's receipts (Attached from emails I sent).\n\nI have tried to relist this product several times, but the authentication team at Grailed has deemed this item inauthentic several times now. I tried to relist it because I notice sometimes you guys don't officially list some items until 2 or 3 attempts of relisting. I posted Grailed's request by providing screenshots of receipts, one is my paypal transaction directly from Grailed and the second attempt the seller's Nike receipt confirmation. I find it ridiculous how the item is just deemed inauthentic with no clear reasons and I even purchased this product through Grailed which is baffling to me. How is it my account is frozen when I am relisting an item that I bought through Grailed. If you guys can not give me a clear reason why my account it frozen and this item is truly a counterfeit, then I want to request a full refund for the Jordan union 4 which I have purchased from Grailed.","title":"Account Frozen and Authentication ISSUE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"},{"date":"2020-11-17","author":"George","text":"9 percent...","title":"9 percent...","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=10&stars=1&stars=2&stars=3"}]