[{"date":"2021-09-07","author":"chris cuong nguyen","text":"Grailed had poor customer service and they nothing but scam recommend not to buy from grailed","title":"Grailed had poor customer service and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-09-10","author":"Customer","text":"I have purchased an item from grailed and paid with paypal recognize as very bad company no customer service and no solution beware don't purchase from this company please.","title":"Grailed no solution","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-09-14","author":"Boot it! Leather it!","text":"Boughtvsome shoes that were \"out of stock\". Now, the seller seems reluctant to return the money. Or Paypal are... Either way Grailed has washed their hands of me and juat send automated scripted links to PayPal and are now ignoring all emails. Thanks grailed.","title":"Boughtvsome shoes that were \"out of…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-09-20","author":"Rue Lee","text":"COMPLETE AND UTTER WASTE OF TIME!!! UPLOADED 100% AUTHENTIC SUPREME SCARFACE BEANIE, WAS REQUESTED TO ADD MORE PICS WITH NAME TO PROVE HAVE ITEM TO HAND.. 1 MINUTE LATER ACCOUNT BLOCKED!!! ON WHAT BASIS?? NEVER KNOWN ANYTHING LIKE IT.. TALK ABOUT UN-PROFESSIONAL.. GO STRAIGHT TO STOCKX. GRAILED AWFUL,, FAR  FROM \"USER FRENDLY EXPERIENCE\".","title":"COMPLETE AND UTTER WASTE OF TIME!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-09-23","author":"Ross S","text":"Grailed banned my account for no reason 3 times, i had an account last year tried to add PayPal as wanted to list some items and it was immediately frozen, they said they would not review as I violated code of conduct, despite the fact i had never sold or purchased anything on the account.  Fast forward to this week  I tried to make another account to buy an item and they banned that as well... same same \nAll I just want to purchase some clothes . Please unfreeze my account Grailed this doesnt make any sense\nusername hedrastudio","title":"Grailed banned my account for no reason…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-09-26","author":"Jonathan Baker","text":"I am a new user to Grailed. I bought two Bottega Veneta boots from the same seller and I have reason to believe they are fake. I have emailed Grailed multiple times over the course of a week regarding this issue and I still have yet to receive a response. However when using a different email address, I wrote an unrelated question to the same Grailed support email and received an answer within hours. I am not sure why they are avoiding my email as I need their help since I have just been scammed by fake items. I really expected better ;( Will not use again. I spent lots of money with them and I hoped to be treated better.\n\nticket ID - 1019948\n\nNow I am needing to make a trust pilot review in hopes of getting their attention.","title":"Customer service deliberately ignoring me","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-09-28","author":"Matrix Glitcher","text":"Absolute worst customer service. Doesn’t reply for almost a week, if ever. You might have to chase them down to do their job. Then they don’t even listen, you’re tossed around between diff reps, and no one handles your issue properly. Grailed has stole money from me and never replied and will not respond now. Do not shop here, it’s really not worth it as a seller especially.","title":"Absolute worst customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-10-06","author":"Polly Mo","text":"Hi Grailed I was listing many of my items ，my account has been frozen with no explination","title":"My grailed just got frozen","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-10-08","author":"FinnyboiFlayva ❶","text":"Good for buyers, terrible for sellers. They take a whopping 15% of the sale the greedy leeches. Along with this, they team up with PayPal. So together, they both take so much money from a sale. That means combined, they take $46USD\/$63AUD of a $300USD\/$410AUD sale... Absolutely disgusting if you ask me. Won't be selling many more items on the website unfortunately. I do like Grailed as well. Photo verification can be stupid too, time consuming and they get it wrong. It COULD be a great platform. But remember - sellers make the platform, we ARE the engine. Without us, you are nothing!","title":"Good for buyers, HORRIBLE for sellers","stars":3,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-10-08","author":"John thompson","text":"Wouldn’t recommend it at all. Purchased an item that was significantly different from what I purchased. Opened a PayPal case after trying to resolve with seller then I wake up to Grailed email saying my account is frozen because I opened a case. They wouldn’t reinstate my account until I closed the case or wouldn’t even hear my story out. Long story short I’m out of $1000.","title":"Wouldn’t recommend it at all","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-10-09","author":"вадим кузнецов","text":"Hi Grailed Team, my account was frozen by mistake, I have never sold fake products, my account since 2018 has 4.6 stars and 30 positive reviews. I am an honest seller and I believe you will make the right decision.\n\nMy account: shop_goodjobreally","title":"Hi Grailed Team","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-10-12","author":"Krisztian Bodnar","text":"I was trying to upload my first listing and they were keep on rejecting it severeal times because of they were asking for a “serial number” of a bag? i have uploaded clear pictures even with my name and date attached on a piece of paper plus a proof of purchase (receipt) i am not happy at all with Grailed.","title":"I was trying to upload my first listing…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-10-15","author":"MunKenDK","text":"didnt even get my item, for some reason ot got send back to the states and the support told me the reason was that i didnt answer my door when my package was there, but thats not true…and now i dont get my item i just lodt my money from shipping.. bad service","title":"didnt even get my item","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-10-18","author":"RickFTP","text":"The moderators of this community banned my account just like that! At the same time, I did not violate anything and did not scammer, and so on! Moreover, at first I made purchases for $ 220, and then my account was banned! For some kind of violations that I found out about in the mail, but at the same time I didn't make a mistake! Why should I create a new account ?! SUCKS!","title":"Moderator's chaos!","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-10-25","author":"Derica Jackson","text":"I Ordered A Shirt To Match My Shoes ( Jordan’s) The Shirt Didn’t Even Match The Picture On The Website. Received A Refund But Only Partial Of My Money Back. Also The Quality Of The Shirt Wasn’t Good. Save Your Money","title":"I Ordered A Shirt To Match My Shoes (…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-10-31","author":"Customer Care Bear","text":"Avoid at all costs.\n\nI recently bought an item from Grailed. It is counterfeit, a fake.\n\nI contacted both the seller and Grailed and was met with an amateurish, dismissive response from both in regard to what amounts to illegal activity.\n\nGrailed makes much of how it will protect customers and touts these protections within its platform, heavily.  However, it is obvious from my incident that Grailed is interested in one thing: hanging onto the commission it made from the sale of counterfeit goods.\n\nThe response from Grailed actually made me more concerned.  Grailed acknowledges buyers describe items based on their interpretation of the items - facts such as actual label sizes seem unimportant. Sellers can also, as acknowledged by Grailed, add photos of other items similar to the item being sold without ever stating this i.e. misrepresenting what they are actually selling.\n\nGrailed actually suggested that an XL can sometimes fit like a small? Yes, it actually suggested that!?\n\nMy contact from Grailed has been woeful albeit fast - too fast to have carried out any proper investigation. It's like having a counterfeit issue dealt with by one of those inappropriately friendly younger people who allegedly represent charities on the street - forgetting that they are not your friend.\n\nMy only option now is to escalate this issue. I will.\n\nI would advise anyone to avoid Grailed entirely. However, if you do decide to use Grailed DO NOT pay via PayPal - use your credit card you have greater level of protection despite the nonsense noted on Grailed's website.\n\nGrailed. It takes your money and runs all the way to the bank without ever once looking back. A truly dreadful, duplicitous company.\n\nAVOID.  AVOID.  AVOID.","title":"Avoid at all costs!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-11-09","author":"Floris Janssens","text":"Website banned me after 300+ transactions with 5 star rating. I was depending on this website for my income and they shut me down and ignored all my appeals to customer support.","title":"Website banned me after 300+…","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"Customer Care Bear","text":"Just received a full refund from Grailed - after PayPal intervened. Grailed attempted to claim that a t-shirt with an XL label can sometimes fit like a small. PayPal, like me, found this to be a ludicrous statement by Grailed in support of the sale of a counterfeit product. \n\nGrailed customer service was utterly appalling and devoid of any logic or understanding of the law.\n\nDon't risk your money. Grailed is plain and simply, dodgy. Avoid!","title":"Grailed: plain and simply dodgy","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"},{"date":"2021-11-10","author":"Sara Berke","text":"DO NOT BUY FROM HERE. This website is a scam and their customer service is horrendous. I made a purchase for $200+ ..they took my money.. then immediately closed my account for no reason. They said I had fraudulent behavior but the only thing i ever did was make a single purchase! They took the money and ran. Do yourself a favor and avoid this site.","title":"DO NOT BUY FROM HERE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=3&stars=1&stars=2&stars=3"}]