[{"date":"2020-12-25","author":"former grailed admin","text":"This platform is corrupt & the admins are thirsty for power. Without question Grailed has the actual worst customer service I have ever encountered; combining this with the recent x2 increase in fees and the way they have consistently ignored their user-base has been a major factor in my move. They alienated a once vital seller-base which has resulted in only a handful of decent sellers with worthwhile items remaining. For a superior alternative I wholly recommend Jawnflip.","title":"Greed & Capitalism","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2020-12-29","author":"Pierre Chaquin","text":"Very weird. Seller selling items that have already been sold on others platforms....\nThen what’s the point ?\nI an doubtful.....","title":"Very weird","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2020-12-30","author":"brokebloke","text":"Terrible app run by morally bankrupt people. Don’t say I didn’t warn you.","title":"Terrible app run by morally bankrupt…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-02","author":"Binh Thi Thuy","text":"Hello, I just bought shoes yesterday, and now the Grailed seller is banned, so I can’t contact with him. What should I do, when I want to refund?","title":"Refund","stars":3,"location":"CZ","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-03","author":"Ricky","text":"Hello my account has been frozen after all the successful sales and reviews I have, I recently made my mind up to finally post some of my jewelry, that were bought years ago at there flagship stores in Miami. There for I don't have receipts and neither did I read anywhere that having a receipt was mandatory to post an item on Grailed. With that being said I carefully took clear photos of each and every single ring I had for sale perfect enough and clear for Graileds Authentacators to review them. Well at first the removed them because they were supposably blurry then I took more time out of my day to post more clear photos and of every symbol and origin of each ring, then they removed it because they said they determined after reviewing my listing that they were unauthentic and they don't tolerate inauthentic items and I kept reposting them because that's a lie it's not my fault that they are unexperienced and just because something is in hyped in the first thing on the market the people go to and see a lot of the item that they can't determine if it's real or fake I feel that I've been wrongly punished am I count's been frozen because of this I would like my account reinstated please thank you my username is ( RIICARDI )","title":"Frozen account for Little to no reason!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-04","author":"Jj","text":"My account has been frozen due to “unshipped items” but I had agreements with my buyers.. which didn’t actually matter as I had few days left to ship my items anyway! How can I get this reversed","title":"My account has been frozen due to…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-06","author":"Игорь Прокопенко","text":"username:  vinniesvintage\nfake moncler exposed. after the complaint it was not deleted)\n\n\nAdministrators sell fake. I do not recommend buying 80% fake on this site.","title":"Fake","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-09","author":"Maxim Dobrynin","text":"Service is bad , Tried to buy beanie several times , all time sellers blocked me or didn’t know how to ship internationally. Can’t give a rate or feedback on sellers who blocked me, so it’s unfair. Fully disappointed \n.","title":"Service is bad","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-09","author":"d. gebaar","text":"I buy and resell on Grailed. I buy limited and new collection clothing. I have a receipt of everything and i Buy it from the stores\n\nThey deleting my ads by telling it is not original.. and then when i reupload it they put it online as authentic really annoying\n\nbut now they blocked me for trying to sell fake items? without a explanation what is fake.. and no response from the customer service.\n\nI have proof of every item that i own.\n\nReally dissapointed in the customer service. late responses and way too high commission fees","title":"grailed blocked me with no explanation","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-11","author":"addison mines","text":"Horrible customer service. Seems like they never consider what’s actually written in any given email. 99% of replies are without a doubt copy\/pasts. So many fakes circulating the website. Exorbitant fees for providing no services related to security. Accounts can be automatically banned if key words are used in chat. It’s a ridiculous website run by a bunch of babies.","title":"Horrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-12","author":"Ricky","text":"I recently had my account Frozen because the moderators could not authenticate in my items which took time and patience to offer them clear photos for them to evaluate after numerous attempts of them failing to authenticate an authentic item which I bought at the flagship store in Miami at chrome hearts they finally froze my account I've wrote them numerous of times they completely ignore me and I have no idea what to do it's almost like I'm punished for something that didnt do. This is ridiculous ground has always been notorious for banning freezing kicking people off their site for stupid s*** I have tons of reviews all five star feedback been on there since 2016 and they banished me as if I was a new seller who was ripping everybody off this is b******* if you ask me I don't recommend grilled to anybody if you're trying to make some money they take entirely too much but what can you do nowadays obviously nothing because they don't even respond to a complaint for something that I didn't do","title":"Grailed is the worst platform to sell on mercari is better at this point","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-14","author":"Benji Edwards","text":"Customer service is probably the worst I have ever come across. Just appallingly slow. On top of that they have so many “dodgy buyers.","title":"Customer service is probably the worst…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-16","author":"michael tonello","text":"Grailed has a problem in that it's base are a bunch of nefarious characters.","title":"Grailed has a problem in that it's base…","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-17","author":"Eric Milton","text":"Explain to me how this makes any sense. Certain items have to be reviewed before getting approved for sale. If something is wrong or you made a mistake, instead of remaining as pending so you can edit the listing, it simply is deleted and disappears from your listings entirely. This is by far the dumbest system I have ever seen an app have. One mistake and you're recreating the whole listing.","title":"Poorly designed listing authentication","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-21","author":"Sean Lee","text":"Grailed, I was banned for listing a fake item (which i did not know of), and an email was sent to me clearly stating that misunderstandings could happen and that I could appeal. My account user is Vlem, please unban me as I will never list a counterfeit item again. I have read the terms and services over, and I have almost 100+ transactions on Grailed with 47 reviews. Please take a look into this.","title":"Grailed admin read this please!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-21","author":"Ricky","text":"hello I've been banned\/account frozen for the last month I've reached out to grout pony times they have ignored reaching back out to me I'm going to continue to leave reviews anyway I can get in touch with you guys I was accused of selling inauthentic or posting unauthentic chrome Heart rings and that's not the case I've uploaded listings before with receipts and you guys have promptly taken them down before so being that said because your moderators are inexperienced I have been punished from using your platform and I'm trying to appeal my case and no one responds to me frankly this is unfair and I don't recommend you guys to anyone I have a hundred successful five-star reviews never sold a fake item ever in my life and your accusations are wrong please restore my account for the last time it's been a month and a half!!!!! \n\nAccnt id : RIICARDI","title":"Been wrongly banned and being ignored by Grails moderators and customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-24","author":"Brian Brett Goldner","text":"Wow, a pure night mare from start to finish.  Where do I start?  Random blocking of accounts, no customer support, no communication.  If you like HIGH RISK transaction than look no further.   It’s being a seller and a buyer here is the worst.  Sellers get screwed all the time by Grailed with zero explanation or writing and buyers get the same.  I warn all to save themselves the pain and shop anywhere else but here.","title":"Wow.... just wow!","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-25","author":"Kasper Petersen","text":"I bought a watch as an xmas present. It did not look as described. I immediately proposed to pay for own return shipping and eat the EU taxes of €33 I paid on top of the shipping. After 6 weeks and 30+ emails I have still not been able to find a way to return it. Both Grailed and the seller are not answering.","title":"The worst online shopping return experience in my life","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-25","author":"Liam Weir","text":"customer service is quite disappointing, takes 4-5 days to get a reply. moderators will authentic one item then deem it fake the next very inconsistent. had a pair of shoes I bought on grailed then reposted them and now they are fake? I miss the old grailed where it didn't take 45 hours for a post to be approved and sellers fee was lower.","title":"customer service is quite…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"},{"date":"2021-01-28","author":"Yulia","text":"This selling platform is very odd. I tried to list a few items (authentic Chanel accessories) and all of them were removed with the reason given \"inauthentic replica\". Seriously? I've been selling for ages with a long track record on Vestiaire Collective, for example, where all listings are pre-moderated and physically inspected after the items are sold. Never ever even one of them was found to be inauthentic, not even mentioning the fact that a few of my items I tried to list for sale on Grailed had original receipts. Having said that, I seriously doubt the professionalism of those who moderate the website. Shall there be an issue between the buyer and seller - how are they going to determine what is not a replica? Would there be any seller protection or it is going to be something like eBay - non existent? I guess it will be an automatic rip off of the seller - no item and no money given the level of expertise. Unbelievable.","title":"Doubt their professionalism and seller protection","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=8&stars=1&stars=2&stars=3"}]