[{"date":"2019-09-10","author":"Tyler McLaren","text":"Update:\nConvenient that Grailed’s Administration Team assessed my User Feedback on a Grailed “Admin” verified account, and found it to be misleading. \n\nThe number of falsified 5 star submissions on this platform, specifically on “Admin” accounts is misleading. All 5 star reviews without comments have been altered by Admin accounts as the everyday user is required to leave a comment.\n\nHave a quick scan of the “Admin” verified accounts and see how many reviews have no comments.\n\nOP:\nAfter buying and selling thousands of dollars worth of items on Grailed, I recently bought a shirt that was recommended as a \"Staff Pick\" by Grailed.\n\nI received the item and unfortunately for me,  it was not the size or condition as described in the item description. I contacted the Seller, with no response. Some days later, I contacted the Seller again, Paypal and Grailed. I received an instant response from the Seller acknowledging some \"flaws\" and a response from Grailed apologising the item was not as described. \n\nThe seller offers me $30 USD (the shirt was purchased for $400 USD). I stated that is not reasonable.\n\nOne day later, PayPal closes the case in favour of the seller, and Grailed changes my feedback from 2\/5 to 5\/5.\nIs this not against the purpose of a feedback system? \n\nGrailed falsely has changed my feedback, which will not warn other buyers of potential issues with this Seller.","title":"Grailed \"Staff Pick\" Flawed Item and False Overwritten Review.","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-09-11","author":"NVmd","text":"Awful experience with Grailed. I sold a brand new pair of Golden Goose sneakers (username NVmd). The buyer filed a \"claim\" immediately after receiving the shipment saying the shoes were not in the box, which was not only a lie, it was a clearly pre-meditated strategy to get the shoes for free. Grailed did not inform me of the buyer's claim, and before I found out about it from PayPal, Grailed had already frozen my account. Grailed never responded to my email inquiry about this, and I wasn't able to speak to anyone because they don't have a phone number. \n\nGrailed allowed this buyer to literally STEAL a pair of $495 sneakers without providing any proof of what he was claiming! They didn't require him to communicate with me before filing a claim. They didn't inform me of his claim, and froze my account so I couldn't communicate with them once I found out the claim existed. They never gave me a chance to dispute the claim, or even to communicate with the buyer! And even though Paypal overturned their decision to refund the buyer after I gave them the evidence proving the shoes were in the box (photos, tracking info showing the package weight, my long history with eBay and PayPal without any claims like this against me, etc etc), I'm still locked out of Grailed.com. I have no way to communicate with the buyer, and Grailed still hasn't responded to my inquiry. \n\nGrailed allowed this buyer to commit legal THEFT, and even though PayPal ultimately sided with me, I wish I had the shoes back instead of the money. I'd be happier knowing that fraudulent behavior like this doesn't happen again, and that this despicable buyer learns that Grailed won't protect him like this in the future. Not only to did Grailed allow him to commit fraud and theft, they froze my account without even offering me a chance to respond. It's truly disheartening and terribly disrespectful.\n\nUpdate: Grailed posted a response to this review below, but they don't even realize that I can't respond here. It's laughably ironic because I tried inquiring to them directly, but they froze my account before I could do that. I sent an email to the general email address they advertise, but didn't get a response there either. \n\nTo \"Grailed Team\", perhaps you should spend less time freezing accounts and responding to reviews, and more time protecting your users. Also, my Grailed username is listed right in the above review. You must have read this too quickly, just like you froze my account too quickly without having all the relevant details.","title":"Awful experience... no protection against fraud!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-09-11","author":"Monique D","text":"Horrible experience! Seller beware! They do not product the seller! I sold a belt  (shipping is out of your pocket as the funds arent released from paypal until the buyer gets the item) the buyer stated I sold a knock off which was bs and I have proof.  Buyer has the item and was asking for a refund! How does that make sense? How is the seller protected when the buyer still has the item sold ? How does the seller know what they sold is what is being returned? In my case the buyer harrassed me. I opened a claim for a refund as well as a bad buyer claim and this website freezes my account! This site is bs! I dont even get to show my proof that my belt was real! Save yourself the headache dont waste your time. This site doesnt even have a phone number and they take their sweet time to get back to you. The reviews are true this site is all bad and they allow the buyer to take advantage of the seller!! I repeat do not do business on this stupid site! Also never was notified about my complaint against the buyer! I opened up a complaint with the BBB! This is not how you do business!","title":"Horrible experience","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-09-17","author":"Laura Hawkins","text":"UPDATE:\n\nI have tried to cancel my account by emailing both report@grailedcom and help@grailedcom yet both emails were returned. To minimize any miscommunication I am more than happy to screenshot these returned emails. \n\nYour response was highly disappointing. Your website is ridiculous when searching for answers with support. This review was not made out of ignorance. I’ve never had so many buyers waste my time with their ability to submit offers with no obligation to pay. I’ve had instances of fraud twice on your website and one where the seller cancelled to relist the item for more. That sends a very bad message to your clientele. The expectations you have set forth to prevent both are minimal in their efficacy. \n\nIt’s interesting you mentioned sellers and buyers are encouraged to communicate because I have had conversations blocked after a seller shared his place of country with me. It was flagged as trying to sell off site yet if you even bothered to read the message, it sure wasn’t. \n\nLet’s get this straight. It’s not a matter of not spending the time to look through the website for information. Let’s not demean the customer experience. It’s been nothing but issues with this site, multiple times with multiple transactions and I’m not rookie to community selling. \n\nPicture this...\n\nAn eBay-esque site where there’s no seller\/buyer protection, no commitment to buy when bidding, no accessible customer service and posting standards that are literally picked blindly out of a hat. See it? Then Grailed is your site! \n\nAs a seller, this site is a joke. They now require you to include pictures of your user name and date in every picture of your item. People can openly bid on your items and then don’t have to commit to buy. It’s a huge waste of time. The commission is ridiculous and shipping is at the cost of the seller in order to funds to be released. Well that sure deters fraud doesn’t it? Take a page from Poshmark or eBay. \n\nAs a buyer, I’ve come across fraud twice and you can only email them. They’re so slow to respond and don’t even monitor their site even though they have ridiculous terms and expectations for postings. There are so many postings that are inactive and sellers that you will never get ahold of. You’ll have more luck gambling in Vegas than hoping the seller will actually respond to you. I have also had sellers cancel the sale and delist for more. Yep, they allow this. \n\nI have no idea how this site is still around. It’s mission statement appears to be everything you can think to go wrong with a community marketplace. For a 10% commission, it’s great not being able to call you.","title":"Picture this...","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-09-17","author":"Monique D","text":"This site is horrible! They froze my account and banned me from accessing this site! I FILED A CLAIM AGAINST THE BUYER AND NEED THE CONVERSATION AS PROOF! how can you ban me from getting that? What kind of crap is this? Your customer service sucks! They wont let me prove my case to them or paypal! I am going to file another claim with the BBB ! You cant do this to people! How dare you do this ! You are siding with the buyer what about the seller rights? This site is horrible believe me never have I had a problem selling online . This site is not for the seller ! SELLER BEWARE! DO NOT DO BUSINESS WITH THIS SITE! I AM NOT GOING TO STOP UNTIL MY SIDE IS HEARD! IM NOT A DISHONEST PERSON! LET ME HAVE ACCESS TO MY ACCOUNT SO I CAN STATE MY CASE!","title":"DO NOT USE THIS SITE! THIS SITE IS HORRIBLE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-09-19","author":"Nick","text":"Grailed has yet to respond to me in regards to my situation the seller has been inactive for 2 years and I have not recieved any help for about 2 weeks now I want my money refunded","title":"Grailed has yet to respond to me in…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-09-25","author":"Zoe Willey","text":"After listing a rare alternative version of a highly desirable bag grailed froze me account, banned me from the site, and won't answer any of my emails after a weeks time! I believe maybe they thought the alternative version meant it was fake, but I included receipts and close ups and everything! I even have the more popular version of the bag to compare it to and it's the exact same besides the materials! This seems like the moderators at grailed think they know better than they do. \nMy ticket ID is 141202, if you could respond and at least tell me what you're problem is maybe I could prove you wrong??\n\nEdit: Minutes after posting my review they JUST SO HAPPENED to finally answer my emails. All they said was \"Your Grailed account has been frozen for listing counterfeit items\", no specification for which item or anything. Most of my items comes with receipts!! Those that don't have been heavily checked over for authenticity. They're purposefully giving me nothing to work with so I can't submit file a dispute. Lazy lazy staff!!! Is this really the service 10% of my sales are going too? If this is the case, I'll just stick to Ebay,","title":"Randomly frozen, no response! Highly unprofessional moderators","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-09-26","author":"Monique D","text":"Worst experience ever! Do yourself a favor from getting ripped off as a seller and do not sell with grailed! Grailed replies to these reviews but I have yet to hear from them regarding my issue. I still would like to understand why I was completely banned on this site when I am trying to prove my item as being real not fake! I know real! I've done my research and would be more then happy to share that but unfortunately I dont have access.. this is the worst experience I had ever.  This site robs you with their fees plus a \"third party\" fee to make matters worse. PSA : there is no number for customer service! So why even say you have that If you dont even provide that? I havent heard anything back from grailed.  They do not protect the seller so please be aware so you dont end up in this stupid mess I'm in.  All I am asking is that someone at grailed ACTUALLY LOOKS INTO THIS AND DOES SOMETHING INSTEAD OF TALKING A GOOD ONE FOR SHOW!  Reach out to me I know you have my information! Take me off of your banned list so I can access the messages between me and the buyer.. I dont and will not ever do business with you so dont worry about that. BACK UP WHAT YOU SAY AND PROTECT ME THE SELLER AND GIVE ME ACCESS TO MY ACCOUNT SO I CAN SHOW YOU AND PAYPAL THE CONVERSATION THAT TOOK PLACE PRIOR TO THE SALE OF THE ITEM! I AM TIRED OF SOUNDING LIKE A BROKEN RECORD! WHY IS THIS TO MUCH TO ASK? WHAT KIND OF BUSINESS ARE YOU RUNNING HERE? IF YOU ARE READING THIS REVIEW LISTEN TO ME AND FEEL FREE TO CHECK OUT THE OTHER POOR REVIEWS DONT MAKE THE SAME MISTAKE I DID! THIS IS NOT THE PLACE YOU WANT TO SELL FROM AS THEY DO NOT PROTECT TGE SELLER! LAST THING.. I WOULD LOVE TO SEE WHAT MAKES YOU GUYS ABLE TO CALL MY BELT A FAKE! OR ARE YOU ONLY TAKING THE BUYERS WORD? CUZ I HAVE PROOF PLUS I DID MY RESEARCH .","title":"THEY DO NOT PROTECT THE SELLER DO NOT DO BUSINESS WITH THIS SITE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-09-27","author":"Najib","text":"Just a heads up that my ticket is awaiting someone to read it. \nMy ticket ID: 149166\n\nI sent my phone number to someone through the app and I must've gotten automatically flagged. Won't happen again. I love this platform! Getting unfrozen would make this a 5 star :)","title":"Mishap","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-09-27","author":"Eraserheade","text":"Grailed is a cool app and I’ve purchased a few things off of the app , selling is just the problem for me . I’ve sold a pair shoes 8 days ago and they were delivered 4 days ago and my money is still on hold . I contacted pay pal and the hold is on Grailed’s end. I’d really appreciate if my problem was solved . My account name is lilescott1 and email is lilescott1 @ Gmail.com","title":"Money is on hold longer than it should be","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-09-27","author":"Joseph Walker","text":"A buyer approached me to purchase 4 items from my listings. He asked me to ship all 4 items together to save on shipping. He sent me an automated bot answer for Grailed stating that I could add the tracking info under “other” shipping method since Grailed won’t allow you to add the same tracking number to all items ordered by the same buyer, going to the same destination. That method did not work, and was a lie, by Grailed and the buyer. So I tried to contact Grailed numerous times, and they would not talk to me, just kept forwarding bot messages, saying to contact PayPal and add tracking info. They won’t allow me to add tracking info, since all 4 items purchased from the buyer were packaged together and shipped to the same address. Grailed stole my money, and the buyer stole my merchandise. This is straight up theft, and Grailed allows people to scam and steal from sellers. Don’t trust this company. They don’t care about customers, and allows buyers to rip off sellers, by sending misleading bot messages that are entirely false and untrue. You cannot add your tracking number to “other” if it’s the same tracking number for multiple items going to the same seller. I’m contacting the Better Business Bureau regarding this scam operation and theft going on at Grailed.com","title":"Grailed Allows Buyers to Steal with Shipping Loopholes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-09-29","author":"Jake","text":"I've been using Grailed for the past four years and it has been going smoothly. I recently noticed that you guys have been doing a lot of current changes to the site through updates and with this latest update there is now a glitch when you add in the tracking information when you have sold an item. I think that it is quite annoying and inconsistent, when the site ran much more efficient without all these updates. Whoever is the tech support for the site needs to fix the problems immediately, as I assume other people are dealing with the same issue...\n\n\nAlso, I have over 650 listings on my account and there isn't any easy way to find a particular item. I have to scroll for hours to find a single item and that is not the most efficient way to have things going. \n\n\nThey need to include a SEARCH engine within your personal closet so you can search with ease and find which items you are looking for without scrolling through every item for hours on end. This would be a BIG fix for the community and I believe the Grailed Team should pay attention to these concerns and put something into affect as soon as possible.","title":"I've been using Grailed for the past…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-10-01","author":"Jon Marshall","text":"Always easy to deal with, issues come up and the Grailed team takes care of it. Thanks!\n\nWow, how things change. I will never use this platform again. \n\nAfter a Grailed employee helped me with an issue I was prompted to post a review. I'll admit, the issue that the employee helped me with was resolved and it was a good experience. Since then i have had a string of very disappointing experiences and the Grailed Team has been completely unresponsive, I've had several items that the sellers refused to ship, even after payment was made, I had to go through PayPal to get refunds, huge waste of time.","title":"Easy to deal with (not recently, though)","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-10-03","author":"Muhammad Hafizuddin","text":"Hi Admin, \nThis is my account Grailed @threefourthree.\n\nI'm really sorry for relisting inauthentics item on Grailed. My acc being Frozen. My rating going 5 star btw. Can i get my account back? Because im working full time on Grailed. My salary based on my sales in grailed. I'm really sorry again. And i will not relist inauthentics item again. Please... Im really sorry.","title":"Hi Admin, Need my acc back.. Sorry.. :(","stars":3,"location":"MY","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-10-04","author":"Marina","text":"Grailed froze my account because of 1 bad review with false accusations (even through all previous reviews were 5 stars) without even reaching out to me first or give me a chance to prove that customer was absolutely wrong and deceitful!  It's been a week since I provided proof of original receipt to Grailed support and the correct description of item was posted on Grailed website and no response.  No number to call at Grailed support!! I spent countless of hours building by website store at Grailed and have proof of purchases for all merchandises and all of my items are 1000% authentic.  It is very disappointing that my account was suddenly frozen without giving me a chance to prove that Customer was wrong and now a week goes by without any response from Grailed to my email where I provided evidence and receipts to prove 1000%authenticity.  How are you protecting Seller's rights on your website who are the ones working hard to build a business with you?   I take my reviews very seriously and worked very hard to grow my business.  So many hours wasted to list my items at Grailed website, which I could have spent with my family if I only knew that Grailed has very poor or practically no customer support and will side with 1 LYING customer.  No other company has even treated me in such an unfair manner, and I would never recommend to anyone to waste their time to support Grailed business model.  Definitely contacting Better Business Bureau next to advise of Grailed false advertisements and disrespectful treatment of the  participants.\nTicket ID #145615","title":"NO SELLER RIGHTS! NO RESPONSE!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-10-05","author":"Darren Wang","text":"Worst customer service team I’ve EVER seen, they froze my account for “inauthentic” item I sold HALF A YEAR AGO, I asked for proof that the item is fake and provided my proof that my item was real, all I got from them is an auto response email basically telling me “yeah your fake go fuk yourself bye”. Will never sell or buy ever again from this garbage app.","title":"Worst customer service team I’ve EVER…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-10-07","author":"Marina","text":"Ticket ID #145615\nGrailed Support - That is a lie that I ever had a previous account at Grailed nor do I have a single supreme accessory on my webiste store.  And since I have spent a minimum of 500 hours building my store, may be you should reimburse me for all the time spent and advertising your website to all my friends and family.  Grailed support does not exist and does not provide any evidence or explanations unless there is a complain about you.","title":"Ticket ID #145615","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-10-09","author":"Aaron Dominguez","text":"Ticket #162220\nI love this platform I make all my income using your website, I just had one TOS violation for spamming didn't know that was in the TOS. Will never do again my emotions got the best of me. Account name is thrftdfindz had this account for atleast 2 years, 300+ transactions, and 150+ positive feedbacks.","title":"Ticket #162220","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-10-10","author":"ZhilinDA","text":"Ticket number 162839\n\nHi, I have been selling on Grailed for about six months and I have a good 5-star rating. Although I sold a few things, I have good reviews. My nickname is ZhilinDA.\n\nI sold the original Balenciaga sweatshirt and when it arrived, the buyer (Kjartan Nilsen) immediately wrote to me that it was not original, because his friends said so and comments on the Internet on some sites and opened a claim for a paypal.\nMy account was immediately frozen, I wrote in support of Grailed and they answered ....\n\n«Hi,\nYour Grailed account has been frozen for listing counterfeit items. At Grailed, we value the trust and safety of our community and we reserve the right to freeze accounts that are inconsistent with our expectations (grailed com\/about\/terms). For the safety of the community, we're unable to reinstate your account.»\n\nThis is an automatic machine response.\n\nI agreed to return the money to the seller through the dispute on the paypal, but he is still silent and has not sent me the sweatshirt back!\n\nFor his part, the Grailed just froze my account and politely sent me to hell! Without any evidence! Please understand this situation and get at least a little protection for sellers, and not just help a buyer who can cheat !!!","title":"My account was frozen, no protection for sellers! Please return your account back.","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"},{"date":"2019-10-11","author":"Willy seaman ","text":"It was really good for awhile but then a seller that I was trying to buy a pair of shoes with asked for my phone number. He asked for my phone number because I had requested a photo of the box label of the sneakers and he asked for my number so he could just send it to me. I wasn’t sure at first but then I decided to give it to him, once I returned to my grailed app I was unable to see listings or messages. Please help!! I had no idea that wasn’t allowed.\n\nMy username is Willy seaman","title":"It was really good for awhile but then…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=26&stars=1&stars=2&stars=3"}]