[{"date":"2021-02-22","author":"Ricky","text":"Grailed I've been banned off you website for absolutely nothing, here is my username RIICARDI I was accused me of uploading unauthentic Chromehearts Rings nowhere does it state that having a receipt is mandatory! I've been a seller of grailed since 2016 with 100 successful 5 star review a and over 130 transaction. I've never had any intention to tarnish my account over some petty rings. You guys really think highly of you client!. SMH I recall having a bad experience where a seller ripped me off and u did absolutely nothing about. Now here I am after 4 months writing reviews after reviews trying to get help trying to reinstate my account because I understand sometimes there's mistaking judgement, after all this time contacting your help service trying to reach out here and it turns out you guys are completely ignoring me. I understand at this very point in time that you guys are full of Shot. It isn't my fault that your moderators are clowns and can't Authenticate everything becuz of lack of experience, okay yeah but punishing me with out any proof is B.S. I'm also following up with my lawyer regarding this, it is illegal to remove someone without any history of such scamming or any proof of any unauthentic items. I feel discriminated against also.","title":"Discriminated against by grilled and ignored","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-02-23","author":"raketa shop","text":"I don't know whats happened, my account has banned \"for fraudulent activity\". What? They even did not explain. \nMy account - raketashop\nJust tell me whats going on!","title":"banned...","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-03-02","author":"Wiktor","text":"I have been banned while customer is satisfied from the purchase. I have sold only one thing: a paper bag! Definitely not recommended and very stressful. Moreover, Grailed support is literally useless.","title":"Worst online marketplace I have experienced","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-03-04","author":"Kaylin P","text":"They keep deleting my listing. I change the photos around and still deleting without any communication. Its so annoying","title":"They keep deleting my listing","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-03-05","author":"John","text":"Bought two hats on Grailed and did not like them so tried to resell them but they removed them and said they were fake .\nI emailed them and asked why they had sold them to me if they were fake , No reply as yet\nAll very strange, I wont be spending another penny with them,","title":"Bought two hats on Grailed and did not…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-03-06","author":"Mustang","text":"They keep letting people who sell replica\/fake shït get away with them as long as they’ve got a huge customer base.","title":"They keep letting people who sell…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-03-06","author":"alqapone","text":"Worst customer service ever. They banned my account for selling an off white sweater bought at Flannels in London, which they claim is fake. When I appealed for an unban, they responded with no. Avoid this site","title":"Worst customer service ever","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-03-08","author":"Brad ","text":"Be aware of this seller \n\nJfoxxnotrades\n\n(Europe -Germany)\n\nShips to USA as he states \n\nHe is indeed a scam artist \n\nI purchased Prada shoes from him \n\nAnd he asked for my phone number (do not give him you’re information and don’t deal with him - scam)\n\nSo I gave it to him\n\nWhere he gets very rude and swears at myself \n(Very bad language and I didn’t do anything)\n\nThen he emails me on my personal email from his personal email \n(Nothing to do with grailed)\n\nAnd states to send him the money again through friends and family on PayPal\n\nAnd that is the only way\n\nI have been through this before and it is the scam artist easiest trick\n(And favorite)\n\nTo take your money and run \n\nNow I have to deal with grailed \n\n\nBe aware of this seller \n\nTimur Gapurov \n\nMail : Timur .lexus@gmx. net\n\nGrailed seller name : jfoxxnotrades","title":"Be aware of this seller","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-03-08","author":"Alexander Lang","text":"I try to buy some pants and I have to sign in so I do so and it says creating account forever and it never finishes loading and I can’t fix it someone please help and I can’t find grailed support please help","title":"I try to buy some pants and I have to…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-03-11","author":"Gregory","text":"Moderators Grailed, My username is GregoryVash. Yesterday I wanted to sell jeans on your site for the first time. I read all the rules and did everything right, but on the same day in the evening, I found that my account was frozen. I did not violate and do not intend to violate the rules of your In the end, what's the matter? This situation is absolutely not normal, I insist on unfreezing the account! If you need to confirm the data, I will gladly confirm all your personal information. If the account is not unfrozen, I will ask all my friends to stay away from your trading platform, since your actions are suspicious and not reasoned.Please reply to this letter! Once again I ask PLEASE UNFROZEN MY ACCOUNT, THANKS!","title":"Moderators Grailed","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-03-16","author":"Coll Fourtyone","text":"Hi,\nGrailed hasnt responded to my email for days my ticket number is - 821670\nMy username is jeremycollective4008.\n\nI cannot provide the link to the listing because you have frozen my account. I can no longer log into my account nor can I view any previous listings. I'm very disappointed that grailed has frozen my account claiming I sold inauthentic items yet all the items I've sold have been authenticated by you guys. Also I do not claim some of my items as designer as this is a platform open to sell not only designer but cheaper alternatives for those who can't afford them. All of my sold listings has been shipped and yesterday I buyer wanted to get a refund on my Stefan Cooke strap even though I have TOLD HIM before buying that I wouldn't be able to ship it out due to me not being home. He agreed and then later decided to claim for a refund which I refunded in full. Then this morning I just get this notification saying my account is frozen without any further explanation, yes you have a protection system but how am I the seller not being protected and having my account frozen at will fair? My funds are on hold, its been 1 month yet I've shipped all my items and included tracking details. Please resolve this issue as I did nothing wrong and I'm at risk of losing my grailed account I worked hard on building alongside the money that I've earned through your website. You guys take money from it and its a win win but in this case I really feel like I'm being mistreated. Please respond soon.\n\nAlso 4 transactions on my grailed the payments are still “on hold” even after almost a month after I’ve provided shipping and tracking info. I have all my receipts from the post office, now that my account is frozen how do I know IM PROTECTED BY YOU and can be sure that I get my money back? Please resolve this.","title":"Frozen","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-03-17","author":"Ricky","text":"Grailed is some trash they take to much from your sales and give you to much crap when talking to anyone even if it's about the sale. To strict,and banned and freeze your account dailey. Trust me save your self the headache they have no integrity what so ever. I've been kicked off for months for nothing. Even with #130 5 star transactions, 5 star reviews I keep uploading photos of my chromehearts rings which took time doing because they want clear photos and once I uploaded clear ones they kept removing my listings which takes time making! they didn't have experience enough moderators to verify my rings so they kept taking them down and I kept reposting them which previously I sold three of them to buyers to a completely satisfied with them it's not mandatory to have a receipt shown and given all my good history they took none of that for granted and banned me for Life and I've been writing them for 8 months and they just ignore me so","title":"Grailed is some garbage inexperienced authenticator's","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-03-18","author":"Agus Supriyono","text":"Hello Grailed team\nHello Grailed team, My username is TokoBagas2nd. Yesterday I wanted to sell Supreme Hoodie on your site for the first time. I read all the rules and did everything correctly, but the same day in the morning, I found that my account was frozen. I received an email saying I was selling replica goods, I really do not know if it is a replica and have no intention of breaking your rules. I insist not to freeze accounts! If you need to confirm data, I will be happy to confirm all my personal information. I am very sorry and promise to be even more careful in selling grailed goods. Once again I ask PLEASE DO NOT FREEZE MY ACCOUNT, THANK YOU SO MUCH!","title":"Frozen","stars":1,"location":"ID","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-03-21","author":"Vadim","text":"frozen account for no reason, terrible work of the moderators, exhibited only my photos with labels, where it was clear that the thing was original, do not waste time on this site.","title":"Frozen account for no reason","stars":1,"location":"LV","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-03-23","author":"Tracy ","text":"NEVER buy from this site. I purchased 3 pairs of Yeezy’s from the same seller. Turned out all to be FAKE. I had no assistance from Grailed for refund. Dealt directly with PayPal (which was nearly impossible) for refund. I only received the initial payment from seller once shoes had been returned. No shipping costs refunded. I was out $80. NEVER AGAIN!  Grailed responded saying the seller has been banned from the site. Little too late","title":"NEVER buy from this site","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-03-31","author":"Jada Chen","text":"It took me HALF A YEAR to get my money back from being scammed after endless emails with no replies for up to months. I was left to contact PayPal, who made it extremely difficult and infuriating to get my money back. Actually verify your listings- I was able to post just a screenshot of a $350 hoodie and had it “authenticated” the next day. This was one of the most frustrating experiences where there was a lack of communication and respect for my time, and I wasn’t even able to get my full shipping money back after 6 months of stress and nearly $500 on hold...","title":"It took me HALF A YEAR to get my money…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-04-06","author":"Dee","text":"No confirmation email no reply from seller this is the Worst experience ever scammed out of 200 stay away from this site if you don't want to be scammed","title":"Worst experience ever scammed I will…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-04-07","author":"NovaNINEk","text":"Some of moderators(who rejected listings with authentic clothes) are incompetent. I've published about 20 items. With each rejection, while publishing all these items, I've got warning, upon reaching 5 account account has been banned.\nSome items that were rejected before were published later and tagged with ''Authentic'', which is true. However I still has warning amount and when I've published few more listings I've got last rejection and ban on my account. \nTrying to communicate with support, which is ignoring me for 6 months, not responding at all. \n\nDont know is everything that bad, but I'm upset about such service..and I wish Grailed to get better moderation and support who is involving in customers issues. \n\nMy username is Nova9k","title":"Incompetent moderation and poor communication with support","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-04-10","author":"Brian Brett Goldner","text":"The worst seller experience I’ve ever had.  I spent 2 years building my business online and gaining credibility & good ratings in the seller\/buying community.  I had a 5 star seller rating and held all 3 of their seller badges including “Trusted Seller”. All that comes crashing down in a moment, without justification or cause.  My account was blocked without cause and they refuse to provide and information and won’t return my email as well as there is no phone support.   Now, I have over 10 items currently in the mail worth over $3,000 on the way to buyers and have no access to communicate with my buyers.  Some of the buyers noticed my account ban and have reversed charges before even getting the package.  Now I’m screwed because I have no way to get my items back and I never got paid.  These are thieves and crooks of the highest order.   Now I’m out over $3,000 in losses because of the incompetence of the Grailed team.  \n\nI operate call centers across multiple industries.  A team of 20-30 well trained monkeys could do a better job then the current team.  I mean it is beyond me the abhorrent nature of this company, just toxic.  You can tell that this is a company of young people without proper business experience and without any real training.  The systems, algorithms and protocols this company has is a complete joke and it’s shocking to me how they have made it so far.  I guess it’s the fact that they do have a lot of rare items,  but that is the sellers that are special, not the platform.  \n\nI implore you to STAY AWAY from this company at all cost.","title":"STAY AWAY! $3,000 gone! Worst experience","stars":1,"location":"BE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"},{"date":"2021-04-11","author":"Y Fong","text":"I purchased a sweater that was 'digitally authenticated' by Grailed. The pics and description looks legit (the seller said that he bought them from the local Neimans Marcus), but turns out the US XS-sized sweater (marketed and sold as XS sweater) is actually clearly a knockoff sweater from China (I found a hidden XL label). Aside from this super obvious proof, the material and smell of the sweater is completely off as I am very familiar with these Chinese knockoff sweaters. For people who don't know, many XL labelled Asian-sized Chinese knockoff sweaters fit like a US XS,S,M etc. depending on the item.\n\nSo, with the solid proof of a tagged XL label, I sent many photos to the customer support team (the person who responded to me had the first name Kevin) to inform them that this item is 100% not authentic. However, after several days, they simply got back to me, saying that it is authentic. When I asked them repeatedly how do they explain the XL tag (I get they can't really tell things like material from the photos), there was ZERO answer on that, and they kept avoiding that question with zero sense of responsibility. There was no explanation why they stand by it being authentic.\n\nThis incident makes me think, if even with a SOLID 100% photographed proofs with the XL tag, they can't even do their job right and take stern action, how would they be able to tell other fake items apart, that are made without obvious flaws that cannot be photographed such as this?\n\nLong story short, Grailed \"authentication services\" and \"zero tolerance policy on fake items\" is complete nonsense. I am sharing this story here so buyers and consumers can be more aware and think twice before using Grailed. Seems to me that Grailed is just being completely irresponsible, lazy, and don't want to deal with issues like these. And know this, Grailed, by being complacent and lazy, you ARE supporting counterfeit goods.\n\nTLDR: Grailed is a scamming company that support counterfeit goods. Their \"digital authentication\" and \"zero tolerance policy\" towards fake product is complete BS. Don't use them.","title":"Grailed (scam site) digitally authenticated a 100% fake item I purchased, then refused to take action after customer support is contacted","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=6&stars=1&stars=2&stars=3"}]