[{"date":"2020-07-13","author":"themostwanteddd","text":"Good afternoon. Today I received a freeze on my account, the nickname themostwatneddd. However, I don't understand why. Now I will give arguments. It all started when I put out a Dior saddle bag. A few days ago, all the photos were taken clearly and in accordance with the rules. Then they sent me two absolutely absurd letter, with a request for more photos. And then, a warning was issued. I have all the evidence that the thing is original. I contacted a Dior representative in my country this morning. We talked to them about this issue and they told me that they can not help and also do not understand the reason for these letters. My account already has transactions, the buyer is happy and never wrote about the fact that it is a fake. All things I sell exclusively my own, which were in use. Please understand this situation and give me an answer for what exactly I was blocked. I apologize for my English, I translated this message with the help of a translator. Thank you in advance. I will wait for a response to my email, I also sent an email to support.","title":"I don't understand why they blocked me","stars":3,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-16","author":"Gabriel","text":"I have been in Grailed platform since 2018 and have never had problems buying things from there, but after a few months I decided to sell some designer clothes that cost quite a lot of money, anyway I created the ads and I put the ads in grailed, as usual it takes up to 24 hours for the ads to be published publicly, but in my case they were never published, my ads were removed from nowhere, I do not know what is going on until I found out that Grailed sent a message to me who claims that my clothes are fake and that I break their rules, how the hell are my clothes fake if I have put pictures on labels and all I have to prove that my clothes are not fake? the logic does not exist in their world, I am very frustrated that I unfortunately can no longer keep changing my ads and do everything to prove that my clothes are not fake but genuine, I have tried to publish my clothes five times now and still they send messages that my clothes are fake, therefore I do not rate their customer service good, worst staff, believe me.","title":"My listings keep getting removed before they were even published for no reasons?","stars":1,"location":"SE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-17","author":"Alyssa A","text":"Bought a lock necklace that promised a key in the description. Seller told me after I received the item that there was never a key. I politely ask for a swap, he tries to squeeze more money out of me. This goes on for days. I almost just paid the money but then I was like “why am I paying for his mistake?” I ask for a refund\/return and he finally offers the swap instead but I’m done. I’m upset I even have to deal with this and I don’t want to go through it again with a swap. I complain to the website about him. I also write a review. Turns out he also works there (!!) and deletes my honest review. No one has answered my customer complaints either. Then the seller replaces it with his own 5 star review through my account!!! I would never give 5 stars for this experience so why is it on my account & its unchangeable? Unethical. Can’t make this up. I just want to warn other people. Avoid this site.","title":"Employee Changed My Review","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-17","author":"Russell Tony Hannan","text":"An utter disgraceful experience on many occasions and talk about FAKES this site is littered with fake items. The customer service is the worst I have encountered in 30 years of living and shopping. \nIf I was to advise anyone I would say STAY WELL CLEAR of this scam site or be prepared to get robbed.","title":"An utter disgraceful experience on many…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-18","author":"themostwanteddd","text":"After the appeal, I was still blocked. I think it's discrimination because I'm from Russia. Guys, well, it can't be that a Dior boutique in Moscow says that the bag is authentic, and the team on some site-the opposite!)) And all sites absolutely approved the ad, except Grailed. It's very funny","title":"Discrimination","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-19","author":"Matthew","text":"I'm a regular user of Grailed, and I can personally express, 'hands on', how terrible their authentication service has become. I purchase a pair of Jordan 1 Retro High Off-White UNC and according to their emails my pair is inauthentic. This happened twice before where I've had to send receipts to grailed in order to prove a point, which ended up going in my favor as the listing which they allegedly marked as fake is still up and listed till this date. I really hope the team can see this and assist me with getting my listings up, but at this point i might aswell move to Bump or Goat.","title":"Falsely claiming EVERYTHING is inauthentic","stars":1,"location":"MT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-21","author":"Harpaganika ","text":"This is ridiculous, you blocked my accounts where I had almost 200 successful transactions, not to mention that I had over 1,500 items posted on your platform.  In addition, I cannot ask for an explanation!  I am not talking about how many new users you have gained becouse of my publicity.  My account: Harpaganika","title":"it can not be worse","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-21","author":"Danverkart","text":"I tried to add the authentic Jordan 1 Retro High Purple 10.5 US to my profile for what Grailed wrote to me that the pair is inauthentic. I couldn't believe it, because the pair was bought on the official Nike website (I have all the supporting documents). I immediately added a pair again with the same photos, they replied that they needed more photos, I did everything they asked and added another photos. The next day they wrote that they needed more photos of the box, I added. Then again the next day they wrote that they needed more photos again, I added for the third time. And then I waited 24 hours for them to add my listing. As a result, today I woke up and saw that my account is frozen. I am ready to send at least a MILLION additional photos and all supporting documents of the purchase of this pair on the official Nike website, to prove that the pair is AUTHENTIC.\nI have a 5 star review for a $550 sold item! And in the coming days I should have one more perfect review.\nThe most unpleasant thing in this story is that two days ago I sold a Stone Island jacket and yesterday a pair of Yeezy 380 Mist Reflective and I don't know how to explain the customers that the account was deleted by mistake.\n\nUsername: Denverkart (Edited)","title":"Frozen for AUTHENTIC Jordan 1 Purple","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-22","author":"Bill","text":"So, Grailed just froze my account without even warning me! Even tho I’m a member for 3 years now and selling only high end items!\n\nThe excuse is that I sell counterfeit items even tho I’m not selling any!\nI asked them which one is counterfeit and they won't even discuss it or let me know!\n\nI have 80+ sales and like 100 transactions, isn’t it weird that none of my customers had any issues and always leave me a 5\/5 star feedback?\n\nMaybe is the fact that I swapped PayPal addresses with my brother’s who is maybe selling fakes?\nI don’t know! \nBut I asked him and I saw it by myself as well that he didn’t have any disputes or anything.\nIf that’s the case you have to believe me that we are different persons and we don’t associate with each other’s clothes.\n\nI swapped accounts because I recently noticed that he had access on my PayPal and he did some transactions on my end without even knowing!\nThus I changed password on my PayPal account as well.\n\nOn my page I had like 15$k worth of clothing and most of them were brand new Gucci and balenciaga items with tags from store and all.\nI wouldn’t just risk to lose all my effort and time by selling fakes.\n\nThis is my business for so long and I’m a trustworthy person as my page and reviews show already!\n\nI’m kindly asking to understand my situation and revaluate this matter since I've been for 3 years a user and I must say that you treated me so badly for my service and amount of money I gave you all these years!\n\nTicket ID: 524465","title":"Grailed froze my account after 3 years! They won't even bother to help me to resolve issue!!!","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-23","author":"Matthew","text":"Every listing I post is taken down and falsely marked as inauthentic. \nI have multiple sales through grailed, I also have multiple friends who have been long term users with hundreds of sales on the platform. Since they have a team of penguins legit checking our shoes, I'm simply going to stop using their platform. They published my listing as soon as I sent them a receipt of purchase, so clearly they admit they're doing something wrong.\nI am tired of this crap considering I used to love this platform, it's a shame we're all going to stop using it.\n\nIf you want to check my account @grailed, my email is info at lanemo dot co","title":"Penguins are legit checking my shoes.","stars":1,"location":"MT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-24","author":"Kishok","text":"Username: Kish77\nANSWER ME GRAILED!\nHi Grailed, my account was recently frozen for \"spamming .\" I got my vlone item as a gift and i never knew it was inauthentic or else i wouldn’t have sold it. You guys never sent me a email stating if it was fake therefore i listed it thinking it was authentic. Now you guys froze my account without even letting me know or gave me warning the item was inauthentic. So how can i learn something if no warning was given, it was a gift and i would never sell inauthentic items on purpose. Please revise ur decision, i beg u. I never spammed anything on grailed and I have good reviews and im not sure why i got this email. I never even got a warning and what do you mean I was spamming? I always followed the guidelines on grailed and never did anything wrong to get frozen. Please consider your decision and lift my ban, as I have multiple things pending that need to be shipped and I need to track my items I purchased. Im going to lose 1000$+ if my account isn't reinstated. You can check my reviews and i never encountered a problem with anyone, so im not sure why my account is frozen. I never got a warning or anything, so please give me a chance to use your service again. LISTEN I DONT LIST FAKE ITEMS AND U GUYS NEVER EVER SENT ME A WARNING EMAIL SO HOW WOULD I KNOW !","title":"Username: Kish77","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-24","author":"Bill","text":"Ticket ID: 524465\n\nYou stated on my previous review that I had association with an account that sold fakes and both under my full name.\nThis is because my brother was under aged and I just gave him my permission to use my name.\nThat’s another reason of me swapping accounts!\nWould I be so stupid to just ruin all my effort by having two accounts and in the one selling only high end brands and on the other counterfeits? Come on...\n\nIn my account I had only high end authentic items for 3 years and now you’re telling me that I can’t use your website not even create a new account by my brothers fault? \nAll I ask is some understanding for my situation.\nYou could just ban the account with the counterfeit items instead.\nI think it’s the fair thing to do, isn’t it?\n\nAll I want is the chance to prove that I’m not a scammer!\nI deserve this after 3 years of being an active user!","title":"Follow up review for frozen account after 3 years of service and not understanding my situation!","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-25","author":"Milo Danilovic","text":"RE: request (533908)\nMy account was frozen for no reason. I contacted Grailed and they replied :\"Your Grailed account has been frozen for exhibiting patterns of fraudulent activity. At Grailed, we value the trust and safety of our community and we reserve the right to freeze accounts that are inconsistent with our expectations. Your account is permanently frozen and you will not be allowed to create any future accounts.\" (end of quote). This statement\/ accusation is completely false and very insulting for that matter. This is all wrong since I only used the site to buy 2 items and everything was good with transactions, I paid and received these two items and were happy with purchases. None of things that can be remotely fraudulent were done, I never sold on Grailed, never listed anything, only 2 very simple transactions, paid through the site. If someone points gun at my head and says \"tell me why possibly could you get banned on Grailed or I will shoot you\" I would not have any idea what to tell. This is an insane experience. Looks like my account just randomly got frozen for no reason.","title":"My account was frozen for no reason","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-26","author":"David van der Pol","text":"Grailed account: TheMall\n\n\nI have a very similar experience with Grailed as mr. Lamoureux. I have been selling Grailed products for over 3 years now. I have around 20 transactions and always have very satisfied customers (5.0\/5.0 rating). I recently made a mistake by selling a Dior T-Shirt that I didn't know was inauthentic (as explained very carefully in my very long e-mail to Grailed). I had no idea.\n\nIt makes me sad to see that they literally didn't even took the time to write me back and to me it seems that they don't care at all about their sellers. This system isn't working. \n\nSelling and buying clothes have been such a big hobby for me and also a part of my income for the past few years. I truly hope that the Grailed team can reconsider my request and look into my account e-mail. \n\nThis is just crazy.\n\n\nKind regards,\n\nDavid","title":"Grailed account banned no reason","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-26","author":"Riicardi","text":"I'm trying to be scammed by a buyer on your platform I'm a 5-star 60 review seller on grailed I currently sold a pair of Yeezy V3 700 which were brand new from stockx kept the receipts advertised everything honestly on grailed the buyer evidently purchase them on go where I had them listed as well I even canceled the sell on goat to sell them to him on grailed your platform for a better price and now the buyer is complaining that they aren't authentic I emailed him the receipts from stockx his email address I tried to keep it vague and discreet all grilled because you guys take that stuff seriously and I didn't want to be frozed, I told the buyer to the gym check them even though I know they're authentic he's very disrespectful and is trying to scam me I can only imagine how many different ways she can do that but I'm not going to let that happen I was honest on my listing I'm not going to tarnish my reputation over some jerk who wants to rip me off and for anyone who sees this who is in an employee of grailed don't do business with (Servino0429) grailed please investigate this buyer I have further information if need be","title":"Trying to be scammed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-27","author":"Mike1097","text":"This is the first time I have ever gone to the trouble of actually writing a review (good or bad) on anything, anywhere.  Just not my thing, but that shows my level of frustration with the level of comms that you get with Grailed reviewers\/moderators. Been trying to post like 6 of my kids used clothing\/shoes for a month and just had them pulled yet again.  First time I got zero response and after going through multiple help sessions they said I needed to add a card with my username, the date, and the site name.  Did that and reposted...they just pulled them all, though I did get emails on SOME as to why.  One because the genius apparently didn’t see the card even though it was in every single photo I uploaded and one because they want more photos (of what I don’t know as I had 5 there and there’s only so many ways to look at a shoe).  The others were apparently pulled by the same reviewer I had the first time because I got nothing from them as to why.\n\nI hope they treat the big box sellers better than the little guys or they’re in for trouble when a decent competitor hits the market.","title":"Review Team Comms are Awful","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-28","author":"Kaitz Alekhno ","text":"Hi Grailed!\n\nToday I received a notification that my account was frozen, I cannot log into it. My friends received the exact same message at 1 and the same time 5:59 PM! A system error has occurred! Please see what happened cuz I’m  very worried about my account. I have a lot of sales and a lot of packages that have not yet arrived to buyers, have questions. I have 45+ transactions on Grailed, we are familiar with Nico communicated with him, one of the best Grailed moderators. Please help me figure out what to do. Help me please!\n\nMy username: luckyluckylucky","title":"Account has been frozen. Error","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-28","author":"Elizaveta Derzhavina","text":"Grailed account: milkwithslz \n\nHello dear Grailled team\nIt has been about a month and a half since my account was blocked. But I still can't let go of this situation, because it is completely incomprehensible to me. For two months I posted quite expensive items and successfully sold them. But in the last month, my items began to be deleted due to \"inauthenticy\". When I began to receive these messages, it was a shock for me, cause all the things that I posted went through a legit check and could not be inauthentic. I asked you to check my items again, cause sometimes it reached the point of absurdity, because I posted a photo with a receipt (like Louis Vuitton's bag), but you didn’t pay any attention :(\nPlease pay attention to my reviews on my grailed's account! I tried to help every customer and answer their questions! The end result of the sale has always been important to me!\nWhen you deleted my account, I had pending transactions, but that did not stop me from finding them on Facebook and continuing to communicate with clients.\nPlease, I put my heart and soul into this account, I would really like to return it","title":"MY account was frozen for no reason","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-07-29","author":"Starway","text":"Hey. I am a new user. Yesterday I posted my first product on the site. After a couple of hours, I could not get to the site. Logging in from the phone, I saw that my account was frozen. I have not received any message in the mail and do not understand what happened","title":"Nickname: starway","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"},{"date":"2020-08-01","author":"Sergey","text":"A few days ago I decided to use the site to sell my Adidas x Calabasas pants. After posting, my account was blocked. The site administration told me that my account was blocked due to fraudulent activity. I have never had any other accounts and this was my first experience with this marketplace. I found community grailed on a social network and found many similar problems. All new merchants receive account blocking and the administration says that they are scammers. Tell me what you need to do to sell a product on your site?","title":"Account frozen","stars":1,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=13&stars=1&stars=2&stars=3"}]