[{"date":"2020-08-02","author":"Se11Mark","text":"I am a novice seller on the grailed website, a few days ago my account was blocked because I listed \"fake Balenciaga jacket product\", but it was the original I listed all the photos that you can immediately understand that this is the original, I do not sell fake products. Please review the ad and help me because my account was blocked by mistake. Thanks.\n\nmy nickname: Se11Mark","title":"the account was blocked by mistake","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-03","author":"Ong Weisheng","text":"Sold a Junya Watanabe jacket to a buyer in the USA.\n\nPackage took longer then usual to deliver due to the pandemic but buyer requested a full refund from Paypal despite me providing the tracking number and website and mentioning that there will be a delay due to the pandemic.\n\nDespite multiple tries, there was no reply at all from the US Postal Services when my local postal service contacted them.\n\nWhether the parcel reached the buyer or not, I am not sure but it seems there are zero protection policies in place for the sellers on Grailed, meaning the buyer could've gotten the item but claim otherwise.\n\nGrailed did not even bother to reply me when I enquired about this issue and it's been around two months since I submitted the enquiry.\n\nI think Grailed should implement fairer policies that can ensure the safety of both buyers and sellers from scammers.\n\n--\n\nTo Grailed team, please contact me via my account name Wei. If it's possible. I'm not about to give my email address out in the open. Thanks","title":"Zero protection policy for Sellers","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-04","author":"Martins","text":"I have been selling on grailed since a year ago. There was no problem. I considered Grailed to be a safe marketplace. When this pandemic started, I had 2 cases that were closed with a refund to the buyers, due to delivery delays (total amount 170USD). After a while, I tracked the packages and saw they were delivered. I have contacted grailed to help me, and had no response.\nTwo days ago, grailed froze my account. I have 70 positive feedbacks and 1 negative, from a buyer who claimed I was a scam, due to delayed delivery, who received the package in the meantime. I also got in touch with grailed due to this VERY BAD REVIEW, which was not my fault, (I provided tracking, and now the package has been delivered) and grailed never responds me.\nNow, I have my account frozen, because they told me I sell counterfeits. I did sent an email asking details, which itens were fakes, and got no response. I would like to say that I don't sell counterfeits, I never did, I never will. I also would like to say, that even if I were doing something against grailed policies, it is not a proper way to treat people. I can't enter my account, I cannot respond to the people who bought from me. Also several cases were opened against me on PayPal, just because they saw I was banned. I did ship all my packages with tracking, which is a relief, because when they are delivered, I will receive my money back. But once again, grailed don't treat people well. I should be allowed at least to enter my account and talk to the people who bought recently. Not be able to sell, but to give people a word.\nI really hope I can get an answer from grailed and have a chance to defend myself. Or at least, a proof that I am selling the counterfeit pieces, like they told me.\nIt is very unfair all this situation and I am truly disappointed with Grailed. After reading all this reviews on Trustpilot, I see I am not alone....","title":"DiSAPPOINTMENT","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-05","author":"Bill","text":"Hi,\n\nI have been banned from grailed because of I had the same info with another account which supposedly sold fakes.\nI stated before that it was my brother’s account and I had no idea what he was selling fakes under my name.  \nIt was my mistake of course. \nHe was underaged until recently and I gave him my permission to use my info.\n\nI understand that its my mistake for giving him permission but isn’t it such a strict punishment to ban my account after all these years without giving me any further option to prove that I have no mix with the other account?\n\nAlso you stated that his account bkdarchives was selling fakes even tho as I saw myself from the incident that he had no cases in his PayPal neither I had any on my account that have been active for 3 years now. \n\n\nMy account was legit with tons of feedback and always selling high end items with tags and all!\n\nFrom the other hand would I be so stupid to lose all my effort after all this time from this? \nBelieve me, unfortunately I didn’t know nothing!\n\nI had like 15$k worth of clothing before this matter and already like 100 transactions.\n\nTry to understand my situation and I’m kindly asking to unfroze my account Gucciway. \nAfter 3 years of being active with lots of sales and buys I expected to treat me with some tolerance and try to help me but instead no tolerance have been shown.\n\nPlease give me another chance because we both lose money in the end and I’m not that type of a person to be selling fakes.\n\n\nUsername: Gucciway","title":"No tolerance shown after a misunderstanding for a long time user..","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-07","author":"Balint","text":"Hi Grailed Team,\n\nToday for no reason I just got an email that my account has been frozen. I did not do any offsite sales attempt or anything like this. If I did something wrong after using your app for 4 years now with 5\/5 seller rating over 59 transactions, please let me know. Also how we can solve this issue. username : pickflips","title":"Account frozen with 5\/5 rating and 59 transations.","stars":1,"location":"HU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-15","author":"West","text":"HAS BEEN 4 WEEKS NEVER RECEIVED MY SHOES, AND NOW THE SELLER HAS BEEN BANNNED, SO I CAN NO LONGER TALK TO THEM!!!!!! I WOULD LIKE A REFUND AND IM GETTING THE RUN AROUND!!!","title":"HAS BEEN 4 WEEKS NEVER RECEIVED MY…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-18","author":"Arron","text":"Hella fakes on here you can sell fakes here and make profit be aware of fakes","title":"Hella fakes on here you can sell fakes…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-18","author":"loweryourfees","text":"EXTREMELY HIGH FEES AND NOW ITS EVEN HIGHER 15% OF YOUR TOTAL SALE VALUE THIS IS REDICULOUS THERE ARE BETTER MARKETPLACE OPTIONS OUT THERE","title":"HIGH FEES…","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-18","author":"G.W.","text":"I love this platform too much to leave a lower star review - it really is a great place to do business. However, I recently got my 100+ transaction 5-star account banned, and it seems as though the Grailed team isn’t responding to my emails. I got banned for off-site transactions for an instance where I only asked for more pictures- in reality I bought\/sold 5-10 items a week and was an avid user of the platform, it’s really sad because it was a big part of my business but now they seem not to care enough to respond... Grailed users be wary when making purchases etc due to their lack of communication they seem to have\n\nEdit: my email is teddyvwallen@gmail if the Grailed team could follow up with me that would be amazing","title":"Edit: added email - I love this platform too much to leave…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-19","author":"T. Wall","text":"Edit: \nUsername: yzkicks\nTicket ID: 567541\nThanks for the reply, please contact me without copy pasting responses - this is very important to me and I’d like to resume business as quickly as possible\n\nOriginal review: \nAccount frozen for no good reason. This  system banned me for offsite transactions when I literally just asked for pictures. I only ever did transactions thru the app- if this was wrong I’ll stop. I had 140+ transactions and a 5star rating, and the Grailed people still don’t care as they keep sending me the same copy pasted email. I’m going to lose $1500 due to a couple pairs I bought that didn’t get shipped before I was frozen and all the Grailed team does is ignore my emails and copy paste their sparse and late responses. Be wary that the staff doesn’t care","title":"ADDED USERNAME - PLEASE CONTACT - account frozen for no good reason","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-19","author":"Benget Sianturi","text":"hello team, I have emailed several times, to the appeals team grailed, but until now it has not been answered and my email has not been answered.\naccount name: exrbe\nand I really hope my account is restored","title":"Account frozen for no apparent reason","stars":1,"location":"ID","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-20","author":"Juan H","text":"So i’m here today to discuss what seems to be an ongoing and never ending problem that many sellers have to go through, particularly the reputable ones unfortunately. I’m a seller on Grailed, have been since September 2019 and i’ve had 36 transactions on the platform, 31 reviews all 5 stars so I like to think i’m an honest seller. Fortunately this is my first issue i’ve had (unlike many other sellers I see have had this chargeback scam pulled on them numerous times), what annoys me is the nature of this case. I sold a user an ERD t shirt back in September, he was a problem from the start, he had tried to make me engage in offsite activity - which I did not, and to make the situation worse his account has a red strikethrough, so he’s obviously been banned for something, chargeback fraud maybe? Username is Kerwinfrust. So 11 MONTHS LATER, a whole 11 MONTHS we’re talking almost a whole calendar year, he opens a chargeback case against me and my account on Paypal is now in negative balance. Paypal have updated me saying that they’re going to have to discuss with the financial issuer now to see if they can recoup my money, but as we all know it will most likely result in me losing out and the buyer keeping a free t shirt. Transactions total was $270, and you know it shouldn’t be much of a debate, this case realistically should be closed decided easily, if you’re opening a case of “item not as described” you do that upon receiving the goods, not 11 months later. I have screenshots of his account being banned, the conversations, I still even kept the shipping receipt from last year September 2019 because I know you can never be too sure when there’s people like this about. \n\nI’ve been trying to contact Grailed to make them aware of the situation and they seem to not be replying now, whereas when I asked them to add a new brand so I could sell something on their platform they’d reply in a matter of hours, funny. It’s amusing that they charge you 9% fees, which in fairness to them is cheaper than eBay, but they charge you a fee for using their platform and you’d assume protection comes with that, otherwise if they’re not going to cover you then everyone may as well go elsewhere or sell offsite no? To rub salt in the wounds further, their automated email reply states “Please remember all transactions are covered by PayPal and Grailed Protection. We'll get your item or money back guaranteed!” I’d like to see this in action now, practice what you preach. Furthermore when you see the reviews on here and there are more negative than positive reviews, well I guess that speaks for itself...","title":"Grailed Chargeback scam 11 MONTHS LATER","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-20","author":"Haitz ","text":"My account was frozen without explanation.  My T-shirt received a complaint from a random person and my account was frozen and a bot was sent out that it might be a fake, after I contacted the buyer who bought this T-shirt, providing him with all the data and ponds, as well as a purchase receipt - business  was settled.  A system error occurred due to the fact that the t-shirt was not defined by you as 100% authentic by moderators and was deleted when it was already purchased and this error and sending by the bot worked, I had a lot of disputes and I lost my money because of you because  I have already sent my product, although all buyers are happy and there has never been a bad review of my account because I have been with you since 2017 and I have 50+ transactions and 31 reviews 5\/5 (look at these reviews!).  I made a profit for the Grailed site and recommended you to my friends.  But my account was frozen for no reason!  I SEND YOU A PURCHASE RECEIPT FOR THE PURCHASE OF THIS T-SHIRT WHAT I HAVE RIGHT TO APPLY THIS CASE.  I SEND YOU PHOTOS OF THE PURCHASE RECEIPT !  Reply me to this letter!  Since buyers who have not received the goods, they are worried and I need to keep in touch with them!  50+ transactions and not 1 negative has ever been in the direction of my account. Look at this case again and my proofs and unfreeze me please. \nMy username: luckyluckylucky \nTicket id: 565601\nNico, help me please!","title":"Account frozen for no reason","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-21","author":"William Franklin","text":"Dont Waist ur time on that app  ...for buyer its an ok apps better than bumps for sure .. but for seller its strait up DOODOO i try to  sell a pair of sneaker i bought on Grailed but they cancel my listing stating they are fake ?!?!? How can a sneakers i bought on the apps 2 month ago can turn fake (they dont give reason of why they state ur listing are fake) ?! They dont give 2 fk about the customer pretty sure they blacklist people who they know are right but dont wanna admit it ...Their support is just trash take a week to get help and when u finally get help its take another week if u got other question .... in short this app is trash and the funniest part ..they raised the fees from 6% to 9% broo ur service is trash how could u increased the fees.. Grailed is a big jokes bunch of clown wearing sketchers !!","title":"Dont Waist ur time on that app  ...for…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-23","author":"Dragos Cerchez","text":"Hello!My ursername is Alinmat012 and my account has been frozen due to the fact that, you said I posted an inaunthetic item.I would please you to understand that I did not have any clue that the Off White t shirt was an inaunthetic item because I bought it from a luxury boutique in Spain.I know that I made a mistake but please take into account that I did not know about it,I did not try to sell fake goods on Grailed.You can see that I already have 2 badges(speedy shipper and quick responder) and also I always provided in less than 2 days the tracking numbers,and after each transaction I received only good reviews.I have already 3 good reviews(5 stars) and I really want to get my account unfrozen because it was a mistake that I assure you will never repeat.I am realible seller with good reviews and I do not want to have my account frozen.Please take a close look at my case and please understand that the t shirt I posted I did not know about it that it was fake.I hope that you can understand and take into account all the things I said and give my account back.","title":"Account frozen mistake","stars":2,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-25","author":"Sian Jai","text":"Purchased an item from seller(walsh666) during messaging the seller he came off as being hostile during communication,  I really needed the so I purchased it, but  I left a3 star review.... I returned to the site later that day to see that Grailed administration team has changed my review on the site! THATS FRAUDULENT!!!! NOW IF YOU CHANGED MY REVIEW, HOW MANY OTHERS ON THE SITE ARE FALSIFIED 🤔 I CAN’T TRUST PURCHASING ANY ITEMS ON THE SITE WHEN THEY’RE FALSELY EDITING THE REVIEWS","title":"FAKE REVIEWS ON SITE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-25","author":"Ross Bey","text":"As a new seller and buyer on grailed I was hyped to find a hypebeast community I could belong to. However, I was very disappointed when they Froze my account after only few hours of opening it despite listing several product. They really getting into a “frozen”\nAccount frenzy stated that one of my item was “counterfeit” although bought from their platform by my brother  - account : IndianaVegas","title":"DISSAPOINTED is an understatement","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-26","author":"Miguael","text":"Hello dear Grailed! Today I received this message that PayPal was changed, but I did not. Now because of this I cannot log into my account. Help restore it, because I didn't break anything and don't know what to do now! I have never made mistakes, help me please, as I need to keep in touch with the buyer and seller. Help me cuz I’m worried :(\nMy username: awesometruee","title":"I can't log into my account","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-29","author":"Bruce Camading","text":"Can anyone check their email why I got suddenly banned after listing one item?\n\nUsername: Nakano","title":"Account is frozen","stars":1,"location":"PH","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"},{"date":"2020-08-30","author":"Miguel Cab15","text":"Great team and support they worked fast and I got my money back","title":"Great team and support they worked fast…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=12&stars=1&stars=2&stars=3"}]