[{"date":"2020-11-19","author":"sam ibenk","text":"Based on my experiences several times, most of the time Support just suggested me to wait until 5 days. Because it is the limit for seller to ship the item. Unfortunately I have this 1 seller, regarded as Trusted Seller and Quick Responder. It turned out the opposite. What made me wonder was why in this seller's listing, there was no \"Contact Support\" like other seller. So i have to contact support, but because no help I went to PayPal. And PayPal won my case so I get my refund.\nI hope Support could be more decisive, especially when there is so much evidence like screenshot chat etc, to this kind of seller. That seller, I think, has broke Grailed community rules.\n\nThanks.","title":"Need to improve a lot, and decisive","stars":3,"location":"ID","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-11-20","author":"CT","text":"Do not sell on Grailed. They're shady. For sellers they claim they charge a 9% fee, but after PayPal fees, the total is closer to 13%. Also, they set up their shipping similar to Poshmark, automatically applying $8, but unlike Poshmark (or Mercari) they don't have a deal with the post office, so if you're package costs more than that, you better change it up front or will it cost you. Better for you to sell on any other platform: Mercari, Poshmark, even Ebay. These other platforms (w\/ the exception of Poshmark which at least provides the option) don't post your name & listing on Google. And if you delete your account with Grailed, they'll send you a \"song of the week\" from MGMT entitled \"When You Die\" w\/ the chorus line \"Go F*** Yourself\" because they're a bunch of shady, immature guys who lack proper customer service.","title":"Grailed is shady. Do not sell on Grailed.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-11-24","author":"Vincent Lee","text":"I have e mailed them many times asking for help about my account and all they do is ignore me.  As a reputable seller, at least provide some communication for your \"sellers\" that actually contribute to your platform.","title":"Non Existent Customer Support","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-11-26","author":"Adam Woo","text":"Doesn't support seller. I'm a seller on grailed. Buyer bought something which size doesn't fit. Buyer threatened me to issue return or will leave negative feedback. I contacted grailed which they suggest me to refund the buyer. They don't even read the proof. Finally they are in my favor. But hope grailed team do more work on seller protection","title":"Doesn't support seller","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-11-26","author":"Victor Justesen","text":"Was banned for a misunderstanding, then support didnt answer","title":"Was banned for a misunderstanding","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-11-26","author":"kouki monsta","text":"I purchased an in-authentic item through their website that was approved by their authentication team and delivered to me (not sure how) .  A few months later (still unaware it was fake) I tried to resell the item through their website and my ad immediately got deleted . Upon emailing them regarding the deleted ad they promptly responded and had indicated to me that the item is in-authentic and to send them all the information about it including photos of the item and a link to the sales ad , which I provided them . Fast forward almost a month after providing them with the necessary information needed to look into my case and also sending several follow up emails , I still have not received a response back from them . I really do enjoy shopping on Grailed but I believe not rectifying the issue and dealing with it in a timely manner is the antithesis of what Grailed is supposed to represent . Which is a site that provides authentic designer and street wear items that you can buy with confidence through a safe buyer\/ seller protected platform . I understand there can be a rare occurrence where in-authentic items make it through there verification process but Rectifying the issue promptly and being able to trust that they’ll  stand by there protection policy is paramount . Im posting this here in hopes that someone from grailed will finally respond back so we can get this dealt with . If any Grailed reps see this you can reach me through the email associated with my account :schroedzz\n\nNEW UPDATE 12\/10\/20: still HAVE NOT received any emails from Grailed as they claimed .","title":"Bought an in-authentic item through Grailed , tried to return for a refund and have not received any responses back .","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-11-27","author":"JavierB","text":"At first I enjoyed using Grailed. I had issues posting one of my backpacks which I thought was good because they took their item verification seriously. Along with this Gucci backpack I posted a LV one. I noticed that I had paid much more for it than originally thought so I deleted it and tried posting it again. I got a warning to not sell counterfeit items and my account would be frozen. I have emailed three separate emails for Grailed voicing my concern About all of my items being real (can provide receipts for everything), and no one has gotten back to me. Does Grailed not have any customer support? Do they even have a verification process or do they make it up on the way? How is it that I can list a backpack and then two weeks later say it’s counterfeit? Very confused Grailed..\n\nJavierbdqb","title":"This app sucks","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-12-02","author":"Shen Gao","text":"Bought broken product. And Grailed did nothing with it. Not helpful. Trash.","title":"Bought broken product","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-12-02","author":"iwnl Wiat","text":"Ive been selling on grailed for over a year and a half now. username (stupidhoe) Email - jadaventresca@outlook\n I woke up to my account being banned. I had almost 100 bought and sold and 35 positive reviews. Grailed also never emailed me to tell me why I was banned, when I emailed them myself the guy said something about 1 offsite transaction that was to send someone extra photos. I apologize for doing that and would really appreciate a second chance, this will never take place again. I have been a reliable grailed user and I used it daily as a source of income. thanks","title":"Ive been selling on grailed for over a…","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-12-04","author":"luxury life style","text":"I dont understand how this thing work i bought lv wallet from grailed and Decided to sell it I relist it I paid $280 for the wallet and the u deleted my listing saying its not authentic when I request a refund as I bought from grailed they banned me .... really it was shocking for me no communication nothing 😒 😕 🙄","title":"Banned without reason","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-12-07","author":"George Davis","text":"Horrible service, they just kept repeating the same quote to me over and over despite numerous clarifications from me. Bad place for sellers.","title":"Horrible service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-12-08","author":"Jordan Nelson","text":"Hello, this consumer is lying there’s no way on Grailed you could make a payment without your consent as it’s you on the app & then Grailed ask you to confirm you order in which they did. I do not have the item in my possession either as there was an attempt to get the item to the main but then something went went. Please disregard there claim as I did what I had to do in my behalf , the item was sent to the rightful address & I am not sure at all as towards why the item wasn’t delivered. I’m pretty sure of I sent the item I was supposed to get it back if the item wasn’t able to be shipped initially. The item says it wasn’t shipped because of the address when indeed I sent to the right address as listed from the buyer. Item says it’s been sent back to me Nov 28 & now it’s Dec 8 I’ve still yet been able to receive the item in hand, I’m unaware as towards where it is. The buyer has since opened up a PayPal dispute in which I’m not able to do much because I never received my item back. \n\nMy Grailed username is: 23collections & this is for Billionaire Boys Club Ice Cream Sweatshirt- Size Medium which I sold for 108 usd","title":"Billionaire Boys Club Ice Cream Sweatshirt- Size Medium","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-12-08","author":"revEYEve Vintage","text":"I spoke to someone about having my account frozen he let me know that they had lifted the freeze from my account. I go on posting items as I normally do. One of my items (a very rare 1980's crewneck) and it gets a lot of likes and all of a sudden my account is frozen again. They said because of marketplace manipulation but I do the same thing every time I post. Mind you i have posted numerous items that gained 1-11 likes after i was unfrozen and absolutely no problems. But because one of my items FINALLY gained some likes I get frozen again? Tell me how that makes sense? Thats basically saying you can get some likes but if you get too many likes we\"ll freeze your account! This deters me from wanting to post popular items or rare items that I know will get lots of likes. Also this seems extremely unfair as I am using the app for exactly what it is intended for.","title":"I spoke to someone about having my…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-12-09","author":"Alex Vienneau","text":"Grailed took multiple days to respond to almost every email I sent, they misidentified the fake item I purchased as authentic on three separate occasions, forcing me to get a third party certificate proving it was fake, and then I still had to convince them to pay me back for the cost of shipping and the certificate. In addition, because they misidentified the bag in the first place, I had to get involved with PayPal, and the whole experience cost me $30...a small amount relative to the hundreds I could have lost, but considering the item was fake to begin with, this really never should have happened. I lost 3 weeks of my life and $30 to this needless, terrible experience. ALWAYS MAKE SURE YOU GET ITEMS VERIFIED BY THIRD PARTY SOURCES BEFORE BUYING","title":"Grailed took multiple days to respond…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-12-10","author":"Eugene","text":"My Grailed username is \"252\" and I've been an exemplar seller on the site since 2014 (over 200 transactions and a 5-star rating with many buyers choosing to actually write a few words of praise in addition to leaving five stars). I am one of the sellers on the site who make an effort — whether it comes to the condition, presentation (nice high-resolution photos, good informative descriptions) of the items for sale or good customer service (I always try to communicate with the users in a courteous manner providing them with as much information about the item as I can so they can make the right choice). I do believe it's because of sellers like myself that buyers keep coming back to the site. \n\nRecently — just when Grailed raised their fees, to hire an army of \"moderators\" to police the site, it appears — they started permanently removing my items from the site in bulk, up to 10 — 15 at a time, for being listed under what their \"moderators\" think \"an inaccurate designer\". How is a jacket made by Junya Watanabe Comme des Garcons in collaboration with Goldwin and listed under \"Junya Watanabe\", \"Comme des Garcons\" and \"Goldwin\" can be considered as listed under \"inaccurate designer\" is beyond my understanding. The high resolution photos of all the labels inside the jacket were in the listing. \n\nDeleted for the same reason, \"inaccurate designer\", a Comme des Garcons Homme sweater listed under \"Comme des Garcons\", \"Comme des Garcons Homme\" and \"Junya Watanabe\". Do their \"team of expert moderators\" even know Junya Watanabe designs for the Comme Homme line?\n\nThe items are removed without warning. You can't  appeal or relist the items unless you do it from scratch. Why not simply send an email to say what it is they find offensive and let us sellers fix the issue? Why not allow to appeal the removal or at least let us relist the original listing? What's their motivation? To punish us? To teach us a lesson?\n\nSo much of my time and work has gone into those listings and now everything has gone: the descriptions, the measurements, the photos I had carefully selected. Not even working links or the listings' numbers remain as everything has been deleted permanently.\n\nAs is customary with Grailed customer service, there's no one I can contact, no one I can direct this matter to. I wrote one of those emails to their customer support no one ever answers (ticket ID 710140). I wrote to this guy Lennox who works for them. Nice guy, we had exchanged a few messages some time ago, but when I sent him a message a couple of moths ago telling him of Grailed's removal of my listings, he never answered. Wrote to Jordan too but only got a generic reply providing me with yet another ticket ID — 711422 this time.\n\nIt's been almost 48 hours since the listings were removed and I started contacting their customer service. No human being has got back to me yet.\n\nIf I want to reinstate the listings they remove I have to write the descriptions from scratch. I have to spend hours to reconstruct the descriptions from memory, unpack the item again (I care about the presentation of my items, I don’t just stick them into an envelope and send them off: all my items are carefully wrapped and sealed in paper and stored away waiting to be shipped), measure them again and post them on the site, hoping the new listings don’t get removed yet again because someone somewhere decides anonymously and unequivocally that the “information I provided is inaccurate\". \n\nI feel hounded and harrassed for no reason and if nothing changes I am going to have to leave the site. I understand that my presence on the site might not be that important to Grailed in the grand scheme of things — if I go another dozen sellers might come along. But I believe there aren’t too many of us sellers left on the site who are still putting our time into it trying to make it work — despite what feels like plain disrespect and continued efforts to undermine our work on their part. If this continues we'll all leave eventually.\n\nWe sellers are the ones creating content for them. We are the ones providing customer service to the buyers. We photograph our items for sale, we write descriptions, we answer questions. When we make a sale we pay them whatever they decide is fair. We pack the items, we ship them to the US from abroad losing whatever money on postage and packing because no one has cared to include an option to charge extra for international postage on the site. We bear the brunt of the situation if the items go missing or get lost or stolen. You'd think they'd appreciate us. But no, all they do or, at least, the only time I hear from them is when those lovely automatic emails arrive titled \"Your Listing Has Been Removed\" letting me know an anonymous \"expert moderator\" has just destroyed my work.","title":"Grailed keeps harassing long-time sellers","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-12-13","author":"Mahairan","text":"here I am humbly and apologize. Disappointed with the way the ratings from the grailed group had a few times enough items that I uploaded as my sales on Grailed. I have reviewed items that have been sold with the same grail as my items that are similar to my items and I also do on google about the original items. Here I am very disappointed with Grailed. I hope you take action on this problem. Because if it continues like this I can not sell and earn a daily income for life, with a warning email deleted it also led me to be blocked to sell at Grailed, I not violated the rules. Thank you.","title":"research on the validity of the items listed","stars":1,"location":"MY","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-12-14","author":"Volodymyr Lukianenko","text":"Hello everyone. This summer I started selling some items from my personal apparel collection. Everything was smooth and all good. Till the point when my acc got frozen it only existed for 4 month and had over 90 transactions and 45+ good reviews with an overall 4.8+ rating with a trusted seller and fast responder badges. Never had any problems with the platform before and mostly had good experience until I got banned. The reason moderators gave me is “listing of counterfit items”. Please keep in mind my 45+ positive feedbacks, I would never list any counterfit item intentionally on the grailed feed and to my potential customers simply because I wouldn’t want to risk my reputation. Since I’m just selling items from my personal collection, I’m mostly not even making any profit from that. I like quality designer clothing and always pay top dollar for my garments. That’s why I would never expect myself getting a counterfit item after paying that top dollar for it. I have never sold any inauthentic items and I’m strongly against of doing that. I currently have 2 sales pending which shipped and never got a chance to update buyers with tracking numbers and details. My account name is “archivedrip” and the case number is “ 714680 ”. Again, I never had any issues with grailed platform, I love buying and selling on there, just this only problem with my account freeze makes me upset since I would love to continue with my contribution to the grailed community. From now on and continuing forever I will only list items I purchased at authorized retailers and 100% sure of legitimacy. Giving me a second chance will be much appreciated and will not disappoint, I promise. Thank you for taking your time to read this review.","title":"Account freeze","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-12-16","author":"ranny Oscar","text":"This item (off white Galaxy )was shipped to the buyer on December 9th, 2020. I could not mark it on grailed as shipped because you guys frozen my account for no reason. \nHere is the tracking number\nUSPS- CE978977487US.  \nThe item was marked as shipped on PayPal and I provided a tracking number. \n\nNow I don’t have my item and my money. Why will you guys refund the buyer?\nGrailed ID-Oabussmindgh \nOn the frozen my account I have provided receipt from Gucci confirming that the item I was trying to list is authentic but I haven’t heard from you.  Worse customer service ever and I’m a trusted seller, fast shipper and 5 star rated seller.","title":"Refunded an international  buyer after an item shipped","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-12-19","author":"Oksana ","text":"Hello, your project is very cool, and I wanted to become a part of it, but unfortunately I ran into a problem. My account was frozen \/ banned during the day. I posted 2 ads in the afternoon and in the evening the account was banned for fraud. Although I am an honest and real seller. I don’t know why it happened.\n\nnickname Grailed: pasquda","title":"Frozen, Banned Account","stars":2,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"},{"date":"2020-12-24","author":"Carl West","text":"They delete listings for no reason. I hope they go broke","title":"They delete listings for no reason","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=9&stars=1&stars=2&stars=3"}]