[{"date":"2019-05-11","author":"Dylan","text":"So I was emailed stating my account had been frozen and banned due to fraudulent activity patterns on my account. I reached out via email and Lennox stated the same thing. I asked for any sort of proof of this “fraudulent activity” and didn’t hear back for 4 days. When I finally send a follow up email and write my first review on TrustPilot, I recieved a response from Nico stating that my account has been frozen, not banned, for “impersonating another Grailed user\/ having the name SaruGeneral”. I’ve mentioned to every buyer that asks if I’m the same SaruGeneral from Instagram, that I’m not the same person. SaruGeneral reached out to Grailed about me having his name. I messaged saru general about this and he claims he doesn’t use Grailed. I reached out via Instagram to Grailed to let them know and for a quick response. They told me all I would have to do is change my name and avatar and my account would be back to normal. So I reached out via email, and after three days, Lennox responds stating “As mentioned, you’re account can not be reinstated.” So why do I have three Grailed employees telling me different things? Two are saying it’s due to the name and my account should be okay and sorry for the confusion. While Lennox is still claiming my account to be banned for Fraudulent activity.","title":"why isn’t everyone on the same page??","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-05-14","author":"Monecka Freeman","text":"I bought a shirt on May 8 that was supposed to be fed ex and should have arrived. Seller seemed legit but I informed him I needed this for May 16! Now ironically grailed app is failing when I tried to log in. I emailed him at the same email I had been emailing him at. No response, I opened a dispute this morning on PayPal. I don’t know why the app isn’t letting me log in. But professionally he shoulda gave me tracking info ASAP especially because I stressed I needed this","title":"I bought a shirt on May 8 that was…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-05-16","author":"Zach","text":"I have sent emails and emails that have went unanswered to grailed. I am a seller that sold $970 dollars worth of bape. I shipped and my buyer signed for the package. This means I should get my money. I have reached out on every platform and I have no answers and I’m out $970.","title":"Grailed owes me money","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-05-17","author":"Zach","text":"So earlier I wrote a review about grailed, saying they owed me money. Well according to them, they banned me from grailed for \"engaging in offsite transactions\". This is NOT TRUE, I shipped and waited for my buyer to confirm delivery. I just wrote them an email begging them to give me my money and un-ban me. I shipped to my buyer, and I never got my money in return.\nThis is the first time I've ever used grailed... \nMY MONEY AND MY THINGS ARE GONE!!!\n$970 gone...\n3 bape sweaters gone...\nTHEY ARE IGNORING MY EMAILS!!!\n\n\nupdate- Grailed, my email is zach.shea21@gmail \nadd the .com","title":"Grailed Support is ignoring me and banned me for no reason and STILL owes me $970.00","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-05-30","author":"Nick Chang","text":"Hi so I have purchased a thom Browne jacket for 385 usd from the seller. I thought everything went fine but he didnt reply to any of my message after the purchase. Before the purchase he used to answer me instantly bit it had been 3days straight he'd been ignoring and not even putting track number. So I sent a mail to grailed customer service that I would like to get refund but they havent replied back to me yet for almost whole day now. My ticket number is 43883","title":"They seem not to read","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-06-02","author":"Jonathan","text":"Made a purchase on 5\/8\/19. Waited one month for the seller to ship from Canada. Never shipped and stopped responding to messages. Seller has my money. I’ve sent several emails to Grailed about this and have received ZERO communication. I am extremely frustrated and disappointed with the seller, but more so Grailed. Had to handle the situation myself through PayPal. Will be deleting the Grailed app once the issue is resolved and I get my money back.","title":"Grailed Customer Service Useless","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-06-02","author":"Wonseok Chang","text":"Hi so the seller hasn't replied nor putted tracking number for over 5 days now and he finally replied back saying if I wanted the refund and I said yes. And he told me that yes and he told me that he wouldnt put the tracking number so that grailed would automatically cancel the order and my money will be fully refunded in 24hours. Also grailed bot told me to press contact button to request refund but I dont know how so I posted here. So I would like to get my money fully refunded thanks. And the ticket number is 46514","title":"I would like to get my money fully refund","stars":3,"location":"FI","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-06-05","author":"Hoàng Minh","text":"i just oder the Lv bag but the seller send me a coin. he is scam. i tried to contact Grailed customer sevice by email. and request refund button so may time. but no one answer or\nemail to me. the seller has my money. what can i do now? \nMy email :louistran89@yahoo.","title":"i just oder the Lv bag but the seller…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-06-06","author":"Miguel Sierra","text":"I've been a long timer user of Grailed and purchased Yeezy Wave Runners for a decent price but then noticed the seller's account has been frozen and all his listings have been erased. Grailed said they were using a \"New Protection Program\" and I am worried that I will not be refunded for this. This has never happened to me before.","title":"I've been a long timer user of Grailed…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-06-07","author":"Mvrsss","text":"Grailed has been good to me, but recently, I sold 2 items and funds were released on one but not the other. It has been more than a week since the item has been delivered and my funds are still not available. I have written 3 emails regarding this issue and still no response. I feel like Grailed team is ran by one man or is under staffed. I wish they had a direct number where I can call to get help instead of writing these emails that they probably don’t even read. This has me feeling uncertain about my future business with Grailed, and I am saddened by this since I truly enjoyed them.\nUsername: mvrsss\nEDIT: Issue has been resolved and my funds have been released after 12 days.","title":"Poor customer service","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-06-09","author":"Miguel Sierra","text":"So I contacted the support team and they replied in this manner:\n\n\"Unfortunately we can refund the transaction from our end due to the seller's account being frozen before the 5 day guideline. As the seller is now unable to message or add tracking via Grailed, we can not confirm the seller being unresponsive or the shipment of the item within the 5 day period.\"\nSo because THEY froze his account for suspicious activity, I am now unable to get a refund through Grailed since it was frozen before the 5 day guideline. Luckily, I signed into my Paypal account before making the purchase and I am able to file a report through Paypal, but I will certainly not be making any more purchases or sales through Grailed, as they are telling me they cannot do anything to help even though they're still holding the money (I believe.)","title":"So I contacted the support team and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-06-10","author":"Morgan","text":"Don’t even bother selling something on here. Sold someone a shirt and the next day they claimed I didn’t ship. so, my account was instantly banned (without warning), they got to keep my item, and they got their money back. I sent them all the information to get account back, but they didn’t do anything about it. RIP me I guess","title":"Don’t even bother selling","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-06-13","author":"daniel lenk","text":"So I was trying to sell my yeezys and suddenly got banned without any message saying why, I'm guessing its because I've sent someone my email adress and they thought it was a link to a website to scam the guy, but I cleary just wanted to provide some of my info.... They did not respond to my emails\n\nEdit: Thanks for your answer Grailed, my profile is @Lenk on grailed","title":"Banned for no reason","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-06-15","author":"Ares_Ares_Peres","text":"I recently got scammed $460 on grailed, the seller will win the PayPal case because he provided tracking number but it’s in pre shipment meaning he hasn’t shipped. He has now gone on to sell the same exact item 3 different times. How can I get my money back?? PLEASE HELP\n\nUPDATE\nUsername: Ares_Ares_Perses\nemail: Graysonspronk@yahoo. com","title":"I recently got scammed $460 on grailed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-06-16","author":"Meg Cashman","text":"I purchased a pair of shoes and was supposed to receive a tracking number, it's been one month and I still have no tracking number and no shoes. I have tried contacting Grailed a number of times and no reply. Do not use this website, there is no buyer protection even though they claim there is! I'll be contacting the ombudsman about this website.\nUser name megphazeone. \nFunny I get a reply to this but not to any of the messages or emails I have sent.","title":"I purchased a pair of shoes and was…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-06-18","author":"Ares_Ares_Peres","text":"NEED HELP FROM A HUMAN!\nI’ve gotten scammed multiple times on grailed, both I have yet to get money back from or even hear back from grailed support. This morning after waking up to see if the seller for any of my recent purchases has shipped, IM BANNED?? I cannot login to check on the thousands of dollars in purchases I have. \n\nUPDATE:\nFor grailed: My email associated with grailed is Graysonspronk@yahoo. com\nUsername: Ares_Ares_Perses","title":"NEED HELP FROM A HUMAN!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-06-18","author":"Konrad Behrendt","text":"I sold a pair of shoes for approximately 300 dollars 2 weeks ago. The package arrived to the buyer 6 days ago now, and I still haven’t received my money even though I’m supposed to get them at the moment the package arrives to the buyer. \nI have sent several emails to Grailed support to get a couple of answers to this situation. At the moment right now, Grailed have told me to call PayPal directly.\n\nAll things considered I have had a very bad experience of selling a product on Grailed. At the moment I don’t really know if I will ever get these 300 dollars to see again, and besides that, I think it is a very time-consuming and annoying situation they have set me to. A shopping-site like this is supposed to be easy and this is the opposite.\n\nDefinitely not recommendable:(","title":"Not recommendable at all:((((","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-06-18","author":"Farhan","text":"I got frozen from grailed telling me that i sell inauthentic items.\nAll the items i posted were legit and few had invoices attached with the items . I even got A+ feedbacks from buyers who bought designer stuff from me. They never reply on time .Really disappointed at them and there services.  would never recommend them for selling items.","title":"I got frozen from grailed telling me…","stars":1,"location":"PK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-06-19","author":"Rocco Zunino","text":"I accidentally deleted my listing even though i sold the item, unfortunately I did not add tracking before, but I added tracking on PayPal. I was wondering if I am still going to receive my money?","title":"Question for grailed","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"},{"date":"2019-06-21","author":"Christina Rivera","text":"My son was scammed for a pair of shoes and I am currently waiting on a response from the company . I don’t understand how this website is still in business ... it’s disappointing how easy a scammer can get away with free items without being reprimanded. The shoes were delivered to a residence \/ daycare in Los Angeles . People are so ghetto.","title":"Furious parent","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=31&stars=1&stars=2&stars=3"}]