[{"date":"2022-04-20","author":"Thai Huynh","text":"Completely untrustworthy site for the fact that a buyer may not even receive their purchased item. This is exactly what happened to me. The first time I reported this, my issue was not resolved and the agent I worked with brushed me off. Then another agent assisted me and finally granted me the refund I needed in the first place. This is after countless emails sent back and forth over a matter of weeks. The agents also ask for screenshots for emails with THEIR agents. Completely ridiculous process. Buying and selling on Grailed is a gamble.","title":"Unhelpful and Delayed Assistance","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-20","author":"TK","text":"Grailed customer service has been top notch. I worked with Michael in their support area.  He was always very professional, responsive and saw my case through to the end.  \n\nAfter using PayPal for decades with zero claims, to say I was upset when they failed to honor their “protection” the first time I filed one  is an understatement.  Their message to me indicated the item was “similar”. They either have BOTs now reviewing claims or are uneducated on the luxury resell market. When you buy a high end piece of designer jewelry, “similar” is not okay. \n\nWhat was listed was a Versace necklace with clear bright stones all in tact. What I received was missing stones and those present were mostly discolored to the point of being grey - black. While the item I received was authentic and was a Versace necklace, the condition was very poor, not as described, and not even close to being as pictured. \n\nMichael at Grailed helped me from the day I received the misrepresented item, through the entire process with PayPal and then saw it to the end by honoring their customer commitment of resolving all issues and protecting customers when it doesn’t get resolved through PayPal. \n\nI have lost all faith on any “protection” from PayPal, but I will absolutely continue to buy on Grailed because of their service, attentiveness to the issue and their commitment to seeing it through to resolution, even when PayPal fails to do so.","title":"Grailed stepped in when PayPal failed!","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Adrian Bermudez","text":"Customer support was super helpful with assisting me with a seller who took too long to ship out an item I purchased and taking forever to send out a tracking number along with it.","title":"Customer support was super helpful with…","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Nurnabilah Jelani","text":"Grailed help me a lot. Although there are lots of scammers in here. Very helpful. Thanks again for the reimburstment given.","title":"Grailed help me a lot","stars":5,"location":"MY","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-21","author":"Booer","text":"Great customer service got back to me fast when I had shipping problem","title":"Great customer service got back to me…","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Mike Iso","text":"I list on all the major apps but grailed just keeps going above and beyond. i had a customer purchase a $2500 pair of cartier glasses on the wrong card so i refunded him so he can put it on a new one. But the item didnt automatically get listed to my feed again. i reached out and gavin from the grailed team got back to me within the hour i reposted the item they made sure to expedite authentication because it had already been verified and it was back up in minutes so my customer could finish checking out. Great experience with them and my customer was happy. Etsy, poshmark and ebay can learn a thing or two from them by helping their sellers instead of doing everything in their power to screw them.","title":"Grailed saved the day and my $2500 sale...","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-22","author":"Adrian Morris","text":"Grailed has been going down for years. When I first discovered this site. It was wayyy better. Now they have falsely authentic items being passed as authentic. They use an “authentic” banner for items that’re not authentic. I was once sold some fake Balenciaga Triple S sneakers (which PayPal refunded me. This time some fake Saint Laurent jeans. I tried to resell them and them deemed them fake. How?! When I bought them from the site in the first place and they use a digital authentication system. Makes no sense. After about a week of back and forth emailing, I was refunded my money. I won’t be doing too much shopping from here in the future.","title":"Grailed has been going down for years","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-24","author":"Rose Schafer","text":"long waiting times for customer service. Overall Happpy and my returns Has been processed... customer service is nice and customer service number is on the top\nI bought something a while ago and then…\nSupport teamSIX82---TWO14---8036(24\/7 HELPLINE )\n\n\n\nlong waiting times for customer service. Overall Happpy and my returns Has been processed... customer service is nice and customer service number is on the top","title":"long waiting times for customer service. Overall Happpy and my returns Has been processed... customer service is nice and customer service number is on the top","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-26","author":"James Segovia","text":"I got scammed for fake diors, and Grailed was quick to reimburse me. Great customer support 🙏🏽","title":"I got scammed for fake diors","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Krisp","text":"Jordan \nHe was an amazing help to my issue. I truly appreciate him for all his help. Thank you grailed.","title":"Jordan","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-28","author":"Francis Peter","text":"Their \"authenticator\" refused my Nike shoes bought from the official Nike SNKRS because they \"unable to confirm it's authenticity\" of the product shipped directly to me from Nike. I don't care if they refuse it for selling but I never gonna buy anything from here as their \"authenticators\" are totally incompetent can't even identify authenticity of the item which is 100% original one.","title":"Their \"authenticator\" refused my Nike…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-04-30","author":"Poz S","text":"grailed should be shut down. Firstly all the positive reviews are of people who were scammed and then got their money back? That’s not a good thing. Secondly, grailed allows for stolen items to be sold on the website. There’s been an influx of stuff from ukraine so they also allow war victim goods to be illegally sold. There’s no authenticity process. Take a look at stockx and compare. Grailed is a pawn shop; worse than Craigslist. No seller on grailed will ever have an original box or document. Most of it is stolen or counterfeit. For those of you living in a 1990s good will overcome bubble and wondering, “well if they are illegal then why is the site working?” Wake up to you! Look around. Massive tech companies do wrong stuff and just get fined. At a certain size, a company generally will just exist and it’s up to consumers to cancel the company. This is why cancelling exists now and so do sites like trust pilot. Grailed is a total scam. Their phone number is a bizarre voicemail. The sellers are all con artists who have these weird networks where they conjure up goods at a low price and mark it 20x to you - proven by any customs form you’ll have when you get a product delivered. There are no longer the original scenarios of individuals who genuinely want to connect over fashion, blah blah. Think uber, Airbnb and all the abuses they did as they got larger. grailed is a dirty sick company. It doesn’t need to exist. eBay and then goat and others are there. Let’s get this sick twisted company and it’s scumbag network closed for good. Avoid or simply lose your time and money","title":"grailed should be shut down","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Shaurya","text":"Ass website doesn't help at all. Sells fake. Steals your money by you placing an order and never receiving any item. please dont fall into the trap that is this website. No customer support.","title":"Ass website doesn't help at all","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"A J","text":"I recently ran into a problem where I received an inauthentic product. I was worried since I only realized this a year later and knew PayPal wouldn’t compensate me since the 180 days period was over. Since contacting Grailed, they quickly provided a solution and fully reimbursed me for the $1,000+ item. Grailed has continuously proven to me to be marketplace where I can buy and sell all types of street wear items knowing I’ll be fully backed up if something bad were to happen.","title":"Grailed Proving to Be Streetwear Marketplace Industry Leader","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Quincy","text":"Grailed Customer Support (Michael)  held me down and got my money back ($150) I sold a Bape hoody on here and the buyer got the item then filed a claim to get his money back while keeping my item. His account was suspended and I got my money in full in about a week. Thanks!","title":"Grailed Customer Support (Michael) …","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-02","author":"Shurland Ayers","text":"My support agent Jordan was knowledgeable and responded expeditiously.","title":"Great customer service","stars":5,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-03","author":"Salma Belghiti","text":"Michael was awesome! Thank you resolved much issue in minutes thanks again","title":"Michael was awesome","stars":5,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-04","author":"SUD - Neiman","text":"Listened and cared for the concern I had. Helped me step by to step to resolve my case.","title":"Listened and cared for the concern I…","stars":5,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Ubs","text":"Item shown as delivered on porch. I was home all day and heard no knock or anything. Received another package from grailed, same day, which required a signature. The other didn't, I dont know why. I looked around, asked neighbors, waited their \"maybe they're shown as delivered but haven't been\" time period. Nothing. Grailed passes the buck to USPS who passes the buck to Grailed. No real way for customer issues. They don't even have a phone number to call and pretend they care. Only my second purchase and definitely my last.","title":"Lost items are on you","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"},{"date":"2022-05-05","author":"Magic Magic","text":"Great customer service!\nVery quick response and helpful !","title":"Great customer service!","stars":5,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=1&stars=1&stars=2&stars=3"}]