[{"date":"2019-04-01","author":"Guillaume Vincent","text":"I have contacted Grailed for OVER A WEEK NOW, they are unable to reply ANY of the mails although they promised to reply in less than 24h. They only need to unlink a paypal account what the hell is taking so long? Hurry up and take care of this problem ASAP grailed\nirox@ live.fr","title":"I have contacted Grailed for OVER A WEEK","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-01","author":"Tomos","text":"Love selling on the site but recently got my account frozen. I’ve sent numerous emails asking about my account with absolutely no response. My account is grailed . com \/ txmos and my email is penguinereno @ hotmail . com","title":"Love selling but have been frozen","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-01","author":"Trevor","text":"my experience has been fine until as of recently when i requested to change my paypal account linked to my account. i dont know why we need to email them in order to change it now, and i dont see the point considering they are blatantly ignoring my emails now. all i need to do is change a paypal. i litterally cannot do anything on the site now and i have several people waiting to buy my jawns, but i cant sell because i need to switch to my paypal account.\n\ngrailed @lost","title":"ignoring me emails after telling me to email them. i need to change my paypal","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-02","author":"Abdullah","text":"My account was frozen\/banned for absolutely no reason. I did not break any Grailed community guidelines. My suspicions are that a petty seller called pharchive that sold me a falsely described item reported me for opening a PayPal case against him. I’m dissapointed in Grailed for failing to respond to my inquiry to get my account back in less than 24 hours as they claim. Bad customer service and banning great buyers and sellers over no reason\/false reports is absolutely ridiculous.\n\nEmail: azreselling@ outlook.com\nGrailed Username: AZR","title":"Banned for no reason when I'm the victim.","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-02","author":"Theo Spencer","text":"Been waiting on a response regarding my account being frozen for 48+ hours without response.\nVery disappointed with quality of customer service.\nUsername: @k1merch","title":"Been waiting on a response regarding my…","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-02","author":"范俊","text":"I bought a pair of shoes on your website. I received it after I received the shoes. The result of the appraisal is a pair of fake shoes. Then I sent you an email, but you never replied to my email until you just went straight to it. I stopped my account, my day, I bought fake shoes, you did not stop selling sellers of fake shoes, and I stopped it. This experience is really bad, I just want to return my money now!","title":"Innocent blocked account","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-03","author":"Ethan Li","text":"Ive sold numerous amounts of items on Grailed and had perfect feedback. I used a friends PayPal account to purchase an item and as I logged into his PayPal, I was banned and frozen. I emailed the issue to your email and its been over 4 days since my problem has not been addresssed. My email is ethan.xiii4 @ gmail . com\n\nMy grailed account is grailed . com \/ pilling","title":"Unresponsive to my Emails","stars":1,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-05","author":"robert","text":"Thought I sold my first item on Grailed (Yeezy clay 350). But as soon as buyer sent payment, account was frozen. Received email from Paypal via Grailed, but nothing from Grailed. I am lost and do not know what to do. The customer service is awful, with a website getting the growth as it is, you'd think a customer service line would be in place. I love Grailed but people get booted off the website for way to many conspicuous reasons.","title":"Thought I sold my first item on Grailed…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-07","author":"miki kotake","text":"I was banned months ago for no reason. After providing receipts for the items, Grailed ignored all my emails. I have cooperated with you guys through the whole process and after doing what I was told, I was ignored by you. \n\nMy account is grailed.com \/ pzoutvancity","title":"I was banned months ago for no reason","stars":1,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-12","author":"Ken","text":"Terrible site, poor authentication procedures, poor customer service and ignores emails\/tweets\/DMs when proven wrong.\n\nI've been a user of grailed for a couple of years now and after making a sale I was banned, for selling fakes. I've sold several items, have 5 star service and reviews and I was banned without warning and not even questioned, for selling a fake of 1. An item that only released a week prior and 2. An Item that I had shown pictures of tags in the listing itself. \n\nWhats worse is they doubled down with their cookie cutter email response even after I LITERALLY showed them tags, labels, my RECEIPT and even offered proof of me getting the item itself which they then ignored. They couldn't admit to their own mistake so they took to ignoring me. \n\nDO NOT SELL ON GRAILED, USE STOCKX, EBAY. DEPOP, GOAT OR ANY OTHER ALTERNATIVE. \n Grailed doesn't care about their users especially loyal users and they run away when confronted on their lies and should be ashamed of this poor service, judging from the reviews here and several Reddit posts, I'm not the only one who's been banned unjustly.","title":"Terrible customer service and liars.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-13","author":"Black","text":"Shi_t site, use stockx. Was banned for no reason. Ret_ards at support wont help, the runaway for them is ignoring. Would give less than 1 star if that was possible.","title":"Sh_it site","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-15","author":"Diogo","text":"Account banned without any notice or reason.","title":"Account banned without any notice or…","stars":1,"location":"PT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-16","author":"An Tai","text":"My account was already blocked earlier for the placement of non-original goods, in particular, Louis Vuitton, I did not know that it was not original and in fact I am very sorry for this listing. But later, they gave me a chance and still blocked it after some time, because in their opinion, I continue to place non-original goods. I published FOG pants because I thought that they were original. but I immediately deleted it because I doubted it. I deleted this listing very quickly and did not think that this would cause block of my acc. After removing this listing, I was still blocked and they say that I have no more opportunity to sell. Although I had 600 items on the page. And because of one mistake, one listing which I immediately deleted, they still decided to close me. I think this is very unfair, because I conduct my shop very carefully and I have no inauthentic things. My email anekantai @ gmail.com","title":"Banned for no reason","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-17","author":"Unima","text":"Been waiting on a response regarding my account being frozen for 5 days without any sort of response. Seems like the support email is inactive?\nExplain what you think is inauthentic on my account, I bought everything from either a department store or on grailed itself.\nReally disappointed as I love selling on the website, it's really convenient and easy. However the consumer service is absolutely horrible, you'd expect much much better from such a large selling community. It's pretty much non existent.\nmy email: unima12@ mail.com\naccount: unima12","title":"Been waiting on a response regarding my…","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-22","author":"Payne Estes","text":"Bought a jacket from Grailed for an absolute steal, wore it a few times and didn’t like the fit so I tried to resell it on grailed and it was removed for inauthenticity within five minutes of the posting. Doesn’t make sense I can buy an authentic good from their website then when I resell it magically becomes inauthentic","title":"Bought a jacket from Grailed for an…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-24","author":"Ramon Vasquez","text":"My account was frozen and banned due to a customer buying a pair of bbc running dog jeans and when the item arrived he filed a claim saying they are inauthentic i messaged the seller when my account was still active and there was no resolution he went straight to a claim without any response ,the support team doesnt take into consideration anything that is being said and feels like a automated service , i have 5 star 100% feedback and havent sold a fake item before , and when i did get a reply they want me to refund the buyer and he will get both i think this is a lack of service i also have 3 garments in transit and cannot contact the sellers and grailed will not give me insight to what the next step is with a growing platform such as grailed youd think there would be more help from the graild support team im furious with the responses given \n\nEmail vamon.rasquez @gmail.com \nUser : grailed.com\/ ramondied","title":"My account was frozen and banned without warming","stars":1,"location":"NZ","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-25","author":"Charles","text":"Was banned\/frozen a couple days ago without any information or email telling me the reasons.. I’ve sent 2 emails already to them but never got an answer back.. too bad I was liking the platform alot. All my buyers were very happy with me and never had any problems.. come on get it together grailed\n\nAcct : charlesodd","title":"Was banned\/frozen a couple days ago…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-25","author":"Nadia Amir","text":"My son bought a pair of shoes through this web site on 03\/29\/2019 for $240. The money was withdrawn from his account on 04\/01\/2019. It has been over three weeks but he has not received the merchandise. I have contacted the customer support three times but have not heard from them even once. This company has the worst customer services that I have come across in a long time.","title":"My son bought a pair of shoes through…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-04-27","author":"COS","text":"I paid for a windbreaker and it was withdrawn from my PayPal account but have not received the item yet. Got the standard reply email from Grailed about giving the seller 14 days to ship, but it is past 14 days, no reply from seller, no return of funds from Grailed. I wlll continue to share on every social media site the failure of this online company ... although I didn't loose a lot of money, it's the principle. If you are going under, close the site Grailed.","title":"DO NOT USE GRAILED","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"},{"date":"2019-05-02","author":"Andrea Maggi","text":"I used shirt in \"great conditions\" by acne, froma user. \nI arrived so old, ruined, overworn but MOST IMPORTANTLY the size written on the website was false and they DIDNT REFUND ME!!! I LOST 100 EUROS FOR A CRAPPY USED HORRIBLE NOT-MY-SIZE SHIRT! They didn't refund me because i \"used paypal to pay and not \"as a platform to pay\" (wut?)\nThat's what they said. Also they don't respet the right of the customer, they said it was also too late to return it while it wasn't! The user quit answering me and DEFRAUD ME and the website did nothing about it. So I was waiting for a great condtion 38 sized shirt, and i got an overworn 36 shirt that sucks and doesn't even fit me. \nHORRIBLE  EXPERIENCE\n\n\nWhen i cimolained about the wrong size and the overworn state of it with the seller it answered \"I din't make the shirt:)\" What? It was your shirt and you selled it! You lied on the size and on the condition! OMG, stay away from \"uppereastside\" profile.\nHe or she also threatened me because I was asking for more explanations and a refund!","title":"I used shirt in \"great conditions\" by…","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=32&stars=1&stars=2&stars=3"}]