[{"date":"2019-03-11","author":"Leo","text":"Long time ago it was good. These days it’s overcharged. There is no customer service. Fees increased but at the end you still pay PayPal on top. Not very reasonable because the only protection you actually get is through PayPal and not them","title":"Used to be better","stars":2,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-13","author":"Josh Rick","text":"I have been an active buyer & seller on Grailed for years, probably since early 2015. For a time it was my favorite place to shop, having over 100+ transactions and an almost perfect feedback rating (5 stars). My IP address was then banned out of nowhere for \"posting of inauthentic items\" even though I had sold another of these items before with positive feedback from the buyers. I EVEN HAD THE RECEIPT IN HAND but grailed has not responded to my emails or appeals in over a month and has yet to give me any info. I am disappointed to say the least as I know how great of a website it can be because I haven't had problems before this but now I see that their customer service is almost non existent and seem to not care about their active users.\nEdit: account email is joshrickk @ gmail. com","title":"Where is the customer service ????","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-14","author":"originalbrand","text":"Grailed is realy bad. I was seller and i have good feed back but some my opponents complained me, grailed banned me there is no reason i wrote to grailed for that status they did not reply me . grailed is too bad.","title":"Grailed is realy bad","stars":1,"location":"TR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-14","author":"christopher gutierrez","text":"Grailed is such a good platform to sell on but they are too strict about some things. Unknowingly i sold an inauthentic item, and the buyer opened a case on it and i immediately accepted the return. I have made over 70 transactions and have a 4.5 star review on my account. We do not sell inauthentic items but one slipped through the cracks, and as im sure everybody has made mistakes before in the past unintentionally. not to mention this situation has only happened 1 time, and they are going by the buyers words. What if in a different situation the buyer is just trying to scam? I emailed grailed numerous times and explained to them the whole situation and its been over 48 hours without any response. If its not for this issue grailed would be a 5 star app. They should definitely give second or even third chances, especially to sellers with good feedback on numerous transactions.","title":"Grailed is such a good platform to sell…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-14","author":"Mustafa Babar","text":"Terrible, didn't even last 3 minutes on the website. I just had put my Yeezy's on Grailed and went to bed, 3 mins later i get an email saying i've been banned from Grailed for suspicious off-site activity. However this is my first time i've ever tried to sell on Grailed, as a new time comer to reselling shoes this was really annoying, especially because im completely new! Have emailed still no response! My IP is banned and i've done completely nothing wrong unless putting up Yeezy's to sell is a problem!","title":"Terrible","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-16","author":"Григорий Майков","text":"I got banned as well for no reason, and i havent even sold anything or put anything up for sale...I just wont to buy a trench coat for me (((The blocked my IP.   I've sent over 5 emails to them with no reply. So disappointed. Do not recommend them to anyone!","title":"I got banned as well for no reason","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-16","author":"Michael Frisque","text":"Banned for no reason. Lost a 540 dollar sale because of it. Nobody at grailed will respond to my tweets to their support team. Cant log in and ask for help because I'm banned for no reason. Worst resale company out there. Let's see how long they last.","title":"Banned for no reason","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-18","author":"felix","text":"Grailed is realy bad.\nBanned for no reason.\nI have been an active buyer  on Grailed for years .For a time it was my favorite place to shop , have about 30 transactions , My IP address was then banned out of nowhere. I am disappointed to say the least as I know how great of a website it can be because I haven't had problems before this but now I see that their customer service is almost non existent and seem to not care about their active users.","title":"Grailed is realy bad.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-20","author":"An Tai","text":"I have a real problem about Grailed. I’m emailing them and I’m not getting any help, I’ve been trying to get in touch with them for almost a week. All that I write they don’t read and send me just the same automatic answer.\n\nI create a topic for redit, but it is immediately removed.\n\nI have a significant problem, which is very important for me to solve, and all the time they just delete my post and write so that I write to the mail, and they don’t even read the mail.\n\nWhat should I do? how do i contact them?\n\nMy grailed account is frozen for listing inauthentic items. I know that they have not approved it, but I did not know that my thing was inappropriate. I published it twice because I was sure that it was not a fake.\n\nI'm just starting to sell on Grailed, but I am good at it and I really value my account, I have a lot of listings published, and there are a few reviews. I also sell on other marketplaces and I have a good rating, my things are authentic and there are no fakes.\n\nGrailed does not want to give me a second chance, besides, they don’t even read what I write to them, and they’re not at all interested in the problems of their users.\n\nMy mail anekantai @ gmail.com username anvtai","title":"problem about Grailed","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-21","author":"Lyve","text":"Grailed is realy bad.\nBanned for no reason.\nI have been an active buyer on Grailed for years .For a time it was my favorite place to shop , have about 30 transactions , My IP address was then banned out of nowhere. I am disappointed to say the least as I know how great of a website it can be because I haven't had problems before this but now I see that their customer service is almost non existent and seem to not care about their active users.","title":"Grailed is realy bad.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-21","author":"Lyve","text":"Banned for no reason. Lost a 600 dollar sale because of it. Nobody at grailed will respond to my tweets to their support team. Cant log in and ask for help because I'm banned for no reason. Worst resale company out there. Let's see how long they last.\n\nemail: lyvelocker @ gmail.com","title":"Banned for no reason","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-21","author":"ckn66391","text":"Banned by Grailed for both account and IP for no reason\nGrailed claimed that I am selling fake item with no evidence. I got 5 transactions only and all the buyer commented my item are \"as described\" which mean the item should be legit.\nI have sent a lot email to help@ grailed.com and banned@ grailed.com to appeal but get 0 reply. THAT IS REALLY BAD\nMy grailed account: silverdigger email:ckn66391@ gmail.com","title":"Banned by Grailed and get 0 help","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-22","author":"ckn66391","text":"I got banned by Grailed with mistake and even now can't access to Grailed.com WHY? I have sent mail to the appeal @ gmail.com to appeal but havent reply me...\n\nmy account: silverdigger email.ckn66391 @ gmail.com","title":"I got banned by Grailed with mistake…","stars":3,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-23","author":"Jack","text":"Someone signed up for Grailed website using my email address and then changed it. I got the emails notifying me of this. I don't know what it is and definitely did not sign up. The email told me that my Grailed account email address was changed to asylum247@icoud. That's not me","title":"Fake account created using my info","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-23","author":"Julio Gutierrez","text":"I have had a good experience on Grailed since using it. Not only to come and find out about their support team is non-existent. I have multiple listings on Grailed and was doing well. Not until sent out multiple messages with the same message that I was alerted that I cannot send any messages out and was referred to their \"appeals team\" which have been M.I.A!! No customer service number, removed my posts from Reddit, no human responding to my emails just a BOT. This is unbelievable. This is over something that could be addressed in seconds if they just took the time to listen\/ read what I have to say! I have seen Reddit forums stating that it was due to their system picking this as spam behavior due to a threshold they have on messages. Need a better filter for this!\n\nUsername:(Deleted)","title":"Message Restriction With No Help!!! Non-exsistent customer service team!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-27","author":"hunterpence17","text":"these people don’t know how to respond to emails, they don’t care about if the customer gets scammed and they won’t do anything about it. thanks grailed you guys suck","title":"these people don’t know how to respond…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-27","author":"t schmeil","text":"Cannot respond to an email","title":"Cannot respond to an email","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-28","author":"Anslem","text":"Dear Grailed,\n\n\nI have drop you guys an email regarding to unfreeze my grailed account issue but there wasn't any replies at all, it has been like almost 6days. I just want to explain myself that, I have 175 transcation for the last 2 years, i always choose to deal within grailed to have the buyer protection and I always find it is convenient to deal within grailed as you guys are the biggest platform for supreme. \n\nFurthermore I have a few transcation that has been done and I will need to communicate with the sellers for tracking numbers and etc. Now my account is ban, so may I ask if my package goes missing due to miscommunication with the seller due to I was ban from grailed. Who shall answer for it? Should it be me? You? Or the seller? \n\nI sincerely hope you guys can unbanned me and let me enjoy the convenience to shop in grailed again. \n\nThank you and have a great day\n\nRegards \nAnslem","title":"Dear Grailed,","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-29","author":"Pijus Nazarovas","text":"As I understand it's impossible to get some email response, until you start to leave bad reviews here, twitter or reddit?\n\nSent shoes immediately after sale, did everything perfect, the buyer got the shoes and said that everything is perfect, left 5 starts review, after few days got banned without any explanation, and the buyer got auto refund. Lost money and shoes.\n\n2 weeks no response from appeal or help staff.\n\naccount: treciaMazda, pij.naz @ gmail.com\n[Edit\/reply] Can you explain to me what's fraudulent activity? Because I did more than perfect from the seller side.\nI understand that you guys are trying to make fair, good marketplace but it's mind-bending to get banned after receiving a message from the buyer that everything is good and 5 stars review, because you thought that my account is \"high risk\". \nPlease solve this, it's insane that I had to lose my shoes (or money for them) because of your thoughts.","title":"Banned\/lost money","stars":1,"location":"LT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"},{"date":"2019-03-31","author":"Darin Ogino","text":"TERRIBLE customer service by Grailed. I've also been banned for no reason with Grailed accusing for inauthentic item when I have clear proof of receipts and photos. No response from Grailed from multiple emails along with Twitter contact. Grailed team is ridiculously awful and pathetic for saying that they will respond within 48 hours. I  was a first time seller and was accused twice for inauthenticity. Item had been taken down and I had to ask for it to be relisted which had been approved just for me to get banned for the same reason that I had appealed. Great impression for my first time selling on your website. I don't know how their team operates but it's outrageously disgusting and a serious what the **** when you experience it. HIGHLY DO NOT RECOMMEND GRAILED...","title":"DO NOT USE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=33&stars=1&stars=2&stars=3"}]