[{"date":"2021-04-12","author":"Brett Bausman","text":"Literally the worst ordering process ever made. I’m surprised people have actually received items from here. Using the most sketchy shipping company my shoes were coming from Japan and when they said they were delivered, my leasing office who accepts all packages never received anything. I reached out to customer service 5 or 6 times. I made the mistake of ending my case with PayPal cause as soon as I brought it up they updated the shipping to “on its way” Grailed is absolutely horrible I’d rather pay the extra few bucks on stock x and get my stuff in a timely fashion and actually receive my items!!!! Grailed should get 0 stars out of 5 do not use them","title":"Literally the worst ordering process…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-04-15","author":"Ryan Stonebanks","text":"Grailed moderators froze my account with no notice or detailed explanation as to why, except for the automated response that describes how “inauthentic items were being sold”. After being frozen, I received an email that encouraged me to contact the support team to appeal the  frozen account if there was a mistake.\n\nI sent an email asking what exactly got my account frozen (no specific product was deemed “inauthentic”) just to get a seemingly automated response that stated how there is no chance for my account to be unfrozen and that there will be no further responses to my appeal messages. They didn’t even read my first message, and once I sent a follow-up I received the exact same message signed by a “Lexi” from Grailed support, which I suspect to be a fake name for an automated response. I felt very restricted from receiving the support that I am entitled to as a user on their platform.\n\nGrailed support considers its users just another number in their statistics, with no real support to help with issues such as this. Grailed has been a great platform for me as a reseller for many years, I had built a strong reputation with an overall 4.7 star rating from my 10+ reviews and 15+ sales, which was cut short from my account being frozen. It was very frustrating for me to lose my account so suddenly.\n\nI even had a pending order from a purchase I made off another Grailed user, which was interrupted from my account termination and I have yet to be able to track my order which I already paid for prior to the account freezing.\n\nGreat platform for buyers and sellers, very poor user support. If it wasn’t for my bad experience, I would have rated the platform 4 or 5 stars rather than the 2 star rating I decided upon. Do not depend on the support team to solve your issues, they likely will not help.","title":"Very Poor Support Team","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-04-16","author":"Yana Capps","text":"This is horrible site with horrible policy. They are allow to sell cheap stuff way over priced. I purchased pedant for my husband's birthday (It was not that expensive - just 40$), but when it arrived - I looked at it and it was the most horrible (quality wise) thing I've ever bought. Later on I found one for like 18$ and one on some Chinese website for a couple of dollars. \nThere is no return possible because the picture matches what I've got. But the quality... Facepalm. Never again... I think they are also based in Chine, maybe with some little office in NY. I guess not worth to fight over 40$ that they can put up in their a$$...","title":"This is horrible site with horrible…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-04-17","author":"long chi","text":"Being used grailed since 2015 and have been 5\/5 ratings since then. Recently I have posted high demand a pair of used off white air Jordan 1 UNC. Shoes have been digitally authenticated in about 5 mins after I posted ; then week after my post has been deleted due to reason of inauthentic replica. What the heck? Now I reposted with a more cleared pictures of shoes ID and details as much as I could do but it takes forever for “under review”. \n\nMy grailed ID: Lvbeifan","title":"Bad moderation and authentication team","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-04-24","author":"Gerald Hann","text":"Total incompetence. Bought an item from Gucci old Bond Street  London. The actual store. Listed with shot of invoice. They declined listing saying counterfeit. What a joke. Wouldn’t trust what they say as they don’t know their job","title":"Total incompetence","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-04-28","author":"Nure Kerimi","text":"If I could I'd give 0. My account got frozen for no reason, I keep getting automize answers just like many users here have stated. Overpriced items sold anyways. Depop is way better tbh.","title":"If I could I'd give 0","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-04-29","author":"Richard Gonzales","text":"I wanted to give the seller plenty of time to get my purchase ready for shipping requested a tracking # got no reply gave him some more time still no reply.Requested a refund and got  it next day.thank u grailed.\nGreat customer service","title":"I wanted to give the seller plenty of…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-05-03","author":"fai chong","text":"My account was frozen for no reason , it always auto remove listing by system said it is inauthentic item , i was try to prove and email them many times , because im worry it make my account will frozen and bad record , but never answer , thats why happen now , i have almost 5 star feedback from many customer , for now still no one email me back , this is stupid action , it will make customer open chargeback and claim money after my account frozen , it make trouble on this even im selling good item and provide good service , anyone help .","title":"My account was frozen","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-05-10","author":"Adam K. Wilson","text":"My first week on Grailed I bought 5 products from 5 different sellers. One arrived broken, one arrived a size larger than advertised, one wasn’t shipped at all and I had to get a refund 2 weeks later, and the last item was cancelled by the seller 3 days after I purchased. \n\nOverall terrible results. Won’t take another chance with Grailed. \n\nNo buyer protection at all.","title":"My first week on Grailed I bought 5…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-05-11","author":"Paul Mather","text":"Absolutely terrible and would avoid,  I used grailed for the first time to buy a sweatshirt.  It was not 'lightly used' and after providing a formal photo with all the necessary information I have heard nothing at all.  Raised a formal compliant but again 'radio silence'.  There isn't a phone number that you can talk to someone as you would say for 'E-Bay'","title":"Absolutely terrible and would avoid","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-05-13","author":"Jada CJ","text":"I tried to purchase a product but the seller did not have it in stock unfortunately but the refund process was very quick and easy. Excellent service.","title":"I tried to purchase a product but the…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-05-15","author":"Brett Goldner","text":"I think a group of mentally challenged high school drop out stoners run this so called business.  Not sure if they don’t care or are incapable of doing good business.  Buyer side not terrible, but as a seller... get you Vaseline ready!","title":"The Mentally challenged run this business","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-05-25","author":"Lisa Jay","text":"I give Grailed 1 star.  i wanted to sell my shoe through grailed but they told me that my shoes is not inauthentic while i got my shoes through Snkrs!. I contacted them and left all my proof of purchase with my details, even then they didn't believed me. I wonder who checked their shoes because Grailed has no knowledge of it.","title":"I give Grailed 1 star","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-05-25","author":"Chuck","text":"Well, the \"whole' experience was a huge waste of time.  From purchase to...awaiting a refund (still pending).  Probably 20 days to see absolutely nothing, nada!  Get it folks?  The seller in my case claimed they had shipped, and I was happy to take that on word-nope!\nI heard a very big \"nothing\" since then.  Ouch!  I learned the hard way here.\nNo Grailed in my future, too many other reliable sources available.\nAdvice-filter your sellers, and police them!!!","title":"Ouch!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-05-27","author":"Sabria Machtane","text":"HORRIBLE! \n\nbad servic, they have no knowledge of what is real or fake.\nI would never buy or sell stuff here again","title":"HORRIBLE","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-05-28","author":"Francis Haddock","text":"I have bought several pairs of shoes via Grailed and was generally pleased each time.  Until one of my favorite brands (Visvim) did not fit.  The size was correct, but the shoes were way too small.  I expected better quality control with Visvim (the shoes were tagged Made in Japan).  I agree with sellers that it is wickedly tricky to measure the inside of a shoe--this is distinct from garments that are more easily measured.  Unfortunately, I bought two pairs at almost the same time and none fit--shame on Visvim.  According to Grailed, if the seller will not accept a return then the buyer should sell the item.  Some of us have never sold anything and don't know how to do it.  That's why we are buyers.","title":"No recourse for buyer if an item doesn't fit","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-06-05","author":"Nicolas Girod","text":"Human experience has decreased so much... have been using grailed for years. Recently I published some undercover and prada sport clothes THAT I KNOW are authentic. However, Grailed removed them pretexting they were unauthentic\/bootleg. I try to message them multiple times to confront them and to prove my items are authentic, but I don’t get any reply. They decided to raise their fees, and to use some type of algorithms to check the new listed items, the human interaction at Grailed is DEAD, the concept of community too. The worst is that I am probably red listed by them and if I do repost an item there, I’m scared to be banned without any explanation and for another mistake from their end. I’v been selling designers clothes for years, always checking my product to only sell the legit ones, and grailed was a great platform to get more exposure. It is sad to see my only way to get their attention is by posting a review here... hopefully this time they might get in touch with me to have a real HUMAN interaction..","title":"Human experience has decreased so…","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-06-10","author":"Tiger Hu","text":"Awful site with awful mods and employees.\n\nI had 5\/5 feedback with over 200 feedback and always strove to be the most genuine and honest seller that I could be. \n\nThese guys de-platformed me and took away the only source of income that I have and without even the chance to prove myself. \n\nI was not given proof of counterfeit items nor do I even own any counterfeit items. This goes to show that their mod team does NOT know what they're doing.\n\nSimply put, the marketing is the only good thing about this company as all of the other good aspects that used to draw buyers and sellers has long since faded.\n\nIn honesty,\nT","title":"Awful site. Awful people.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-06-13","author":"Bartosz Kokot","text":"really bad site for selling,\nadmin team is joke, almost 400 transactions 120 positive feedback *average 4,7 \nget banned becouse one of my items was fake but nobody tells me wchich one \nclowns overthere","title":"really bad site for selling,","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"},{"date":"2021-06-21","author":"White Store","text":"I've got an honest sellers account and had 200 successful transactions with no negative reviews.\n\nMy account was banned and I wasn't even given a proper reason why this is the worst way of moderation and I hope they lose all their customers.","title":"I've got an honest sellers account and…","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=5&stars=1&stars=2&stars=3"}]