[{"date":"2020-04-27","author":"marcos","text":"People make mistakes. I apologize to the entire grailed community. I have been a user for three years, always perfect but the need made me do that. I ask for the last chance, I have remained unemployed I have had to close my business. Please give me a chance, I could contribute a little of my savings, just let me go back to this community that has made me so happy, I am in a very critical situation me and my family, this is a open community, not only for clothing, a multicultural community .I have a buyer waiting his pair for the Covid19 that i sold through Grailed, and please I want to contact him. I have put public apologizes on Trustpilot. More than 3 weeks frozen.\n\naccount: markos_aramayona","title":"People make mistakes","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-04-28","author":"indira sharma","text":"Grailed is moderated by clueless kids newly out of diapers.\n\nI just tried to sell some of my Rick Owens and had my listings ended by a Grailed child claiming the goods were not authentic. I made an appeal but still felt like I was dealing with a clueless child freshly out of diapers. \n\nThere are better places to sell where you don't have to put up with such idiocy.","title":"Grailed is moderated by clueless kids…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-04-28","author":"вадим кузнецов","text":"Grailed frozen my account\nHi Team Grailed! \nmy account: shop_goodjobreally\nI have been with you since 2018, during this time I made 30 successful sales, my rating is 4.8 \/ 5 stars. On April 23rd, my account was frozen for no reason ... I'm very upset about this. I beg you to unfreeze it. Thank you very much!","title":"Grailed frozen my account","stars":3,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-04-29","author":"Never_Sold_Out","text":"Why don’t you let me try to prove that it’s not fake? You only say that you have evidence. You do not have them, show me your evidence, please.\nI want to cooperate with you, and you treat me like I’m wrong, although you actually have nothing against me except the word of someone there who checks something for authenticity. The same person missed the non-existent Balenciag model on your website, by the way, someone already bought them ... (g r a i l e d com \/listings\/13978797-balenciaga-triple-s-clear-sole-rainbow)\nPlease stop shaming and let's work together","title":"Grailed blocked my account №3","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-04-29","author":"valentin maxence","text":"Grailed = more bad reviews than good.\n\nIs no one else disturbed by the fact that Grailed has far more bad negative reviews than good ones ?\n\nI've been a buyer and seller on Grailed. Had some good experiences, but also very bad. Ended up with fake goods where Grailed did not give a damn. Been sent the wrong goods where Grailed also did not give a damn. They only suggest you go to Paypal with your problems. Their limited staff do not have the expertise, experience or knowledge to know what is genuine. Their knowledge probably starts and stops at Yeezy or Supreme. \n\nWhen you are a seller you can't have proper interaction with customers because Grailed are so paranoid you might be trying to do an off-site transaction, so they keep sending you red warnings. So all communication needs to be kept cold and basic. It's not possible to build a relationship with a consumer.\n\nAs a seller you are continually dealing with cheap buyers who want everything for a few dollars. You get constantly messed about. All communication from buyers is \"lowest price?\" \"deal?\" \"trade?\". There's no proper form of language or attempt to construct a sentence. And even when you agree on a price they do not pay. It's truly the most miserable website to try and sell on.\n\nAnd then you have Grailed moderators who pull your items for pathetic reasons for clothing they have no knowledge about. Have you bothered to look at the Grailed Team Instagram account ? They are kids barely able to grow proper body hair. What is their background and knowledge to be able to know anything about what's sold on Grailed ? They know Off-White but they couldn't tell you anything about Chanel or real fashion houses. They have heard of Balenciaga, but could not tell you anything about the house and its codes. I doubt they know the Christian name of Balenciaga without searching google. These are kids that probably only know about streetwear and have worn VANS. \n\nTake some advice, use other websites to sell on. Build your own website on Shopify. Take care of your own business. Don't waste your time trying to use a platform run by les enfants. There's no good reason to support a business like Grailed if they do not care about their sellers or buyers. It's far too easy to claim \"we care about your trust and safety\". Hollow meaningless words. They do not care about anything apart from their profit margins.\n\nThe following is nonsense written on the Grailed website :-\n\nOur expert moderators work around the clock to review and verify listings posted on Grailed for authenticity. We ensure that the items we review are Authentic. We check labels, patterns, textiles, and many other details to make sure items are the real deal and remove items that are likely to be fake.\n\n\"Our expert moderators\". What makes anyone at Grailed an expert on anything ? Their les enfant staff are not old enough or experienced enough. \n\n\"We remove items that are likely to be fake\". So why is Grailed littered with fakes ?\n\nThe whole Grailed website and its les enfants staff and moderators are a joke.","title":"Grailed = more bad reviews than good.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-04-30","author":"pnam jayrat","text":"My account has been frozen for a non-sense reason ‘listing inauthentic items’ by ignorant moderators \n\nI replied back to the email and sent to appeal as instructed on 24 April but haven’t received any response.\n\nI asked if they could provide me with more details on why my account has been frozen when all of my items are authentic. I provided receipt copy from the store in my listing. I have 100% positive feedback, fast responding to question with facts. I am not sure what else I have to prove.\n\nI only sell authentic items and most of the item I’m selling are Louis Vuitton. I have been buying a lot of LV products. Hence, I’m selling those one I no longer want. It can also clearly be seen that I only have 1 qty for each product. \n\nThis hurts me a lot. I have seen a lot of fake LV products on Grailed and those sellers are able to list their items. I, on the other hand, am selling the authentic ones with reference and receipt to prove - yet my account is frozen for listing inauthentic items (that the Grailed moderators have no clue about).\n\nI bought all of my items from the stores by myself and have provided copy of receipts.\n\nI asked if they could provide me just one - one spot that could tell my items are not authentic - no reply. They even take down the listing without even an attempt to ask the question. This is just hard to understand.\n\nHow did they authenticate the product? I have no idea. In fact, it was the moderator who have no clue. Even you provide the receipt in listing, they don’t care. They just want to freeze the account for no reason.\n\nI guess you can only sell street wear on Grailed. \n\nMy user name is pnamjayrat","title":"My account has been frozen by ignorant moderators","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-04-30","author":"Darryn ","text":"FIrst of all, the only reason they have 1 star is because I cant give them 0 stars. All that stuff like Grailed protection is some bull. Because this seller took my money !!!. I was purchasing some yeezys from this guy. and he took way to long to have them shipped out so i just asked for my money back and this clown basically is refusing to not give it to me so i reach out to grailed protection TWICE and they didnt get back with me either time. and basically just let him get away with it. I am extremely disappointed and I promise you i will never spent another dime her ever again. and if i were the rest of you i would never come back here to this site again. they are janky and I have no respect for it there are plenty of our places to get quality sneakers and street wear and they treat there customers better than this","title":"RIPPED OFF !!!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-04-30","author":"Never_Sold_Out","text":"My shoes are confirmed to be inauthentic by WHO? Let me contact this man. Or let me see what proofs of inauthecity he gave to you, please.\nIf my shoes were fake I would just create another account and continue to sell fake. But I didn't tho. I will text you until you unban me.","title":"Grailed blocked my account 4","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-05-01","author":"andreask44","text":"Got frozen for sending a link asking if the picture matched his listing.\nSince then grailed has not responded me and i lost my account","title":"Got frozen for sending a link asking if…","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-05-01","author":"RIICARDII","text":"Geezus, PLEASE UNFREEZE MY ACCOUNT just wen I get my account back do you guys freeze it for what reason now I've done nothing wrong but make sales through your site your platform you are getting paid why are you freezing my account and been in my account that's my account RIICARDI I just made two sales today through your platform what is the problem","title":"Plz unfreeze my account","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-05-03","author":"Hayden","text":"I’m trying to reply to buy something and it keeps coming up error and won’t send \nUsername is churchy_rule799","title":"I’m trying to reply to buy something…","stars":3,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-05-03","author":"Sean Lee","text":"Alright so, I posted a listing of my “Yeezy Boost 350 V2 Black Static” size 9 on my page, that I got from YEEZY SUPPLY (with online receipt). I cleaned up the shoe itself before posting and then whitened the boost, and grailed here comes over to me and tells me that my item is “inauthentic”. I understand that it’s digital and “not 100% accurate” but they still haven’t responded to my email in a while. They pretty much just told me that Yeezy supply gave me a fake shoe 🤣🤣. I can send every photo and detail of the shoe that I can prove to you that it’s legit as well as the online receipt (Nov 29. Release date). Sigh, I’ve had problems before but they refuse to tell me what was wrong with my item. There wasn’t even a factory defect on the shoe and I literally posted TWO pictures, and they call it fake without looking closely at all. I’ll change this review (stars) to 4-5 once grailed comes through and verifies this. Thank you.\n\nMy acc is @SCL. I highly recommend grailed but this is a minor inconvenience, thank you grailed moderators and please take this into concern and reply to this or my email.","title":"Authentic item from Yeezy Supply (with receipt) accused as unauthentic","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-05-04","author":"Salvadordaliroden Gala","text":"Dear Sir\/Madam,\nI am writing with the purpose of unfreezing my account. \nMy username is VladislavKevlar. From the email message from your administration I read that the reason for freezing my account is posting an inauthentic item. It happened after I posted Balmain Jeans. I was given this item as a present and I did not know that it can be inauthentic. I deeply respect your website and your policy, and did not mean to harm users of your community. In future I will be more accurate checking items authenticity  before listing them. I would be very grateful if you give me the right to continue using Grailed. I look forward to hearing from you at your earliest convenience.","title":"Unfreezing account","stars":3,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-05-05","author":"YiLin Choi","text":"I used to sell quite actively on this platform.  I have about 10 sales and have purchased multiple times from this website.  They've been picky in the past and some features are annoying.  First, my account gets like this shadow ban whenever I try to reach out to my customer.  But once the customer put the email in the chat not me.  Another time, it sent the error but all mentioned in the chat was how the item came from somewhere else.  The thing that really made me mad was how recently I purchased this pair of Balenciaga Speed Trainers from jomashop.com.  They got flagged as fake and it was weird.  I filed an appeal and showed the ORIGINAL RECEIPT and they still said it was fake.  It was clear the email was paid no attention to as they said \"Our moderators have removed the infringing listing and will be taking appropriate action. Thank you for bringing this listing to our attention!\"  This was my own appeal! A companies true values really show in their customer service and this one really let me down.  I've brought my business to them for many times in the past.  Along with that, there are some great buyers who are understanding, but there are low-ballers who think they know more than you and try to make your item seem worthless.  Some buyers refuse to chat and even when you ship within 5 days they will leave a 1star review on how you're slow.  This site is still a good site for buyers, and I probably will still use it as its probably the largest site for used clothes, but I wanted to share my experience as it hasn't been super positive.\n\nmy account is : aznclosets","title":"A sellers perspective","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-05-05","author":"Lobbo","text":"Customer service doesn't help\n\nI was scammed, and my item is not refunded. The tracking for the item has expired, user's banned, sellers review plummeted to 1 star after i purchased, and I still haven't got any refund.\nThey say they've refunded it, but I haven't recieved anyhting. I quote \n\"Hi,\nThanks for reaching out! Your fee refund was automatically sent when you refunded the initial transaction.\"","title":"Customer service is bad","stars":2,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-05-05","author":"Matthew Alquisada Mansoori","text":"I like the items on the website, but they have huge customer service issues. I have been messaging them for the past 2 weeks for a refund and haven’t received any replies. I feel like I got scammed.\n\nusername: mattamansoo1255","title":"Not the best customer service","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-05-05","author":"marcos","text":"People make mistakes. I apologize to the entire grailed community. I have been a user for three years, always perfect but the need made me do that. I ask for the last chance, I have remained unemployed I have had to close my business. Please give me a chance, I could contribute a little of my savings, just let me go back to this community that has made me so happy, I am in a very critical situation me and my family, this is a open community, not only for clothing, a multicultural community .I have a buyer waiting his pair for the Covid19 that i sold through Grailed, and please I want to contact him. Moderator must be more solidaries.\n\naccount: markos_aramayona","title":"People make mistakes","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-05-06","author":"Остап Груша","text":"Hello! My name is Ostap Grusha. My grailed account is grusha_shop. My account was blocked for no reason. Also, I can’t log in to my account! I assume that you have limited my account due to the fact that I do not send packages on time. Now in the world of quarantine and I physically can’t get to the post office, just because of your site I was deceived by the buyer who returned his money and received my jacket for free which costs $ 250. I hope you take some measures and you can again return my account! I wrote to you at your mail from my mail I didn’t receive any answer. It took more than 2-3 months and I don’t know who to contact more, I hope you can help me!","title":"account issues","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-05-06","author":"Afandi","text":"Grailed freeze my account (VINTAGEMADNESSSTORE) coz of the buyer filed a baseless accusation  after more than 7months  of transaction.(Paypal's decision was on favour of me) on March 2020. Had sent numerous email from March till todate and Grailed never respond to any of my email and still freeze my account.","title":"Grailed freeze my account with no sufficient evidence","stars":1,"location":"MY","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"},{"date":"2020-05-06","author":"Mateo ","text":"Literally banned for no reason I put up a listing and it was digitally authenticated then I took it down because someone wanted to buy it but he flakes so I put it back up and it got deleted for being “fake”","title":"Literally banned for no reason","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=17&stars=1&stars=2&stars=3"}]