[{"date":"2020-04-12","author":"Valentina Feximus","text":"Hi grailed staff team my account recently got banned for fraudulent activity. I have not done anything wrong and I have been patient for many days waiting to sell my items!!! I’am not really sure why I was banned for “fraudulent activity” please respond to me . My username is “constancebrands” if I have done anything wrong please let me know.","title":"Hi grailed staff team my account…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-14","author":"Monica Kun","text":"My account was frozen.. Because of inauthentic items. It was really mistake and I am really sorry about my postings. I didn't know that it was inauthentic. I just really want to sell on Grailed. Moreover, I need this, I am a good seller...\nMy account's name ukrainianflex","title":"Frozen account for a mistake.","stars":2,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-14","author":"An Tai","text":"Banned for no reason!\nI was selling and everything was going well. And suddenly my account was hacked and I couldn’t get it back! I wrote in support, the account was blocked, and now they don’t want to unlock, I don’t understand why! I had authentic goods, had successful sales, but I can’t unblock me not because of my fault! I don’t understand what’s going on, what terrible support this site has. ID aleksrex","title":"Banned for no reason!","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-14","author":"Valentina Feximus","text":"Hi again, I saw your response on my statement below, I’am fairly new to the platform and I wanted to show more pictures to a potential buyer through WhatsApp\/Instagram , I’am sorry I did not think this through and I did not think it was punishable I’am truly sorry .I went over the rules and regulations regarding grailed so I have a better understanding And I will not do repeat this I will instead re list the post (friends advice) again I’am truly sorry, if you can please re instate my account that would be great as I’am trying to sell my items to get some money back due to the crisis.\nHi grailed staff team my account recently got banned for fraudulent activity. I have not done anything wrong and I have been patient for many days waiting to sell my items!!! I’am not really sure why I was banned for “fraudulent activity” please respond to me . My username is “constancebrands” if I have done anything wrong please let me know.","title":"Hi again","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-15","author":"Mikey Grayson","text":"First of all I would like to apologize Grailed for breaking the terms of service. I am a longtime seller on Grailed for years  with perfect feedback and a great reputation. I went against the terms of service by trying to contact a potential buyer on Instagram. In my opinion, it is much simpler and quicker to use this alternative app as a form of communication. I understand my faults and I won't make the same mistake again and won't ask or respond to buyers who want to communicate on a different application. I am truly sorry and I would like to continue doing business on your site. \nMy username is Lethargy","title":"Frozen Account because of  Mistake","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-16","author":"Jordan ","text":"Yes I understand this was the issue but I explained to the customer that that was done by accident as I was sending out many packages that day & accidentally sent over that box with nothing inside as you could see in the messages, I even lost the original shoes in the process of this transaction & sent it to a completely wrong address which was a buyer through Depop, I am a reputable person on grailed with great feedback there’s no way this one encounter could ruin my account. I was even about to send the customer a refund but he then made a PayPal dispute in which he lost & PayPal allowed me to keep the funds. But then a couple days later the case was reopened & then he won. I love grailed it allows me to work at home & it was a mistake as accidents do happen, can you guys please bring my account back I promise for this to never happen again I’m so so sorry.\n\nUsername - 23collections","title":"Frozen grailed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-16","author":"derek durojaiye","text":"was about to purchase two items on Grailed then I started getting an error message. I found out I was banned due to a “fraudulent chargeback” I emailed them 5 days ago still no feedback. The chargeback was a dispute from PayPal because I did not receive the shoe in the condition it was advertised, I reached out to the seller because I was planing on returning it. In 10 days the Seller did not respond so PayPal issued me a refund. I am a reputable buyer and seller with 70+ transactions and 5 star rating. I wish I was able to call them and explain but they only take emails and they take forever to respond. This is just unfair and unjust, I was not given the opportunity to explain the situation nor was I given any warning. \n\nUsername: ShegzJ","title":"Frozen account","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-17","author":"marcos","text":"please give me a chance, I have mailed Grailed","title":"chance","stars":3,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-19","author":"Tony","text":"Trying to sell my item which I bought directly from Nike.com but Grailed team reviewed my item and said that it is inauthentic. What are they smoking really.","title":"Trying to sell my item which I bought…","stars":1,"location":"TH","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-19","author":"Vanigas Is here","text":"First off I love Grailed never had a problem until this week. My account was frozen due to listing “inauthentic item” yet for the record i had this item listed before on Grailed but I took it down because i wasnt ready to let go of it, but when i relisted Grailed kept taking it down claiming it was “fake” however This is not true i purchased this Pendant of the brand ChromeHearts from a very reputable ebay seller WITH screenshots and proper documentation, ive had it authenticated by multiple friends. However it is a old piece so the engraving had gotten a bit old over time but that is completely normal due to age of the item So the fact that the Grailed Team has banned me for listing a legitimate item is beyond me and not to mention ive emailed grailed they say 2-3 business days response and its been over 4 days and no word. \nMy account name was ASAPGarments\nGrailed please reach out to me hondadirtlife @gmail.com ive reached out twice due to you guys saying you never received my message and still yet to reply","title":"FrozenAccount","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-21","author":"John C","text":"My username is jcamp186. \n\nI have been trying to purchase a jacket for days now. Plenty of money in my bank\/credit accounts (note:accounts), however each time I try to add a card (I’ve tried several) it gives me an error. All I want to do is buy this item, and I cannot. What’s the point of an app\/site meant to broker sales, if you can’t buy something on sale ?!","title":"Unable to purchase item I want!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-21","author":"marcos","text":"People make mistakes. I apologize to the entire grailed community. I have been a user for three years, always perfect but the need made me do that. I ask for the last chance, I have remained unemployed I have had to close my business. Please give me a chance, I could contribute a little of my savings, just let me go back to this community that has made me so happy, I am in a very critical situation me and my family, this is a open community, not only for clothing, a multicultural community .I have a buyer waiting his pair for the Covid19 that i sold through Grailed, and please I want to contact him\n\naccount: markos_aramayona","title":"People make mistakes","stars":2,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-22","author":"Sean Lee","text":"Hey everyone! I’ve been using Grailed for quite a while now and I have 20+ reviews with 36 transactions, and my account has been frozen for asking for pictures! I’ve made a mistake, and I went ahead and clicked on the FAQ’s and terms of service and pretty much re-read everything to ensure that this WILL NOT happen again. Again, I didn’t mean any harm to the seller (if it’s possible I can ask him to email @grailed support for proof that I didn’t do anything wrong just asking for pictures) and I really enjoy using this app for all of my services, as customer service is fair and reliable. I know I have genuinely made a mistake and I would greatly appreciate it if I could start buying\/selling without a problem on the account again! I 100% ensure that this WILL NOT happen again and I’m sorry for the inconvenience. I’ve emailed grailed appeal but I’ve got no response, so I was hoping to try to get my account reinstated here. Thanks! \n\nMy user is “SCL”","title":"Grailed account frozen","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-22","author":"kerilee carey","text":"Shoes did not meet expectations. Were not as described. Stains on fabric and rubber that were not described\/photographed. Listing stated  had been professionally cleaned - does not appear true. No support whatsoever from Grailed. Told\nto make a PayPal plan, PayPal considers difference in quality, condition to not be materially different and will not refund. Stick with GOAT or StockX where you products are verified and they protect their customers","title":"Shoes did not meet expectations","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-22","author":"marcos","text":"Please I want to contact him personally. I put the track on Grailed and Paypal. Please I have been apologizes, give me the last chance this not will happen again. All my rates are with 5 stars, I only want to sell on your platform and buy too. A lot of user do wrong things on Grailed and still using the platform\n\nuser:markos_aramayona","title":"Please I want to contact him…","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-22","author":"Never_Sold_Out","text":"My Grailed account: Never_Sold_Out\n\nHello. I've been listing Off-White x Air Jordan 5 Sneakers, and Off-White x Nike Dunk Low Sneakers on Grailed. Every time I was trying to list my items I waited 48 hours and then received message that says that my shoes are inauthentic. I was trying to make more photos to proof the authencity but got declined every time. I'm 100% sure that my items are authentic, because I've bought them from Official Retailers (KM20, OFF-WHITE, NIKE SNKRS) and have an invoice letters for every pair.\nSo, I decided to write a letter to appeal center and handle this problem, because I knew, that my shoes are authentic and could proof it.\nThat's what I wrote to them:\n\"Hello guys. I have Off-White x Air Jordan 5 Sneakers, and Off-White x Nike Dunk Low Sneakers. Please, tell me, how can I proof the authencity of these to you, because I've tried a lot of times and you were declining them. I have invoice (letter from the shop) for every single pair and can make any photo that you will ask me to do. Also I do not understand how your team are legit checking every pair, just because I don't get any comments about my pair, they just decline it and tell me that it's fake. Why wouldn't you tell me why is it fake. I don't think that the official retailers are selling fake. So I am ready to deal with you and handle this one situation just for me to prove you that it's authentic shoes and for me to sell it on your marketplace. Thank you.\"\nDay after I got BANNED and received this message from appeal center:\n\"Your Grailed account has been frozen for listing counterfeit items. At Grailed, we value the trust and safety of our community and we reserve the right to freeze accounts that are inconsistent with our expectations. For the safety of the community, we're unable to reinstate your account.\"\nI already got 15 transactions to the moment and 2 feedbacks with 5 stars. I didn't even got chance to prove the authencity of my items.\nThey don’t even consider it necessary to explain why my shoes are fake, while I did my best to prove the authencity of my shoes.\nThat is awful. I do not recommend to work with this marketplace, because they ban everyone for no reason.","title":"Grailed blocked my account","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-24","author":"Rasmus Ty Hammarstrom","text":"Grailed has been great to me up until recently, where they haven’t gotten back to me about my frozen account in over 3 weeks. I recently received a fake pair of shoes from someone that I paid $800 for, and PayPal is being extremely unhelpful as well due to the virus. I would really like to contact the seller about it, but can’t because someone tried to go offsite to sell me a hoodie. I would extremely appreciate being reinstated as I was previously actively selling and buying on the platform and have 32 positive reviews with no negative ones. Thanks.\n\nUsername: ufogogo","title":"Grailed has been great to me up until...","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"},{"date":"2020-04-24","author":"Never_Sold_Out","text":"Tell me which of my shoes are fake and I will give you proofs that they are not, if you can't give me proofs that they are fake. You just saying this and don't know nothing about legit checking, your staff probably doesn't know nothing about this, because all my friends tried to upload Off-White x Nike sneakers were getting declined. But I've tried to cantact you to handle this question and you banned me like I'm a stupid kid or something inconsiderable. I'm sorry, but I do NOT deserve such an attitude towards myself. I know that I got all proofs and you got nothing against me, so, I'm waiting for your answer. I want to repeat myself, just contact me, I can prove EVERYTHING. I like your site, but this moderation... I have all the evidence, I am an honest seller. Just contact me, I'll give you all the evidence, and if they don't convince you, then your legit checkers are simply incompetent.","title":"Grailed blocked my account №2","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=18&stars=1&stars=2&stars=3"}]