[{"date":"2019-12-10","author":"Jimmy Darmody","text":"My account was frozen. I have emailed grailed several times asking for a specific reason why and each time I get the same no excuse emails.They can not find my account with over 80 listings which I worked hard to create. Please give me a Specific reason and unfreeze my account. This is about the 10th email I have sent with no resolve. If I did something wrong so could you please let me know the actual reason that you frozen my account. My last post is Visvim x Fragments Design and I can legit it’s authentic. \n\nMy id : LeningradCowboys51","title":"My account was frozen","stars":1,"location":"TH","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-10","author":"publogg","text":"Terrible customer support. they frozen my account and never refund my sales fee. Check honsin5423 at gmail. I've email several time to customer susport but they never riplied..","title":"Terrible customer support","stars":1,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-11","author":"Jimmy Darmody","text":"Could you please let me know the actual details of counterfeit Chrome Hearts jacket. Actually I really need to know the formula of decision to judge that my jacket is fake or inauthentic. Did you try to asked to the buyer? who really active and push me to sell that jacket so quick. I don’t see any fake spots on the jacket by my own opinion. Actually I’ve read many forums about frozen account by Grailed. It’s many times happened on Chrome Hearts selling post that’s always make banned on sellers even the sellers claim as it’s authentic. \n\nSo please let me know exactly point or actual information on this that make me feel I can admit or satisfy on the issue that you claim on and banned me. Please don’t just give me unclear answers this is very serious and sensitive situation for me. \n\nI work on this super hard and spent a lot of time and money on this. You could break my heart or even my life with that wrong decision. \n\nIf this is misunderstanding please re check all the problem again.\n\nPlease consider my situation seriously.\n\nI beg.\n\nApologize for my bad English.","title":"RE : from the last post (please answer in here) you didn’t respond me on email","stars":1,"location":"TH","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-11","author":"publogg","text":"They frozen my account even I was doing honest business long time on grailed.Check honsin5423 at gmail. and they should explain specific reason why they frozen my accoxnt.specifc reason.","title":"They frozen my account even I was doing…","stars":1,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-12","author":"Jimmy Darmody","text":"Re : this is from the last post about refund to the buyer. I had refunded to the buyer with full price of refund. And I already sent the proof of refund to help@grailed Please check about the photos I attached with to proof and appeal this problem. \n\nThank you.","title":"Re From the last post.","stars":3,"location":"TH","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-13","author":"Wendell Zee","text":"I have helped this platform make so much money and i am EXTREMELY disappointed in how they mistreated me. My account was recently frozen. I have emailed and appealed to grailed several times on reddit, their appeal email and even created a separate account to access one of their mods on site. All my messages were ignored. Their customer service is absolutely the worst. I've been with them since their beta stage with no fees and have helped them grow by providing superb services. My account has over 800 listings, fast reply, quick delivery, all throw away which I worked hard to create. I was definitely treated unfairly and am either being ignored or blocked. They claim I violated their rules for off site transaction, but it is the buyers who asked for my IG. All i did was provide it. No where did I agree to do an off site transaction. I would never throw my hard work to save a measly 6%. My account should be unfrozen. I am undoubtedly nothing but a valuable asset to your growth. account- kawsneffect","title":"I have helped make this platform what it is and was mistreated","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-14","author":"Vic Damone","text":"My account has been frozen email said for offline activity, but every purchase I’ve made and items I have sold have been through Grailed please fix this error of my account I’ve sent multiple emails with no response \n\n\nUsername : Steezgotti","title":"Grailed account frozen","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-14","author":"1600 Rager","text":"Hi, my Account got frozen because Grailed thinks i made Off Grailed activity. My Buyers wanted to see a receipt so they kept asking me to send it on Instagram but all my Sales were made on Grailed and with Protection.\n\nPlease answer\nUsername: smirnoff","title":"My Grailed Account got frozen because of Off-Grailed-Activity","stars":3,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-15","author":"Alex Cazares","text":"Hello, my account is @valex and my account was frozen due to an inauthentic item, it doesn’t state which item is inauthentic which is very frustrating because I don’t own any inauthentic items and will take down whatever it is that is causing my account to be frozen and will not post again. I make custom pieces and always put custom in designer and\/or description and if I missed one Item I would not mind fixing it I will double check listings before posting.I have been a user since 2016 and have bought and sold many items, it sucks to be treated this way as I have nothing but 5 star reviews on all of my sold listings and have nothing but good intentions, I feel like I am treated unfairly due to the fact that I have used this account for years, if I ever have an issue with a buyer I would be glad to fix the issue. It would be different if I just made an account with no feedback selling an “inauthentic” item.\nEmail: cazalex444@yahoo\nGrailed: valex","title":"Grailed is unfair with long term supporters","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-16","author":"Alex Petersen","text":"Pls help grailed. \nSo my account got \"froozen\" because of a \"inauthentic\" item. To be honest i dont know if its authenic i bought it on facebook and dident think much of it. So its fair i got \"froozen\" if it is fake, im not saying its not i dont know. \n\nBut here is the problem. \"Our moderators have reviewed this item and it appears to be inauthentic. Please do not relist it. Repeatedly listing inauthentic items will result in the suspension of your account.\"  to my understanding this means it will be unfroozen after som time since i dont \"repeatedly\" post it, i have writen to suport if they are gona unfrezze me and if when. i have made 2 support cases no answers on any of them\n\nIf you say you will respond in 2-3 bussines days then do it or dont write it. \n\nin the end i like your app i have purchased something and i also havent got it and cant contact him. i just want my account opend pls \ne-mail:  alex.soelving2@ gmail.com \nSupportcases: 234592 and 237307","title":"Pls help grailed","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-18","author":"Roco","text":"I couldn't log in to my account today.\nHello, I ask you to help me find out the reason for deleting my account (Specialdelivery). today I tried to enter it, and I did not succeed. And no warnings about blocking my account were sent to my e-mail. Perhaps this is some kind of misunderstanding, since I conduct an honest business - my account has 5\/5 stars. So please reply to my message","title":"I couldn't log in to my account today.","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-18","author":"Nicolas Rossi","text":"Issues with trusted sellers","title":"Issues","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-18","author":"Jordan Nelson","text":"Currently unable to log into Grailed honestly don’t know why. My account name is 23collections\/23scollections I don’t know what the issue is I was just using the account too at that","title":"Account Frozen","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-19","author":"Дмитрий Кузин","text":"Deleted the page for no reason. The page name is vivaldi1818 . There were no sales or dissatisfied customers. Sold only authentic things. Site policy is not violated. Please restore the page or leave a comment why the page was deleted.","title":"Deleted the page for no reason","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-20","author":"Samuel Austin","text":"Hey Grailed, I have used your services for over 2-3 years now with no issues on my end with 15-20 plus purchases and love purchasing items and browsing your listings. I have several offers out right now for the holiday season hoping to buy gifts for loved ones and treat myself but suddenly was blindsided unexpectedly when checking if a seller replied when I saw a email stating I was banned for seemingly no reason.\\\\\\\\?\n\nslipknot_sam39 is my username and you can see for yourself I am not a scammer nor do chargebacks\/any fraudulent activity ever. Just a sneaker\/streetwear enthusiast who spoke highly about your platform until now.\n\nHoping to hear back from you all soon via email as I keep checking to see my account be reinstated but its been over a week with no response.\n\nA seller was going to provide his instagram for proof of receipt and was not trying to make a off-site transaction as I sure that's what had triggered the ban. At this point I wont even entertain any questions about my ig at this point I just wanna be able to shop with you all again\n\nHope we can resolve this and give some insight into this matter asap as I really planned on making several purchases with you all asap.\n\nCheers","title":"Please get back to me for some clarity Grailed","stars":3,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-21","author":"Nicholas Hipolito","text":"I have been using Grailed for awhile now, i sell Vlone frequently and in my last order i received a hoodie that was counterfeit & i was not aware of it because i have never has issues with fakes nor ever sold fakes. I think it is outrageous that i was banned for a mistake, why didn’t they just make me aware that it was fake and not repost the item.  i am not a scammer, i have a 5 star rating and was two sells away from being a trusted seller. \n\nthe name of the account was Lilsushivert._ \n\ni feel like i should be reinstated, something won’t happen like this because i will get all my items legit checked. i legit checked the hoodie and they lmk that it was fake so i have to talk to the person i got it from.","title":"I have been using Grailed for awhile…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-21","author":"Joe","text":"Tried to message someone from Grailed support multiple times. No one is responding i'm waiting two months for them to take look at my case because I got scammed. They replied on my last review and told me to send them my username so they can solve it, I did but nothing is happening. So here is my username and please do something.\nGrailed username: gelojosip","title":"Customer service","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-22","author":"Dwight Butts","text":"Actually, I'd give it a negative if available.  I'm a frequent buyer of luxury goods both retail and resale and guess I will stay w\/TheRealReal for resale, this site totally sucks!  First time user and the item, a Louis Vuitton scarf, shows available.  I contacted the seller several times, and no response so I reached out to Grailed customer service. \"Jason\" responded w\/ \"contact customer\" which I explained I had already attempted.  He finally answered yet again to \" contact customer\".  Can you imagine if you had a problem with an item? I have simply deleated the icon for this worthless site!","title":"Forget This Site","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-23","author":"Daniel Vanegas","text":"My account got frozen after sending out an E-mail to a customer who asked for it. The account was already frozen about 2 years ago, I asked why and never got an answer. Now they tell me it was previously reinstated on the grounds that \"off side activity\" will never happen again, and it even never happend again, I still got frozen.\nI am not a nativ english speaker and sometimes misunderstand stuff.\nThe account has 80+sold listings and 100% 5 star ratings.","title":"My account got frozen after sending out…","stars":2,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"},{"date":"2019-12-24","author":"Alex Petersen","text":"My account has been froozen and have now been told 3 of my items are counterfit and the thing is 2 of them I know are not. At the same time there was only 2 items up at the I time I got froozen so there was not even 3!! Grailed doesn't answer emails. It's unprofessional and bad service. I also only got a email for one of the times they have claimed to be fake. I will not recommend grailed if you are trying to sell\n\nMy email: alex.soelving2 @gmail.com\nSupportcases: 234592 and 237307","title":"Bad service","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=22&stars=1&stars=2&stars=3"}]