[{"date":"2020-02-14","author":"Ghost Boyz","text":"I was selling unreleased and exclusive merch and they all of a sudden up and Ip banned me, they claimed I got an order and never fulfilled it, which was a complete lie and then never responded after that. Im pretty positive the admins didn't like the fact that i had stuff they did not and couldn't prove it was fake now they buy my stuff via other outlets and sell it theirselves at a jacked price. Whatever you do do not give them your money they have the worst customer service in the world. I have no clue what the \"service fee\" is for i guess paying the trolls to report you when they get mad.","title":"I was selling unreleased and exclusive…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-02-15","author":"Ross","text":"They froze my account for no reason and are only giving me script responses. Since you are only responding on here, I guess this is the best way to reach you. My account was closed for selling “fake items”. You said I was claiming my jewelry to be real solid gold and real diamonds. If you read my description, you can clearly see I write GOLD PLATED and SIMULATED (not real) lab diamonds. I am not claiming them to be genuine diamonds or solid 14k gold. Only gold plating and simulated lab diamonds. It’s SO obvious I’m not trying to sell them as real. You don’t have the “designer” names I was looking for so this was the closest jewelry related option you had so I picked it. Can someone please message me regarding how to fix this? It’s a huge mistake and it’s so obvious I’m not selling them as real🥺 my account was @missjewelry .","title":"They froze my account for no reason and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-02-15","author":"Daniel Son","text":"Listed an item that was deemed inauthentic by Grailed and when I tried to appeal the listing and sent proof to them that it was real they just straight up froze my account and ghosted me. On a side note I know for a fact that my item was authentic as I bought it STRAIGHT from Nike and even sent email receipts and online receipts. I even offered to send more proof if they needed but they stopped responding to me and all together just ghosted me. Horrible customer service, got unfairly banned and they won’t even listen to my case. \n\nTicket ID: 307989\nUsername: Dannyboy0874\n\n*Update* \nThey now claim that my receipts don’t matter as they deem that parts of my shoe were inauthentic which is pretty laughable as I doubt NIKE would send me an inauthentic shoe. There authentication team dare I say is not the most reliable or the most valid as they have made a clear mistake in my case. They are refusing to double check of any sort and stand by their claim that my shoes are inauthentic. Honestly, I have been a loyal grailed customer and seller and to see them just throw me under the bus without explaining to me what was inauthentic about my shoe is just infuriating cause I know for a fact they aren’t fake. Be wary when using this platform as the customer service and service in general is terrible. They are too stubborn to admit they are wrong, and at this point I might just pay to get a certificate of authenticity for my shoe and show grailed just to see what they have to say to that.","title":"Grailed banned me for posting inauthentic items when it was indeed real","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-02-15","author":"Pam Osborne","text":"Bought a pair of shoes and the seller never shipped them. Tried to get my money back and Grailed was very unhelpful. Even though I used my registered account, they said I checked out as a guest and would not do anything about it. Repeatedly emailed and no resolution. They protect the SELLER only! That’s the people that make them the money even if they scam people. Stay away.","title":"Grailed is a scam site.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-02-17","author":"FreshGoods14 ","text":"Had an account up and running for a long time and it’s just got frozen without any notice or anything. Just frozen. I tried reaching out to multiple places to get some help but haven’t got a reply anywhere as of yet. Maybe I’ll get on here, would love to have my account back and running! You guys made tons of money off of me as well","title":"Had an account up and running for a…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-02-18","author":"Bronson Love","text":"Overall My experience on grailed is decent I put on recently a total of 5 listings of which 2 to my knowledge looked authentic a supreme hoodie and Tshirt and the other 3 were in fact authentic as 2 of the 3 were supreme items bought from the supreme online store, and 1 were a pair of Gucci Glasses from Sunglass Hut and I even posted a picture of tags of the 2 items that I was 100% sure about instead of removing both they removed 1 then froze my account entirely they haven't got back to me yet but the thing that upsets me the most is I bought a Supreme t-shirt moments before my account was frozen and I don't if I'll get it or not Im worried that I sint get my Shirt and the seller will have my money anyway considering my Paypal says I purchased the item, my username BronsonLove","title":"Accidental Inauthentic Listing","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-02-21","author":"Christian Rahbæk","text":"Overall is grailed the perfect site, but the support needs major work. Got my account banned for literally nothing. Woke up one morning and I got permanently banned for fraudulent activity or something.","title":"Overall is grailed the perfect site","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-02-26","author":"AUGER","text":"I lately \"tried\" to purchase 3 items on Grailed and out of the 3 transactions, 2 failed : one because the seller never answered even after the payment was made, the other because the seller had underestimated the shipping costs to France, so that the sale turned unprofitable for him and he finally refunded my money. As for the 3rd one, he was supposed to send me my parcel registered mail but did it plain customary... Grailed has obviously no control whatsoever over their lazy, dilettante, sloppy sellers. When you are used to shopping on ebay, Etsy, Vestiaire Collective, and that you try Grailed, it's like taking a cold shower !","title":"I lately \"tried\" to purchase 3 items on…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-02-27","author":"Dan","text":"hello, my grailed account lokiIo blocked without reason, I created this account to sell sneakers but a day later grailed blocked it, I didn’t even have time to sell them. \nI know that you can help me and I will be grateful.\nin the mail (appeal grailed) I get mails from a bot that does not help me, please just unlock my account","title":"my acc blocked without reason","stars":2,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-02-29","author":"Sasha Gymn","text":"I ve been banned because apparently i had a fake item, i didn t even want to sell something fake. I made a mistake, i could take it off the site, but they just banned me without any reasons.\nI had to send 2 emails to know the reason, and they didnt even told me wich item was fake.\nIt look like this site will never give u a second chance, i don t get this, i was using it a lot and never had any problem, u make mistake one time and then you have to disappear !!!","title":"I ve been banned because apparently i…","stars":2,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-02-29","author":"Jackson Martin","text":"Recently I got banned form messaging. I don’t know why. I’ve emailed grailed 3 times to no response. I normally love grailed and it’s a great site but I now lost the opportunity to buy a pair of shows that I really wanted because of this ban. Grailed please help me fix this. Grailed if you are wondering My username is I-am-Jackson-the-shoe-guy.","title":"Recently I got banned form messaging","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-03-02","author":"Antwone L","text":"Asked for a bigger size of some WHITE sneakers with black logos they advertised. They responded they'll see what they could do. A few days later I receive a email saying they have the BLACK sneakers I ordered. Because these shoes run about $700 I wanted to know exactly what I was purchasing. Maybe a pic or something so we're on the same page. Next I got a email saying the sneakers were no longer available.  When I inquired, they emailed me back accusing me of \"window shopping\" and would't respond to any of my emails. Very unprofessional and childish to be in the business of retail.","title":"Asked them if they could get a bigger…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-03-03","author":"Magasin","text":"Opened an account last week, posted few items shortly after received an email stating my account has been frozen due to one of my items identified as counterfeit but didnt mention which one, i appealed the case recieved an email few days later stating the same thing but no mention of which item, ive been selling on various platfroms for the last few years and never had any issues, all of my items are %100 authentic as i purchased them myself from local outlet stores and have receipt for each one of them. Reading some reviews here seem to be it is a commn accurance with grailed and their \"AUTHENTICATION PROCESS\". \nWhat a disappointment. \nI also read on redit that they hired staff to visually authenticate items via pictures, it doesnt seems to be working out very good for them, by banning users not only they losing money from The sellers but also banned users wont be able to purchase any items so not sure if it is good strategy. \ni undrestand grailed is private entity and they have right to deny service but better explanation and in some cases second chance would go far.\nMaybe i can hear from them here and resolve the issue im facing.\n\nThanks for your reply, i would greatly appreciate you look into this for me. My user name is magasin-en-ligne","title":"Banned from grailed","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-03-03","author":"Joshua Ilagan","text":"I got banned from listing fake items. The first item I listed was the Travis Scott Jordan 1 High and they told me it was fake. I did my own legit check for the Travis Scott's and found out they were fake so I stopped listing it. However when I listed my Vlone Rhinestone Tee, they said it was fake then proceeded to freeze my account without any explanation on why it was fake. I only had 6 sales and 4 of them I got 5 star reviews. This is really frustrating because I feel like it's not fair as I've seen countless of sold items that are fake on Grailed but a lot of those sellers get away with it. Instead they decide to ban my account for listing \"inauthentic items\".\n\ngrailed username: HypedCloset11","title":"I got banned from listing “inauthentic items”","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-03-05","author":"Minsu Jeon","text":"I (username:barry53180) was trying to sell my Supreme Box Logo hoodie, and I got 2 emails from grailed, first one asking to take a better picture of washing tag, and second one insisting my item was inauthentic, therefore my account is frozen.\n\nMy item was definitely legit, so I sent all the detailed photo of the hoodie to prove my item was authentic and asked Grailed for a quick resolution. However, the reply I got from grailed team was just a scripted answer saying “your account was frozen due to inauthenticity and therefore we cannot reinstate your account.” So I had to send all the proof images again, which they did not even bother reading\/answering this time.\n\nClearly, they did not read my email whatsoever, did not understand what I was insisting, probably did not even look at the proofs I sent, and did not explain the reason of judging my item as a counterfeit item when it is surely not. They are very difficult to communicate with. And since I recently bought items from another seller, I was not able to get a tracking number for my purchase, which is causing me a great inconvenience.\n\nAs many of other reviews here suggested as well, their authentication is not trustworthy and they often make mistakes. However, for some reason, they never admit they can be wrong, and stubbornly maintain their attitude, which seems ridiculous and funny.","title":"They are very stubborn and irresponsible with their mistakes","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-03-05","author":"James Parkes","text":"Shopping at Grailed is like walking into a store with a few genuinely rare pieces in the window and endless stacks of overpriced junk out the back. Except it's much worse. Most of the junk 'for sale' on Grailed is just screen grabs of other people's stuff on Etsy\/ Ratuken\/ Ebay with a 100% markup on the original price. Grailed sellers take your money, buy the item from other sites and then ship on to you... if you're lucky, Most of the sellers on Grailed are lazy teenage kids who don't keep tabs on the stuff they're re-selling - you pay $300 for a T-Shirt that's already been sold elsewhere. You pay, then you're told its out of stock and you lose your money because Grailed don't employ enough staff to police the scammers. You're better off setting fire to a $100 bill and then buying the thing you want from the company that actually makes it.","title":"Grailed is a Scam","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-03-09","author":"Tyson Hancock","text":"user (dagger_dixk) i recently had a buyer from Austria buy something off my page but keep in mind im in US. so i never sent the item until i told him one day he was kinda far and that i would estimate shipping cost there and let him know. its been about a week or 2 since he bought the item. he ends up being to far for me so i go to refund him and paypal tells me i need funds in my account to do that? if my bank card is already linked to my account then arent my funds already available? anyway i attempted the first time and didn't work then later that same day i got the email saying my account was frozen for not shipping the item\/ refunding buyer. so then i figure out how to refund buyer and i sent the refund later that same day as well too. basically what my questions is, will my account be banned or permanently frozen because of this or just temporarily? i sent an appeal to grailed and informed them the refund was sent 2 days ago and am currently waiting.","title":"refunded customer but still frozen","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-03-12","author":"John","text":"I have used grailed for over four years. In my four years of using grailed I’ve never had a freeze or hold on my account for ANY reason. I have made over 450+ transactions in my time of using grailed. I bought out someone’s collection that consisted of supreme Vlone and bape. I planned to sell some pieces that I didn’t like on grailed. It turns out that the Vlone was un authentic. (THIS WAS NOT TO MY KNOWLEDGE). Instead of grailed cautioning me that I was sold un authentic items and to not post them, my account was immediately put on freeze. Grailed did not give their 4 year consumer with over 450+ transactions the benefit of a doubt that I had no clue the Vlone was un authentic. I do not think that this is fair being that I do not have a history of selling fakes on my account nor have I ever intentionally done so. I understand that you guys reserve the right to freeze accounts. However I ask that you look at my past history and see that I had no intentions of selling fakes nor would I ever do so. At this point if I get my account back I’d get everything legit checked before posting. I believe I deserve a second chance since this was not a planned offense. Had you guys simply told me the Vlone was fake, I would have not tried to sell them. Keep in account that I’ve been using grailed for 4 years with over 450+ feedback ... like wow !\n\nMy grailed name is Varet","title":"450+ feedback account randomly frozen !","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-03-12","author":"Alessandro V","text":"I was banned unfairly! (appeal@grailed email NOT RESPONDING)\nI was recently IP banned on grailed because I listed a few AUTHENTIC items on my account that I wanted to get rid of (all of these items being bought from either Grailed itself or an authorized retailer). Grailed decided that these items were inauthentic according to them and without any warning PERM banned me. For example, if grailed would check my account that was deleted they would see that the Chrome Hearts hoodie that I tried to list (that they removed for being \"counterfeit\") was literally bought through their website and digitally authenticated by them! (I purchased it on my @_alealeale account and listed it on @alessandrov). I never even relisted any of the items that were marked as inauthentic (I only ever relisted when asked BY GRAILED to \"tag\" my items or add clearer pics of tags ect. once my items were deemed inauthentic I did NOT re post them again). Instead I tried to email grailed support BEFORE relisting to avoid my account being frozen but I never got and answer AND they froze my account anyways. At this point i'm not even interested in selling on grailed anymore because my authentic items keep getting taken down. However, buying on grailed is a necessity for me as it is the best place to find rare pieces. I emailed grailed's appeal support (appeal@grailed email) about a week ago and still haven't gotten ANY  response besides their automated email that is completely unhelpful. I hope that this review gives me a chance for my support ticket to get resolved by an actual person at grailed. BTW I have also spent thousands of dollars buying on grailed and have been a loyal buyer\/seller on their app for almost 4 years :\/ (The two accounts that I would like to be unfrozen are @alessandrov and @_alealeale)\n*If my account does end up being unfrozen I will not be listing any more items for sale* all i ask for is a second chance as I believe to have done nothing wrong. I understand that it’s in the TOS that you guys reserve the right to freeze accounts but I really think a permanent ban was uncalled for here. Even if some of the items do happen to be inauthentic I was definitely NOT aware of this as most of these items were originally bought from grailed and i believed them to be authentic. I would’ve never listed an item on grailed if i knew it was a fake.","title":"I was banned unfairly (appeal@grailed NOT RESPONDING)","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"},{"date":"2020-03-12","author":"Tommy","text":"I've literally just recently started using grailed and haven't been able to buy anything yet or sell anything ( I had nothing listed to sell either) but I have been banned with absolutely no explanation. Can I just have my account reinstated as I'd done nothing apart from message sellers and make a couple of offers so I don't see why I've been banned.","title":"Banned for no reason","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=20&stars=1&stars=2&stars=3"}]