[{"date":"2020-01-06","author":"Jacob Leonard","text":"My account is not working it started to work for about 2 hours then just stopped working! My email was JL3977 @ students .responsiveed .com \nI dont know why It wouldnt work I am over 18! If my account got reinstated then I would most certainly change my review.\nPlease help grailed!!! there is no spacing in my email I just had to do that so I could post it( no spacing in email)\n\n\nYour reply is false because I created a new account 2 days ago and I actually haven't messaged anybody!","title":"My account is not working","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-01-07","author":"Lesley McMillan","text":"First time using and the package never arrived. Contacted customer service and they didn’t care. That’s $115 I’ll never see again. What a scam!","title":"First time using and the package never…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-01-08","author":"O2SG Inc","text":"If being honest I have to go with POOR. I do love the website and the ability it provides to buy some rare stuff but the first time I ran into a problem with the merchandise being non authentic I was beyond dissatisfied with the service. Basically it seems the Grailed guarantee is simply PayPal coverage and has very little to do with Grailed as you have to do everything yourself on PayPal. Anyone that has dealt with PayPal knows how flawed their claim process can be and how easy it is to cheat it.\n\nPrior my claim and during my claim communication with the Grailed team was rather poor and at times I had to constantly inquire about updates etc. And as many have said it felt like they could care less. Maybe it’s just a case of them being overwhelmed and such is not their intention but since this review I can’t help but to be honest here with the hope of this possibly improving their service down the road. \n\nAfter PayPal turned the claim in the sellers favour (go figure) I do have to give credit where credit is due and thank the Grailed team for stepping in and for actually providing a refund for my purchase. I think the claim process needs to be more direct and streamlined to create a better more efficient platform.","title":"If being honest I have to go with POOR","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-01-10","author":"Alex Petersen","text":"My account has been froozen and have now been told 3 of my items are counterfit and the thing is 2 of them I know are not. At the same time there was only 2 items up at the I time I got froozen so there was not even 3!! Grailed doesn't answer emails. It's unprofessional and bad service. I also only got a email for one of the times they have claimed to be fake. I will not recommend grailed if you are trying to sell\n\nMy email: alex.soelving2 @gmail.com\nSupportcases: 234592 and 237307\nYou still haven't sent a email","title":"Please just do something","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-01-13","author":"Martijn Termijtelen","text":"URGENT. On december 2nd (more than a month ago!!) I sold a pair of yeezy shoes on this website and I STILL haven't recieved any form of payment. I've been trying to reach out to grailed but all I get are automated emails telling me \"the grailed team will reply in 2-3 days\" but I haven't received anything from them. Really frustrating to deal with.","title":"URGENT","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-01-15","author":"Lil Ken","text":"I recent bought some shoes on grailed for 200$ on a credit card through paypal guest checkout and I’m trying to get my refund since that is a lot of my money it’s been 8 days and the seller and customer service is unresponsive this is by far the worst EVER online transaction made. How do I recieve a refund? Ok I have got your response and my email is kendallmorris20 @ yahoo .com and my grailed username is kendallmorris1668 and the seller has finally responded and has informed that the shoe was listed as the wrong size and that I should request a refund but the thing is I’ve been requesting a refund for almost a week straight and it would be really helpful if I could recieve a refund. Please","title":"I recent bought some shoes on grailed…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-01-23","author":"Lorenzo Castiglione","text":"I got banned for off site activity which I did not perform at all. I have over 30 seller transactions with all positive reviews and I still managed to get banned... I tried very hard to email support about my case on reinstated my account. They won't reinstate it at all because they think I performed these acts.... Please someone from grailed support can I please be unbanned?","title":"I got banned for off site activity…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-01-23","author":"ben","text":"i have been scammed on the app by a user called \"LCSUPREME\" he hasnt replied to my messages in 2 days and i want a refund, if i get the gucci belt i purchased i wouldnt mind but i also wouldnt mind my money back, my email is: bennyelliott04\"AT\"gmail.com, and my grailed username is \"bentekker\"","title":"Gucci Belt w\/ interlocking G, requesting refund","stars":2,"location":"NZ","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-01-23","author":"Dennis Koek","text":"I just got banned and accused of listing counterfeit Designer products, which I do NOT. Every product I post is authentic, including every kind of proof of authenticity. After listed a couple of items this week I suddenly got banned for this reason. Made some good transactions in the past and received good reviews but doesn’t seemed to matter! Without any substantiation or rebuttal or they stick to their decision not to reinstate my account. Dear people from Grailed please get into this more accurate and reinstate my account.","title":"Got banned unjustifiedly","stars":1,"location":"NL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-01-24","author":"by Kevin Samuels","text":"I’ve had 43 transactions with no issues. The only items I’m selling are items I’ve purchased on Grailed and it shows in the purchase history.  I’ve never done offsite and all of my messages verify I’m a clean user. Then out of nowhere BANNED!\n\nWhat is going on with this?  I’ve seen this more and more lately and it’s honestly it’s maddening.","title":"I’ve had 43 transactions with no…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-02-01","author":"Maxim","text":"Hey, dear Grailed. \nCan you please help me. I have got banned my account due to \"for exhibiting patterns of fraudulent activity\". After I have written Messages to the support but i never got a response. \n\nI suppose it happened after i was using VPN for my purposes (LinkedIn is blocked in my Country). And therefore IP has been changed. Can you please review my case again because i deffently believe it is misundestanding. \n\nI just wanna understand why it happened because i clearly did not do any fraud activity.\n\nMy login is Terrot. \n\nReally hope you can help me. \n\nThank you and have a good Day.","title":"Misundestanding case","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-02-05","author":"Frank","text":"A crapshoot of a site. Woke up yesterday with my draws full of diarreah, stomach full of liquor. Ordered something and it decided to mash my new address with my old one, and instead of being able to just change it like a normal website they want you to cancel the order, wait 3 days to receive the refund. So here I am sitting and waiting to finally be able to do the full transaction again and have it shipped. I don’t have time for this I have another cliff to diarreah off of for the next few days. Forget this website forget PayPal they blow anus.","title":"A crapshoot of a site","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-02-09","author":"Neek Breezy","text":"This buyer has constantly been nagging me to sell him these Nike Off White sneakers for a while now, constantly saying “help me out” and “accept my offer of 200$”, I am not giving handouts to someone I dont know!! Nevertheless someone who has only made 1 sale! Moral of the story, he ends up reporting me for offensive language, and I have had nothing but 5 stars or higher on my page with about 10 sales, kind of sketchy by Grailed considering I have only been good to their service, but this? Ludicrous , I want my account activated again I did nothing wrong","title":"This buyer has constantly been nagging…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-02-10","author":"PR Athletics","text":"joke of a company. they hire people who cant authenticate stuff and claim my item is fake even though i give them the receipt and a tagged picture. i have 62 sales and a 4.9 star rating with no one saying ive sold a fake item. they refuse admit they r wrong even though i literally gave them the receipt to the item im trying to list.\n\nupdate: my grailed username is ygvinny","title":"joke of a company","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-02-10","author":"Ross","text":"ACCOUNT CLOSED WITHOUT WARNING!\nI have been selling jewelry for quite some time now on your platform. Most of the stuff I sell is purchased from your website and later resold. I have NEVER received any warning regarding my account before, but for some reason, my account got closed for the sale of counterfeit items?! I don't sell fakes I sell jewelry! This is mindblowing to me, especially considering most of the stuff is merchandise that was purchased on grailed! I have tons of 5 star reviews and ZERO complaints, can you please reinstate my account or remove any listings that you do not approve of. I HAVE NO PROBLEM WITH THIS! I just want to fix it so i can sell back on your platform again. I emailed you already and am hoping to get this fixed. @missjewelry on grailed","title":"ACCOUNT CLOSED WITHOUT WARNING!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-02-10","author":"Christian Holmes","text":"I got scammed out of $850 on this site. I purchased a jacket and recieved woman’a shoes. \n\nGrailed refuses to refund me and then proceeded to ban my account (I dont even sell anything). DO NOT PURCHASE from this site. \n\nThey say you are protected but I dealt with PayPal and my bank and still have not received my $850 back for an item I tried to purchase on their site. I have contacted Grailed’s help center  several times and they refuse to send me my money back. More than anything I am hurt. This is not what an online shopping experience should be and how dare they claim your purchase is protected. I am looking into small claims court should I not get $850 from GRAILED. \nPlease protect yourselves. This is not a safe site to purchase off of.","title":"I got scammed out of $850 on this site","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-02-11","author":"Jurgen S.","text":"I haven't had a very good experience with Grailed.\n\nMy experience so far:\n\nFound some sneakers via European\/UK filter. Then found out that Russia is considered European.\n\nThis caused a lot of problems because I found out first after the purchase that the sneakers would be coming from Russia.\n\nBesides this the help center is not helpful, they are blaming the customer. I should have checked Trustpilot first for the reviews. I should have never purchased anything via Grailed.","title":"I haven't had a very good experience","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-02-12","author":"Allan Nguyen","text":"My account was frozen for offsite activity but I sold everything off Grailed. The only possible reason I got banned was for offering to provide shipping labels. However, no where on the ToS states you can’t provide labels? I’m just trying to save a couple bucks and now I lost my account? Also, I’m in a middle of a couple sales, what’s going to happen to my payments. Also, I purchased a hoodie off the site and now I lost that tracking number because I can’t access messages.","title":"Grailed, Please Explain","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-02-14","author":"L Greenfield","text":"I just bought an item from a seller on Grailed and the seller emailed me to confirm my address.  I confirm my address and the seller sends back a super aggressive email about insurance, fraud, that they record the packaging of all items being shipped and if I make a fraudulent transaction or claim they will report me to the police.\n\nI'm shocked by the message and then realize the seller just joined Grailed in 2020, has 162 listings and 0 feedback, which on top of the aggressive message threw up a huge red flag to me.\n\nI contact Grailed about being threatened by a seller and that I want to cancel the transaction.  In their reply back to me they chose to completely ignore the report of the seller threatening me and proceed to tell me to ask the seller for a refund, they basically can't do anything and they are sorry the transaction didn't work out.\n\nYES IT DIDN'T WORK OUT BECAUSE A SELLER THREATENED  ME AND NOW I FEEL UNCOMFORTABLE COMPLETING A TRANSACTION WITH A SELLER THAT SEEMS SUPER SKETCHY. \n\nSo glad your team encourages buyer harassment and bad behavior from sellers.","title":"THREATENED BY SELLER, GRAILED DID NOT CARE","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"},{"date":"2020-02-14","author":"Jordan ","text":"Username: PeazyLife\ni’ve tried to get in contact with grailed multiple times regarding this issue and have had an awfully terrible time even getting a response. Over a week ago i sold Saint Laurent Paris Denim to a customer of mine on grailed. Due to my account now being frozen over diffusion line items claimed as 'fake\", i do not have access to my funds, and am afraid that the hold on my funds are now permanent due to the freeze on my account. I’ve contacted PayPal due to this issue and they told me the hold is not on their end and that the payment has been already been processed, but that the hold is still in effect FROM GRAILED. I'm not worried about gaining access to my account again honestly, i wish to simply gain access to my funds that are sitting in limbo and have the hold released. Right now the customer basically got one of my HARDEST ITEMS TO LET GO for free and they won't help me access my funds! Please help!\n(don't say this has anything to do with PayPal again as I already spoke with a representative and they said this is a hold FROM GRAILED)","title":"Account frozen \/ My funds now have a permanent hold by Grailed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=21&stars=1&stars=2&stars=3"}]