[{"date":"2019-11-25","author":"Artyom","text":"My Grailed username: ArtyomKuplinov. A week ago a received three mails from Grailed about not enough photos for my items and that I have to add more photos. The first mail was received at 1:47. At 1:48 I received a mail, which said that my account is frozen for selling counterfeit items. This happened with my Louis Vuitton Clutches. I had three of them and each of them was authentic. Of course I immediately wrote a mail to support and sent them a lot of photos, to make them sure that my items are authentic, but they still haven’t solved the problem. My feedback was strong (5\/5) and to be honest, I enjoyed selling on Grailed. I hope that you can help me with this issue. That was a misunderstanding.","title":"Frozen for selling authentic items.","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-11-27","author":"saint ","text":"grailed was a grail for me i got banned out of nowhere for \"inauthetic items seems to be im not the only one, HOW when other sellers literally have the same items i was selling just with  better quality pics and i got my items authenticated prior to posting i dont sell fakes my feedback speaks for itself how do you send me a frozen account email first to reply to appeal then not even read my response and send me one right away that says banned with no rebuttal i still yet to get a decent response from you . \nUser:thekolectorr","title":"grailed was a grail for me i got banned…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-11-27","author":"Elijah Butler","text":"My account was frozen about 2 months ago. I have emailed grailed about 10 times asking for a specific reason why and each time I get the same no excuse emails. They ask me for my email address and then nothing happens afterwards. This leads me to believe I am dealing with a bot or automation system. They can not find my account with over 500 listings which I worked hard to create. I feel as though I have been treated unfairly and am being ignored or blocked. Please give me a Specific reason and unfreeze my account. This is about the 10th email I have sent with no resolve. If  \nAS every one can see from the last review they sent a reply from a automated system. No one is addressing my issue.  Elijah Butler","title":"My account was frozen about 2 months…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-11-27","author":"Artyom","text":"I had a strong feedback and only authentic items. They blocked me without any explanation, just saying that my Gucci belt is fake. I have enough photos to make sure, that it s legit. Grailed, this is unfair! Please solve this problem. Username: ArtyomKuplinov. Mail: steamackc@ gmail.com","title":"Blocked for authentic items","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-11-29","author":"Jhonald Cruz","text":"To the Grailed Team,\n\nRecently I’ve made a purchase for a pair of Jordan 1 Royals 2017 release. The pair was listed under jakobdewald (username) and his history was 22 transactions with 11x5-star reviews. Before I made a purchase I recently made contact to your support team to verify the listing and the response I received was to send your team photos with my username, date, and the word “Grailed” as a tag. So basically with your response I had to purchase it first before I can have it “authenticated”. (I should have insisted to verify the listing before purchasing since your website says you offer that service.) The photos sent by the seller checks out with an “authentic” pair and I’ve also reached out to the original retail store (basketzone.net) where the seller bought it to confirm the purchase. Everything checked out at this point.\n\nSo I went ahead and purchased the pair and once I received it quickly sent the photos (w\/tags) to grailed support team. Note that before I sent the photos I also did my own checks, compared it with my Jordan 1 Breds (2016) and also used “Legitcheck App” for reference and the pair I bought pretty much matches the “authentic” pair. Now after a week, I received an email from Grailed’s support team with a response that the seller sold me an “inauthentic” pair and they have frozen the seller’s account. This was a surprise and complete shock to me. I was expecting a positive outcome. The reasons that the moderators used were:\n\n1.\tThe overall shape is off\n2.\tHeel shape looks off, especially the heel tab\n3.\tThe wings logo is unclear and dull\n\nI’ve asked on facebook groups and checked online, compared the pair I bought to my pair of Jordan 1s, it checks out to be fine. I just don’t agree with the moderator’s findings. I’ve been trying to reach out with your support team again to make an appeal but I have not received any response at all. I’ve tried twitter, Instagram, reddit, trustpilot and not a single response from you. I just want to be fair to the seller who has his account frozen and basically make the necessary corrections. I’ve made a paypal claim\/dispute as per your advice to document what has been happening and I’ve been communicating with the seller trying to resolve the issue. He wants to clear his name and he is sure that there is a mistake somewhere. He should have tried and reached out to you by now. But the problem is whether it will be looked into for investigation. I really hope your team would do the necessary actions because in a way your credibility is at stake here. There must be some sort of misunderstanding or error that has been made. So please kindly look into this.\n\nThis is my second purchase in grailed and both of them has been only but problems. My first purchase never arrived. Now this time I requested to verify a listing but for you to do that I have to buy it and then come back to say it’s “inauthentic”.\n\nUSERNAME:jhonaldcruz","title":"Issues with Grailed Moderators Authenticity Reviews","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-11-29","author":"Ty Hibbitts","text":"My Email is: thibbs1023@gmail . com\nMy Username: twhy","title":"My Email is","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-11-29","author":"Chris Hernandez","text":"Terrible customer service they couldn't do any ting because pay pals site doesn't work properly and made me check out thru guest then the seller is banned for whatever reason and theirs no way for me to contact him back bc grailed blocked him. I tried to work thru the chanels they suggested and nothing. Now I'm out my money and no product and no recourse but grailed doesn't care as long as they get their fees for the sale. I wouldn't recommend using this your better off on stock x or just buying online from the manufactured or retailer not worth the hassle or long waits","title":"Terrible customer service they couldn't…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-11-30","author":"Elijah Butler","text":"grailed appeal Dept: Your ticket ID is 221897. My account was frozen about 2 months ago. I have emailed grailed about 10 times asking for a specific reason why and each time I get the same no excuse emails. They ask me for my email address and then nothing happens afterwards. This leads me to believe I am dealing with a bot or automation system. They can not find my account with over 500 listings which I worked hard to create. I feel as though I have been treated unfairly and am being ignored or blocked. Please give me a Specific reason and unfreeze my account. This is about the 10th email I have sent with no resolve. If\nAS every one can see from the last review they sent a reply from a automated system. Again No one is addressing my issue. Elijah Butler.\nbutlersboutique.","title":"grailed appeal Dept","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-11-30","author":"Maddy McMurray","text":"I got my money scammed and I've reached out to the support team and there has been no direct help, They've just told me to reach out to the buyer personally. I will never order from here again and YOU shouldn't either. Worst customer service and the products are fake. I've lost my money and it has been the most difficult process to try to get my money back. I 10\/10 DO NOT recommend.","title":"DO NOT USE GRAILED","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-12-04","author":"gmailedlt","text":"They have never replied my inquiry for a long time. Never refunded my grailed fee and they closed my account.. strange customer support.","title":"They have never replied my inquiry for…","stars":1,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-12-04","author":"Devin Lee Sokolich","text":"Seller told me his listing was deleted after i had purchased the item, \nseller said he refunded the money and sent me a paypal tracking number for the refund which didn't work. No one has told me how or when I can get my money back which is sad. 220$ to me is way different that 220$ to grailed and I think they need to understand that. please fix this....\n\nNo help from grailed yet as I have emailed both them and paypal twice, each....","title":"Seller told me his listing was deleted…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-12-04","author":"Joe","text":"Worst costumer support ever. They don’t even respond to messages. I got scammed and I don’t know what to do because nobody is responding.\nMy Grailed username: gelojosip","title":"Worst costumer support ever","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-12-05","author":"thiago","text":"Hi, when I try to Log in I got this following message: \"Cannot read property 'user' of undefined\" \n\nCan you guys fix this issue please? I did not get any e-mail regarding this btw.\n\n Thank you guys.\nusername:ThiagoSergio","title":"Log in error.","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-12-05","author":"gmailedlt","text":"already asking many time to customer support but never replied...very sad experience.\nthis is mine, masuonoi9876 at gmail","title":"already asking many time to customer…","stars":1,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-12-05","author":"anthousai","text":"Wow - you offered to review my case after I wrote a previous negative review due to poor customer service. However, you haven't responded to all three follow up emails I've sent. Definitely the worst customer experience I have ever had.  \n\nIt's not possible to reply to reviews unless you are the business being reviewed. my username is aura_uranus_eos and the seller’s username is kevinclement1","title":"The worse customer experience I've ever had.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-12-06","author":"gmailedlt","text":"They frozen my account even I\n have never sold counterfeit items. They said I've uploaded counterfeit chrome hearts but I never..They should tell me which items they are talking. otherwise it's not fair and very strange attitude as marketplace. very bad marketplace.","title":"They frozen my account even I","stars":1,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-12-07","author":"Nick Barker","text":"Horrible marketplace. \nThey ban me for a \"vulgar word used through a message that my 12 year old cousin wrote while I was SLEEPING after a long day at work. They froze my account with multiple pending sales and transactions, and I wouldn't be surprised if these greedy people who run this website try to steal all my money due to me... being \"froze\". I did nothing wrong at all and they refuse to respond back to my case and just took the word the moron who reported me AFTER I apologized to him and informed him that I wasn't even the one who said that. Worst customer support of any website I have ever experienced. I've spent thousands of dollars on this website and this is how Im treated. What A JOKE.","title":"Horrible marketplace and customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-12-07","author":"gmailedlt","text":"They frozen my account even I\nhave never sold counterfeit items. They said I've uploaded counterfeit chrome hearts but I never..They should tell me which items they are talking. otherwise it's not fair and very strange attitude as marketplace. very bad marketplace.\nvery sad experience.\nthis is mine, masuonoi9876 at gmail\nThey should share specific item info to me.\nThen I can swear I never upload such brand to avoid any misscomunication.","title":"They frozen my account even I","stars":1,"location":"JP","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-12-08","author":"Gavin Goes","text":"Buyer beware , they allow FAKE items  to be sold and then when u clam them as fake they do nothing about. Also when we left bad feedback on  our FAKE purchase, it was deleted.","title":"Buyer beware","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"},{"date":"2019-12-09","author":"Gurinderjeet singh","text":"Grailed don’t pay of your sales\nEven don’t answer your mail\nAm from Tatagold.com \nI never got paid of my sales","title":"Grailed don’t pay of your sales","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=23&stars=1&stars=2&stars=3"}]