[{"date":"2020-05-06","author":"Sean Lee","text":"Aight so I’m hella frustrated rn, grailed called one of the shoes that came straight from yeezy supply “fake”, and I appealed to them and showed them the receipt and they accepted it saying they won’t take down my damn listing. I put the listing back up and they take it down once more 🤣🤣 maybe it’s the fact that the boost has been restored and repainted but other than that there’s literally nothing wrong with it. The fact that they’ve accepted my appeal but taken my listing down again is outrageous. This is so ridiculous and they’re cutting of my source of income.","title":"They authenticated my item after saying it was fake, so I posted it again but the TOOK IT DOWN AGAIN after they confirmed it was real. Smh","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-07","author":"David Sietras","text":"Hello,\nmy account got frozen for selling conterfeid items.\nThere not unauthentic, as I also have receipts as proof of authenticity.\nMy items were falsy classified as unauthentic.\nNow the people I have sold my items to are worried and start to open paypal cases against me.\nSince I never have or tried to list anything counterfeid I contacted Grailed support with no response.\n\nI also called them and got no response.\n\nI would be happy to send receipts and other proofs to them but cant.\n\nLoosing a lot of money because of grailed even though I never did offsite transactions or anything against their Terms of service\n\nVery disappointed by the moderation team too for clearly making multiple wrong decisions which are now causing a lot of trouble with my buyers\n\nUsername Balisto2019","title":"Hello,","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-07","author":"Sean Lee","text":"Okay, so I posted a listing of my “Yeezy 350 V2 Black” on my page (I have 40+ transactions and over 20 reviews), and grailed takes in down saying that it was “unauthentic”, when I literally got it straight from yeezy supply. I appealed to grailed saying that I have the receipt, and they said “okay we won’t remove your item again we have confirmed that your item is authentic” so I thought “okay that’s cool!” And I proceeded to post the listing again. 2 hours later I get a notification that the same item that they “authenticated” earlier was fake! 🤣🤣 I find this so stupid but disturbingly outrageous for them to have the audacity to remove my listing after they said I could post it again. Idk grailed might be trippin, calling a shoe straight from Kanye’s factory fake. My username is SCL and I’ve made another appeal sending screenshots of everything including the message you sent to me saying I could post the listing again (by Nico). I’m yet to receive a response and I’ve been waiting over 24 hours. Thank you.\n\nUser: SCL","title":"They authenticated my item, told me it was real, then when I put my listing back up they removed it again!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-07","author":"Alejandro De La Luna","text":"My account was just recently frozen and I have no idea why...\n\nUsername: dreamsneverdie","title":"Frozen Account","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-08","author":"Gainsaurus Rex","text":"Their \"buyer protection\" is really bad, never got my money back even though I had evidence that I never received my item or even my tracking number.\n\nEdit 2 may 23 : still could not help me get my money back. If I could rate lower, I would","title":"Their \"buyer protection\" is really bad","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-09","author":"Diego Patino","text":"hello grailed i love your site but i posted travis scott jordan 4s authentic sneakers and they are used, i have done everything to complete your requierments and have done eveything to sell the post but your team deletes my post for no reason. the same thing happens with my brand new highest in the room hoodie, also tried to post some trav sweat pant and supreme sk8s. pls need money would help me allot if you accept my offers to sell very reasonable prices and good photos also authentic items pls let me post my items.  Username: TETSUO8","title":"hello grailed i love your site but i…","stars":3,"location":"MX","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-10","author":"Mikey Grayson","text":"I tried to email you guys, but I was unable to get a response back.  I would like to apologize Grailed for breaking the terms of service. I am a longtime seller on Grailed for years with perfect feedback and a great reputation. I went against the terms of service by trying to contact a potential buyer on Instagram. In my opinion, it is much simpler and quicker to use this alternative app as a form of communication. I understand my faults and I won't make the same mistake again and won't ask or respond to buyers who want to communicate on a different application. I am truly sorry and I would like to continue doing business on your site.\nMy username is Lethargy","title":"BANNED FROM GRAILED SENT EMAIL BUT NO RESPONSE","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-11","author":"Anthony","text":"This has been the worst experience I've ever had on a shoe platform. Seller accidentally accepted the bid (shoe was sold and listing was older) Seller stated he accidentally clicked accept but could not return funds were frozen. Then I sent countless emails to them trying to get a refund and the automated messages were the only thing that I would get back. I tried to send about 20 emails trying to complete a refund faster no help was given. after 2 weeks I finally received my refund there was absolutely no help. USER NAME anthog4","title":"This has been the worst experience I've…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-12","author":"Ronaldo Peduche","text":"Hello! I think you you should improve the rate on your shipping fee. I am from the philippines and you already have the standard shipping fee on your site for asian shipping worth i think 30usd. But the problem is when the seller was about to ship my item he told me that 30usd shipping fee is not enough ang i should shoulder the remaining of the the fee which is 70$. Though grailed is very supportive when it comes to my refund, im hust wondering if it still ok to buy on this site if the buyer is from asia?","title":"Hello!","stars":3,"location":"PH","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-12","author":"John Deez","text":"I feel like Grailed is a great marketplace when you are actually able to list an item. Recently I have found the review process to be very inconsistent, tried to list my LV planes hoodie but was rejected for being \"inauthentic\". Knowing it is authentic I searched through recently sold listings and of course someone sold the same hoodie in just a smaller size and they let him list it. It highly confuses me why they let some people list their items and others out right do not allow them to list. The help or appeal process for listings is daunting to say the least, they advertise 2-3 days for a response but frequently it can be weeks I have heard and sometimes never a response. Grailed name : JoDeez, would really appreciate some help or even a response on my email.\n\nUPDATE**\nGrailed has replied and situation seems to be soon sorted out.","title":"Very inconsistent review process","stars":2,"location":"MT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-13","author":"Остап Груша","text":"Hello! My name is Ostap Grusha. My grailed account is grusha_shop. My account was blocked for no reason. Also, I can’t log in to my account! I assume that you have limited my account due to the fact that I do not send packages on time. Now in the world of quarantine and I physically can’t get to the post office, just because of your site I was deceived by the buyer who returned his money and received my jacket for free which costs $ 250. I hope you take some measures and you can again return my account! I wrote to you at your mail from my mail I didn’t receive any answer. It took more than 2-3 months and I don’t know who to contact more, I hope you can help me!","title":"Help!!","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-14","author":"Rowan Jee","text":"Go straight to STOCKX...  Don\"t even bother making the effort to list here, be wasting your time.. Had Supreme New Era Box Beanie, bought direct from Supreme.. Had item refused,, yes,,, claiming inauthentic!!!! Unbelievable..\nThe whole format is pointless if cannot list GENUINE items,, I assume selling loads of  FAKES!!!!!\n\nPlease see reply!!! This item came direct from Supreme not E-Bay!!!! Grailed is a JOKE!!! Just go to StockX. Save loads of time.\n\nFinal thing,, why would I ever re-list on such un-professional Mickey Mouse set Up?  I am 100% sure now having tried to list authentic item, site completely full of FAKES!!!!","title":"STOCKX  everytime, these guys are amateurs!!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-15","author":"reelux","text":"hi team Grailed  please a buyer came to my shop on grailed he wanted to see              what models I have about  one item in my store he told me to send him the models on Whatsap I sent my number I found myself blocked I never tried to close the sale outside of grailed it's just for the photos !!! Serious help please I want to recover my old account i have more than 110 transactions   Its a big mistake                   User Name    :     reelux","title":"Reply please  Grailed","stars":1,"location":"MA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-18","author":"John Deez","text":"I have been so frustrated the past week, grailed finally got back to me about my LV listing I posted about in my last review. Apparently their issue was with my necktag, which was extremely odd as when I originally posted I forgot to even put a clear image of the necktag, so its hard to imagine that they could even get a good look at it. I then sent a clear image and yet again they rejected it with a very general response saying \"flaws\". Knowing its legit I have now compiled evidence to prove my case using multiple LV listings from reputable sellers, I strongly feel and I am sure readers will feel the same, if they were to reject this then they are contradicting every post they accept. This link includes all the images I have sent,  the first two are mine and the rest are accepted listings from experienced sellers. Hopefully they will realise that their authentication is flawed and can be very inconsistent and biased to the new seller. imgur .com\/a\/NUPQMo6 I will be updating this post to inform potential new sellers of the issues and if they will be solved. \n\nNote: I have also sent images of my hoodies and paid for various authenticity check services, all have informed me that the hoodie is legit.","title":"I have been so frustrated the past…","stars":1,"location":"MT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-20","author":"Rajbir","text":"Garbage app, and it doesn’t help people sell. They will take off your listing and have no explanations I have authentic shoes (Travis Scott 1’s) and I have 10 more pairs that I’m looking to liquidate soon. Grailed needs to send a message to their sellers for why their listing was removed and for what reason.","title":"Garbage app","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-21","author":"John ","text":"Bought an item from grailed and decided to sell it a while after on grailed. Only noticed now that the item was taken down and I was banned??? How can it be fake if I bought it from grailed and it said digitally authentic ? please help asap\nUsername: Nostylist_","title":"Re-listed an authentic item bought from grailed to be banned for FAKE item?","stars":1,"location":"MT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-21","author":"Kevin Ford","text":"I’ve sold 15 items none have complained as fake all my items were bought in store at supreme, palace or saks for fear of god I have one buyer whose been contacting me constantly about his package after I informed him Canada shipping restrictions from USA he told me he was still okay to have it ship I dropped off at Usps and has been in transit to him for last 2 weeks I tried to contact Grailed multiple times to resolve issue with buyer because he wanted refund was unable to refund him cus tracking was already issued and money was on hold in paypal until item is delivered been in daily contact with him yesterday he files a claim to PayPal saying I have fake items and fake shipping my item was bought from supreme it’s not fake and the buyer hasn’t received the item so how would he know ? I’ve tried to contact Grailed for weeks now to resolve this issue and today i wake up to my account frozen due to a negligent buyer @kjp92 username","title":"I’ve sold 15 items none have complained…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-22","author":"Experienced User","text":"Iv sold like 40 items and never got a single complaint about any of my items being fake. Because I do not own any fakes, never will, never did. Every single item I have I bought myself and I am positive every item is 100% authentic. Most was bought instore like supreme and palace. And it is really strange to me that you just frozen my account for posting unauthentic items. I am very curious to know on which item you decided to ban me because I can prove authenticity on every single item I have posted or sold. It is really unfair that you did me like that and I would like to get some answers and unban, thanks.\naccount name: flexxxin\n\n\nupdate: just got a paypal dispute on item that I sold back in february. This LV bag was purchased INSTORE in London on Sloane St by me personally, I can give you any proof of this. I forwarded you an official email from LV with an invoice of this purchase. You made a mistake","title":"RIDICULOUS","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-24","author":"Ian Moroz","text":"No customer experience. Constantly asked for link for original product which was an MCM bag I was supposed to get and then show them what I recieved which was a 6x12 envolope with the same tracking number noted jn single picture. It's been almost two weeks and nothing has been done I haven't received an email a phone or let alone a refund. I wouldn't recommend this site to anyone there customer service is is the appitiny of clueless and hopeless.if I don't refund within a day I will initiate a chargeback.","title":"Scam","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"},{"date":"2020-05-25","author":"Jean calude","text":"Getting crazy with this not so cool (trust pilot made me change my words...) market place. Grailed so want to make money that it is almost impossible to earn anything as a seller. Most of the time I post item with really good prices for the demande but grailed just delete directly because they find it too expensive which most of the time is wrong. I have a lot of high demandes items that have a certain price. But grailed just want there fee so they try to fk the seller\n\nJust go on stockx they get more fees but at least you can chose the price you want to sell your item.","title":"Getting crazy with this not so cool market…","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=16&stars=1&stars=2&stars=3"}]