[{"date":"2019-08-20","author":"Frank","text":"Customer service is very very poor. They take the easy way out of a situation rather than dealing with it. I have quit using them because of this.","title":"Customer service is very very poor","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-08-21","author":"Hans van Dreven","text":"Find it difficult to report a seller without having to sign up to another provider.\nThe site allows sellers to leave advertised products on auction for extended periods of time even though the product is no longer available\nGrailed seems to have very little control over seller's behaviour and in many instances take no responsibility for none shipment of sold products.\nBecause of this none compliment environment, a buyer can; \n1\/ never be sure if the stock is actually available\n2\/ never be sure if the seller will ship the order after payment.\n\nThis has resulted in a period of approx 3 months covering approx eight purchases having to via PayPal request 2 refunds where Grailed offered no assistance and 1 refund which Grailed did provide.\n\nThe lack of compliance enforced by Grailed seems to have attracted abusers of the on-line trading, as an example;\n\nIn 9 years of trading with eBay,  I have only ever had to request 2 refunds for none shipment of purchase and in both cases, eBay provided the refund.\n\nI wish to add that Grailed does not allow negative feedback on a seller to be viewed.","title":"Find it difficult to report a seller…","stars":2,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-08-21","author":"codee","text":"i love grailed but this seller is clearly trying to scam me he says he can ship out right now, then i buy the item and he doesn't answer me for 2 days, and i still have to wait 3 days and the weekend now to get my money back thats what grailed told me. This has happened to me multiple times and here we are again.","title":"i love grailed but this seller is…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-08-22","author":"mike","text":"I decided to try selling on Grailed. I Sold my first item, uploaded the tracking info as instructed. Item delivered to buyer successfully. Buyer is happy and leaves me positive feedback. A week later, my payment is still on hold from Grailed. I have done everything I needed to do as a seller to complete a transaction with buyer satisfaction.  No response from customer service. Still waiting with no answer.\n\nI opened a ticket a couple days ago. My info is in the ticket\nticket ID is 109212\n\nUpdate:\nPayment Received\nThank You","title":"First time seller - Need Assistance","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-08-23","author":"Дмитрий Здравствуй","text":"Hello, I wrote below about your support, you answered me by asking for my account name. I updated the last review, but I'm afraid you won’t see it, so I’m writing a new one\nI really hope that with your help I can really solve the problem and return my money,account and continue to work with your trading platform!\nYou can see that message by clicking on my name\nMy Grailed  account name is BADVIBESUA\nThanks for your reply.","title":"Not everything is lost.","stars":2,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-08-24","author":"glina 1337 ОЛДМЕН","text":"!!!UPDATED!!! Banned for no reason thx Grailed team  !!!UPDATED!!! \n1 cause \nYour Grailed account has been frozen for violating our Terms of Service. Specifically, your account was frozen for listing inauthentic items. At Grailed, we value the safety of our community and activity like yours will result in an account freeze.\n2 \nI need a real reason for blocking for which particular thing I received a freeze in, I was a responsive seller!\nI worked for about a year, I had no problems, I don’t sell fake things, and I won’t restore those that you deleted! why don’t you just treat ordinary sellers as I bring you money!\nand follow your rules \n3 \nPlease understand my situation and give me the opportunity to work further! \n4 during the ban, they bought a shirt from me and I can’t contact this person, I need an unlock to contact this person \nY GRAILED NAME IS a_bit_of_everything\n MY GRAILED NAME IS a_bit_of_everything\n MY GRAILED NAME IS a_bit_of_everything\n MY GRAILED NAME IS a_bit_of_everything\n MY GRAILED NAME IS a_bit_of_everything","title":"!!!UPDATED!!","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-08-26","author":"lopezalex9222","text":"recently sold a pair of shoes thru grailed, got banned in the process, shoes were shipped out couldn't add tracking to grailed ( banned) added it on PayPal but grailed refunded the buyer per there numbered days to ship policy (couldn't add tracking banned) , now im stuck with no funds nor shoes emailed them multiple times no help. I've sold on there multiple times no problem this is a first. reached out to PayPal there telling me grailed is whom I have to speak with yet grailed does not help at ALL\n\n\nMy ticket number is \n\n#109028","title":"recently sold a pair of shoes thru…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-08-27","author":"NOT SURE HOW LONG I WANT TO BE A GRAILED CUSTOMER","text":"Grailed repeatedly bombarded my mailbox with groundless warnings about doing business offsite.  Being on Grailed means you have to deal with annoying and groundless accusations even when both sellers and me agree to carry out the transaction at a much lower price on multiple purchases on Grailed above and beyond 60% volume discount.  The only way one could negotiate with other sellers is of course via Grailed to reach mutual price so both parties could carried out our transactions on Grailed.  Grailed stupidly sent out wrong warnings threatened to remove us from Grailed and for falsely accusing both parties for negotiating on prices to complete transactions on Grailed.  Grailed tries to act like Big Brothers by simply sending out intimidating emails with groundless and unreasonable language.  Doing business on Grailed is like doing business on a third world country...LOW RESPECT FOR CUSTOMERS.","title":"Doing business on Grailed is like doing business on a third world country...LOW RESPECT FOR CUSTOMERS.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-08-27","author":"OAbussmind ","text":"Ban you for no reason and no support from customer service.","title":"Ban you for no reason and no support…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-08-27","author":"Eduardo Villela","text":"I’ve tried to contact grailed multiple times through various platforms in relation to my account being frozen, I have no bad intentions I was always honesty to buyers and if I had horrible intent I wouldn’t try and reach out this much, I really just want my account back @lalosvendetta on grailed","title":"Ban appeal..","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-08-27","author":"saint.dead","text":"Too high of a percentage cut!","title":"Too high of a percentage cut!","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-08-27","author":"Josh","text":"Grailed needs to revamp their Grailed app on Android immediatley! It is buggy and useless.","title":"Revamp of Android App","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-08-27","author":"James Scott","text":"When dealing with scammers and getting either your product back or your money it is useless to contact grailed as they never get back to you or help you in any way.","title":"When dealing with scammers and getting…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-08-27","author":"Michael C","text":"used to be great. not anymore.","title":"used to be great","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-08-27","author":"Anthony salomone","text":"Got ripped off through paypal multiple times and you guys dont do a thing","title":"Got ripped off through paypal multiple…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-08-28","author":"Michael Beyer","text":"Satisfaction depends significantly on the individual seller.  I've had very positive experiences with quality merchandise, and prompt responses from sellers.  I've also had many poor experiences with no responses to inquiries about the products, or sarcastic replies to questions about size. Seems like the moderators could do a much better job requiring all sellers list exact size measurements, ensuring that questions are answered, and removing sellers that are no longer active.","title":"Satisfaction depends significantly on the seller","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-08-28","author":"Chad Noblet","text":"The worst customer service of any secondary market site. No response after multiple inquiries. No way to hold buyer responsible if they ship returns to the wrong address and no way to prove an authentic item is authentic even if buyer claims it is not. \n\neBay and poshmark are my go to as a seller after such a horrible experience with grailed staff :(","title":"The worst customer service of any…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-09-09","author":"Flaco Flaco","text":"I would never buy any of the fake items the moderators at grail are selling as authentic items. I bought 2 expensive items from grailed and turned out to be fake and couldn’t get refunded. Beware just buy the safe way because grailed is the new booth leg hub.","title":"Fake, Counterfeit items at Grailed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-09-09","author":"Maze ","text":"Hi, \n\nMy grailed USN: Maze_Zolnouni \n\nThanks for reaching out. Please assist via email or grailed. It’s impossible to get ahold of anyone. Thank you!\n\nTicket #: 130206","title":"Grailed Has Robbed Me (Terrible customer support)","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"},{"date":"2019-09-10","author":"Bermondsey","text":"From the buyer’s perspective (and Grailed admitted) there’s little protection to ensure a seller doesn’t change his mind and decides to renege on a deal already done. \n\nI saw an item, where the seller has listed $25 shipping to Asia, seller and I corresponded and agreed a price, I paid using PayPal, deal was done. But after a few days the seller decided he did not want to ship anymore to outside US and unilaterally cancelled the deal, and simply refunded my purchase price. When I insisted he ships the item because a deal was made, he laughed and said I could not “force” him to sell to me. \n\nThis is grossly disappointing. Grailed is a site for hard to get authentic and unique items - that is its entire value proposition. But Grailed does nothing to ensure that a seller honors a deal that has been struck and fully paid for. Just as buyers cannot change their minds, similarly should be expected of sellers - else don’t list the item with shipping to specific regions! \n\nGrailed customer service responded with a curt and officious email - “Unfortunately per our terms of service, sellers reserve the right to refund a transaction with or without reason at their own discretion.” \n\nThis was a disappointing experience because the item was meant to be a special birthday gift for a loved one, now that has discouraged me from buying anymore from Grailed.","title":"Poor buyer protection to get seller to honor deals","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=27&stars=1&stars=2&stars=3"}]