[{"date":"2020-05-27","author":"Chris Hudson","text":"I love using grailed but they banned my account and said my off white Jordan unc were fake when I bought them from stockx I have the receipt And once grailed said they were fake I started checking them online to authenticate and there were no flaws in my pair. I never buy or sell fake anything so it’s very frustrating and grailed has not replied to me to explain how the shoes are fake. I would like my account to be reinstated my account name is 999dfa Grailed is now saying the shoes are fake with no specifics on how they are fake?","title":"I love using grailed but they banned my…","stars":3,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-05-27","author":"Devan Cooper","text":"today my account has been frozen with absolutely no explanation! I Have no disputes and have no fake items associated with my account at the time they banned me. I actually havent even been on Grailed in about 4 days so i have no idea what could have happened in that time span to get me banned. I have had my account frozen before and Grailed told me it was a mistake and put it back up so i really hope this is the case again considering i almost have 600 sales and 300 5 star reviews on my page and didnt do anything to go against the community guide lines! my account name is secondnaturehype. please help as this is my only source of income and can not afford to have 4 years of work deleted for no reason with no explination\n\nEDIT: Just 20 hours before my account was frozen grailed emailed saying there were \"listings matching my feed\" which means up untill about 20-24 hours ago my account was fine and then somehow in the time frame of me sleeping and waking up my account was frozen? this makes no sense at all please re instate my account","title":"my account has been frozen with no explination","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-05-28","author":"Cody Woo","text":"You guys removed my listings asking for more tags when they were already showing and then suspended me. I seriously don’t get that. Did you actually look at my items or just went off what your mods noted? I had photos of all the neck and wash tags all legit clothing why would you say they aren’t real?","title":"Hi there hope everyone is staying safe!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-05-28","author":"Experienced User","text":"So are you going to reply to my issue or how much longer is this going to take? Will I get any compensation for your mistake and for my account being frozen for all that time? Do you have like 1 person employed for customer service? Thats what it seems","title":"unban me","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-05-29","author":"D2Groovy","text":"So i am a seller and the person i was looking to sell to now has a banned account should i still ship off is it safe?!!!","title":"So i am a seller and the person i was…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-05-29","author":"8ln.nl8 xx","text":"The freeze on my account was lifted and the refund i was forced to make was reimbursed to me. but those are not the problem i have with grailed. its the extremely inconsistent “authenticity check” which allowed something to be bought and sold 3x before it was flagged. Also why does it take 3 days to get a reply from the help team. this app sucks and is going to start losing business if they dont get their costumer service under control. i personally will not be using this app anymore.","title":"The freeze on my account was lifted BUT","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-05-29","author":"Cole Walker","text":"My grailed just got frozen for selling a BOGO that I bought from SUPREME NY so I don't understand how this happened. Could you guys please reinstate my account, the name under it is walkercole8093, please I partially make my living off this.","title":"My grailed just got frozen for selling…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-06-01","author":"Sean Zammit","text":"Tried listing my LV x Supreme luggage tags with OG all twice and both times the listing has disappeared with no mention as to why it was taken down. Ridiculous, as I am trying to list all items from my sneaker store and clearly Grailed it not the place for them. Username:  Whitenemo","title":"Tried listing my LV x Supreme luggage…","stars":1,"location":"MT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-06-02","author":"Marqus ","text":"I have been locked out of my Grailed account for no reason at all, I only buy on Grailed and I have never sold anything on there. So I decided to file an appeal (via email)  and the response I received was: ”Your Grailed account has been frozen for repeated attempts to engage in offsite activity. Unfortunately, we can no longer reinstate your account.” I do not know what this means all of my deals have been legit and smooth please explain this. \n\n\n\nUsername : Qtodd98","title":"I have been locked out of my Grailed…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-06-02","author":"Sean Zammit","text":"Received an email response about my last post saying it was pending approval today, however, still received no response and only received a response on a listing I made way after the supreme x lv.","title":"Received an email response about my…","stars":1,"location":"MT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-06-02","author":"Igor “Lait”","text":"This is absurd. They’ve banned me for the fourth time for no reason. After I write on this site they will unblock me, but this is a laugh. why should I constantly write here, and why do you ban accounts for no reason?\nI have 100% positive feedback, there are not any complaints. Last time you came up with a reason that I liked the photo, although if you go to my account you can see that I do not like. \nthey also wrote that I have several accounts that are used for spam, why are you brazenly lying? I have only 1 account.\nWhat do you say to me this time?\n\n\nmy nickname on grailed Lait88","title":"This is absurd","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-06-03","author":"Papi Shampu","text":"Hello ppl looking for good quality clothes, please do not come to grailed! They have ripped me off 3 straight times, and with that bs 100% guarantee is bs! All they do is send automated emails and ignore your problems!! DO NOT SHOP WITH GRAILED!","title":"NEVER EVER SHOP WITH GRAILED!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-06-03","author":"Riicardi","text":"You have to take better precautions with letting people buy and sell on your platforms I just sold a pair of air Jordan ones with specifically say 9.5 condition but not new and the buyer after shipping it to him states that all he can't take it now because he thought they were new well I don't do refunds and you need to look into this situation because I'm not refunding him anything he's trying to extort and scam me clearly Sellers I'd is (bktheplug) please investigate this user","title":"You have to take better precautions…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-06-03","author":"Sean Zammit","text":"If you are a collector, I advise you not to use grailed according to them all my J1 x OW's are fake even though I got them from klekt which sure as hell has better authentication than grailed considering they focus on that. Grailed will never tell you what exactly is fake about it and have a general excuse. Well at the end of the day its their loss I have a sneaker store with over 100k euro of items to list, someone else will be getting my business. Also grailed execs please google a type 1 error, you guys are fantastic at them.","title":"Do not use grailed","stars":1,"location":"MT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-06-03","author":"Leong888 ","text":"Hi Grailed I was listing many of my items and I believe my itmes all authentic. my account was frozen please contact me thank you.\n\n\nThanks for the fast reply !\nThe shoes that I listed from StockX !  ( I have receipts and price tags )  StockX to me is the trusted store . And l also been a great buyer from Grailed many years and bought so many items too ,but I used different account that I’m use selling right now . Anyway I no more wish to continue selling my items on Grailed .You are HEARTLESS and abandoned me to find a way to reach  all my buyers by myself ,The items already shipped to them and is my big responsibility to make sure all the the items reach and arrived to them . Is all my BIG mistake that chose you to sell my items .And thanks again for the most expensive experience that I never have before in my life with Grailed thanks !","title":"Account Frozen","stars":2,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-06-04","author":"Synthesizer","text":"Im not going to lie... grailed is a great marketplace. Although, their customer service is terrible and their authenticity checks are counterproductive. They have banned me numerous times for \"inauthetic items\" although the items in question were literally bought from retail stores. i'm not claiming to be an expert about this but i just can't see how they will manage to keep new people coming to their site. It seems as if they ban new accounts for no reason. As if its some sort of reserved community for trusted sellers. I understand the idea of that but unfortunately there is no way to become a trusted seller if there is no opportunity to sell. Also, i cant even buy on the website now. After one account being frozen, they ban my address. I would really like to use this site as items seem to sell quicker here, however, their customer service sucks and they will ban you for simply using their site.","title":"Im not going to lie..","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-06-04","author":"Igor “Lait”","text":"I will duplicate my message again, since I did not receive a response (\n\n\n\"This is absurd. They’ve banned me for the fourth time for no reason. After I write on this site they will unblock me, but this is a laugh. why should I constantly write here, and why do you ban accounts for no reason?\nI have 100% positive feedback, there are not any complaints. Last time you came up with a reason that I liked the photo, although if you go to my account you can see that I do not like.\nthey also wrote that I have several accounts that are used for spam, why are you brazenly lying? I have only 1 account.\nWhat do you say to me this time?\"\n\n\ndue to the fact that the buyer could not write to me in PM, he opened a dispute on paypal and wrote that I blocked him. And all this because you block people just like that.\n\nmy nickname on grailed Lait88\n\n\nWhy are you lying brazenly? show me at least one of my goods which is duplicated somewhere? I have only one account. Again, arrogant lies.","title":"This is absurd","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-06-07","author":"Igor “Lait”","text":"my account was banned for a reason\n\n\"We have documentation that your account has been using shell accounts to mass-like your own listings for self-promotion, which is considered a form of spam and content abuse by our platform.\n\nAt Grailed, we value the trust and safety of our community and we reserve the right to freeze accounts that are inconsistent with our expectations.\"\n\nI have only one account. Show me at least one take of my publications.\nWhy do you just block people, and come up with untruthful reasons.\n\nBecause of you, people began to open disputes on PayPal. Because they saw that I was in blocks, and they think that I am a scammer, although this is not so.\n\nI have 100% positive reviews and not one complaint for all the time since 2017.\nIt is unfortunate that you do not value your users\n\nThey blocked me, although I did not violate more than one of your rules!\n\nI don’t advise anyone to deal with this site, get ready for the fact that you will simply be banned.\n\nNick Name Lait88","title":"Again a blatant lie","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-06-07","author":"Maximilian Kilworth","text":"Can Grailed please get back to me about a seller than has given me a non existent tracking number? I have messaged the seller; no reply. Messaged DHL; they said there is no package under the tracking number provided. Contacted grailed via email and through the contact form on the app; no response","title":"Grailed please get back to me","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"},{"date":"2020-06-08","author":"VETMO","text":"Hello, i used the grailed for a year and had many positive transactions, reviews and happy buyers but i has been frozen for listing counterfeit items. I provided to support a lot of additional photos, but they said that they can’t confirm the identity of the item without a original receipt. unfortunately the snkrs ru(nike.com) does not provide it but only gives an invoice. I provided an invoice but support wanted only a receipt. I do not want to argue. I am sorry if it was a fake and promise that this will not happen again. Is there path to have this issue resolved? By the way, thanks for the opportunity to sell many of my items.\nUsername: VETMO\nnew Email (i don't use old): ilovevetmo1@mail. ru  (without space)","title":"Account has been frozen","stars":3,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=15&stars=1&stars=2&stars=3"}]