[{"date":"2017-09-28","author":"Niko","text":"My first purchase on grailed was a luxury bag. Before I bought the bag I read the user protection info where grailed say they dont tolerate counterfeits and will assist you with paypal refunds or any troubles ... \nSo the bag I bought obviously was a fake, when I asked the seller for a refund he said he cant refund from his paypal because grailed took a big fee and he can refund the part the website took. So I contacted grailed and all they said was...sir, here is paypal phone number ... talk to them we cant help you with anything, bye... \n\nMy first experience turned into a nightmare.\n\nSo basically - when you buy on grailed you have a very high chance to buy a fake item and no one will assist you with  a refund, you will have to deal with the whole process yourself on paypal.\n\nIf you want to sell on grailed, just find a customer on the website and sell through paypal because you will not have to pay the fee, In case if a dispute you will have to deal with paypal  yourself anyway plus you will have full control of the refund. \n\nGood luck","title":"My first purchase on grailed was a …","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2017-10-10","author":"tntijw","text":"Got scammed, and the customer service was very unhelpful in solving. Do not recommend this site.","title":"Got scammed","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2017-10-26","author":"Ilana","text":"The one time I bought something there I recieved a t-shirt and I was told it was great like new quality but it was more like fair but I got a decent deal and recieved it quickly. Be careful and if you really want to take a chance.","title":"Kind of scammed","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2017-11-29","author":"Jhonald Cruz","text":"There Buyer Protection is full of bs!!! Do not buy from this site. You are not protected and they won't help you at all.\n\nI have purchased a bag and got a shirt and had to send the shirt back to the seller so he can send me the bag I purchased, and like magic my bag didn't appear because stupid Australia Post placed the parcel outside our door as they think it was safe leaving it there instead of my mailbox. Now I end up having nothing. Never trust GRAILED!!!!","title":"There Buyer Protection is full of bs!!","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2017-11-30","author":"Collin Porterfield","text":"Grailed does nothing to enforce the integrity of its site.  I made a deal with a seller, esmolitsky, aka Arthur Smolitsky, to buy a pair of boots after he offered a price certain. I paid, then 5 days later he inexplicably refunded my money. When I asked why, he told me he sold them on more than one site simultaneously. However, a couple of weeks later he relisted the very same boots on Grailed for much more than he agreed to sell to me. Upon complaining to Grailed, they basically say there is nothing they will do even though esmolitsky violated the site's terms and conditions.","title":"Grailed does not protect buyers.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2018-02-05","author":"Lori Smith Docherty","text":"Grailed does NOT provide any type of customer protection and allows Sellers who have committed fraud to continue to sell. The automatic 5 star review unless you post something to the contrary is misleading as well. I have spent hours trying to deal with 4 Buyer issues though Pay Pal, from fake items, to items not sent.    Really a shame they are not accountable when their Sellers are not.","title":"Grailed does NOT provide any type of …","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2018-03-11","author":"J. Boberg","text":"ATTENTION: DO NOT DO BUSINESS WITH GRAILED.COM. They claim to back their sales, but they do not hold their sellers to any accountability, and any disputes they just throw to Paypal. The loser of a seller from whom I attempted to make a purchase refused to ship the item after acknowledging the transaction, and claimed he never got the money, which Paypal said was not true. Grailed \"customer service\" attempted to distance themselves from the entire transaction immediately, and Paypal just closed the case with no resolution. I am out the full purchase price, have not received the item I purchased, and have gotten no responses to any requests for assistance that I did not have to raise a stink to obtain, and there is still no resolution in sight. You are taking an extreme risk dealing with any of these people (this includes PayPal). Please protect yourself and stay away from them. Feel free to share this to everyone.","title":"Avoid Grailed.com at all costs","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2018-04-12","author":"James ","text":"Sellers are scammers. You will never receive your item. Avoid at all costs. Had to go through paypal to get refund. Grailed doesn't respond to customer service emails.","title":"Sellers are scammers","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2018-04-14","author":"DeiDa Dei","text":"I received 4 counterfeit in Grailed! Its customer service did not help you. Please call Paypal directly. Also, it didn't ban the seller who sell fakes. It allows the counterfeit seller to sell their fake goods again and deletes the bad customer review.  Well, the only one suggestion I wanna give you:  the seller's rate is nothing, the most important thing is to review the seller's evaluation!","title":"Bad Bad Bad","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2018-04-19","author":"DaBeast","text":"I was trying to sell my red purple bogo and within hours they labeled it as counterfeit. I didn't really know how to use it or how to sell products so I just took some pictures and posted them. I guess there a specific way you need to take the pictures. I was willing to take them again but I was immediately banned and when I tried to contact them about what happened I got no response. Never buying or selling on grailed again.","title":"I was trying to sell my red purple bogo…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2018-05-31","author":"Wayne Klein","text":"I contacted their customer service people via Twitter and was given the runaround when I asked them to access information on a tracking number for an item. The person that purchased it  filed a false claim with PayPal claiming they did not get it. That person was banned for this behavior. I was unable to open the page with the listing under transactions because that used it was bad and I sold the item to him. Grailed Has the worst customer service I have ever experienced online. Don’t use them.","title":"I contacted their customer service… grailed sucks","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2018-06-10","author":"RuN","text":"Wow .. where do i start . I recieved a fake, very obviouse fake filed a claim paypal sent pictures to them all the requirements ,got my refund but had already was waiting for other purchased items and have yet to recieve NOTHING . As i type this some of my pkgs are lost in the mix or never actually ship anything only a label created with ZERO updates...no Moderation , \" customers service\" is the same person and are USELESS .STAY FARRRRRR AWAY FROM GRAILED no Bs Stay AWAY . Or if you like headaches than go ahead ,flip a coin","title":"Wow .","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2018-06-14","author":"Cyber Viper","text":"AVOID LIKE THE PLAGUE. Purchased a pair of Givenchy sneakers but instead got women's underwear made in Romania. Complained to Grailed and they *banned me* because the UK tracking number on most of the pics did not match the US! Surprisingly, for a website that posts internationally, their incompetent and ignorant staff don't know that whenever a package arrives in another country it gets a local tracking number. In any case, I sent a photo of the US postage on the package and they still banned me. There is not a phone number you can call and it is different people replying to you so no one owns the complaint. Didn't get a refund so lost $320. NEVER AGAIN! GRAILED IS A SHAM!","title":"AVOID LIKE THE PLAGUE","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2018-06-19","author":"Brendon Taylor","text":"I had a issue while purchasing an item from this app. I needed it in a timely manner and the seller agreed on a date to ship the item out by to assure it got to me on time. The seller left no tracking # and I’ve been waiting multiple weeks for my item. I have contracted the Grailed customer support team everyday for 7 days straight (only available through email) to try to get some help on my issue. I have not a single email or response back from them about my issue. My next step is reaching out to PayPal and explaining to them that not just the seller is fraud but the company is fraudulent themselves as well. I hope they can fix there service ASAP so others don’t go through the same experience I am currently in. I will definitely be removing my account and deleting the app once my issue gets resolved that is if I ever gets resolved.","title":"I had a issue while purchasing an item…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2018-07-21","author":"Mine","text":"never never and never again\ncheating website!!","title":"never never and never again","stars":1,"location":"DK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2018-08-07","author":"BPY Security","text":"i got banned for some false accusations horrible","title":"i got banned for some false accusations…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2018-08-10","author":"Taylor Durkin","text":"Long timer trusted Grailed user here, I have over 200 transactions and over 180 positive feedback with no negatives.  Grailed randomly banned my account for selling “Fake” Supreme accessories and is stating I’m a wholesaler for “Fake items”.  I have ever and would never sell unauthorized\/unauthentic product and my good reputation proves this.  I have wrote them many times with even being in contact with Arun Gupta, the CEO of Grailed with no resolution.  I’m seriously considering taking Grailed to small claims Court since my attorney believes I have a valid case to fight.  Well that’s my review of Grailed.","title":"Grailed has the worst customer service.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2018-08-15","author":"Anthony Garrone","text":"If i could give this app zero stars i would !!! customer service is appauling and every other person using this app is a scammer and or selling knockoffs !!!! These people should be ashamed of themselves AVOID at all cost !!!!!!!","title":"Worst Clothing app Ever !!!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2018-08-28","author":"Анна Карпова","text":"I got unfair ban on Grailed.\nAfter more then 100 positive transactions i got unfair ban for 100% authentic certificated Moncler sweater. They told me it is fake. Their administrators dont know how to distinguish fake from authentic stuff, so they ban what they want and sell obvious fake from chinese markets as auth. item. They do wat they want. \nThey told all my buyers that i am fraudster and i lost more than 400 euro, but all my stuff was authentic and i am fair seller.\nAfter 2 weeks and more than 20 mails they told me thet my stuff is fake and i'll get no answer anymore. My account is permanently frozen.\nGrailed got 2000$ only from percent of my sales. And look what i've got.\nIf you sell on grailed - you can end up in same situation as me.\nIf you buy on grailed - this administration sells fake because they can. So you will not prove nothing.","title":"I got unfair ban and unprofessional administration.","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"},{"date":"2018-09-03","author":"Gary Villagran","text":"I was selling on Grailed and had one buyer claim that I sold him a fake as I was working with PayPal on the situation . I noticed buyers storefront was mostly replicas so I reported him to Grailed. Grailed turned around and banned me and contacted my buyers to inform them I was selling replicas which was a flat out lie . As of today I have won the PayPal dispute with the scammer and forwarded that information to Grailed . I expect an apology at the very least for continuing the lie buyer had submitted to Grailed and for Grailed emailing my buyers who kindly supported me with the email you sent him urging him to file a claim with PayPal . That is illegal and morally corrupt  for you to do with no proof . I submitted to you tons of proof on this scammer . But you allowed him to stay as he continued to berate me via emails . But you all wouldn’t even look at that . I will be filing with BBB and  FCC and take it all the way to the top to expose the corrupt business you are running here . Every item on the site new with tag is a fake as no one can ever supply you with a retail store tag . Red flag 1. And serial numbers but no one says a word about that claiming new with tags more like fakes with tags . All the trickery they use but no one will provide retail receipt tAg with price from retail store and provide you with tags that are useless no one ever shows inside of tags cause they are blank and should not be . Many use original receipts of designer but are still selling replicas . If you pay careful attention and know your designers well.  Ex Gucci belt should have a21 digit serial number usually starts with 112 or 223. Stitching of items other giveaway . But that they allow and runs rampart  thru Grailed . Perhaps we should start a class action lawsuit as I know many who have endured the same as I .  It’s one thing to ban a person but when you attack my character with false allegations. Some one needs to hold you responsible . That’s slander and you tririef to destroy my business with no actual facts .","title":"I was selling on Grailed and had one…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=36&stars=1&stars=2&stars=3"}]