[{"date":"2021-06-25","author":"Amina Khan","text":"Terrible customer service and questionable 'authenticators'. I was sold a pair of what I believe to be fake Adidas x Prada (came with no tags or box which is fine) but I took them to the Adidas store who stated it is hard to be conclusive without tags and boxes but looked at certain things like the smudged label and wonky Prade heel tab, excessive glue and uneven stitching - they are most likely fake. Their digital authenticators are clearly not good enough, and their 'customer service' assistant Emily needs to go on some training. I dropped Adidas a line to let them know that Grailed is allowing potential fakes to be sold, hopefully, that will motivate them to take it seriously. I'll be going straight to Paypal. Avoid Grailed and stick to StockX or even eBay. These are amateurs peddling questionable goods.","title":"Terrible customer service and…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-06-27","author":"Gruppe S","text":"Don't buy from these guys, owner Justin lacks integrity. If you don't like what you get, just do a chargeback with your credit card. Also if you special order anything, cancel at any time, he totally doesn't mind.","title":"Justin Pham lacks Integrity - charge back any time!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-06-29","author":"PGD","text":"So, I’m new to this platform. But, I’m a Level 4 seller on StockX, blah, blah, blah. \nMy point: I’ve been around. A few sales went through great on Grailed and I received perfect feedback across the board. Then, the scams started happening. New profiles with no purchase history outright paying for the item (even if it’s above market), then being dead silent when attempting to speak with them, followed by (surprise!) an unauthorized charge claim on PayPal. Being wise to this, I put my profile on vacation mode, hoping that I could just take everything down when I had a moment. But, as soon as the clock struck midnight and my “return” day began, BOOM another sale from a silent, rando, zero transaction buyer. Immediately, I contacted Grailed and asked what I should do-that this guy fit the profile of every other fraudulent purchase I’ve received. No one bothered to reply. So, I sent the item out thinking that, after I tape recorded everything, bought insurance and signature confirmation, that I’d be good. Then along came “Gavin” from the “Grailed Team” more than 24 hours later saying to not send the item, if I did, to re-route it, and to go deal with PayPal. Yeah, too late. So, I tried rerouting it (hopefully, it’s successful) and “Gavin”\/Grailed have yet again gone dead silent regarding how they can help and did not answer my questions as to, inter alia, whether this guy can still leave me negative feedback since they (Grailed) expressly told me (too late) not to do business with the buyer, etc. One could argue that I could’ve waited longer for a response. But, I pride myself on sending things out fast-StockX only gives you two business days and I’m guessing that it rests on the premise that buyers should not have to spend their hard earned money for some seller to “get around” to something they’ve paid their hard earned money for. Plus, over 24 business hours is plenty of time for Grailed to respond. Someone could also argue that I should’ve refunded the guy on the spot. But, that leaves me open to negative feedback (from what I’ve been told). With only a few sales, I can’t afford a negative review. \n\nTL;DR: Grailed sucks; Grailed’s mod team sucks, they offer no protection; they’re lazy; they’re rude; and scammer buyers are everywhere. I deleted every single item and they in no way, shape, or form deserve their cut of the sales. Other platforms are far from perfect. But, Grailed is a steaming pile of crap. Hopefully, StockX begins to accept used stuff or a legit middleman service that will help advocate for you (e.g. not a rando on Reddit) comes around; I’d happily pay the premium for that…\nStay safe out there, sellers! Karma is a b****, Grailed!","title":"Grailed is an absolute joke","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-06-30","author":"Tom","text":"Grailed Team is horrible and unhelpful. The site itself is full of scammers. I honestly wouldn’t be surprised if that loser staff are the same cretins that are scamming people.","title":"Grailed Team is horrible and unhelpful","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-07-01","author":"RAZ","text":"“Grailed Team” especially Gavin and Lennox, are absolutely disgusting. They let scams happen and are scammers themselves. Buyers and sellers would do well to stay far away from this horrible site.","title":"Grailed team is sickening","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-07-10","author":"Ashley L. Brewer","text":"Unacceptable service and accountability. I ordered a shirt on May 31st, reached out 2nd week of June and was told that my shipping time would be 7-10 days after the order was placed and that I should be receiving my order soon after.  Today is July 10 and I have still not received an order but instead have been told several times on several occasions that my order is now being shipped.  I requested a refund citing everything mentioned above and was given a 15% off of my next purchase whereas nothing done for this one and my refund has been declined, Im guessing as it was never addressed in return email.  Completely unacceptable, I’ll continue to use IllCurrency for my needs.","title":"Unacceptable service and…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-07-16","author":"Brad M","text":"Made an account and bought a couple shirts, one shirt I was never sent a tracking ID so I had to refund the shirt thinking I was never gonna get it, surprisingly it came in the mail so I tried to do the right thing and give the seller his refund back, there was no obvious way to do this within the app so I just asked for his PayPal not knowing that it was against company policy to do so, a simple mistake that cost me my whole account permanently. That was surprising but what was more surprising was their team member Lexy making a false accusation against me that I made this simple mistake repeatedly, but could offer no proof to back her claim, instead of backing her claim she chooses to ignore my emails for 3 days because Grailed customer support does not value its customers.","title":"Grailed customer treated terribly.","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-07-19","author":"Laurent B","text":"This site is just a joke ... They consider authentic articles like counterfeits. Even when we bring all the verifications with the authentic labels etc ... I doubt the proffessionalism of their moderators. If you do not want trouble after a sale, flee this site!","title":"This site is just a joke ..","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-07-21","author":"Joe Gabriel","text":"I ordered a wallet and IT WAS NEVER SHIPPED!!! \nTHIS SELLER IS A SCAMER!!!","title":"I ordered a wallet and IT WAS NEVER…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-07-25","author":"R Seoul","text":"Zero communication or customer service from the seller.\n\nGrailed customer service agent was great though. \n\nConvoluted refund process puts me off.","title":"Mixed bag","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-07-26","author":"Francis D","text":"Communication from customer service is A1 communication between customers and sellers is garbage","title":"Communication from customer service is…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-07-29","author":"Riicardi","text":"My account was frozen by grilled for absolutely no reason I just made the account a week and a half ago all my items have been successfully supposedly verified by experience authenticators I would like to know what’s the reason and I’m contacting the Better Business Bureau because this is happened before and I’m tired of this crap with you guys my","title":"My account was frozen by grilled for…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-07-29","author":"Julian S","text":"«Grailed Protection» doesn’t exist and is a literal scam.\nGrailed proudly advertise on their website that Grailed Protection will «take over» with their Money Back guarantee if Paypal is unable to solve your refund claim or if you’re outside the 180 day period for Paypal refunds. But this is completely false. Whenever I mention Grailed Protection with customer service they stop responding to my e-mails or respond with automated mails. Horrendous costumer service and actual lies as part of their refund «policy».","title":"«Grailed Protection» doesn’t exist","stars":1,"location":"NO","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-08-01","author":"Samantha Blackburn ","text":"So on June 16. I placed my order with Grails, a place you can buy matching t-shirts to go with your sneakers, two weeks I emailed customer service, they said they was having a high volume of printing and there was a delay, I gave the benefit of the doubt, then two weeks became a month they say for your waiting they will give a 15% discount which never happened.  I'm still waiting on 4 t-shirts that I find it ridiculous that a place that prints t-shirts for a business has taken going on two months to produce four.\nI am now working with my bank to get back my money.\nBuyer beware if you plan on ordering from them make sure you're not ordering for an occasion I still have not received my items.","title":"two months and still not received my order","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-08-03","author":"Alexandre Gagnon","text":"Worst selling site you can be on.\n\nBan users for no reason at all.\n\nTried to contact support and getting completly ignored by automatic message.","title":"Worst selling site you can be on.","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-08-05","author":"Claudia Selvatino","text":"I purchased an item from a seller and after 2 weeks of attempted correspondence, it became clear the seller had no intention to send my item. Grailed was quick to refund me - I’ll absolutely give them that. But after leaving a negative review on the seller’s page about my experience, I learned that if the seller removes a listing, the review goes with it. So, if a seller gets a negative review, they can effortlessly wipe their slate clean. I can’t shop on Grailed with confidence knowing they allow their sellers to do this.","title":"Easy for sellers to manipulate their rating","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-08-12","author":"Drea","text":"Seller never sent me a tracking number. Luckily, I was able to get a full refund the same day I contacted the support team which was a plus because they responded in under 5 mins. But, I don't think I would buy from this seller again. Unprofessional!","title":"Seller never sent me a tracking number","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-08-24","author":"Mark","text":"Although the concept of Grailed is a good one, it has a significant number of sellers who cheat the system by being deceptive of sizing, or simply not shipping items that have been paid for.\nThe reliance on PayPal for refunds creates a cumbersome process and leaves buyers at risk if they do not fully understand what actions need to be done by whom and when.\nI'd give it one star if it weren't for the speedy response of the Grailed Support Team and their work to resolve the multiple issues I had with purchases.","title":"Nice idea for a way to buy clothes, but flawed.","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-08-25","author":"Areyke","text":"I had 5 successful sales and 70 messages during the time when I did not use the service during the pandemic. Once I got back I spent the whole day taking a photo for the product and also updating all prices. As a result, after 2 days they write to me that my yeezys are not original. Although for 2 years, this pair of shoes was quietly posted on the site. I had 2 pairs of Yeezys from one drop, the first pair was bought from me on grailed 2 years ago. It turns out, according to the logic of GRAILED, they sold the fake and did not even refund the money to the victim? In fact, this is a big clownery, it feels like they are just tossing a coin to decide whether to post or not. At the same time, I took all my items with my own hands and I have everything, including accounts with purchase history and online receipts. But the grailed service doesn't need that. Why try to be competent when you can pretend that you are competent. Fake customer care. When I wrote to them to prove the originality of my couple, they refused to explain anything and banned me, and indicated the reason for \"offensive behavior\", because I also called them clowns in the ticket. In the end, they grailed this bunch of resentful clowns. You don't even need to buy tickets, everything is free.","title":"Company of clowns.","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"},{"date":"2021-08-25","author":"Sh8y 96","text":"Grailed seems to have racist moderators who give black sellers a hard time with “authenticating” high priced items. I have been selling on Grailed since 2019 and they always seem to ask for 20 plus photos with my listings yet other sellers have minimal photos and no seller history yet somehow have zero problems.","title":"Grailed seems to have racist moderators…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=4&stars=1&stars=2&stars=3"}]