[{"date":"2021-01-29","author":"Sam Cook","text":"Bought 2 pairs of shoes last year on StockX, decided to sell them with the proofs of purchase and verified tags.\n\nTaken down asking for more photos, which I provided, eventually removed after a few days claiming they were counterfeit. I emailed support asking for further explanation, no response, so I relisted them with every detail I could cover. This led to my account being frozen.\n\nI appealed and they gave the same automated response of \"counterfeit Jordans.\" No further investigation, no comment as to why they were fakes. I should reiterate: bought off StockX, they verified they were authentic. Very arbitrary review process, hope other first-time sellers have better luck and use this as a warning.\n\nUPDATE: Sold them through Sneakercon. Weird experience selling on an application where the mods know what they're doing.","title":"UPDATED: Tried to tell shoes, ended with my account being frozen","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-01-30","author":"Michael","text":"Hello Grailed. My account has been frozen and I don't understand what happened. \nI have been doing business with you since 2014 and have 104+ transactions and 34 reviews, I also have a lot of sales lately and I cannot contact my customers because of this. I wrote to technical support, but they did not answer me. I was also cheated on Grailled and I was left without goods and money. I do not understand what happened and I am very disappointed in this. Please help me solve my problem to understand what happened. I really appreciate the Grailled community and don't know what to do now. Help me please. \nMy username: whatwhywhowhere","title":"I have problem with my account with 104+ transactions","stars":2,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-02","author":"kai","text":"Bought a stone island hoodie from the platform but seller was banned for selling fakes before the hoodie arrived,when the hoodie arrived it was found fake on certilogo.paypal agreed to refund me the money but I had to ship the fake back to Russia and it costed 100 usd.Grailed should refund me the shipping cost but their support is unreponsive.THIS WEBSITE IS A SCAM DO NOT USE.","title":"Buyer protection is a scam","stars":1,"location":"MY","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-05","author":"andrea moretti","text":"Experience was terrible as i sold something, then send it to the costumer and never received money from him. NOT THE FAULT OF GRAILED! They actually helped me and refunded me as soon as possible. So thank you Grailed!","title":"Grailed is good but attention to bad buyers!","stars":3,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-08","author":"Sean Miller","text":"account suspended for no reason, they are not answering","title":"account suspended for no reason","stars":1,"location":"RS","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-08","author":"Bogdan Belodedov","text":"Today I registered on your site for the first time, uploaded 8 vintage rock group T-shirts, received an account freeze without notification by email and reasons.\n\nI am waiting for a response from support by mail.\n\nMy nickname: lilkrystalll","title":"Frozen account","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-10","author":"Norm","text":"My experience with Grailed was truly the worst company experience I've ever had. To make a long story short, I had bought and then re-sold a piece of clothing from Grailed, which, two years after I had sold the piece turned out to be fake. I found this out from a random email letting me know that my account was now frozen.\n\nInstead of taking the two seconds to realize that I had bought the fake piece of clothing, totally unbeknownst to me, from the Grailed website, they banned my account and sent me a hastily written email with absolutely zero context letting me know they had done a thorough investigation and this was the result. \n\nA week after I sent them a followup email explaining my situation, they send me an email letting me know that my account was unbanned. No apology, no empathy, nothing. \n\nI now have a 1 star review on my account which I had absolutely no control of (due to the fake piece of clothing), so I no longer can sell anything on their site. I used to work in customer support so I know how easy it is to humor a customer; They didn't even act like they cared. Grailed pretends to care about their customers, as I used to be a huge Grailed fan for this reason, but the reality is, they couldn't care less.","title":"Worst Company Experience I've had.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-10","author":"n\/a","text":"I have been selling on grailed for quite sometime now, I've come to sell over 60 items and have luckily never had issues with my buyers. My greatest issue is the fact that I resell authentic luxury items - most of which have tags attached and are in brand-new condition. I make it a point to photograph every angle of the item, ( I am not green to the resale business and I am very well aware of how to provide detailed information on listings in order to protect myself and the buyer) so of course I include photographs of the tags, the logo, basically every angle close up and far away, it's all there. Obviously I spend my time doing all this which means I invest time into creating detailed listings but for some reason grail always takes down my listings ( about a day after I create it claims to be under review)  claiming that they need more information. This alone is very frustrating because I provide every possible piece of information for a clothing item ( not really sure how much detail you want out of the T-shirt or a sweater for example) . Many of the clothing items that I sell I have had for sometime and I am not one to keep receipts like many others, that is the only piece of information that I don't have but it seems like grailed feels that without it they have permission to take down your listing meanwhile nobody else puts these receipt images - I hope I'm making sense. My point is, instead of completely removing a listing that people spend time and effort creating what you should do is move it into the draft section at the very least if your company feels that it's missing some kind of information in addition to that perhaps your company should specify which information you feel is missing instead of leaving it a riddle for sellers. If you're selling clothing that has no brand then this platform is perfect for you, if you want to sell luxury goods - high end product then you will be wasting your time trying to create listings on here ( and remember time is money). I also reached out to their customer service regarding this because it honestly it is incredibly frustrating to have to deal with and to have to re-create each listing simply because someone on there end doesn't know what they're looking at. Customer service says they need \"more\" images ... well that's always been provided so I think somebody is lacking in their work department. Are you guys even looking at the listings and images provided? Do you guys realize how long it takes to create a listing on your website especially with your incredibly slow image upload system? ( and by the way there are only six slots for images and you can upload 2 at a time otherwise it won't upload any images at all) And don't you guys think that it would be better appropriate for your sellers - for the people making you money to at the very least make that listing a draft instead of totally deleting it?\n\nBy the way I see that there are a lot of short reviews on here and honestly they look fake to me. Just be aware there are plenty of other platforms that you can sell on that won't waste your time I have great customer service as opposed to this platform. \nIt also doesn't help that their customer service is oblivious to any question you ask them.","title":"This platform is a waste of time, here's why","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-11","author":"cuan sloan","text":"Grailed is gradually becoming the worst resell marketplace. Seeing the reviews this decline is unsurprising.\n\nHad sold a few items from my closet and received positive feedback so was on course to building a good reputation. But I had also purchased a few items which were safe and great thanks to graileds authentication process. However, I went to purchase a designer second-hand item for my brother's birthday, from a seller who had accepted my offer. I then logged in to his PayPal and had paid for the item via revolut and PayPal. The notification for money being taken from my card instantly came through from Revolult and then the screen froze on the grailed app. I tried redownloading the app and logging in but the section so where I had purchased had not worked at all. I had contacted Michael from customer support and he told me to try again. This time I did and then my app froze and had read error messages. i emailed him again and then he said my account was frozen due to my brother's \"suspicious associated paypal\". No explanation just a random statement \" suspicious\" What bullsheet excuse is this for banning an account in the middle of a transaction. I had done nothing wrong and now grailed has taken my money and I cannot even check my transaction which I had paid for!!! This is robbery in the highest form.\n\nUnimpressed and will never recommend this app to anyone.","title":"Grailed is gradually becoming the worst…","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-11","author":"Elegant Mode","text":"They keep deleting my listing with excuse that they only sell men stuff. But there is thousands of female listings on grailed. It’s useless with them. Just better to stick to eBay.","title":"They keep deleting my listing with…","stars":1,"location":"AT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-11","author":"Derek Fischer","text":"I purchased a pair of Yeezy boost 350 V2’s on their site that they claimed were authenticated. I went to resell them on the same site, grailed, and they told me they were fake. So which is it? Their “authentication” is clearly a gimmick.","title":"I purchased a pair of Yeezy boost 350…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-12","author":"Will F ","text":"PLEASE READ AS A FIRST TIME SELLER ON GRAILED \n\nFirst off, I never leave reviews weather I've had a good or bad experience, I just don't do it. \n\nEXCEPT FOR NOW! \n\nMy very first interaction with Grailed left me so pissed off and frustrated that I've come here to warn people.\n\nI've used StockX and Goat numerous times with zero problems. So I list the holy grail of sneakers, my used Nike Dunk Low Diamond Supply co. I list them at an excellent price of $1200 for a fast sale as I had my eyes on some new releases. The listing had 15+ photographs and was VERIFIED by Grailed after 3 days. The listing went live and a buyer bought the shoes after about 3 hours. They sent over the money through PayPal and I told them I would ship the shoes the following day. \n\nSo far so good 👍\n\nAbout 1 hour later I get bombarded with messages saying he \"wants his money back\" he \"made a mistake buying them\" \"it was an impulse buy\" \"I have to pay my rent\" and said he \"wasn't right in the head\" I was disappointed, I told him he had \"wasted my time\" but \"yes I will refund you after I finish work\" \n\nAbout 3 hours later I log into PayPal and see he was already issued a reverse charge and his money was sent back to him and I never hear from him again. No worries I say be gone and good riddens! I log into my Grailed account to relist the shoes BAMM account blocked and banned for selling fake shoes!! WTFFF!! \n\nTHIS KID HAD A FREAKER, TOOK HIS MONEY BACK AND GOT MY ACCOUNT BANNED LOL \n\nI write a long ass email to Grailed explaining the whole situation and if they look at our previous messages they will see I am in the right with the buyer and my shoes are real as they verified them themselves 3 days prior. (By the way, I bought the shoes in 2004 for 139.99 in a skateboard shop on Kelowna, so they are real) \n\nTheir response was \"you sold fake items on our site and are now banned forever\" I can't even view Grailed.com in my web browser, they literally deleted me from Grailed period! LOL\n\nI was pissed and wrote numerous emails over the next few days and they never got back to me. I didn't lose out on anything except my time and I'm not down money or the shoes but how they treated me as a new user and banned me with no proof of anything and no investigation is incredible. The buyer panicked and felt the only way he could get his money back was to report the item fake, in turn blocking me from Grailed forever and the buyer can continue on doing that as much as they want.\n\nDO NOT SELL ON GRAILED AS A FORST TIME USER. 😒","title":"PLEASE READ AS A FIRST TIME SELLER…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-13","author":"Leo","text":"It’s funny how the company writes it’s own reviews here you in order to keep a better profile while at same time has the worst customer service. I opened up an account uploaded a Margiela jacket with the tag still on. Anyone could see it was real but poof it was taken out because apparently fake. Getting in touch with them impossible. After a while I got an answer that was so stupid I could have gotten the same from a drunk idiot yelling random words. Then for a while I did great. I sold a lot and only positive five star reviews from my customers. So far so good. After some time I sold something to a person from Montreal. Annoying but hey let’s give him a chance.  Buyer did it really wait until it arrived even though I told him in advance that shipping will take long and opened up a complaint. Bang I got blocked and since then no answers. The best part about it is that I even had the tracking number showing that the customer received it at the end. But hey I guess that’s what you get when a bunch of unwanted kids meet up in Brooklyn and start a business that basically copied Depop and Poshmark","title":"The worst customer service","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-13","author":"Marija Radic","text":"Paranoide, in one word. First,they refused to list my Amiri jeans, witch I bought on Amiri official website,called it replica!!!!??????\nMy other item was on, authentic sneakers bought on Yoox, next day suddenly I am blocked!!???\nGave me explanation because of fraudulent activity???\nI did nothing, there was no activity!!!\n\nAs I said, paranoid.\nMy advice, stay away from Grailed!","title":"Paranoide","stars":1,"location":"HR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-19","author":"indira sharma","text":"Can Grailed Be Trusted ? No.\n\nRight now there is someone on Grailed selling a piece of clothing using photos I took, of an item I own and posted on Instagram. I have reported the item 3 times to Grailed but no one ever replies, and they do not remove my photos from Grailed. I'm worried someone might get scammed.","title":"Can Grailed Be Trusted","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-20","author":"ozg turhann","text":"Grailed allows seller to sell fake items!!! I have reported one seller and I have proved she has uploded fake receipt. since she has so many transactions, they did not care me. but they can ban new seller or has low transactions easily!! it is not fair!!!","title":"Grailed allows seller to sell fake…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-20","author":"martins titolarefisso","text":"I'm tired to lose time in re-entering the listing 10 times.\nbye bye grailed, I will never be there again","title":"I'm tired to lose time in re-entering…","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-20","author":"Hallex M","text":"Very bad experience with the staff and website.. they frozen my account and told me i least seven counterfeit items! \nAnd that’s not true, I provide everything they asked me.. original received more pictures, tag, Grailed name picture etc. \nI put only authentic clothes on it, I had only good feedback from buyers. \nAnd now they stop answering my emails an frozen my account. 0","title":"Very bad experience with and…","stars":1,"location":"HK","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-21","author":"John","text":"Bought two hats on Grailed  and did not like them so tried to resell them but they removed them and said they were fake . \nI emailed them and asked why they had sold them to me if they were fake , No reply as yet \nAll very strange, I wont be spending another penny with them,","title":"Bought two hats on Grailed  and did not…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"},{"date":"2021-02-22","author":"Adam Woo","text":"Those moderators just are so stupid that my listing photos are digital authenticated at first time ,but once I relisted with the exact same photos, they said unable to authenticate . \nWhat a mess company with those stupid people. Also they are gonna discontinue android apps next month. As a so called leading company, they cannot even manage to have a working app, but charging seller a high transaction fee","title":"Those moderators just are so stupid…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=7&stars=1&stars=2&stars=3"}]