[{"date":"2019-10-14","author":"Victor Atamanov","text":"Literally a joke. Posted my authetic LV bag and got banned a day after. Bought it on LV store in Paris as posted everywhere. Already got few offers and about 9 follows there. There also was 3 more bags with ABSOLUTELY THE SAME LOOK AT PHOTOS AS MINE ( really 1:1 ) from other sellers. But yes, they recognised it as fake, banned me and so on! After writing them back, they just answered with scripted phrase, that my item was unauthetic, lol. No proofs, just nothing. Script phrases on any email. \nSo nice service, will move somewhere else to sell AUTHETIC items. Thank you, Grailed!","title":"Literally a joke","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-10-15","author":"Jenneth Gu","text":"This site needs to improve. \nThey are lack of staff. Sellers need to be aware. \nThey basically do nothing to protect the sellers.  \n\nThe buyer allows to open a claim skip Grailed. I sold a supreme Champion Hoodie and Thrasher coach jacket hoodie. Total for $330. After I shipped them, the buyer opened an \"unauthorized payment\" claim and the money was charged back by paypal. I sent help request to grailed, they didn't reply me at all. After 14 days, they send me a message, my fund was released. What a joke!\n\nI also sold a moncler jacket, buyer opened an \"Item not as described\" case two weeks after delivery, without contacting Grailed. Normal case, the platform should be the middle man. The platform make a decision first, if buyer wins, he can open a case on paypal. Grailed skip the process and let buyers freely make claims. \nGrailed leaves all the work to the sellers and paypal. \nThis platform is costing me too much time and energy with very little earnings. \n \nRecently, there was a suspicious order from Canada, paypal said the buyer's account is not verified. I didn't ship the order, and my Account gets frozen. \n\nI'm fine with not selling on this site anymore. But I still have 2-3 orders need to follow up. I just lost all my access to my account. I never saw a platform frozen sellers account when there are existing orders. Clearly, They don't care about their buyers' experience as well.  \n\nMy paypal is also connected to my eBay sellers account. Can't let them mess up with my paypal. The increasing claims from grailed may cause holds on my eBay income.  \n\nI hope my account can be temporarily restored, let me finish my existing orders and disconnect my paypal from this site.","title":"This site needs to improve","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-10-16","author":"Xyhiem Milton","text":"So 14 days ago i sold some yeezys on grailed that same day i shipped the shoes off and everything. So i added the tracking number everything it said tracking added but when i look at the status it’s still saying tracking not added payment held when i added the tracking 14 days ago 2 times already i contact them no response. so grailed if your looking my username is xyhiemmilton  can i please get my money i already contacted paypal they said hold is on y’all end the yeezys have already been delivered so please can i get my money .","title":"grailed hold payments saying i didn’t add tracking when it told me i already added tracking","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-10-16","author":"Angel","text":"Today I put some Zara Jeans for sale, with a style very similar to the Amiri Jeans, after having put them a user comments on the same sale this emoji “🤡”, I do not pay attention, I do not enter his game and  while I find that Grailed arbitrarily cancels the sale of my article, I send a message that gives me an explanation of why that decision.\n\n While I do this I decide to put the same article back on sale because as far as I know I am not putting a fake or anything, I publish the Zara again and again after having published them the same user as before re-comments  \"Stop.\"\n\n And again the Grailed sales cancel me again, that's when I realize that it is this user who is denouncing my product and Grailed without giving me any explanation cancels me.\n\n AVOID THIS PAGE, WHAT KIND OF DISCRIMINATION AND MAKING OF ARBITRARY DECISIONS DO YOU USE ON THIS PAGE TO ACT IN THAT WAY?\n\n FLEE NOW YOU CAN.","title":"DICTATORIAL AND ARBITRARY PLATFORM","stars":1,"location":"ES","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-10-18","author":"Alex Yi","text":"I have 30+ transactions and no complaints from anyone but was banned for posting \"fraudulent items\" even though none of them were. I finally got my account back and I bought a hoodie, the next few days i tried to buy a t shirt and got a paypal error and got banned again. The hoodie i bought prior was never shipped so I don't have a means of contacting the seller since he won't respond to emails. SO i don't know how to get my money back. I want my account back because I'm not even doing anything wrong. I'm literally just purchasing clothes like any other website. The customer service is so dismissive and is condescending everytime i try to contact them. My wish is to get my account and paypal reinstated and all IP bans lifted because I AM NOT DOING ANYTHING WRONG.","title":"I have 30+ transactions and no…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-10-20","author":"Joseph","text":"my account was frozen because a buyer  got my chrome hearts then refunded my money and my account frozed! i carefully legit checked that shirt i think sellers need protection too! and i checked his\/her paypal it is not verified!","title":"my account was frozen because a buyer …","stars":1,"location":"PH","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-10-21","author":"DN","text":"My son sold shoes on Grailed a few weeks ago.  The buyer received and left positive feedback, Grailed sent a message that the funds were released.  However, we have yet to receive the funds in our PayPal account.  We've contacted Grailed's customer service twice and have been ignored.  Would really like to get our funds.","title":"Grailed is not releasing funds!","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-10-22","author":"Peter Park","text":"No you have not, it has been months and I was going to forget about using your platform but it still bothers me that my account was frozen for no reason. Don't just reply for show on review sites like this...","title":"I had 30+ purchase\/sells on grailed…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-10-28","author":"League","text":"froze my account for offsite activity. Which is a joke because no purchase or deal was ever done. My user name is Graylifepromo and i’ve done over 30 transactions on the site  and have been a loyal customer.","title":"froze my account for offsite activity","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-10-28","author":"Elijah Butler","text":"My account was frozen about a month ago. I have emailed grailed several times asking for a specific reason why and each time I get the same no excuse emails. They ask me for my email address and then nothing happens afterwards. This leads me to believe I am dealing with a bot or automation system. They can not find my account with over 500 listings which I worked hard to create. I feel as though I have been treated unfairly and am being ignored or blocked. Please give me a Specific reason and unfreeze my account. This is about the 10th email I have sent with no resolve. If I did something wrong it was not intentional. Elijah Butler","title":"My account was frozen about a month…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-10-28","author":"Ardavon","text":"I’ve sold 30+ and bought several more NEVER having an issue, and all of a sudden the ban my account with no reason or explanation or ANYTHING. I’ve emailed about 10 times now and waited for 3 weeks and they don’t respond or care\n\nUser name Ardavonnazari\n\nUpdate: still haven’t gotten a response","title":"ban your account for no reason","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-10-29","author":"Krasti","text":"You don 't answer me, I 'm writing for the third time. Email me","title":"Hello","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-10-29","author":"Kiefer Keddy","text":"Got scammed by an unresponsive seller and grailed isn’t really doing much to get my refund besides sent me an initial automated response that said they’d get back to me in 2 days.... it’s been 4 and still nothing. Seller still has my money I have no item or tracking after 2 weeks. My grailed username is kwk131394_1 please look into this for me because I only got the automated response and nothing is being done. Thank you.","title":"Got scammed by an unresponsive seller…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-10-31","author":"Jerry maldonado ","text":"Ticket ID- 189094\nMade a purchase for a shirt and the seller got banned shortly after and gave a tracking number that leads to nothing. I’ve emailed many times and they refer me back to PayPal which didn’t help either and now the customer service for grailed won’t respond anymore , need a refund ASAP.","title":"Ticket ID- 189094","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-11-01","author":"George English","text":"Tried out this platform because i was downsizing my luxury collection, went well for the first couple of weeks, i sold one shirt from my collection and went off without a hitch and i was really happy with the service. Then, out of the blue i wake up the day after i had sold my first item and listed two new ones to find i have no access to my account. I contacted support continuously for about 2 days until i was finally greeted with a message simply stated that my acount was frozen for selling “counterfeit items” and could not be reinstated, no notification of any problem with my account, no proof or basis for what item was fake (i only ever listed 3 on my acount, only one sold and recieved a five star review, I provided all original photographs with verification) i liked this platform at first but now it just seems a waste of time :( if you are going to ban me for selling real items i might as well just use ebay... thanks grailed ☠️","title":"Platform will ban you without notice or reason do not waste your time","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-11-01","author":"Jared Koh","text":"Less than a month ago, I wrote a 1 star review hoping to reach out to the Grailed team regarding an item I believed to be unauthentic which it was which Nico from the Grailed team managed to sort out really well and I was refunded.\n\nI come back to the site to review 2 new problems I have encountered recently. To start off, I'd like to clarify that I love shopping on the site, it's something I do almost automatically if I have cash and free time.\n\nFirstly, I've had an issue with receiving a refund from a seller who chose not to ship my item out due to high shipping costs and we both came to the consensus that we would not proceed with the deal and he would refund me. However, the funds are apparently not in his account, thus he is unable to refund me and I have been given the same feedback to file a claim for the transaction using Paypal. Unfortunately, I have been unable to find the transaction within my account to file for a claim and have contacted Grailed team member, Wyatt again. I'd also like to mention that Wyatt from the Grailed team responded to me in about 3 hours so I am pleased with the ever improving customer service on the site.\n\nThe second issue I've had is that I think I have purchased an unauthentic item again on the site and would like the Grailed team to look into it once again, and refund me like last time if the item is fake. I have already submitted a review complaint under my account (@hypecats)\n\nUnderstandably, I have only submitted the request recently, but have written this review to try and reach out to the Grailed team faster.\n\nMany thanks, hope to hear from you soon. I also would like to suggest to the Grailed team to add a feature which allows for a verification check on items BEFORE allowing items to be listed on the market. Apart from that, special thanks to Nico who helped me in the past and Wyatt who is helping me right now, I hope to hear from Grailed regarding my two issues right now, thank you.","title":"Improvement but not good enough (2 ISSUES)","stars":1,"location":"SG","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-11-01","author":"Whendy","text":"Your reason for permanently ban my account is totally blatant and exaggerated! I did not list any chrome hearts merchandise which has been removed before! It is your duty to authenticate stuffs before subject for listing! I will gladly accept if my listing did not make it public\/removed with logic reason. I have been building trust through your marketplace by take responsibility from the day I dispatch my order until costumers receipt. I am open for any complaints even will issue a refund if problem occurs. I am more accommodating and humane, why can’t you investigate further? My account has been in a good standing for 3 years plus! Also I sold more than 300 items with 99% positive feedback! \n\nLook!!! At my feedback!!!!","title":"Ban account without detailed explanation!","stars":1,"location":"ID","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-11-05","author":"Jodeci B","text":"Loved this app for a very long time but as I post my items the next day, lots of items are deleted with no explanation ?? All items are authentic and my feedback consists of 500+ 5 star responses. Very confused as to why my posts get deleted ??","title":"Loved this app for a very long time but…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-11-06","author":"Tim Hoermann","text":"[EDIT] Ended up solving the issue through Paypal, so that’s a small plus.\n\nHonestly the worst shopping experience In had online. Literally getting no reply from multiple emails to help @ grailed.com (\/wo space) ... even not through their own form...  new low.","title":"Support is nonexistent","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"},{"date":"2019-11-07","author":"marcus heitzman","text":"I recently sold an item on grailed and it says that the buyer received the package, however, the funds will not go through to my paypal. Please do something about this grailed.","title":"Funds Won't Go Through","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=25&stars=1&stars=2&stars=3"}]