[{"date":"2020-09-02","author":"RT","text":"I ordered a Anti Social Social Club sweatshirt from the Grailed site for $131.00. The item was packed in a plastic bag making it hard to authenticate this sweatshirt. Once I got it and opened it up, it was clear it was fake. I contacted the company and let them know and included pictures. I got an email saying yes they did agree it was NOT authentic and then told me I had to go through Paypal to dispute the claim. The purchase did not go through Paypal it was from Grailed. They are a company that sells fakes and then uses a complicated system of hiding the purchase payment.  I have a screen shot of the sale and it is clear it came through Grailed. I have the item and all the emails as backup for my case. There are many complaints about this business on other websites, including Reddit,and SitJabber. This is not an isolated case.\n\nTo Grailed:  Love to hear from you! I have contacted you through the thread, we have been involved with, trying to sort this out.","title":"Fake Products\/Deceptive Payment\/Billing","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-03","author":"Richard Fredericks","text":"I can’t see this marketplace lasting much longer.  We’ve had three goes at Grailed, the first was, admittedly, fine, the third party seller we dealt with delivered.  \n\nThe second time, while the item we wanted was for sale, the seller was unable to accept payment via PayPal, which is the only real option given that there’s no coverage or insurance for transactions that occur outside of PayPal.\n\nThe third time was just plain infuriating, and represented three weeks of apprehension and aggravation before I received back a refund.  The seller from whom I ordered an expensive item was largely unresponsive, and then finally when obliged by Grailed to respond, he fed us a line of BS concerning the order and how it was DHL’s fault, even though he had not provided any confirmation of shipment or tracking number (even though he was supposed to provide both within 5 days of ordering, something he never did).  I contacted Grailed for assistance only to receive auto-responses.  Grailed simply shunted the problem over to PayPal, who take two more weeks to deliberate, and give the seller a chance to come through.  He never did, remained unresponsive as did Grailed, and so I spent almost three weeks wondering if I’d been ripped off.  And the seller in question, who’s caught a string of negative reviews, is still selling on Grailed.  There’s integrity for you.  Moreover, if you wait to post a review against a Grailed seller until after you receive a refund through PayPal, Grailed removes that option.\n\nGrailed is just too much of a crapshoot to trust.  Avoid.","title":"Three weeks of Aggravations","stars":2,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-04","author":"Yunus","text":"Hi Grailed.  My Grailed account: Yunus73. Yesterday I posted a prada scarf and today a chrome hearts pendant and I was blocked... Why was I blocked?  I think there was a mistake and you froze me instead of someone else","title":"Frozen account","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-09","author":"Sam Creagh","text":"ABSOLUTE DIRE WEBSITE,, I HAD ACCOUNT FROZEN 10 DAYS AGO. REFUNDED A SHIPMENT THAT HAD ALREADY SENT TO BUYER.. BLATANT THEFT.. SO MANY MESSAGES  TO CUSTOMER SUPPORT, STILL NO REPLY.. IT DOES NOT GET WORSE THAN THIS.. USE ANYTHING BUT GRAILED. MANY  GOOD ALTERNATIVES. STEAL YOUR  MONEY WITHOUT  EXPLANATION.. TERRIBLE THIEVING E-COMMERCE FORMAT. DO YOURSELF A FAVOUR, STAY WELL AWAY!!!!!\n\nI HAVE SENT MULTIPLE MESSAGES... NOBODY REPLIES...","title":"STOLE MY MONEY!!!","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-10","author":"Percin","text":"my account has been frozen for selling \"inauthentic\"items. they took down several listings with legit items over a couple months and then froze my account. the digital authentication and its moderators are a complete joke\n\ni am so mad, especially because those weren't fake items at all. always checked every item precisely, did research on them online etc to guarantee it's authentic before listing it. tried my best to be as honest as possible on this site and yet they still trashed me after 2+ years. on top of that i had 100+ positive reviews and not a single neutral or negative one","title":"trashed my account after 2+ years","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-11","author":"Eddy Malou","text":"My account Rowjay got banned fro no reason ! I’ve never post an item and bought something once this is ridiculous !","title":"My account Rowjay got banned fro no…","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-12","author":"daily sinkgraven","text":"I got my account frozen for no reason. I just tried to log in and there was the sign \"your account has been frozen\" I didn't even sell anything at the moment, just wanted to log in. My account name is @brainwashed_ken. I got great reviews from other users. I haven't even got any messages about fradulent activity or something. Please help me.","title":"I got my account frozen for no reason","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-13","author":"Yotam","text":"Hi I got ban from grailed for authentic off white tee loll it’s so bad legit check team dm me to see the pics it’s so annoying!!!!!!!","title":"Hi I got ban from grailed for authentic…","stars":1,"location":"IL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-14","author":"Emmet","text":"The 9% fee Grailed charges for selling on their website is not worth it for the service they provide. They provide no cover if you purchase a unauthentic item or if someone makes a charge back on an item you sell. Their support team are pretty much non existent.\nI would definitely recommend dealing with other websites such as Bumped or even Stock X because their support and protection of the members is much better.","title":"Not worth the 9% fee with the support you get","stars":1,"location":"IE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-16","author":"Евгений Неманов","text":"Hello. please unblock my account. I laid out the thing that was brought to me from the USA. and there are many such ads like mine. I looked at all the photos. I did not understand why the thing is not laid out. only then I saw messages from grailed in the mail. I myself could have been deceived. but I think the sweatshirt is real. Please unblock my account. I have great reviews. I have never sold grailed outside the office. Thank you for understanding. my name nemanov-1992","title":"Hello","stars":3,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-19","author":"Peter","text":"Support agent did not actually read the support request they just sent an auto response. Issue was only resolved after I reminded the agent to check the screenshots","title":"Support agent did not actually read the…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-20","author":"Harry Quinlan","text":"I never got an item and now i just get automated replies every time i ask for help. Stole $100 off me","title":"I never got an item and now i just get…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-21","author":"Barack Obama","text":"So sad that grailed has come to this. I’ve been buying and selling on grailed since 2015. They constantly turn their back on users who have been using their platform for a long time. They could care less how great your feedback is or how many sales you have , they will side with the buyer 10000% of the time. Their customer support is atrocious , similar to stockx, you never get the help you’re looking for and it takes days\/weeks to get a mere response. They don’t allow users to connect on different platforms because they’re so greedy they will ban you if they think you’re not using their platform to sell your items just so they can steal 10% of your sale. I have no reason to keep selling on grailed even though it’s the platform I make the most sales on. It’s a shame really.","title":"Terrible website, even worse customer support.","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-23","author":"Ron Claussen","text":"I am not getting notices on my e-mail inquiries or still when I sell an item.  I must go 24\/7 to my site and look at the messages to see what is going on.  In the past I was being advised of my sales with details.  So far, nothing.  So it is not fixed.  Suggest you run some tests on my e-mail addresses to see what is wrong.thanks","title":"I am not getting notices on my e-mail…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-28","author":"Mark Walsh","text":"This is ridiculous, they baned my account after I make 3 says and buy lots of items WITHOUT telling me why. Then you have not paid me my money for the items which the people have received. This is terrible customer service and a terrible website. I will be telling people to stay away from Grailed and not to use it as they will get scammed, not by the people using Grailed but by Grailed themselves. Please give me my money for the items I sold. I have emailed them many times with no response AFTER A MONTH.","title":"This is ridiculous","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-29","author":"newport beach","text":"My account was frozen because a buyer thought I was selling fake Louis Vuitton lock. After my account was frozen I submitted authentication and PayPal decision in my favor. I have almost 2,000 sales and excellent feedback. My account was frozen 25 days ago and I have sent 7 messages. I've tried the help e-mail and the e-mail for an appeal.  Copies of authentication, PayPal decision in my favor, pictures etc. No one gets back to me? Why no response? I have no history of selling fake merchandise and I have proven authenticity. Help! User name newportbeach..............\nReply from Grailed makes no sense. One buyer reported that I was selling a fake Louis Vuitton lock. I provided authentication from an impartial reliable service proving lock was authentic. I submitted proof to Grailed. PayPal agreed with me and denied buyers claim. I also submitted this proof to Grailed. Please review decision. In this case I have proven with professional authenticator that the lock was authentic. No one ever reviewed my documentation.","title":"My account was frozen because a buyer…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-29","author":"Grail Archive","text":"I cannot access my account anymore, looks like it was frozen, but I don’t even get informed about that. I’v been a long time seller, with great reviews, never sold fakes and now I have to deal with this. No answers from supports, have current sells and I can’t even update my buyers about it, which will begin to get worry, I’m really disappointed with the direction which Grailed decided to take, meaning increasing theirs fees and decreasing their support\/services...\nMy user name is Grailworld, please do something asap.","title":"I cannot access my account anymore and no answers from support","stars":1,"location":"CH","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-09-30","author":"Michael Hamilton","text":"Had the worst experience with Grailed who couldn’t convert to my currency Therefore was charged extra conversion fee. After contacting support they Didn’t offer to refund. Won’t use again","title":"Had the worst experience with Grailed…","stars":1,"location":"AU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-10-01","author":"Jonah Lamoureux","text":"I have 137 reviews with a 4.8\/5 star rating, over 300 transactions on my YEGDesigner account. I recently bought a pair of Balenciaga Speed Trainers on Grailed and reposted then and all of a sudden my account gets frozen for posting “inauthentic items”. The same item they authenticated and I purchased off Grailed I get frozen for because now it’s considered fake? To me it seems like they gave the seal of authenticity to a fake product and because I added more detailed pictures I get screwed over.","title":"Are they authentic or not???","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"},{"date":"2020-10-10","author":"Hc","text":"I purchased a necklace from grailed and later found out through many different sources that it was a fake. I sent more than enough photographic and video proof, and they have left me completely hanging after months of waiting. They have not responded to my last email practically begging for any sort of update. They do not stand with their customers. I am now out hundreds of dollars and own a necklace I am too embarrassed to wear","title":"Sells fake products as authentic, doesn’t stand by their guarantee","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=11&stars=1&stars=2&stars=3"}]