[{"date":"2019-11-07","author":"Josiah Rodriguez","text":"I had put my items on grailed multiple times every time I put it they’re little automated message comes to my email saying it’s inauthentic with no proof or explanation it’s incredible how quickly it is too they really need to monitor taking the items of us sellers so quickly. It’s a shame.","title":"banner multiple timesBc","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-08","author":"Charles ","text":"I recently bought a pair of off white nikes from a seller off grailed for $662. He lied about the condition of the item (said it was “like new” , however they were nowhere close)  and I attempted to get my money back through PayPal but it was denied. After that I just wanted to recoup some money and get a new shoe, because those gave me bad vibes. I attempted to repost the EXACT SAME SHOE I BOUGHT OFF GRAILED, and they took my post down claiming it is inauthentic! If these shoes are inauthentic, I DESERVE A FULL REFUND. No one on grailed has even attempted to get back to me besides automated messages that provide no help at all. This is how I am treated as a 5 Star seller on grailed for over a year now with 15 Five Star reviews. This is a significant amount of money to me and I am deeply disappointed in the response from grailed. This isn’t fair and something needs to be done. \n\nAccount : catburney","title":"Scammed on grailed, they did nothing","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-08","author":"Jon Marshall","text":"Nothing but issues. Sellers on Grailed are allowed to freely back out of sales with seemingly no consequences. I've had 4 instances where sellers refuse to send the item after it is purchased. This is after I have paid for the item plus shipping. My credit card is charged, then I need to either fight with Grailed, the seller, or PayPal to get a refund. I love the idea of buying quality used clothing, but I won't be using the Grailed platform ever again. Well, I should wait until my last refunds finally arrive before I cancel my account.\n\nStay away, unless you like getting dicked around.","title":"Nothing but issues","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-08","author":"hai wong","text":"My account got frozen for no reason after i shipped a shoe and couldn't provide tracking on grailed due to not being able to log in but i put it on paypal and my buyer received the package and had no complaints and my funds are being held by grailed. its over 1k of money on the line and i emailed but got no reply.]\nUsername:SuperSeducer","title":"Funds are being held","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-09","author":"sickle69","text":"I do not know how the items are verified by grailed service, but the seller sent me not an authentic pair of shoes (travis scott 1 high).  claims that the shoes are authentic and that they have been verified!  He refers to this.  I wrote an email to grailed and zero response.  case through paypal open, pictures provided and nothing happens.  watch out and verify items twice.\n\nMan who scammed on me: mclovinhype\n\nI wrote an two emails to support, with screens, pictures and still no respond :\/ Case is opened, nothing happen, I'm worried about lose my money! ;\/\n\n\n—————————\n\nI also replay on your message. Waiting for response. PayPal case is open. We will see what they decide. Maybe I don’t lose money, I hope.","title":"I got fakes Travis Scott through Grailed!","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-10","author":"Kristin ","text":"My brother was a seller for over a year on grailed. On April 15th He unexpectedly passed away.(taking a part of my heart with him) after alot of going back and forth with myself i decided to make another account and continue selling his collection. Tonight I go to login and it wont let me. They sent me an email stating that my account was frozen due to selling an inauthentic item. I am in tears right now. My brother was a honorable man and loved and respected the designers and there brands. For grailed to say that he is anything different makes me truly sick inside.\n\n\nResponse:   thank you I would appreciate it.  knfour72     \nThe buyer reached out to me and said that the shoe box was missing the identification flap, and that was the reason he made the claim that the shoes weren't authentic. Last night after finishing up going through my brothers collection, I found the missing flap. I have already refunded him the money, my wish is to be allowed to continue selling on the platform that my brother was so successful on. Thank you again for taking the time to respond and take a look, I'm very appreciative of it.","title":"Heartache","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-11","author":"adsadsad","text":"The first and last sales experience at Grailed. For lunch, I poured Gucci's original jeans, until the evening there were no problems, but around 11 I could no longer go to the Grail. After checking the mail, I realized that my account was blocked for no reason and then banned, presumably my jeans are not originals.\nFriends who also sold on Grailed confirmed the originality of the jeans, but the moderators simply banned the account.","title":"The first and last sales experience at…","stars":1,"location":"UA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-12","author":"Gary","text":"My account was frozen and I was wondering what I could have done, no explanation within the first email.\n\nI sent a email asking for a explanation, I received the following statement “ It appears that you had opened a non-receipt claim on a delivered item“\n\nI had opened a case regarding a non-delivery, the courier claimed to have posted the parcel through my letterbox, the problem being my letterbox is to small. I sent in photos showing the size of the letterbox, which clearly shows any parcel delivery with that method is not possible.\n\nAccording to Grail, “ In order to unfreeze your account this dispute will need to be closed” so I have to suffer a financial penalty, because the courier claims to have delivered the parcel, when clearly how they described the delivery could not have happened.\n\nThe account is frozen because my parcel was not delivered, I am being penalised for disputing this and to have the account unfrozen, I have to take a financial penalty!\n\nCompletely unfair decision, with little critical thought or logical explanation.\n\nGrailed username - garyharding21 \n\nYour argument is completely ridiculous, is got nothing to do with the size of the letterbox, but the honesty of the couriers statement about the delivery. If something goes wrong with a delivery you should investigate that matter, not hide behind your policies which are deeply floored.\n\nThe issue is; the delivery was made, but that statement is a lie, because the letterbox is to small for that delivery. So just saying the delivery was made is ridiculous, because I have not received the parcel. You should be investigating this matter, rather than penalising me.\n\nFreezing my account because I have made a claim seems rather counterintuitive, I have not received the parcel, I have lost financially on this matter and my account is frozen, what have I actually done wrong!\n\nI have been told the only way the account will be unfrozen, is to close the dispute. So I have to take a financial penalty because the item I paid for, I have not received.\n\nIt’s an absolute disgrace, your conduct is ethically \nunlawful, I have paid for a item, I have not received, but I am being punished.\n\nThe conduct of the courier company is not even looked at, utter shambles.\n\nThe courier is myhermes, which has quite a poor reputation when it comes to delivery.\n\nFollow up\n\n\nYour conflating the two issues, this issue has nothing to do with the buyer, it’s the couriers honesty regarding this delivery.\n\nSo I am not making a malicious claim, I am disputing the delivery of this parcel, that’s the issue. \n\nYou are hiding behind you policies, you should be more willing to engage about this lost parcel.\n\nWhich clearly you have no interest in and my financial loss. The point should be, was the delivery successful, if I have not received the parcel, then clearly it was unsuccessful. \n\nJust stating the delivery was made is unfair, because your taking the word of the courier, rather than looking at the evidence.\n\nIf the letter box is to small, clearly the delivery could not have been made, that’s what you should be looking at!\n\nThe courier had a choice, they could have posted a note, I have a parcel, giving instructions for collection at a later date. \n\nThe courier however, was to lazy and left the parcel on top the letter box, which is in a insecure area. Then claiming they posted the parcel through the letter box, this is want I am being penalised for!\n\nIt’ laughable!\n\nAnyone reading this thread should be aware, the buyer on Grailed is treated poorly if anything goes wrong. Grailed and Paypal have received a percentage, the buyer received their money.\n\nI am the only party not to have received my item or money back, this is Grailed response to me, by opening a dispute, I am “ financially penalising the buyer” just a bizarre use of words to describe the situation.\n\nThe advise they gave me was to contact the courier company, I did not buy the service, the seller is the only one could could do that.\n\nThey said contact the police, the police said I should contact the courier, so basically I have lost my money.\n\nBy opening the dispute with Paypal, I did not penalise the the seller, I was asking Paypal to investigate this matter.  But clearly you have know regard for my loss.\n\nAnyone reading this thread, I would advise any buyer to be aware, if any problems occur with that delivery, Grailed and Paypal will disregard you.\n\nIf the courier claims to have delivered your item,\nbasically any conversation you have with these platforms is useless, they will just keep saying it was delivered.\n\nSo if the courier leaves the package with a neighbour, it’s been delivered. If the courier leaves the package outside your house is delivered. If it’s left on top of a letterbox, it’s been delivered!\n\nBy any logic, they clearly have not been delivered successfully, but the platforms hide behind this policy.\n\nA reputable courier will come back if your not in, however many courier companies, especially in London, will ring other buzzers especially in flats,\nuntil someone comes down.\n\nIf someone signs for that, according to Grailed and Paypal that’s a delivery. So depending on the honestly of that person, if you receive that parcel.\n\nIf you have just spent £800 on a jacket and that situation occurred, Grailed and Paypal will just say it was delivered!\n\nI just thought you are the platform hosting the sale process, I just thought if any problem occurred you would help, clearly not. Very disappointing!\n\nI have closed the case with Paypal, when will my account be unfrozen!\n\nI am the only party to have lost financially, but the way I have been treated, you would have thought I had committed some heinous crime.\n\nThe crime being I have not received the item I paid for, just a utter disgrace!","title":"Grailed - poor customer service","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-14","author":"bbzbenet","text":"Horrible\nHonestly the worst selling experience online. Literally getting no reply from multiple emails I have sent to their support team. I have many 5 star reviews and have been selling for over a year. They won't even respond. RIDICULOUS.\n\nusername: bbzbenet","title":"Horrible","stars":1,"location":"PL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-14","author":"David Askins-Gast","text":"If you can handle all the lowball offers and people who send offers but don't go through with them, it is a truly useful platform for selling used and new clothing. Don’t bother trying to make money, I’d say grailed is best for selling clothes you’ve worn carefully to get some of that initial cost back.\n\nUPDATE: Gotta take points off as they took down a listing of mine for a supreme item I bought from the London supreme store with my own hands, they claim it’s inauthentic, and said relisting will result in a ban. 😒 not 1 star though as the platform is still the best out there, but they need people who actually know what they are legit checking to not mark something inauthentic when it was literally bought from the legit London Supreme store","title":"If you can handle all the lowball…","stars":2,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-14","author":"grailed @chidi","text":"Awful. Got scammed selling my supreme hoodie. Buyer claimed inauthentic and grailed just sides with the buyers. Disputed it multiple times in emails and demanded them explain how they deemed it to be so, I then asked for a response that is not automated touching the subject of me possibly being scammed by the buyer and never got a response","title":"Awful","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-15","author":"Stuart Moore","text":"Horrendous experience with this website.\n\nSigned up, purchased my first item ($800) from user motzog. DO NOT BUY FROM THIS GUY!\n\nThe seller was communicating fine until I paid for the item!\nNo tracking number provided and no jacket received.\nGrailed customer service are about as helpful as all the other automated replies from every other website. Absolutely no assistance whatsoever!\n\nI’ve had to open a case with PayPal myself.\nIt will have been 1 month since I paid for it, just glad I used my credit card.\n\nI will NEVER use the website Grailed again.\n\nusername - mac_in_scotland","title":"Horrendous experience with this…","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-16","author":"anthousai","text":"Never again! Bought item, seller specified incorrect value on customs form which corresponded to an enormous bill more than the price I paid on the item.  Grailed sent a copy and paste response saying that customs fees are responsibility of buyer. Nothing helpful about returns or anything.","title":"Never again","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-17","author":"dp","text":"Total crap, kinda like what we are seeing on the RealReal on news lately of authenticity. I tried out the website and was excited to see cool nice things, very expensive though, i ordered three things the two did not fit as described cause they said they were XL but were not. Just a waste of time. Third item never even came, never again this is crap and i heard from sellers that they are taking such big percentages from them.","title":"Total scam, liars","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-17","author":"Whendy","text":"never trust grailed authenticator! they banned my account permanently with a reason of listing counterfeits chrome hearts product. Totally ignorant, refused to listen to appeal, poor customer service. I cannot accept the fact that grailed ban my account and let hell loads of Asian accounts list hell loads of counterfeits! I can share links to proof.","title":"never trust grailed authenticator","stars":1,"location":"ID","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-17","author":"Gary","text":"I recently had a experience with a courier, they claimed to have posted my parcel through my letterbox.\n\nMy letterbox is quite small, so how a parcel was put through it, I am still perplexed!\n\nI can only assume the courier placed the parcel on top of the letterbox, then claims the parcel was posted through the letterbox.\n\nBecause the courier claimed it was posted through letterbox, according to Grailed that’s a signed for delivery, they will not intervene in this matter.\n\nThe parcel was not in the letterbox or on top, I can only assume it was stolen. \n\nThe interesting point being, when I contacted Grailed about this, they said repeatedly if the tracking information says it was delivered,\nthey will not intervene.\n\nThe advice they gave, was to contact the courier or the police.\n\nIf the tracking information says it was delivered, no mistake could have happened in this process, according to Grailed.\n\nWhen posting expensive items use a reputable courier, they are more likely to make a successful delivery.\n\nEspecially in London, couriers will ring numerous\nflats buzzers if your not in and give the parcel to a neighbour or any person coming out.\n\nIf that happens, according to Grailed that’s a successful signed delivery.\n\nLess reputable couriers have time restraints, so are likely to leave parcel in a insecure location \nor person.\n\nIn my experience, couriers like UPS and DHL offer more delivery options, if you are not in. More importantly, they will not leave parcel with insecure person or location.\n\nIn these situations the seller is covered, but the buyer is completely ignored. When sending your expensive items choose a reputable courier, so the buyer is more likely to receive the parcel.\n\nIf this situation happens to you, you can not make a claim. According to Grailed if you do, you are making a malicious claim against the seller and your account will be frozen.","title":"Use reputable courier when shipping.","stars":1,"location":"GB","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-19","author":"Erwanto Dimas Saputro","text":"my account is permanently frozen by grailed because they say my item is not authentic. I sell vintage prada jackets and the grailed party says my jacket is not authentic. even though there are so many listed exactly the same jacket that I have. Is this only applied to sellers in Asia? and now I can't sell anymore in grailed. Thank God","title":"my account is permanently frozen by…","stars":1,"location":"ID","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-22","author":"Ty Hibbitts","text":"I love using this app BUT my account was frozen for allegedly selling inuathentic items. The two items (BOTH Vivienne Westwood 3D Orb Necklaces) I listed aren't fake and I never received any reason as to why they were ruled fake. Keep in mind I also have a 5\/5 seller rating. ***The reason I think they seem fake is because the photos I listed had a white background and made it seem like the orbs were completely missing.*** I know it was a stupid mistake but this doesn't make the necklaces inauthentic. It would be great if I was given the opportunity to prove that the necklaces are real since I wasn't given one. \n\nEDITED**\nMy Email: thibbs1023@gmail. com\nMy Username: twhy","title":"Frozen Account Because of Misunderstanding","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-24","author":"andrew ","text":"Dear grailed team , \nI sent my number to a seller so he can send me more pictures of an item which was an astroworld tee shirt and it banned me I’m pretty sure . I have gotten a temporary ban but I think this one is fr . please fix this I just purchased something and idk if the seller sent a tracker","title":"I sent my number to a seller so he can…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"},{"date":"2019-11-24","author":"Stathis","text":"I loved this website untill it blocked me for no reason. I got an email with an explanaton that it was frozen for selling \"inauthentic items\". How is that possible if i never bought any incauthentic items and only buy clothes from official boutiques ?! I can provide all the receips too. \nPlease do something with this as this is very unfair.\nUsername: kalemke_st3120","title":"Worst marketplace","stars":1,"location":"GR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=24&stars=1&stars=2&stars=3"}]