[{"date":"2019-06-23","author":"PC","text":"I got scammed by this seller jonathangormanje_1, I purchased a t-shirt that never arrived. \nI received no messages from the seller and the worst part is that GRAILED never reached out after the many refund requests.\nTerrible experience, non-existing costumer service. Still waiting for my money back.","title":"I got scammed by this seller and received NO help from Grailed","stars":1,"location":"IT","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-06-24","author":"Devan Cooper","text":"sold a brand new item to a user who said it was worn when he got it. after going through the paypal claim it was decided to he was to return the item to get his refund even though he provided no evidence. how ever when i got the parcel it was a complete different item that the buyer sent back. after contacting grailed and paypal about this and provided not only photo evidence of the wrong item but also video of me opening the parcel they still somehow decided that i was in the wrong and they gave the buyer back his money and now he also has the shirt!! im not sure how grailed does not do anything to resolve these cases even though they claim to have seller protection....its a JOKE!! the seller protection is just them hopping that paypal makes the right choice which is in favour of the buyer  99% of the time because its not real people reviewing the case its automated robots which they told me on the phone...grailed literally does nothing to review the situation they just trust paypal robots and then say that they offer seller protection based off that. Ive contacted grailed now 3 times about this and every time i have gotten the response that paypal will take care of it for me as long as i provided evidence. well guess what they closed the case in favour of the buyer even after i sent a video of me opening the package with the wrong item in it!! what more evidence could you need to see that this person is scamming?! at this point im under the impression that grailed does not care about the people who sell and only care about the 10% they make off the buyers. If they actually refunded me for the fraud i have encountered it would cost them money and im sure thats the last thing they would want to do which is pathetic. million dollar company screwing over innocent people trying to make a side hustle all becuase they would rather rely on paypal to review the scams than actually do something about it themselves!","title":"Buyer Scamming The Seller On Grailed","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-06-28","author":"Mara Georgescu","text":"I DO NOT RECOMMEND GRAILED. I bought an Off White Black belt (full price of course). And so when it arrived, I realized it is fake. The seller only posted the images that did not show the belt entirely, but it seemed new and i did not even think it was a fake. 160$ wasted on a fake belt on grailed, what could be better. After seeing that the seller is not replying even though I messaged him on Instagram and what not, I left several refund requests to Grailed and I did not receive a response. Also left messages on Twitter, i left a mail but no response. I would very much like a refund if it is possible. And please, stay away from this app, you never know what can happen, u can easily lose more money on fake things than on legit sites.  Username : marageorgescu","title":"I DO NOT RECOMMEND GRAILED","stars":1,"location":"RO","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-06-28","author":"artemis_thanatos_nyx","text":"I bought some yeezy 350 v2 shoes from Grailed User: MichaeliaJessica555 using paypal through Grailed. She accepted the payment and provided an invalid tracking number through USPS.com.  2 weeks later and the seller's grailed profile is frozen and after fruitlessly trying to contact grailed both through their \"contact support\" form and by emailing help at grailed.com, I haven't received a single response. I am now having to begin the dispute process through paypal completely on my own and without any support from Grailed.com. Worst customer experience and I warn everyone to stay away and use other services.","title":"Unless you like dealing with crooks and fraudsters, Stay away from Grailed.com  customer service doesn't care about protecting your purchase","stars":1,"location":"CA","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-06-28","author":"Krissy Apusen-Dejardin","text":"A buyer send payment  but no pending or onhold payment in my paypal balance. I already ship the item..i dont know if its true that grailed out on hold the payments. Im worried i might not get the payment. Im thinking of trying to stop the courier the delivery of the items. And grailed always freeze or banned my account. All i want to know is did you really put on hold the payments or theres was no existing payment from the buyers. Please contact me asap","title":"A buyer send payment  but no pending or…","stars":1,"location":"FR","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-06-29","author":"Janelle","text":"Grailed shut down my account right after I sold an item and received the shipping information. I shipped within the same hour so I could provide a tracking # to receive the money asap; however, after shipping my account was suddenly frozen and I couldn't login or provide information.\n They're holding my funds and my account is mistakenly banned because a previous offer asked for my email through a message. I tried twitter, emailing, and reddit, I am unable to reach support to fix this because they're unresponsive. I have no option other than to try calling paypal support and see if they can help.\n\nUsername: Tartarus_achilles_rerum","title":"Grailed shut down my account right…","stars":2,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-07-03","author":"Rick","text":"Grailed banned me again because a seller asked me for my e-mail to send receipt pics to me. I didn't to anything or try to do offsite activity. All I did is ask for more pics because the seller has no feedback or transaction record, is that not allowed now? I need prove for authenticity. He is the one mentioned sending through e-mail, not me. Ban appeal doesn't work at all, the support team said  my account has been frozen for repeated attempts to engage in offsite activity, which is nonsense. And they won't unlock my account. I have many selling record in that account, and important data too. Ridiculous team, never cares about their users' experience.\n\nBy the way, the guy with 0 transaction and 0 feedback who brought up sending pics via e-mail is still there selling. I'm the one with 69 transaction and all 5 star feedback was banned forever from grailed, even if I register a new account, I can't use my paypal anymore. \nThe support team won't unlock my account, saying nonsense like \" your account has been frozen for repeated attempts to engage in offsite activity\" I never try to do offsite activity and I need my account to be safe too.\nGood job, G, really look after your loyal users.\nMy username is KillerGang. Hope you guys can really look into what happened before you decided to kick someone out of your platform.","title":"Grailed just ban whoever they wanna ban","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-07-03","author":"wildones","text":"It’s a great app but I never got my money back I sent out like a 100 contact us emails and they haven’t responded to one so if I could ever get my money back \/ refund","title":"It’s a great app but I never got my…","stars":3,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-07-06","author":"KILLERDRONE","text":"User name: DRONEKILLER\nI have already sent this massage but sending it again because your service is S**T and doesn’t reply what I want to hear except “bla bla bla violated our terms and consistions so BAN”\nHello\nWith all respect I want some explanation why my account got banned. I never had problems with buyers, all my products are authentic and I respected all the rules.\nI am kinda tired of your stupid policy’s and conditions, why cant buyers just sell without any problems and just a sudden get banned.\nI got 3 problems now\nI can’t log in\n1. One buyer has shipping problems, I’ve sent express EMS and it’s taking really long, today i phoned the company and they say it will update since tomorrow. I CANT EVEN LET HIM KNOW, AND ALL TEACKING INFORMATION IS ON GRAILED I HAVE NOTHING IN NAHD\n2. Today someone bought a FA AWESOME INVERTED LOGO. I received his shipping information BUT I CANT SEND IT TILL I LOG IN AND SEE THE INFORMATION, it’s not exactly the same as on PayPal!\n3. I bought a sweat shirt a couple of days ago and the guy put tracking, BUT ITS ON GRAILED AND I CANT TRACK MY ORDER\nThe thing is I’m currently selling a lot of stuff, so it’s in your interest too, I pay you fees which are pretty big\nBoth buyers can request a refund and, you’ll lose fees and me cash, plus one parcel witch I shipped with EMS won’t be returned back because I don’t have tracking for it, everything is on Grailed\nGuys don’t make more problems than that, I have never been banned please resolve this by tomorrow","title":"BANNED FOR NOTHING WHATS YOUR PROBLEM GUYS????","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-07-07","author":"Ava","text":"Was trying to sell a garment and was subsequently cursed out and called a \"c*nt f*ggot\" by another user who then encouraged other users to mass report me for allegedly stealing photos from somebody else, and when i uploaded photos with my tag on them I woke up the next day to my listing removed. This was not the problem however, I can just sell the product elsewhere. The problem was that I reported the user for harassing me and customer support ignored the issue and instead requested my information, even though I am not the one calling people homophobic slurs. The problem was ignored completely and this user is still on the website being toxic. \n\nDo not use Grailed. The customer support is horrible and the community itself is toxic.\n\n---\nI had my account deleted but all of my emails and information should still be accessible for customer support. My account was \"avawilliams.\" My complaints were left ignored.","title":"Toxic website and horrible customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-07-07","author":"Chris","text":"I am confused what to do at this point I sent an item in perfect condition to my buyer, they claimed that it was not and the print was melted but I have a photo showing nothing of the sort. I’m going to be so mad if I get a pair of shorts returned not in the state I sent them. How are you going to resolve this, also my username on grailed is versedvisions","title":"I am confused what to do at this point…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-07-09","author":"los","text":"hi, i am a good seller, i really like to buy and sell from grailed but for one customer make me to freeze my account i hope grailed can check the reviews of one month ago was 5 stars, but after  another monththe same person modify the three reviews from 5 stars to 1 star. and you freezed me and all the delivery was made i have to refund all the customers becouse they don,t trust me more.\nThis is a very bad experience. \n all the pictures i made with the tag, i refund one customer \"abrahamflamenco\" becouse the late delivery ( was explain in description i was to travel) he bought from me three pairs of shoes. 5 stars review for all three pairs.  but after i refund him becouse delivery was expired he asked to refund him for the other three pairs of shoes bought from him one month ago. I refuse and he modify the three 5 stars reviews in 1 starand grailed froze my account becouse one person didn't receive on time  the converse off withe vulcanize. just today i sold two new pais but grailed freeze\n my account right now becouse said the shoes i sold to abraham \nwas falke. Is not true, i have one shop in milano and one in tirana, if i sell fake shoes my business will fail.\nI hope grailed can read my complain\n\nfor graile. my account name is  \" resell_lifestyle87 \"  i correct","title":"grailed without reason freeze me","stars":1,"location":"AL","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-07-09","author":"Manu Heldt","text":"Account Name\" suckmadick \nSold all my stuff to TAZZ_BOY, i was tellin him that the paypal adress is incorrect (but i still can do things from it, but its my old one\/ not verified because of a Bank problem in the past), sent him my usual paypal and then got banned.\nI received a Mail that the money will Come in the next days, but i cant Log in and write him.\nDont know if i should ship now or wait. \nDont want to loose my money and stuff.\nWhat a shi**y customer Service. \nBanned without ans reason, without explanation and left me alone in the dark.\nPlease restore, or this was the last time i used your s#$@ Platform.","title":"Blocked without any reason","stars":1,"location":"DE","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-07-11","author":"Chachi","text":"If you have a problem with a purchase don’t expect grailed customer service to help in any way. I can’t get them to respond at all to my many return requests. Going on 3 weeks and still nothing. So much for their buyer protection guarantee. *update* Grailed responded to my review but basically all they said was “contact PayPal”. They gave me no assistance and told me to get PayPal to fix it. So like I said before, so much for their buyer protection guarantee.","title":"No customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-07-11","author":"Alexandra Roccamo","text":"Have been trying to get refunded for an item not sent to me for over a month. Have not received any response from grailed. Will not continue to use this app.","title":"Zero response from customer service","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-07-12","author":"Hieu","text":"I sold an item and provided tracking to the buyer. The buyer received the item on July 5th, I still have not received payment from Grailed. They still have the payment on hold, I've contacted them twice and no response.  Very disappointed.  Hope to hear back from them soon!\n\nMy username is HieuWear\n\nUpdate: today is 7\/17\/19 and I still have not received my funds. Items already delivered and tracking provided. I need help asap from Grailed customer service.\n\nFor those having issues, contact help at grailed dot c0m\n\nThey released my funds finally.","title":"Grailed Holding My Funds","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-07-12","author":"Dre Page","text":"I’ve shipped a product to Canada by using Grailed I’ve put in a tracking number that allowed me to see that it was delivered when I go to the inbox it says add a tracking number I already added one that show the status I haven’t got my funds in a month I contact PayPal and they said it’s grailed holding up your funds I will never sale on the app in life the customer service is nonexistent I’ve emailed sent messages on contact us and went to instagram and inboxed them I’m highly upset don’t have any Idea what’s my next step should be I feel I’ve been played do anybody on here has any answers I would greatly appreciate it","title":"Grailed holding my funds","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-07-15","author":"Pavel Oberyuhtin","text":"Seems like their support doesn't exist at all. I can’t get them to respond at all to my many return requests. Going on 2 weeks and still nothing. I hope Paypal will help me to get my money back. In case if Grailed reads this message, my username is \"vivaselenko\".","title":"Seems like their support doesn't exist","stars":1,"location":"RU","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-07-16","author":"DR Devitt","text":"I bought a pair of off white prestos and they were shipped to the completely wrong address. I thought I may have screwed up but after double checking and the one i told him to ship it to was my correct address. My username is Deviito if someone from grailed is reading this but it has been a week now and i havent gotten any response.","title":"The Customer Support Doesn't Exist","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"},{"date":"2019-07-16","author":"Scott","text":"The people who \"SELL\" on this site are Fakes and Fraudulent ....I ordered an Acne Studios sweatshirt, from a guy who had it listed....he claimed it was Brand New with Tags, Never worn .....I got it, it was the wrong size, and it had NO tags.....plus it had stains....then I had to file a complaint with PayPal to get my money back ....DO NOT waste ur time !!!","title":"The people who \"SELL\" on this site are…","stars":1,"location":"US","url":"https:\/\/www.trustpilot.com\/review\/grailed.com?page=30&stars=1&stars=2&stars=3"}]